{"id":"train_15025","question":"Which {academic degree} and {academic major} of {{Denzel Washington} was {educated at} as {Fordham University}}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q42101 p:P69 ?s . ?s ps:P69 wd:Q130965 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["What academic degree did Denzel Washington receive from Fordham University, and what did he major in?"],"info":{}}
{"id":"train_15026","question":"Is Jessica Lange American?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q173585 wdt:P172 wd:Q846570 }","paraphrases":["Jessica Lange is an American right?"],"info":{}}
{"id":"train_15028","question":"Which municipalites of Jiangsu have dialing code 511?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16963 wdt:P150 ?answer . ?answer wdt:P473 ?x FILTER ( contains ( ?x , '511' ) ) }","paraphrases":["Which municipalites of Jiangsu have dialing code 511?"],"info":{}}
{"id":"train_15029","question":"which office building with the highest floors above ground whose instance is skyscraper?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1021645 . ?ent wdt:P1101 ?obj . ?ent wdt:P31 wd:Q11303 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the tallest skyscraper with offices?"],"info":{}}
{"id":"train_15031","question":"What is the time zone in Apulia that is standard time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1447 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q1777301 }","paraphrases":["What time zone, in standard time, does Apulia belong to?"],"info":{}}
{"id":"train_15032","question":"Which is the teacher of the tribute to Christ Church?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26618202 wdt:P825 ?X . ?X wdt:P802 ?answer }","paraphrases":["who is makes utilize of sports Martin Lang"],"info":{}}
{"id":"train_15034","question":"What is the geography of the planet, Mars?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q111 wdt:P2633 wd:Q128621 }","paraphrases":["What is the geography of Mars?"],"info":{}}
{"id":"train_15035","question":"who magic spell in Harry Potter for present in work of Harry Potter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q8337 . ?sbj wdt:P31 wd:Q28872880 }","paraphrases":["who enchantment spell in Harry Potter for show in work of Harry Potter?"],"info":{}}
{"id":"train_15036","question":"What what is chemical element has affected by tin poisoning and also which starts with letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11344 . ?sbj wdt:P1542 wd:Q7807844 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is chemical thing has affected by tin poisoning and additionally which starts with letter t"],"info":{}}
{"id":"train_15037","question":"Is the FSB speed of the Pentium D 945 equal to 800?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q15217736 wdt:P2150 ?obj filter ( ?obj = 800 ) }","paraphrases":["Is the Pentium D 945 FSB velocity equal to 800?"],"info":{}}
{"id":"train_15039","question":"Which is the organ of the lymphatic drainage of the Hepatic lymph nodes that contains the word liver in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q712378 . ?sbj wdt:P2288 wd:Q17077735 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'liver' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the organ of the lymphatic waste of the Hepatic lymph hubs that contains the word liver in it's name?"],"info":{}}
{"id":"train_15040","question":"What is Philippine Standard Geographic Code for Angeles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q55741 wdt:P988 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15041","question":"Is it true that the number of injured of 2013 Valdresekspressen hijacking equals to 1.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q15131462 wdt:P1339 ?obj filter ( ?obj = 1.2 ) }","paraphrases":["Is it genuine that the number of harmed of 2013 Valdresekspressen seizing breaks even with to 1.2?"],"info":{}}
{"id":"train_15042","question":"who record  of sports long jump?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170737 wdt:P641 ?X . ?X wdt:P2869 ?answer }","paraphrases":["Who's recording long jumping sports?"],"info":{}}
{"id":"train_15043","question":"What is the person in the portrait of an equestrian statue of Joan of Arc guilty of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20798629 wdt:P180 ?X . ?X wdt:P1399 ?answer }","paraphrases":["What is the individual within the representation of an equestrian statue of Joan of Circular segment blameworthy of?"],"info":{}}
{"id":"train_15045","question":"The controlled-access highway is part of what highway system?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P16 wd:Q46622 }","paraphrases":[],"info":{}}
{"id":"train_15047","question":"Where in Hertfordshire did John Walter work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1702099 wdt:P937 ?answer . ?answer wdt:P47 wd:Q3410 }","paraphrases":["Where in Hertfordshire did John Walter work?"],"info":{}}
{"id":"train_15048","question":"Is the speed of the Westernland more or less than 12?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1269741 wdt:P2052 ?obj filter ( ?obj < 12.0 ) }","paraphrases":["Is the speed of the Westernland more or less than 12?"],"info":{}}
{"id":"train_15051","question":"Is the 2009 British and Irish Lions tour to South Africa's number of losses equal to 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q920429 wdt:P1356 ?obj filter ( ?obj = 2 ) }","paraphrases":["Is the 2009 British and Irish Lions visit to South Africa's number of misfortunes break even with to 2?"],"info":{}}
{"id":"train_15052","question":"What is pronunciation audio of nut that is language of work or name is Ukrainian ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11009 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q8798 }","paraphrases":["How do you pronounce \"nut\", the word for work or name in Ukrainian?"],"info":{}}
{"id":"train_15055","question":"What is {played} and {informed} by {Christian cross} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q392371 wdt:P737 ?X . ?X wdt:P1299 ?answer }","paraphrases":["What is {played} and {educated} by {Christian cross} ?"],"info":{}}
{"id":"train_15056","question":"Traditional Chinese characters are used by which written language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q178528 wdt:P1535 ?obj . ?obj wdt:P31 wd:Q1149626 }","paraphrases":["What language is primarily used with traditional Chinese characters?"],"info":{}}
{"id":"train_15057","question":"When did Sardinia become part of Province of Ogliastra?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1462 p:P150 ?s . ?s ps:P150 wd:Q16223 . ?s pq:P580 ?value }","paraphrases":["What time did Sardinia become part of the Province of Ogliastra?"],"info":{}}
{"id":"train_15058","question":"Which university first described the binary search tree?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q623818 wdt:P61 ?X . ?X wdt:P69 ?answer }","paraphrases":["The description of the binary search tree was first provided by which University?"],"info":{}}
{"id":"train_15062","question":"Who is the employer of Jonathan Ive since 2015-5-26?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q164750 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["For whom has Jonathan Ive worked as of 2015-5-26?"],"info":{}}
{"id":"train_15063","question":"What aspects of the history of Christianity has proponents?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q235329 wdt:P1269 ?X . ?X wdt:P3095 ?answer }","paraphrases":["What aspects of the records of Christianity has proponents?"],"info":{}}
{"id":"train_15064","question":"What is the main socket type of the sovereign state of Yantai?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q210493 wdt:P17 ?X . ?X wdt:P2853 ?answer }","paraphrases":["What is the most attachment sort of the majestic state of Yantai?"],"info":{}}
{"id":"train_15065","question":"What was Ernest Rutherford nominated for on January 1, 1933?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9123 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1933' ) ) }","paraphrases":["Which award was Ernest Rutherford short-listed for on January 1, 1933?"],"info":{}}
{"id":"train_15068","question":"Which {typology} of {language native} of {Pink} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q160009 wdt:P103 ?X . ?X wdt:P4132 ?answer }","paraphrases":["Pink has the typology of which language native?"],"info":{}}
{"id":"train_15069","question":"What is the performer and occupation of Merlin","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q188044 wdt:P175 ?ans_1 . wd:Q188044 wdt:P106 ?ans_2 }","paraphrases":["What job was Merlin well known for?"],"info":{}}
{"id":"train_15070","question":"Which is the NATO code for grade of lieutenant general?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q152951 wdt:P1611 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15073","question":"What service is offered and operated by the ANA Mileage Club?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11189383 wdt:P137 ?X . ?X wdt:P121 ?answer }","paraphrases":["ANA Mileage Club offers and operates which service?"],"info":{}}
{"id":"train_15076","question":"Is 2047 Smetana's orbital period equal to 2.56?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q130055 wdt:P2146 ?obj filter ( ?obj = 2.56 ) }","paraphrases":["Is 2047 Smetana's orbital period rise to to 2.56?"],"info":{}}
{"id":"train_15077","question":"Which is the OMIM ID for acromegaly?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q189580 wdt:P492 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15079","question":"In what year did Quentin Tarantino receive an Edgar Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3772 p:P166 ?s . ?s ps:P166 wd:Q833154 . ?s pq:P585 ?value }","paraphrases":["What is the year in which Quentin Tarantino received an Edgar Award?"],"info":{}}
{"id":"train_15080","question":"How many head coaches are there for Borussia Dortmund?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q41420 wdt:P286 ?obj }","paraphrases":["Borussia Dortmund has how may head coaches?"],"info":{}}
{"id":"train_15081","question":"How many significant events involved John Paul II?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q989 wdt:P793 ?obj }","paraphrases":["John Paul II was involved with what number of significant events?"],"info":{}}
{"id":"train_15082","question":"Which is the academic degree and the academic major of Larry Page who was educated at Stanford University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q4934 p:P69 ?s . ?s ps:P69 wd:Q41506 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["What degree, including his major, did Larry Page earn at Stanford?"],"info":{}}
{"id":"train_15084","question":"What proportion of the military branches are composed of the army?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P241 wd:Q37726 }","paraphrases":["The army makes up what portion of the military branches?"],"info":{}}
{"id":"train_15087","question":"What is the driving side of Estonia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q191 wdt:P1622 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15091","question":"When did Edward Norton Lorenz receive the Buys Ballot Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q174808 p:P166 ?s . ?s ps:P166 wd:Q1018319 . ?s pq:P585 ?value }","paraphrases":["Not to be confused with Eduard Lorenz, Edward Norton, Ludvig Lorenz, or Hendrik Lorentz.\nEdward Norton Lorenz\nEdward lorenz.jpg\nEdward Norton Lorenz\nBorn\tMay 23, 1917\nWest Hartford, Connecticut, United States\nDied\tApril 16, 2008 (aged 90)\nCambridge, Massachusetts, United States\nResidence\tUnited States\nAlma mater\tDartmouth College (BA, 1938)\nHarvard University (MA, 1940)\nMassachusetts Institute of Technology (SM, 1943; ScD, 1948)\nKnown for\tChaos theory\nLorenz attractor\nButterfly effect\nAwards\tSymons Gold Medal (1973)\nCrafoord Prize (1983)\nKyoto Prize (1991)\nLomonosov Gold Medal (2004)\nScientific career\nFields\tMathematics and Meteorology\nInstitutions\tMassachusetts Institute of Technology\nThesis\tA Method of Applying the Hydrodynamic and Thermodynamic Equations to Atmospheric Models (1948)\nDoctoral advisor\tJames Murdoch Austin\nDoctoral students\tKevin E. Trenberth\nWilliam D. Sellers\nEdward Norton Lorenz (/ˈlɒrənts/; May 23, 1917 – April 16, 2008)[1][2] was an American mathematician, meteorologist, and a pioneer of chaos theory.[3] He introduced the strange attractor notion and coined the term butterfly effect.\n\n\nContents\n1\tBiography\n2\tAwards\n3\tWork\n4\tPublications\n5\tSee also\n6\tReferences\n7\tExternal links\nBiography"],"info":{}}
{"id":"train_15092","question":"What is the criterion used for formaldehyde whose vapor pressure is 1.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q161210 p:P2119 ?s . ?s ps:P2119 ?x filter ( contains ( ?x , '1.0' ) ) . ?s pq:P1013 ?value }","paraphrases":["What requires Formaldehyde with a vapor pressure of 1.0?"],"info":{}}
{"id":"train_15097","question":"What type of business does Nintendo work on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8093 wdt:P199 ?obj . ?obj wdt:P31 wd:Q334453 }","paraphrases":["What sort of trade does Nintendo work on?"],"info":{}}
{"id":"train_15098","question":"WHICH IS THE VOTING ROUND WITH THE MAXIMUM NUMBER OF BLANK VOTES","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q24097670 . ?ent wdt:P5045 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which voting round has the most number of blank votes?"],"info":{}}
{"id":"train_15099","question":"When did Rhône-Alpes become the twin city of Shanghai ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q463 p:P190 ?s . ?s ps:P190 wd:Q8686 . ?s pq:P580 ?value }","paraphrases":["When Rhone-Alpes and Shanghai became twin cities, what year was it?"],"info":{}}
{"id":"train_15100","question":"tell me catholic cathedral starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56242215 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a Catholic church that begins with S."],"info":{}}
{"id":"train_15103","question":"what is the unit with the greatest whose i dontg know","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5300 . ?ent wdt:P1141 ?obj . ?ent wdt:P2670 wd:Q352090 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["what is the unit with the best whose i dontg be aware of"],"info":{}}
{"id":"train_15107","question":"Inuit are indigenous to where ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2341 wd:Q189975 }","paraphrases":["Where are Inuit's native to?"],"info":{}}
{"id":"train_15109","question":"Was Sandy Dennis nominated in the Academy Awards for Best Supporting Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q239691 p:P1411 ?s . ?s ps:P1411 wd:Q106301 . ?s pq:P805 ?value }","paraphrases":["what was sandy dennis nominated in the academy awards for best supporting actress?"],"info":{}}
{"id":"train_15112","question":"What is the highest point in Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q90 wdt:P610 ?obj . ?obj wdt:P31 wd:Q3393392 }","paraphrases":["What's Paris ' highest point?"],"info":{}}
{"id":"train_15115","question":"Is War and Peace both a sentimental novel and a war novel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q161531 wdt:P136 wd:Q7451276 . wd:Q161531 wdt:P136 wd:Q908667 }","paraphrases":["Is War and Peace a sentimental war novel?"],"info":{}}
{"id":"train_15116","question":"What is the mother tongue of Tyagaraja whose typology is the agglutimother tongue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2044389 wdt:P103 ?answer . ?answer wdt:P4132 wd:Q171263 }","paraphrases":["What is the mother tongue of Tyagaraja whose typology is the agglutimother tongue?"],"info":{}}
{"id":"train_15118","question":"\"What is the topic of history in Sierra Leone, that has a License plate code WAL ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1477561 wdt:P1269 ?answer . ?answer wdt:P395 ?x FILTER ( contains ( ?x , 'WAL' ) ) }","paraphrases":["\"What is the subject of history in Sierra Leone, that features a Permit plate code WAL ?"],"info":{}}
{"id":"train_15119","question":"What are the social service which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16605260 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the social benefit which begin with the letter s"],"info":{}}
{"id":"train_15120","question":"What is in the local government area of Bass Strait that has the capital town of Hobart?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q171846 wdt:P131 ?answer . ?answer wdt:P36 wd:Q40191 }","paraphrases":["What is in the neighborhood authorities vicinity of Bass Strait that has the capital town of Hobart?"],"info":{}}
{"id":"train_15121","question":"What is Rijksmuseum's Wi-Fi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q190804 wdt:P2848 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15122","question":"What is the disease with the shortest incubation period in humans that was originally described in the Armenian Soviet Encyclopedia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12136 . ?ent wdt:P3487 ?obj . ?ent wdt:P1343 wd:Q2657718 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What disease was originally described in the Armenian Soviet Encyclopedia and has the shortest incubation period in humans?"],"info":{}}
{"id":"train_15123","question":"What role did Niccolò Machiavelli play as a leader and historical figure?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q25107 p:P3342 ?s . ?s ps:P3342 wd:Q1399 . ?s pq:P3831 ?value }","paraphrases":["Niccolò Machiavelli played a leader and historical figure in what role?"],"info":{}}
{"id":"train_15125","question":"Tell me about the locations of important events leading to the fall of the Soviet Union.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P793 wd:Q5167679 . ?sbj wdt:P31 wd:Q3024240 }","paraphrases":["What important events lead to the fall of the USSR?"],"info":{}}
{"id":"train_15126","question":"Is {University of Cambridge} {subsidiary} {Department of Physics, University of Oxford} and {Department of Chemistry, University of Oxford} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q35794 wdt:P355 wd:Q21008607 . wd:Q35794 wdt:P355 wd:Q21008611 }","paraphrases":["Does the University of Cambridge have  subsidiary departments of Physics and chemistry? Does the University of Oxford have these departments as well?"],"info":{}}
{"id":"train_15127","question":"What are the coordinates of the geographic center of Washington, D.C.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q61 wdt:P5140 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15129","question":"Is Akbar's child Prince Daniyal and Khanum Sultan Begum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q8597 wdt:P40 wd:Q7243878 . wd:Q8597 wdt:P40 wd:Q29369258 }","paraphrases":["Are the child prince of Akbar Daniyal and Khanum Sultan Begum?"],"info":{}}
{"id":"train_15130","question":"What is the least gini coefficient of the dominion of the British Empire ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q223832 . ?ent wdt:P1125 ?obj . ?ent wdt:P530 wd:Q41 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What dominion of the British Empire had the lowest gini index?"],"info":{}}
{"id":"train_15131","question":"What are the ethnic group which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41710 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the ethnic group that begins with letter z?"],"info":{}}
{"id":"train_15132","question":"What is the JPL Small-Body Database ID for 10 Hygiea","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2640 wdt:P716 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15133","question":"Which is genetic association of bulimia that of determination method is Genome-wide association study ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q180913 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q1098876 }","paraphrases":["What is the genetic association of bulimia that the determined method is the Genome-wide association study?"],"info":{}}
{"id":"train_15135","question":"Eddie the Head is a member of what hardcore musical group who's title has \"iron\" in the name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56816954 . ?sbj wdt:P822 wd:Q259261 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'iron' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Eddie the Head is a member of what hardcore musical crew who's title has \"iron\" in the name?"],"info":{}}
{"id":"train_15139","question":"Which supplementary intercardinal direction has maximum position angle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22809326 . ?ent wdt:P2211 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the supplementary intercardinal direction with position angle of maximum."],"info":{}}
{"id":"train_15142","question":"Who is the film producer of Stayin' Alive that has honors in the Grammy Lifetime Achievement Award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1352181 wdt:P162 ?answer . ?answer wdt:P166 wd:Q935843 }","paraphrases":["Who is the film maker of Stayin' Lively that has respects within the Grammy Lifetime Accomplishment Grant?"],"info":{}}
{"id":"train_15143","question":"What is the ISCO occupation code for chemical plant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q905286 wdt:P952 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15146","question":"What nation has shires of Mikhail Gorbachev?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q30487 wdt:P27 ?X . ?X wdt:P150 ?answer }","paraphrases":["What country has shires of Mikhail Gorbachev?"],"info":{}}
{"id":"train_15151","question":"What characters play supporting roles in The Man Without Qualities?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1195668 p:P674 ?s . ?s ps:P674 ?obj . ?s pq:P3831 wd:Q4388180 }","paraphrases":["Name the characters that play supporting roles in The Man Without Qualities."],"info":{}}
{"id":"train_15153","question":"What award did Birgit Prinz receive in 2004?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q109868 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["Which award did Birgit Prinz win in 2004?"],"info":{}}
{"id":"train_15155","question":"In what year did Marine Le Pen become a member of the Rassemblement Bleu Marine?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q12927 p:P102 ?s . ?s ps:P102 wd:Q3419877 . ?s pq:P580 ?value }","paraphrases":["Marine Le Pen became a member of the Rassemblement Blue Marine in what year?"],"info":{}}
