{"id":"train_374","question":"Who is the owner of the theatre company that made 'The Birth of the Star Spangled Banner'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21184208 wdt:P272 ?X . ?X wdt:P127 ?answer }","paraphrases":["Who is the proprietor of the theatre corporation that made 'The Birth of the Star Spangled Banner'?"],"info":{}}
{"id":"train_375","question":"How did John Wilkes Booth kill Abraham Lincoln?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q91 p:P1196 ?s . ?s ps:P1196 ?obj . ?s pq:P157 wd:Q180914 }","paraphrases":["How was Abraham Lincoln assassinated by John Wilkes Booth?"],"info":{}}
{"id":"train_377","question":"Who was the person with Chris Rock when he was awarded the Lunt-Fontanne Award for Ensemble Excellence?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q4109 p:P166 ?s . ?s ps:P166 wd:Q28007406 . ?s pq:P1706 ?value }","paraphrases":["Who was with Chris Rock when the Lunt-Fontanne Award for Ensemble Excellence was awarded to him?"],"info":{}}
{"id":"train_378","question":"What does Kelly Clarkson do and where is she a citizen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q483507 wdt:P27 ?ans_1 . wd:Q483507 wdt:P106 ?ans_2 }","paraphrases":["is Kelly Clarkson a citizen and she does what?"],"info":{}}
{"id":"train_381","question":"When did Lee de Forest divorce from Nora Stanton Blatch Barney?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q354863 p:P26 ?s . ?s ps:P26 wd:Q17676 . ?s pq:P582 ?value }","paraphrases":["What year did Lee de Forest end his marriage with Nora Stanton Blatch Barney?"],"info":{}}
{"id":"train_382","question":"Mention the predecessor and the successor of Louis the Pious while being recognized as king of Franks","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Who were the kings of the Franks before and after Louis the Pious?"],"info":{}}
{"id":"train_383","question":"does the explosive energy of the tsar bomba equal 500","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q188596 wdt:P2145 ?obj filter ( ?obj = 500 ) }","paraphrases":["Is 500 the explosive energy of the tsar bomba?"],"info":{}}
{"id":"train_384","question":"What is the bibliography of the  PhD advisor to Karl Herzfeld?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q84763 wdt:P184 ?X . ?X wdt:P800 ?answer }","paraphrases":["What is the bibliography of the PhD guide to Karl Herzfeld?"],"info":{}}
{"id":"train_385","question":"What is the interaction of antiparticle symmetric correspondence with Q48460 521.1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q182717 wdt:P517 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '521.1' ) ) }","paraphrases":["What is the interaction of antiparticle symmetric correspondence with Q48460 521.1?"],"info":{}}
{"id":"train_386","question":"What is the estimation rate of Slovakia fertility?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q214 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }","paraphrases":["Slovakian fertility is at what estimated rate?"],"info":{}}
{"id":"train_387","question":"Tell me {intergovernmental organization}  whose name  starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q245065 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me whose name begins with s { intergovernmental organization}."],"info":{}}
{"id":"train_390","question":"which award E.T. the Extra-Terrestrial did receive and at what time he got it?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q11621 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["which award E.T. the Extra-Terrestrial did obtain and at what time he bought it?"],"info":{}}
{"id":"train_391","question":"What is the music genre that is made by Battle Zeque Den","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4870126 wdt:P178 ?X . ?X wdt:P136 ?answer }","paraphrases":["What is the genre of music that Battle Zeque Den makes?"],"info":{}}
{"id":"train_396","question":"What type of beryl is found at he GPS coordinates of 24.77111111 34. 71805556?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q103480 wdt:P2695 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '24.77111111 34.71805556' ) ) }","paraphrases":["Name the type of beryl is found at he GPS coordinates of 24.77111111 34. 71805556"],"info":{}}
{"id":"train_397","question":"Which {history of topic} and the {geography of topic} is {Melbourne} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q3141 wdt:P2184 ?ans_1 . wd:Q3141 wdt:P2633 ?ans_2 }","paraphrases":["{Melbourne} has a {history of topic} and {geography of topic}"],"info":{}}
{"id":"train_398","question":"What is the sister city of Ivan Turgenev's hometown?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42831 wdt:P551 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the sister city of Ivan Turgenev's hometown?"],"info":{}}
{"id":"train_400","question":"Is a black hole the opposite of a stellar atmosphere?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q589 wdt:P461 wd:Q6311 }","paraphrases":["The stellar atmospheres opposite id the black hole correct?"],"info":{}}
{"id":"train_401","question":"Did Francis Ford Coppola have notable works of The Godfather and The Godfather Part III?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q56094 wdt:P800 wd:Q47703 . wd:Q56094 wdt:P800 wd:Q202326 }","paraphrases":["Do the noted works of Francis Ford Coppola include The Godfather and the Godfather Part III?"],"info":{}}
{"id":"train_402","question":"tell me audio and video interfaces and connectors are name has the word ypbpr in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1153429 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ypbpr' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know sound and video interfacing and connectors are title has the word ypbpr in it"],"info":{}}
{"id":"train_403","question":"What is the official language of lives in Pasi Siltakorpi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28786447 wdt:P551 ?X . ?X wdt:P37 ?answer }","paraphrases":["Which is the official language for lives in Pasi Siltakorpi"],"info":{}}
{"id":"train_404","question":"How many colors are next to brown","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P462 wd:Q47071 }","paraphrases":["Which is the number of colors that are next to brown?"],"info":{}}
{"id":"train_406","question":"Is the PPP GDP per capita of Lithuania less than 22148.8","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q37 wdt:P2299 ?obj filter ( ?obj < 22148.8 ) }","paraphrases":["Is the PPP GDP per capita of Lithuania less than 22148.8"],"info":{}}
{"id":"train_407","question":"Is the topographic prominence of the Franzosenkopf less than 4.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1450459 wdt:P2660 ?obj filter ( ?obj < 4.0 ) }","paraphrases":["Is 4.0 greater than the topographic prominence of the Franzosenkopf?"],"info":{}}
{"id":"train_408","question":"What Chinese dynasty replaced the Yuan dynasty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7313 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q12857432 }","paraphrases":["What dynasty came after the Yuan in China?"],"info":{}}
{"id":"train_409","question":"How would you spell meat pie using the international phonetic alphabet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5367573 wdt:P186 ?X . ?X wdt:P443 ?answer }","paraphrases":["In what manner would you spell meat pie utilizing international phonetic alphabet?"],"info":{}}
{"id":"train_410","question":"Where is the human place of birth in Thessaloniki?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P19 wd:Q17151 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Where was Thessaloniki born?"],"info":{}}
{"id":"train_415","question":"When did Johnny Carson start as the presenter for The Tonight Show?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1338655 p:P371 ?s . ?s ps:P371 wd:Q310819 . ?s pq:P580 ?value }","paraphrases":["Give the date Johnny Carson began as the presenter for The Tonight Show."],"info":{}}
{"id":"train_416","question":"How many armament does the aircraft has?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P520 wd:Q11436 }","paraphrases":["What are all the kinds of armaments on this aircraft?"],"info":{}}
{"id":"train_417","question":"Where and what did Katherine Dunham study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q272637 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["What was Katherine Dunham's field of study and where did she study it?"],"info":{}}
{"id":"train_418","question":"Name the women's association football team who play the least in tournaments.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1478437 . ?ent wdt:P2257 ?obj . ?ent wdt:P2094 wd:Q606060 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Who play the least in tournaments, is what women's association football team?"],"info":{}}
{"id":"train_420","question":"Tell me me a cryptocurrenc whose name consist of the word \"neo\" and whose stock exchange bitfinex","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13479982 . ?sbj wdt:P414 wd:Q29647473 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'neo' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me me a cryptocurrenc whose title consist of the phrase \"neo\" and whose stock change bitfinex"],"info":{}}
{"id":"train_422","question":"What explosive chemical has the highest explosive velocity ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2231 ?obj . ?ent wdt:P2868 wd:Q12870 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which chemical that's explosive has the highest explosive velocity?"],"info":{}}
{"id":"train_423","question":"Is the human genome size more than 3881796000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q720988 wdt:P2143 ?obj filter ( ?obj > 3881796000.0 ) }","paraphrases":["Is the size of the human genome over 3881796000?"],"info":{}}
{"id":"train_424","question":"Where is the drainage basin of the Brazos River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q903306 wdt:P4614 ?answer }","paraphrases":[],"info":{}}
{"id":"train_425","question":"Who is C. V. Raman's doctor","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P184 wd:Q60429 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Which doctor has C.V. Raman as a patient?"],"info":{}}
{"id":"train_426","question":"Who is the viceroy of Tasmania?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q34366 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q244741 }","paraphrases":["Give me the name of the viceroy of Tasmania?"],"info":{}}
{"id":"train_427","question":"What is at the Kolyma River at the coordinates 161.364?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q78879 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '161.364' ) ) . ?s pq:P518 ?value }","paraphrases":["I want to know what can be found at the Kolyma River at the 161.364 coordinates."],"info":{}}
{"id":"train_428","question":"What is the court and application of jurisdiction of Roe v. Wade?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q300950 wdt:P4884 ?ans_1 . wd:Q300950 wdt:P1001 ?ans_2 }","paraphrases":["Which court did Roe v. Wade?"],"info":{}}
{"id":"train_429","question":"What are the phantom island which start with the letter T","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q129264 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the fantasy island that begins with the letter T"],"info":{}}
{"id":"train_430","question":"Which German city is twinned with Cardiff?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10690 wdt:P190 ?obj . ?obj wdt:P31 wd:Q42744322 }","paraphrases":["What other german city is like Cardiff?"],"info":{}}
{"id":"train_433","question":"What portrait has the Woman Drinking Wine wearing a pendant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q32995247 wdt:P1639 ?X . ?X wdt:P180 ?answer }","paraphrases":["Which picture presents the woman wearing a pendant drinking wine?"],"info":{}}
{"id":"train_434","question":"Cholera affects which taxon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1542 wd:Q12090 . ?sbj wdt:P31 wd:Q16521 }","paraphrases":["Which taxon does Cholera affect?"],"info":{}}
{"id":"train_435","question":"Is Schutzstaffel's subsidiary Reich Main Security Office and 21st Waffen Mountain division of the SS Skanderbeg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44687 wdt:P355 wd:Q152698 . wd:Q44687 wdt:P355 wd:Q160776 }","paraphrases":["Does the subsidiary of Schutzaffel include the Reich Main Security Office ans 21st Waffen Mountain division of the SS Skanderbeg? ?"],"info":{}}
{"id":"train_436","question":"In the consort of Myrna Loy, what is the service branch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q105941 wdt:P26 ?X . ?X wdt:P241 ?answer }","paraphrases":["WHAT IS THE SERVICE BRANCH OF MYRNA LOY"],"info":{}}
{"id":"train_437","question":"When did Supernatural win the Favorite Pop/Rock Album award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q819127 p:P166 ?s . ?s ps:P166 wd:Q19858080 . ?s pq:P585 ?value }","paraphrases":["On what date did Supernatural win the Favorite Pop/Rock Album grant?"],"info":{}}
{"id":"train_438","question":"What is the international organization for World Bank?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7164 wdt:P355 ?obj . ?obj wdt:P31 wd:Q484652 }","paraphrases":["What is the universal organization for World Bank?"],"info":{}}
{"id":"train_439","question":"What was the population of Aysén Region from 1992-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2181 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1992' ) ) }","paraphrases":["What was the populace of the Aysen Region from the exact time 1992"],"info":{}}
{"id":"train_440","question":"What are the historical progress which start with the letter g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16622264 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the authentic advance which begin with the letter g"],"info":{}}
{"id":"train_442","question":"Matthias Sindelar who has number of points/goals/set scored as 26.0 is a member of which sports team ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q312865 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?x filter ( contains ( ?x , '26.0' ) ) }","paraphrases":["Which sports team includes Matthias Sindelar as a player?"],"info":{}}
{"id":"train_443","question":"TELL ME TRADITIONAL FAIRY TALE WHOSE NAME HAS THE WORD SNOW IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q42402646 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'snow' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know Conventional Pixie Story WHOSE Title HAS THE WORD SNOW IN IT."],"info":{}}
{"id":"train_444","question":"Which award did One Piece receive in 2009?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q673 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["One Pierce received what award in 2009"],"info":{}}
{"id":"train_447","question":"Where does Po fit into the location 12.5469?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q643 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '12.5469' ) ) . ?s pq:P518 ?value }","paraphrases":["At location 12.5469, where is Po exactly?"],"info":{}}
{"id":"train_448","question":"Which are the cites of Tractatus Logico-Philosophicus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2860 wd:Q655717 }","paraphrases":[],"info":{}}
{"id":"train_450","question":"What are the fictional detective which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3656924 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the anecdotal criminologist which begin with the letter s"],"info":{}}
{"id":"train_452","question":"Who is the showrunner of The Apprentice, who also has a sister called Robert Trump?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q863122 wdt:P1431 ?answer . ?answer wdt:P3373 wd:Q28748031 }","paraphrases":["Who is the showrunner of The Apprentice, who additionally has a sister called Robert Trump?"],"info":{}}
{"id":"train_453","question":"Were Dutch and Hungarian the official languages of the Holy Roman Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12548 wdt:P37 wd:Q7411 . wd:Q12548 wdt:P37 wd:Q9067 }","paraphrases":["Is it true that the official languages of the Holy Roman Empire were Dutch and Hungarian?"],"info":{}}
{"id":"train_454","question":"What type of clothing do the characters in The Silent Stars Go By wear?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7764234 wdt:P674 ?X . ?X wdt:P3828 ?answer }","paraphrases":["Which is the type of clothing that the characters in The Silent Stars Go By wear?"],"info":{}}
{"id":"train_455","question":"How do you pronounce coffee in the Georgian language?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8486 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q8108 }","paraphrases":["Using the Georgian language how does one say coffee?"],"info":{}}
{"id":"train_457","question":"What is the cardinality of the complex logarithm input set?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2520206 wdt:P1851 ?X . ?X wdt:P2820 ?answer }","paraphrases":["What is the cardinality of the complex logarithm input set?"],"info":{}}
{"id":"train_458","question":"Tell me the famine which starts with the letter t?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q168247 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the starvation that begins with letter t?"],"info":{}}
{"id":"train_459","question":"WHO DIRECTS THE POLITICAL OFFICE HELD IN EDUARDO LOPEZ DORIGA","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55547556 wdt:P39 ?X . ?X wdt:P2389 ?answer }","paraphrases":["WHO Coordinates THE POLITICAL OFFICE HELD IN EDUARDO LOPEZ DORIGA"],"info":{}}
{"id":"train_460","question":"What position is held by Ramsay MacDonald and when was he elected?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q166646 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What function is held through Ramsay MacDonald and when was once he elected?"],"info":{}}
{"id":"train_461","question":"tell me about thoracic disease that contains the word syndrome in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18553676 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'syndrome' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know around thoracic malady that contains the word disorder in their name"],"info":{}}
{"id":"train_462","question":"what is the world heritage Tentative liste ID of  Univirsity of Tahran","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q737835 wdt:P4171 ?answer }","paraphrases":[],"info":{}}
{"id":"train_463","question":"What language did Juan González de la Pezuela y Ceballos translate for Os Lusíadas?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q781898 p:P655 ?s . ?s ps:P655 wd:Q1710495 . ?s pq:P407 ?value }","paraphrases":["What language did Juan Gonzalez de la Pezula y Ceballos translate?"],"info":{}}
{"id":"train_464","question":"\"Who is {tenant} of {Windsor Castle}, that has {employment} as {postage stamp designer} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42646 wdt:P466 ?answer . ?answer wdt:P106 wd:Q2000124 }","paraphrases":["\"Who is inhabitant of Windsor Castle , that has work as postage stamp planner ?\""],"info":{}}
{"id":"train_465","question":"When did Veronica Lake and Andre dé Toth end their relationship?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q84232 p:P26 ?s . ?s ps:P26 wd:Q518244 . ?s pq:P582 ?value }","paraphrases":["what did Veronica Lake and Andre dé Toth end their relationship?"],"info":{}}
{"id":"train_468","question":"Is the apoapsis of the Aotearoa 3400 equal to 2.126?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q151503 wdt:P2243 ?obj filter ( ?obj = 2.126 ) }","paraphrases":["What is the apoapsis of the Aotearoa 2400?"],"info":{}}
{"id":"train_469","question":"Which bourbon whisky has the lowest alcohol by volume whose country of origin is united states of america?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q543127 . ?ent wdt:P2665 ?obj . ?ent wdt:P495 wd:Q30 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which bourbon whisky has the lowest alcohol via volume whose us of a of origin is united states of america?"],"info":{}}
{"id":"train_470","question":"What is the genetic association of major depressive disorder with the determination method TAS?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q42844 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q23190853 }","paraphrases":["With the determination method TAS, for what major depressive disorder is this associated?"],"info":{}}
{"id":"train_471","question":"When did the Three Kingdoms period end in Korea?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q18097 p:P17 ?s . ?s ps:P17 wd:Q698268 . ?s pq:P582 ?value }","paraphrases":["When was the last year Three Kingdoms period finish in Korea?"],"info":{}}
{"id":"train_472","question":"What book series did the author Dante Alighieri write?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P50 wd:Q1067 . ?sbj wdt:P31 wd:Q277759 }","paraphrases":["What book arrangement did the creator Dante Alighieri write?"],"info":{}}
{"id":"train_473","question":"Tell me biogeochemical cycle whose name has the word cycle in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q846303 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'cycle' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me about the biogeochemical cycle whose name contains the word cycle."],"info":{}}
{"id":"train_474","question":"What business, product, or material does Facebook offer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1056 wd:Q355 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["What trade, item, or fabric does Facebook offer?"],"info":{}}
