{"id":"train_21494","question":"Who is {spouse} of {Charles IX of France} whose {end time} is {1574-5-30} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q134309 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1574' ) ) }","paraphrases":["What was the name of Charles IX of France's wife, who died on 5-30-1574?"],"info":{}}
{"id":"train_21495","question":"which is pronunciation audio crafted out of herbal tea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q379932 wdt:P186 ?X . ?X wdt:P443 ?answer }","paraphrases":["which is articulation sound made out of home grown tea?"],"info":{}}
{"id":"train_21496","question":"When did Norman Borlaug receive the AAAS Philip Hauge Abelson Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q154824 p:P166 ?s . ?s ps:P166 wd:Q19877229 . ?s pq:P585 ?value }","paraphrases":["In which year Norman borlaug received the AAAS philip hauge abelson prize?"],"info":{}}
{"id":"train_21497","question":"Which is the natural satellite for the child astronomical body of Uranus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q324 wdt:P398 ?obj . ?obj wdt:P31 wd:Q2537 }","paraphrases":["Which is the characteristic adj. for the child galactic body of Uranus?"],"info":{}}
{"id":"train_21498","question":"What are the royal or noble rank which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q355567 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the regal or respectable rank which begin with the letter v"],"info":{}}
{"id":"train_21499","question":"What is the chairperson of University of Notre Dame?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q178848 wdt:P488 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is serving as the University of Notre Dame's chairperson?"],"info":{}}
{"id":"train_21503","question":"How many from the house are present in work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1441 wd:Q23558 }","paraphrases":["How many from the house are working?"],"info":{}}
{"id":"train_21504","question":"When did Derby start the twinned administrative body in the year 1976?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43475 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1976' ) ) }","paraphrases":["What did Derby start the twinned administrative body in the year 1976?"],"info":{}}
{"id":"train_21507","question":"What location is adjacent to the city of Mandaue, that contains the state of Zapatera?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1889017 wdt:P47 ?answer . ?answer wdt:P150 wd:Q26821340 }","paraphrases":["What area is adjoining to the city of Mandaue, that contains the state of Zapatera?"],"info":{}}
{"id":"train_21509","question":"What structure is near the Sydney Harbour Bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q54495 wdt:P2673 ?obj . ?obj wdt:P31 wd:Q3397519 }","paraphrases":["What structure is close the Sydney Harbor Bridge?"],"info":{}}
{"id":"train_21510","question":"Tell me me a economic union whose name consist of the word european and whose executive body european commission","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3623811 . ?sbj wdt:P208 wd:Q8880 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'european' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me me a economic union whose name consist of the word european and whose executive body european commission"],"info":{}}
{"id":"train_21513","question":"Which is the jurisdiction of the Declaration of the Establishment of the State of Israel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q223732 wdt:P1001 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21515","question":"What is AVP encoded by?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P702 wd:Q12009087 }","paraphrases":[],"info":{}}
{"id":"train_21517","question":"How many episodes are in the television series Friends?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P179 wd:Q79784 . ?sbj wdt:P31 wd:Q21191270 }","paraphrases":["How numerous scenes are within the tv arrangement Friends?"],"info":{}}
{"id":"train_21521","question":"Tell me the historical language that starts with 'a' and that has the masculine gender.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2315359 . ?sbj wdt:P5109 wd:Q499327 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the historical language that starts offevolved with 'a' and that has the masculine gender."],"info":{}}
{"id":"train_21523","question":"what is the language official of Kingdom Of Mercia that has cause is .?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q105092 wdt:P37 ?answer . ?answer wdt:P2989 wd:Q185077 }","paraphrases":["What is the Kingdom of Mercia's official language of cause?"],"info":{}}
{"id":"train_21524","question":"Who is the father of Tenzin Gyatso?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q17293 wdt:P22 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Tenzin Gyatso's father?"],"info":{}}
{"id":"train_21525","question":"Where was Al-Hajjaj ibn Yusuf born in the empire Umayyad Caliphate?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q293460 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q8575586 }","paraphrases":["In the empire Umayyad Caliphate, where was Al-Hajjaj ibn Yusuf born?"],"info":{}}
{"id":"train_21528","question":"What is the name of the binary numeral system","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3913 wdt:P155 ?obj . ?obj wdt:P31 wd:Q1747853 }","paraphrases":["What is the name of the parallel numeral framework"],"info":{}}
{"id":"train_21529","question":"What (in the Julian calendar) was the date of death of Odoacer?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q103333 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["The death of Odoacer occurred on what day in the Julian calendar."],"info":{}}
{"id":"train_21530","question":"How many times was Emil Constantinescu head of state?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P35 wd:Q299152 }","paraphrases":["What is the number of times that Emil Constantinescu was head of state?"],"info":{}}
{"id":"train_21531","question":"Who is learning history of religions that has theogy as domain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q846742 wdt:P2578 ?answer . ?answer wdt:P2579 wd:Q34178 }","paraphrases":["Who is learning history of religions that has theogy as domain?"],"info":{}}
{"id":"train_21534","question":"Which is the short film that was directed by Baz Luhrmann?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P57 wd:Q250545 . ?sbj wdt:P31 wd:Q24862 }","paraphrases":["Which is the brief film that was coordinated by Baz Luhrmann?"],"info":{}}
{"id":"train_21535","question":"How was Ross Macdonald murdered and how was CLU related to it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q318297 wdt:P509 ?answer . ?answer wdt:P2293 wd:Q14864935 }","paraphrases":["How was once Ross Macdonald murdered and how was CLU associated to it?"],"info":{}}
{"id":"train_21538","question":"Which is the IBU biathlete ID for Ole Einar Bjørndalen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q189408 wdt:P2459 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21540","question":"Who was the executive produce of The X-Files?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2744 wdt:P1431 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["The executive producer of The X-files was who?"],"info":{}}
{"id":"train_21541","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1038 wd:Q41484 . ?sbj wdt:P31 wd:Q22988604 }","paraphrases":["n/a"],"info":{}}
{"id":"train_21544","question":"Is it true that an Olympic-size swimming pool's operating temperature is equal to 22.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2084454 wdt:P5066 ?obj filter ( ?obj = 22.4 ) }","paraphrases":["Is 22.4 degrees the operating temperature for an Olympic-size swimming pool?"],"info":{}}
{"id":"train_21545","question":"What capital town of the Kingdom of Wessez experienced the notable event of the July 7, 2005 London bombings?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q105313 wdt:P36 ?answer . ?answer wdt:P793 wd:Q10818 }","paraphrases":["What capital town of the Kingdom of Wessez experienced the striking occasion of the July 7, 2005 London bombings?"],"info":{}}
{"id":"train_21546","question":"Name the ancient civilization that gave us the public holiday Saturnalia that starts a A","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28171280 . ?sbj wdt:P832 wd:Q207213 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the ancient civilization that gave us the Saturnalia public holiday that begins an A"],"info":{}}
{"id":"train_21549","question":"Which is the extensive physical quantity that's measured by a joule?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1880 wd:Q25269 . ?sbj wdt:P31 wd:Q3386703 }","paraphrases":[],"info":{}}
{"id":"train_21550","question":"Which political party is Mariano Rajoy the secretary general of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3975 wd:Q10819 . ?sbj wdt:P31 wd:Q6065085 }","paraphrases":["Which political party is Mariano Rajoy the secretary common of?"],"info":{}}
{"id":"train_21551","question":"Who was Sarah Michelle Gellar's spouse and child?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q180665 wdt:P26 ?ans_1 . wd:Q180665 wdt:P40 ?ans_2 }","paraphrases":["Who was Sarah Michelle Gellar's life partner and child?"],"info":{}}
{"id":"train_21552","question":"For what was Paul Muni nominated in 1918?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q182292 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1935' ) ) }","paraphrases":["Which award was Paul Muni nominated for in 1918?"],"info":{}}
{"id":"train_21553","question":"What method was used to determine the total fertility rate of Mauritania?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1025 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }","paraphrases":["How was the total fertility rate of Mauritania determined?"],"info":{}}
{"id":"train_21554","question":"What are the warfare which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12786121 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the fighting which begin with the letter w"],"info":{}}
{"id":"train_21555","question":"Which is the SI derived unit for the measured physical quantity of the thermal conductivity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P111 wd:Q487005 . ?sbj wdt:P31 wd:Q208469 }","paraphrases":["Which is the SI inferred unit for the measured physical amount of the warm conductivity?"],"info":{}}
{"id":"train_21556","question":"How many goals were scored by the member of a sports team of David Icke?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q333118 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }","paraphrases":["How numerous objectives were scored by the part of a sports group of David Icke?"],"info":{}}
{"id":"train_21558","question":"What was the population of Edirne in 2000-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43387 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["In 2000-0-0, what was the population of Edirne?"],"info":{}}
{"id":"train_21560","question":"Tell me former building or structure whose name has the word tower in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19860854 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tower' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me previous building or structure whose title has the word tower in it."],"info":{}}
{"id":"train_21561","question":"How many characters are there in \"Táin Bó Cúailnge\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q399113 wdt:P674 ?obj }","paraphrases":["In this story \"Táin Bó Cúailnge\"How many characters?"],"info":{}}
{"id":"train_21562","question":"which is the song lyric created by Irving berlin ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P676 wd:Q128746 . ?sbj wdt:P31 wd:Q7366 }","paraphrases":["What is Irving Berlin's song lyrics?"],"info":{}}
{"id":"train_21564","question":"what is the transformation starts with t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12202238 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is the change begins with t"],"info":{}}
{"id":"train_21566","question":"What is Mao Saito's field of profession?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11267555 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["What does Mao Saito do for a living?"],"info":{}}
{"id":"train_21567","question":"What is the latest date of the country of Heraklion in 961-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q160544 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P1326 ?x filter ( contains ( ?x , '961-0-0' ) ) }","paraphrases":["Give me the latest date of the country of Heraklion in 961-0-0."],"info":{}}
{"id":"train_21568","question":"what is in the SIREN number of amiens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41604 wdt:P1616 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21570","question":"Is the stroke of the EMD 567 12?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q602696 wdt:P2557 ?obj filter ( ?obj = 12.0 ) }","paraphrases":["Is 12 the stroke of the EMD 567?"],"info":{}}
{"id":"train_21571","question":"What was the population of Ajaccio in the year of 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q40104 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["What was Ajaccio's population in 2015?"],"info":{}}
{"id":"train_21572","question":"What are the ice honey team which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4498974 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the ice honey team that begins with the letter s"],"info":{}}
{"id":"train_21573","question":"What award did Evanescence receive that was subsequently won by Maroon 5?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1777698 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P156 wd:Q182223 }","paraphrases":["Tell me the name of th. award Evanescence received that was subsequently won by Maroon 5?"],"info":{}}
{"id":"train_21575","question":"Which is the China Vitae ID for Hua Guofeng?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41570 wdt:P1631 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21576","question":"When was Bruce Lee educated at the University of Washington?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16397 p:P69 ?s . ?s ps:P69 wd:Q219563 . ?s pq:P580 ?value }","paraphrases":["When did Bruce Lee attend the University of Washington?"],"info":{}}
{"id":"train_21577","question":"Which aircraft has the largest wingspan that can be used in a gliding competition?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15056993 . ?ent wdt:P2112 ?obj . ?ent wdt:P366 wd:Q5569597 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which aircraft can be used in a gliding competition with the largest wing span?"],"info":{}}
{"id":"train_21578","question":"who is the occupant of  Eiffel tower?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q243 wdt:P466 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21579","question":"In what year were Tyrone Power and Deborah Jean Smith divorced?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q309989 p:P26 ?s . ?s ps:P26 wd:Q16017505 . ?s pq:P582 ?value }","paraphrases":["Deborah Jean Smith and Tyrone Power divorced in what year?"],"info":{}}
{"id":"train_21581","question":"What are the Hindu temple which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q842402 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the Hindu temple which begins with the letter t."],"info":{}}
{"id":"train_21583","question":"What is {title} of {Real World} whose {end time} is {2013-0-0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q743738 p:P1476 ?s . ?s ps:P1476 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["what was the ending time of the year 2013-0-0?"],"info":{}}
{"id":"train_21584","question":"What is the political affiliation of Julian Assange","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q360 wdt:P102 ?obj . ?obj wdt:P31 wd:Q1393724 }","paraphrases":["What is the political alliance of Julian Assange"],"info":{}}
{"id":"train_21585","question":"\"Which is {has towns} of {Rio Grande do Sul}, that has {STD code} is {54} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40030 wdt:P150 ?answer . ?answer wdt:P473 ?x FILTER ( contains ( ?x , '54' ) ) }","paraphrases":["\"Which is {has towns} of {Rio Grande do Sul}, that has {STD code} is {54} ?\""],"info":{}}
{"id":"train_21586","question":"What is the manner of death of the characters of Harry Potter and the Philosopher's Stone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q102438 wdt:P674 ?X . ?X wdt:P1196 ?answer }","paraphrases":["What is the cause of death of the characters of Harry Potter and the Philosopher's Stone?"],"info":{}}
{"id":"train_21588","question":"Which is the Bargeton ID of Jules Ferry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q959708 wdt:P4906 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21590","question":"What position does Chanda Kochhar hold in the ICICI Bank?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q539281 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P108 wd:Q1653258 }","paraphrases":["What is Chanda Kochhar's position at the ICICI Bank?"],"info":{}}
{"id":"train_21593","question":"What are the superseded scientific theory which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4115113 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the replaced theory of science that begins with the letter v"],"info":{}}
{"id":"train_21594","question":"Which is the family name of mayonnaise?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P734 wd:Q167893 }","paraphrases":[],"info":{}}
{"id":"train_21596","question":"How many writing systems are there for Javanese?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q33549 wdt:P282 ?obj }","paraphrases":["For Javanese, how many writing systems are there?"],"info":{}}
{"id":"train_21597","question":"What the name of the child of Menelik II and Abetchew Bayan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q244748 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P25 wd:Q19403224 }","paraphrases":["Who is Menelik II and Abetchew Bayan's child?"],"info":{}}
{"id":"train_21598","question":"What are the stock market crash which start with the letter m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1020018 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the stock advertise crash which begin with the letter m"],"info":{}}
{"id":"train_21600","question":"Where is the headquarters of UNESCO?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7809 wdt:P159 ?obj . ?obj wdt:P31 wd:Q41176 }","paraphrases":["Where is the central command of UNESCO?"],"info":{}}
{"id":"train_21602","question":"What flammable gas is a big cause for air pollution ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q131123 wdt:P828 ?obj . ?obj wdt:P31 wd:Q10913792 }","paraphrases":["Air pollution is caused by which flammable gas?"],"info":{}}
{"id":"train_21603","question":"Name a cola brand that starts with letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134041 . ?sbj wdt:P495 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a cola brand that begins with letter P"],"info":{}}
{"id":"train_21606","question":"Was Alexander the Great a citizen of Macedonia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q8409 wdt:P27 wd:Q83958 }","paraphrases":["Did Alexander the Great reside in Macedonia?"],"info":{}}
{"id":"train_21608","question":"What is the date of the death and birth of Frederick William I of Prussia, son of Prince Henry of Prussia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q50993 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["What is the date of the passing and birth of Frederick William I of Prussia, child of Sovereign Henry of Prussia?"],"info":{}}
{"id":"train_21609","question":"When did La Paz have a population of 654,713?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1491 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '654713.0' ) ) . ?s pq:P585 ?value }","paraphrases":["La Paz had a population of 654,713 when?"],"info":{}}
{"id":"train_21611","question":"Which is the alphabet that is based on the Proto-Sinaitic script and starts with the letter a?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9779 . ?sbj wdt:P144 wd:Q1065250 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the alphabet that is based on the Proto-Sinaitic script and begins with the letter a?"],"info":{}}
{"id":"train_21612","question":"What is the population of Port Said Governorate that was determined by census?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q31079 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["Quote the population cited by census for Port Said Governorate"],"info":{}}
