{"id":"train_245","question":"What what is unary operation notation by integral symbol and which that starts with {'i'}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q657596 . ?sbj wdt:P913 wd:Q1665420 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is unary operation notation by using crucial symbol and which that starts offevolved with {'i'}"],"info":{}}
{"id":"train_246","question":"What is being treated in an individual with arteriosclerosis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184559 wdt:P828 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What is being handled in an person with arteriosclerosis?"],"info":{}}
{"id":"train_248","question":"At what rate was inflation in Venezuela in the year 1996?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q717 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1996' ) ) }","paraphrases":["What as the 1996 Venezuelan inflation rate?"],"info":{}}
{"id":"train_249","question":"When was Vittorio De Sica nominated for an Academy Award for Best Supporting Actor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q53004 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P585 ?value }","paraphrases":["When was Vittoria De Sica nominated for Best Supporting Actor?"],"info":{}}
{"id":"train_250","question":"What is Auñamendi ID of Miguel López de Legazpi ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q318500 wdt:P3218 ?answer }","paraphrases":[],"info":{}}
{"id":"train_251","question":"What is the timezone of the place Sallust died?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7170 wdt:P20 ?X . ?X wdt:P421 ?answer }","paraphrases":["What is the timezone of the put Sallust died?"],"info":{}}
{"id":"train_252","question":"Did the East India Company own the Britannia and the Busbridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q83164 wdt:P1830 wd:Q4801940 . wd:Q83164 wdt:P1830 wd:Q55606211 }","paraphrases":["The East India Company (EIC), also known as the Honourable East India Company (HEIC) or ... It was dissolved in 1874 as a result of the East India Stock Dividend ..... Within the Army British officers, who initially trained at the company's own ..."],"info":{}}
{"id":"train_254","question":"What is total fertility rate of Trinidad and Tobago that is determination method is estimation process ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q754 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }","paraphrases":["the method determined to estimate Trinidad and Tobago's fertility's rate?"],"info":{}}
{"id":"train_255","question":"Which church is located in the parish border Krukengrund?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q32068316 wdt:P131 ?X . ?X wdt:P47 ?answer }","paraphrases":["Which church is found within the ward border Krukengrund?"],"info":{}}
{"id":"train_257","question":"Where is the deathplace of Gediminas, whose twin town is Irkutsk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q244852 wdt:P20 ?answer . ?answer wdt:P190 wd:Q6576 }","paraphrases":["Where is the deathplace of Gediminas, whose twin town is Irkutsk?"],"info":{}}
{"id":"train_259","question":"In the 68th Academy Awards, what nomination did Mira Sorvino receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q212026 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q903494 }","paraphrases":["Mira Sorvino was a nominee for which category in the 68th Academy Awards?"],"info":{}}
{"id":"train_260","question":"Tell me interface standard whose name has the word virtuallink in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6046311 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'virtuallink' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the standard interface whose name contains the word virtual link."],"info":{}}
{"id":"train_263","question":"Tell me medical specialty whose name has the word trichology in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q930752 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trichology' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know therapeutic forte whose title has the word trichology in it."],"info":{}}
{"id":"train_265","question":"What is the state of India that contain the word \"uttarakhand\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13390680 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'uttarakhand' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the state of India that contain the word \"uttarakhand\" in its title ?"],"info":{}}
{"id":"train_266","question":"Who is drafted by the Boston Celtics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P647 wd:Q131371 }","paraphrases":[],"info":{}}
{"id":"train_267","question":"Name the BAFTA settlement with the postcode DA.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q159661 wdt:P131 ?answer . ?answer wdt:P281 ?x FILTER ( contains ( ?x , 'DA' ) ) }","paraphrases":["Title the BAFTA settlement with the postcode DA."],"info":{}}
{"id":"train_269","question":"Name a religious concept in Hinduism that contains the word \"yatra\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj wdt:P1269 wd:Q9089 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yatra' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a non secular thought in Hinduism that carries the phrase \"yatra\" in its title"],"info":{}}
{"id":"train_271","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P360 wd:Q11639 . ?sbj wdt:P31 wd:Q13406463 }","paraphrases":["not applicable"],"info":{}}
{"id":"train_272","question":"What is the religious affiliation of Vladimir the Great's child?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14974 wdt:P22 ?X . ?X wdt:P140 ?answer }","paraphrases":["What is the spiritual affiliation of Vladimir the Great's child?"],"info":{}}
{"id":"train_274","question":"What year did Le Corbusier win the Frank P. Brown Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q4724 p:P166 ?s . ?s ps:P166 wd:Q19873358 . ?s pq:P585 ?value }","paraphrases":["What was the year when Le Corbusier had received the Frank P. Brown Medal?"],"info":{}}
{"id":"train_275","question":"Tell me the city which is enclaved within Montreal.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P501 wd:Q340 . ?sbj wdt:P31 wd:Q27676416 }","paraphrases":["Let me know the city which is enclaved inside Montreal."],"info":{}}
{"id":"train_279","question":"\"Where is {on harbour} of {Kryvyi Rih}, which has {tributary} is {Saksahan} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q157137 wdt:P206 ?answer . ?answer wdt:P974 wd:Q1633893 }","paraphrases":["\"Where is {on harbor} of {Kryvyi Rih}, which has {tributary} is {Saksahan} ?\""],"info":{}}
{"id":"train_280","question":"Who stars with Ian Carlyle in the production?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42421333 wdt:P1441 ?X . ?X wdt:P161 ?answer }","paraphrases":["Who stars with Ian Carlyle within the generation?"],"info":{}}
{"id":"train_281","question":"What causes rain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1542 wd:Q7925 . ?sbj wdt:P31 wd:Q483247 }","paraphrases":["What's causing the rain?"],"info":{}}
{"id":"train_282","question":"What is the service branch  by Julius and Ethel Rosenberg, which has subsidiary entities including Arlington National Cemetery?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q769097 wdt:P241 ?answer . ?answer wdt:P355 wd:Q216344 }","paraphrases":["What is the benefit department by Julius and Ethel Rosenberg, which has auxiliary substances counting Arlington National Cemetery?"],"info":{}}
{"id":"train_283","question":"Was Hank WIlliams a rockabilly and honky-tonk musician?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q206181 wdt:P136 wd:Q203720 . wd:Q206181 wdt:P136 wd:Q1627155 }","paraphrases":["Is Hank Williams remembered as a rockabilly and honky-tonk musician?"],"info":{}}
{"id":"train_284","question":"When did Aaron Kwok receive the award for Golden Horse Award for Best Leading Actor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16872 p:P166 ?s . ?s ps:P166 wd:Q17500591 . ?s pq:P805 ?value }","paraphrases":["In which year did Aaron Kwok receive the Golden Horse award as the best lead actor?"],"info":{}}
{"id":"train_289","question":"Which is the enterprise for the parent organization of Sears?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q6499202 wdt:P749 ?obj . ?obj wdt:P31 wd:Q6881511 }","paraphrases":["Which is the endeavor for the parent organization of Burns?"],"info":{}}
{"id":"train_290","question":"Who proved the theory of Proper Motion? Their surname is Halley.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q193223 wdt:P61 ?answer . ?answer wdt:P734 wd:Q16870415 }","paraphrases":["Who proved Proper Motion's theory? Halley is their surname."],"info":{}}
{"id":"train_291","question":"What head coach is the New York Yankees named after?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q213417 wdt:P286 ?ans_1 . wd:Q213417 wdt:P138 ?ans_2 }","paraphrases":["The New York Yankees were named for which head coach?"],"info":{}}
{"id":"train_292","question":"What are the national cuisine which start with the letter m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1968435 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the national cuisine that starts with the letter m."],"info":{}}
{"id":"train_295","question":"What is the second language of Peter Faber which regulatory body is Pontifical Academy of Latin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q454814 wdt:P1412 ?answer . ?answer wdt:P1018 wd:Q48509 }","paraphrases":["What is the 2nd language of Peter Faber which regulatory body is Pontifical Academy of Latin?"],"info":{}}
{"id":"train_298","question":"What award did Edward C. Prescott receive on 1-1-2004?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q312585 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["Edward C. Prescott received what award on January 1st, 2004?"],"info":{}}
{"id":"train_299","question":"where is the headquartes of  formation of google located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q95 wdt:P159 ?ans_1 . wd:Q95 wdt:P740 ?ans_2 }","paraphrases":["Where was the first headquarters of Google located?"],"info":{}}
{"id":"train_302","question":"What has the eccentricity of 0.0567, that is located on astronomical body of the near side of the moon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q782867 wdt:P376 ?answer . ?answer wdt:P1096 ?x FILTER ( contains ( ?x , '0.0567' ) ) }","paraphrases":["What has the eccentricity of 0.0567, that is placed on astronomical physique of the near aspect of the moon?"],"info":{}}
{"id":"train_303","question":"What is the diplomatic relations like in basin countries of Lake Okeechobee?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q202905 wdt:P205 ?X . ?X wdt:P530 ?answer }","paraphrases":["The basin countries of Lake Okeechobee has what diplomatic relations?"],"info":{}}
{"id":"train_306","question":"Where was Augustus II the Strong buried?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q53437 p:P119 ?s . ?s ps:P119 wd:Q666935 . ?s pq:P518 ?value }","paraphrases":["Tell me where Augustus II the Strong was buried."],"info":{}}
{"id":"train_307","question":"Is it true that the semi-major axis of 1627 Ivar is greater than 2.2361778?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q141634 wdt:P2233 ?obj filter ( ?obj > 2.2361778 ) }","paraphrases":["Is it true that 1627 Ivar's semi - major axis exceeds 2.2361778?"],"info":{}}
{"id":"train_310","question":"What is the total fertility rate of Sudan with estimation process?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1049 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }","paraphrases":["Using estimation process, Sudan has a total fertility rate of what?"],"info":{}}
{"id":"train_311","question":"Is the half-life of silicon-36 less than 0.54?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q18844603 wdt:P2114 ?obj filter ( ?obj < 0.54 ) }","paraphrases":["Is silicon-36's half-life less than 0.54?"],"info":{}}
{"id":"train_313","question":"What is the Malayalam alphabet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q36236 wdt:P282 ?obj . ?obj wdt:P31 wd:Q9779 }","paraphrases":["WHICH IS THE MALAYALAM ALPHABET"],"info":{}}
{"id":"train_315","question":"WHICH IS THE ZUCKERART THAT CONTAINS WITH THE WORD SYRUP IN THER NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q227790 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'syrup' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE ZUCKERART THAT CONTAINS WITH THE WORD SYRUP IN THER NAME"],"info":{}}
{"id":"train_317","question":"Name a business whose heaquarters are located in Lyon","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q456 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Name a company with headquarters in Lyon"],"info":{}}
{"id":"train_320","question":"What agent had conflict with Lowell English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6693201 wdt:P607 ?X . ?X wdt:P710 ?answer }","paraphrases":["What operator had strife with Lowell English?"],"info":{}}
{"id":"train_321","question":"What does European Parliament approve?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P790 wd:Q8889 }","paraphrases":[],"info":{}}
{"id":"train_322","question":"WHat location that belongs to the World Heritage starts with the letter H","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1307276 . ?sbj wdt:P1435 wd:Q17278671 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat location that belongs to the World Heritage begins with the letter H"],"info":{}}
{"id":"train_323","question":"mike krzyzewski name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q434909 wdt:P1449 ?answer }","paraphrases":[],"info":{}}
{"id":"train_324","question":"What is Fantastic Fiction author ID of James Ellroy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q318487 wdt:P5408 ?answer }","paraphrases":[],"info":{}}
{"id":"train_327","question":"What administrative territorial entity was Sint Maarten located in the year December 15, 1954?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q26273 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1954' ) ) }","paraphrases":["Which government controlled Sint Maarten as of December 15th, 1954?"],"info":{}}
{"id":"train_328","question":"What is the density of aluminium at a temperature of 20 degrees?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q663 p:P2054 ?s . ?s ps:P2054 ?obj . ?s pq:P2076 ?x filter ( contains ( ?x , '20.0' ) ) }","paraphrases":["The density of aluminium becomes what at a temperature of 20 degrees?"],"info":{}}
{"id":"train_331","question":"When did Artem Sergeev, adopted son of Joseph Stalin, die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q4416801 . ?s pq:P570 ?value1 . ?s pq:P22 ?value2 }","paraphrases":["When did Artem Sergeev, adopted son of Joseph Stalin, die?"],"info":{}}
{"id":"train_332","question":"\"What is {holds position} of {Martin McGuinness}, which has {prequel of} is {Member of the 55th Parliament of the United Kingdom} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57689 wdt:P39 ?answer . ?answer wdt:P156 wd:Q35494253 }","paraphrases":["\"What is {holds position} of {Martin McGuinness}, which has {prequel of} is {Part of the 55th Parliament of the Joined together Kingdom} ?\""],"info":{}}
{"id":"train_333","question":"What what is animated taxondistributed by MGM and {family}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2312410 . ?sbj wdt:P797 wd:Q369225 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'rugby' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is energized taxondistributed by MGM and {family}"],"info":{}}
{"id":"train_336","question":"When did Sarah Bernhardt and Jacques Damala split up?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q4605 p:P26 ?s . ?s ps:P26 wd:Q6120528 . ?s pq:P582 ?value }","paraphrases":["When did Sarah Bernhardt and Jacques divorce?"],"info":{}}
{"id":"train_337","question":"\"What is the birth city of Kirsten Stewart, with the county seat of Los Angeles County?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q126599 wdt:P19 ?answer . ?answer wdt:P1376 wd:Q104994 }","paraphrases":["\"What is the birth city of Kirsten Stewart, with the district situate of Los Angeles Province?\""],"info":{}}
{"id":"train_338","question":"Where {faith} {has influence} on {Madonna} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1744 wdt:P737 ?X . ?X wdt:P140 ?answer }","paraphrases":["Where {confidence} {has impact} on {Madonna} ?"],"info":{}}
{"id":"train_339","question":"What in the code for INS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P702 wd:Q21163221 . ?sbj wdt:P31 wd:Q679692 }","paraphrases":["What within the code for INS?"],"info":{}}
{"id":"train_340","question":"When did Alla Pugacheva divorce his wife, Mykolas Orbakas?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q80510 p:P26 ?s . ?s ps:P26 wd:Q16465149 . ?s pq:P582 ?value }","paraphrases":["What is the divorce date for Alla Pugacheva from his wife Mykolas Orbakas"],"info":{}}
{"id":"train_341","question":"When was Isadora Duncan's funeral?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q483512 p:P793 ?s . ?s ps:P793 wd:Q201676 . ?s pq:P585 ?value }","paraphrases":["At what time did Isadora Duncan's funeral take place?"],"info":{}}
{"id":"train_343","question":"who culture of state of australian secret intelligence services ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q181694 wdt:P17 ?X . ?X wdt:P172 ?answer }","paraphrases":["The australian secret intelligence service has what kind of culture?"],"info":{}}
{"id":"train_345","question":"What language does the sculptor of Z3 write in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q222419 wdt:P170 ?X . ?X wdt:P1412 ?answer }","paraphrases":["Name the language used for writing sculptor of Z3?"],"info":{}}
{"id":"train_348","question":"Was Cleopatra's child named Caesarion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q635 wdt:P40 wd:Q39589 }","paraphrases":["Was Caesarion the name of Cleopatra's child?"],"info":{}}
{"id":"train_353","question":"Did Mao Zedong hold a position as President of the People's Republic of China?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5816 wdt:P39 wd:Q655407 }","paraphrases":["Was Mao Zedong ever President of the People's Republic of China?"],"info":{}}
{"id":"train_355","question":"Is it true that the maximum wavelength of sensitivity of Submilimeter Array is greater than 2.004?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1205241 wdt:P3737 ?obj filter ( ?obj > 2.004 ) }","paraphrases":["Is the greatest wavelength of sensitivity of the Submilimeter Array greater than 2.004?"],"info":{}}
{"id":"train_356","question":"What nonprofit organization is regulated by the association of football?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2736 wdt:P3719 ?obj . ?obj wdt:P31 wd:Q163740 }","paraphrases":["What nonprofit organization is controlled by the affiliation of football?"],"info":{}}
{"id":"train_357","question":"What diplomatic crisis lead to the founding of the Russian Orthodox Church?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q60995 wdt:P793 ?obj . ?obj wdt:P31 wd:Q5791104 }","paraphrases":["What political emergency lead to the establishing of the Russian Conventional Church?"],"info":{}}
{"id":"train_359","question":"When was Boris Johnson the Member of the 56th  Parliament of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q180589 p:P39 ?s . ?s ps:P39 wd:Q30524718 . ?s pq:P580 ?value }","paraphrases":["On what date did Boris Johnson the Member of the 56th Parliament of the United Kingdom?"],"info":{}}
{"id":"train_362","question":"What is a nut that starts with the letter n.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11009 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What may be a nut that begins with the letter n."],"info":{}}
{"id":"train_363","question":"When is the date and birth of Joseph Stalin's child with Svetlana Alliluyeva?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q228584 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["When is the date and birth of Joseph Stalin's child with Svetlana Alliluyeva?"],"info":{}}
{"id":"train_364","question":"How many works are occupied in the Rijksmuseum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P466 wd:Q190804 }","paraphrases":["How many works are contained within the Rijksmuseum?"],"info":{}}
{"id":"train_367","question":"What is the birthplace of Maureen O'Hara, which has the co-ordinate location of 53.3252?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q229276 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '53.3252' ) ) }","paraphrases":["What is the origin of Maureen O'Hara, which has the co-ordinate area of 53.3252?"],"info":{}}
{"id":"train_368","question":"What is the official residence of Queens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P263 wd:Q18424 }","paraphrases":[],"info":{}}
{"id":"train_369","question":"Which is the {participant} and the {location} of {Pacific_War} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q184425 wdt:P710 ?ans_1 . wd:Q184425 wdt:P276 ?ans_2 }","paraphrases":["Who was involved in the pacific war and where did it take place?"],"info":{}}
{"id":"train_371","question":"What domain has the aspect of bodhisattva?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178149 wdt:P1269 ?X . ?X wdt:P2579 ?answer }","paraphrases":["Which domain has the bodhisattva aspect?"],"info":{}}
{"id":"train_372","question":"What is the Commonwealth area with the lowest real gross domestic product growth rate whose diplomatic relation is Taiwan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q202686 . ?ent wdt:P2219 ?obj . ?ent wdt:P530 wd:Q865 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which diplomatic relative of Taiwan is a commonwealth area with the lowest gross domestic growth rate?"],"info":{}}
{"id":"train_373","question":"What is located on the astronomical body of North America?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q49 wdt:P376 ?answer }","paraphrases":[],"info":{}}
