{"id":"train_8528","question":"What was Max Weber Ahre a member of during the year 1918?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9387 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1918' ) ) }","paraphrases":["What was a member of Max Weber Ahre during 1918?"],"info":{}}
{"id":"train_8532","question":"Who gave the {source of inspiration} of {characters} of {Les Misérables} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1193096 wdt:P674 ?X . ?X wdt:P941 ?answer }","paraphrases":["Who gave the {source of motivation} of {characters} of {Les Misérables} ?"],"info":{}}
{"id":"train_8533","question":"What is the sister town of the chef-lieu of the Qajar dynasty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q189326 wdt:P36 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the sister town of the chef-lieu of the Qajar dynasty?"],"info":{}}
{"id":"train_8535","question":"Where was John Kenneth Galbraith educated at and what was his academic major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q186042 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["Where was John Kenneth Galbraith trained at and what was his educational major?"],"info":{}}
{"id":"train_8536","question":"When was Taha Hussein nominated for the Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q328765 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["Taha Hussein was nominated for the Nobel Prize in Literature in what year?"],"info":{}}
{"id":"train_8538","question":"What was the strongest earthquake ever in Taiwan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7944 . ?ent wdt:P2528 ?obj . ?ent wdt:P17 wd:Q865 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What was the strongest earthquake in Taiwan?"],"info":{}}
{"id":"train_8539","question":"What is the  movement of the new religion Rajneesh","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q148285 wdt:P135 ?obj . ?obj wdt:P31 wd:Q477544 }","paraphrases":["What is Rajneesh?"],"info":{}}
{"id":"train_8540","question":"With a total fertility rate of 1.8615, what is the event participant of the Guadalcanal Campaign?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q217145 wdt:P710 ?answer . ?answer wdt:P4841 ?x FILTER ( contains ( ?x , '1.8615' ) ) }","paraphrases":["With a whole fertility charge of 1.8615, what is the tournament participant of the Guadalcanal Campaign?"],"info":{}}
{"id":"train_8541","question":"Who is the diplomat of Southwest China?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1190484 wdt:P131 ?X . ?X wdt:P530 ?answer }","paraphrases":["Give me the name of the diplomat of Southwest China."],"info":{}}
{"id":"train_8542","question":"Which is the ISO standard for Pinyin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q42222 wdt:P503 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8543","question":"Bill Gates wrote what for what collection?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P195 wd:Q5284 . ?sbj wdt:P31 wd:Q47461344 }","paraphrases":["What collection did Bill Gates write for?"],"info":{}}
{"id":"train_8545","question":"When was Terry Pratchett nominated for the Locus Award for Best Fantasy Novel?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q46248 p:P1411 ?s . ?s ps:P1411 wd:Q607354 . ?s pq:P585 ?value }","paraphrases":["Terry Pratchett was nominated for the Locus Award for Best Fantasy Novel in which year?"],"info":{}}
{"id":"train_8546","question":"Which fort was most notable for the Lewis and Clark Expedition?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P793 wd:Q505802 . ?sbj wdt:P31 wd:Q1785071 }","paraphrases":["Which fortress was most striking for the Lewis and Clark Expedition?"],"info":{}}
{"id":"train_8547","question":"what is phase of the moon contains the word quarter in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26388 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'quarter' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is stage of the moon contains the word quarter in their name"],"info":{}}
{"id":"train_8548","question":"What's the name of a type of dog with the word \"toy\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q38672 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'toy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the name of a dog type in its name with the word \"toy?\""],"info":{}}
{"id":"train_8549","question":"Who is including my son?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1012 wd:Q177232 }","paraphrases":[],"info":{}}
{"id":"train_8550","question":"Was Ronalinho a member of the sports team, Paris Saint Germain F.C.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q39444 wdt:P54 wd:Q483020 }","paraphrases":["Did Ronaldinho belong as a member of the sports team, Paris Saint Germain F.C.?"],"info":{}}
{"id":"train_8551","question":"Where was Arcadius,which has a member of the council of Europe,born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q159369 wdt:P19 ?answer . ?answer wdt:P463 wd:Q8908 }","paraphrases":["Where was once Arcadius,which has a member of the council of Europe,born?"],"info":{}}
{"id":"train_8552","question":"which sacrament of the catholic church starts with the letter m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3233636 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which holy observance of the catholic church begins with the letter m"],"info":{}}
{"id":"train_8553","question":"Is the density of the water less than 1.169832?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q283 wdt:P2054 ?obj filter ( ?obj < 1.169832 ) }","paraphrases":["Is the water density below 1.169832?"],"info":{}}
{"id":"train_8554","question":"Impressionism has what kind of movement?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P135 wd:Q40415 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Impressionism has what kind of movement?"],"info":{}}
{"id":"train_8556","question":"which valley starts with v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q39816 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which valley begins with v"],"info":{}}
{"id":"train_8557","question":"What is the prevalence of tuberculosis at Norway?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12204 p:P1193 ?s . ?s ps:P1193 ?obj . ?s pq:P17 wd:Q20 }","paraphrases":["What is the rate of TB in Norway?"],"info":{}}
{"id":"train_8560","question":"Tell me about award received of Venus Williams and point in time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q11578 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["Let me know approximately grant gotten of Venus Williams and point in time?"],"info":{}}
{"id":"train_8561","question":"Which is {tributary} of {next to lake} of {Spitsbergen} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21162 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["Which is {tributary} of {next to lake} of {Spitsbergen} ?"],"info":{}}
{"id":"train_8562","question":"What was the population of Freiburg im Breisgau in 1968?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2833 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1968' ) ) }","paraphrases":["In 1968, what was the population of Freiburg im Breisgau?"],"info":{}}
{"id":"train_8564","question":"Who is {member of} of {land} of {Serie A} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15804 wdt:P17 ?X . ?X wdt:P463 ?answer }","paraphrases":["what is the name (member of) of (lamd) of (serie A)"],"info":{}}
{"id":"train_8565","question":"What countries speak english?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q1860 . ?sbj wdt:P31 wd:Q202686 }","paraphrases":["What nations talk english?"],"info":{}}
{"id":"train_8566","question":"Is the semi-major axis of 6635 Zuber greater than 1.51193832?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q80489 wdt:P2233 ?obj filter ( ?obj > 1.51193832 ) }","paraphrases":["Is the semi-major hub of 6635 Zuber more noteworthy than 1.51193832?"],"info":{}}
{"id":"train_8568","question":"What country shares the same border as Austria","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q131964 . ?sbj wdt:P31 wd:Q417175 }","paraphrases":["Which country does Austria share a border with?"],"info":{}}
{"id":"train_8569","question":"What is the scientific discipline of the person who discovered the asteroid '(229760) 2007 RM225'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8223332 wdt:P61 ?X . ?X wdt:P101 ?answer }","paraphrases":["What field of science does the person who discovered the asteroid '(229760) 2007 RM225' belong to?"],"info":{}}
{"id":"train_8570","question":"What is the bilingual inscription of Egyptian hieroglyphs for writing system","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P282 wd:Q132659 . ?sbj wdt:P31 wd:Q861809 }","paraphrases":[],"info":{}}
{"id":"train_8573","question":"What award did Mohamed ElBaradei receive in the year 2008?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q133308 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2008' ) ) }","paraphrases":["In 2008, which award did Mohamed ElBaradei receive?"],"info":{}}
{"id":"train_8575","question":"When did Oulu begin serving as the head of government for Ilmo Paananen?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47048 p:P6 ?s . ?s ps:P6 wd:Q6031942 . ?s pq:P580 ?value }","paraphrases":["Which year did Oulu begin serving as the head of government for Ilmo Paananen?"],"info":{}}
{"id":"train_8578","question":"Who was elected in Iligan on 11-1-2013?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q285488 p:P1831 ?s . ?s ps:P1831 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["give me  lected in lligan on 11-1-2013."],"info":{}}
{"id":"train_8580","question":"Who is {head of government} of {Düsseldorf} whose {start time} is {1820-7-19} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1718 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1820' ) ) }","paraphrases":["Who was the head of government of Dusseldorf in 1820?"],"info":{}}
{"id":"train_8581","question":"Which carriers operate the Airbus A330?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q6478 wdt:P137 ?obj . ?obj wdt:P31 wd:Q721639 }","paraphrases":["What carriers use the Airbus A330?"],"info":{}}
{"id":"train_8582","question":"Who is the {asteroid} for {followed by} of {Pluto}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q339 wdt:P156 ?obj . ?obj wdt:P31 wd:Q3863 }","paraphrases":["Who is Pluto's asteroid for?"],"info":{}}
{"id":"train_8583","question":"Who is the {copolymer} for {monomer of} of {ethylene}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q151313 wdt:P4599 ?obj . ?obj wdt:P31 wd:Q421281 }","paraphrases":["Who is the {copolymer} for {monomer of} of {ethylene}"],"info":{}}
{"id":"train_8584","question":"Who was the head of the Inca Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q28573 wdt:P35 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was the head of the Inca Empire?"],"info":{}}
{"id":"train_8586","question":"In the Star Wars universe, who is Princess Leia's child?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q51797 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P1080 wd:Q3551295 }","paraphrases":["Which character in Star Wars in the child of Princess Leia?"],"info":{}}
{"id":"train_8587","question":"Who is Andriy Shevchenko's spouse and where did they get married?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q41244 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P2842 ?value1 . }","paraphrases":["Who is Andriy Shevchenko's companion and where did they get married?"],"info":{}}
{"id":"train_8589","question":"which country in Beersheba  has am end time of 1917-10-31?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41843 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1917' ) ) }","paraphrases":["There is a country in Beersheba that has am end time of 1917-10-31, which one is it?"],"info":{}}
{"id":"train_8590","question":"What electoral district is Bob Hawke in and what is his position?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q269372 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 ?value1 . }","paraphrases":["What electoral district is Bob Hawke in and what is his position?"],"info":{}}
{"id":"train_8591","question":"What timer home venue starts Montreal Canadians in Center Belly?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q188143 p:P115 ?s . ?s ps:P115 wd:Q522282 . ?s pq:P580 ?value }","paraphrases":["Which home venue's timer in Center Belly begins Montreal Canadians?"],"info":{}}
{"id":"train_8592","question":"tell me alloy that name has the world zamak in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q37756 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zamak' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know combination that title has the world zamak in it"],"info":{}}
{"id":"train_8593","question":"Which is Yahoo! Japan Talent Database ID for Jimmy Connors?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q53393 wdt:P3284 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8594","question":"What is the binary relation that contains the word subset in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q130901 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'subset' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the binary relationship that the word subset contains in its name?"],"info":{}}
{"id":"train_8596","question":"What is the current translated edition of Tao Te Ching","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P629 wd:Q134425 . ?sbj wdt:P31 wd:Q3331189 }","paraphrases":["What is the translated current version of Tao Te Ching?"],"info":{}}
{"id":"train_8597","question":"What is the design of a Russian ruble?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P38 wd:Q41044 . ?sbj wdt:P31 wd:Q28794013 }","paraphrases":["WHICH IS THE DESIGN OF THE RUSSIAN RUBLE"],"info":{}}
{"id":"train_8600","question":"What is the name of the writer of \"How to Win Friends and Influence People\", who died in 1955?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q960077 wdt:P50 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( YEAR ( ?x ) , '1955' ) ) }","paraphrases":["What is the identify of the author of \"How to Win Friends and Influence People\", who died in 1955?"],"info":{}}
{"id":"train_8602","question":"What is the gender of Diana Ross, that is not a woman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36290 wdt:P21 ?answer . ?answer wdt:P1889 wd:Q467 }","paraphrases":["What is Diana Ross's gender, which isn't a woman?"],"info":{}}
{"id":"train_8603","question":"Which {function} is {treatment} of {postoperative complications} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18478450 wdt:P2176 ?X . ?X wdt:P2868 ?answer }","paraphrases":["Which {work} is {treatment} of {postoperative complications} ?"],"info":{}}
{"id":"train_8604","question":"What is the emergency phone number for Liberia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1014 wdt:P2852 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8605","question":"What is The Dean's Answer to The Rebus know for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21283498 wdt:P50 ?X . ?X wdt:P800 ?answer }","paraphrases":["What is the reason for The Dean's Answer to The Rebus?"],"info":{}}
{"id":"train_8607","question":"When did Osamu Tezuka receive an Iwaya Sazanami Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q193300 p:P166 ?s . ?s ps:P166 wd:Q28069010 . ?s pq:P585 ?value }","paraphrases":["the year Osamu Tezuka received the Iwaya Sazanami Award?"],"info":{}}
{"id":"train_8609","question":"What partner town of Trondheim has the geotag of 61.4981?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q25804 wdt:P190 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '61.4981' ) ) }","paraphrases":["What accomplice town of Trondheim has the geotag of 61.4981?"],"info":{}}
{"id":"train_8611","question":"Which member of the county seat is with Yaounde?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3808 wdt:P1376 ?X . ?X wdt:P463 ?answer }","paraphrases":["Which part of the province situate is with Yaounde?"],"info":{}}
{"id":"train_8613","question":"who is the member and student of Quincy_Jones?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q193645 wdt:P463 ?ans_1 . wd:Q193645 wdt:P1066 ?ans_2 }","paraphrases":["Who is Quincy Jones, and who is their student?"],"info":{}}
{"id":"train_8616","question":"Name a painting commisioned by Catholic Church","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P88 wd:Q9592 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["Title a portray commisioned by Catholic Church"],"info":{}}
{"id":"train_8618","question":"Which is the record or record progression for decathlon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q184654 wdt:P2869 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8620","question":"What is the etymology of the Cooper pair that has a Nobel Prize in Physics nomination received?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q620057 wdt:P138 ?answer . ?answer wdt:P1411 wd:Q38104 }","paraphrases":["What is the Cooper pair's etymology that has been awarded a Nobel Prize in Physics nomination?"],"info":{}}
{"id":"train_8621","question":"Who has superpartner of muon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3151 wdt:P2375 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8622","question":"Who uses the conical shaped Asian hat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q526863 wdt:P1419 ?X . ?X wdt:P1535 ?answer }","paraphrases":["Who is using the Asian conical hat?"],"info":{}}
{"id":"train_8624","question":"What is the name for someone who works in psychoanalysis","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P101 wd:Q41630 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is someone who works in psychonalysis called?"],"info":{}}
{"id":"train_8625","question":"Which is Google+ ID for Federal Communications Commission?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q128831 wdt:P2847 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8627","question":"Who or what is the manager of Alan Sugar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1037 wd:Q336520 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["Who or what is the supervisor of Alan Sugar?"],"info":{}}
{"id":"train_8628","question":"What is the name of a market structure that starts with the letter o.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q877707 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a advertise structure that begins with the letter o."],"info":{}}
{"id":"train_8629","question":"Which is commissioned by Sears?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P88 wd:Q6499202 }","paraphrases":[],"info":{}}
{"id":"train_8630","question":"Who gave the {head office location} of {graduated from} of {Lisa Harriton} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2994135 wdt:P69 ?X . ?X wdt:P159 ?answer }","paraphrases":["Who gave the {head office area} of {graduated from} of {Lisa Harriton} ?"],"info":{}}
{"id":"train_8633","question":"What binary F-type main-sequence star has the slowest stellar rotational velocity ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1353952 . ?ent wdt:P4296 ?obj . ?ent wdt:P31 wd:Q50053 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Name the binary F-type main=sequence star that has the slowest stellar rotational velocity."],"info":{}}
{"id":"train_8634","question":"Which business is owned by the Empire State Building?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9188 wdt:P127 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":["Which trade is possessed by the Realm State Building?"],"info":{}}
{"id":"train_8636","question":"What is the country identifier of the country's jurisdiction of Bush v. Gore?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2065434 wdt:P1001 ?X . ?X wdt:P2258 ?answer }","paraphrases":["Bush v. Gore uses what country identifier of the country's jurisdiction?"],"info":{}}
{"id":"train_8638","question":"Where was Jon Jones born in 1803-0-0.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q285450 wdt:P19 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1803' ) ) }","paraphrases":["Where was Jon Jones born in 1803-0-0."],"info":{}}
{"id":"train_8640","question":"What record label released the albums of Eminem ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5608 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 }","paraphrases":["What record name discharged the collections of Eminem ?"],"info":{}}
{"id":"train_8641","question":"at what temperature do graphite sublime?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5309 wdt:P2113 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8642","question":"What is zenith of range for East Lake ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28656991 wdt:P4552 ?X . ?X wdt:P610 ?answer }","paraphrases":["What is East Lake's zenith range?"],"info":{}}
{"id":"train_8643","question":"Is 8.8 the slope of the El Dorado Speedway?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q16559802 wdt:P4184 ?obj filter ( ?obj = 8.8 ) }","paraphrases":["Is the pitch of the El Dorado Speedway 8.8?"],"info":{}}
{"id":"train_8644","question":"Who won the award for which Arthur Hunnicutt was nominated?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q709942 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who won the grant for which Arthur Hunnicutt was designated?"],"info":{}}
{"id":"train_8645","question":"What is coordinate location of Mekong River that is applies to part of river mouth ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41179 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q1233637 }","paraphrases":["coordinates of Mekong River  north?"],"info":{}}
