{"id":"train_6817","question":"Is Janet Jackson, the performer, single?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P175 wd:Q131324 . ?sbj wdt:P31 wd:Q134556 }","paraphrases":["Is Janet Jackson, the entertainer, single?"],"info":{}}
{"id":"train_6819","question":"Who is the {shareholder} of {CRRC} which is a {New York Stock Exchange}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19840026 wdt:P127 ?answer . ?answer wdt:P414 wd:Q13677 }","paraphrases":["Who is the {shareholder} of {CRRC} which could be a {Unused York Stock Exchange}?"],"info":{}}
{"id":"train_6821","question":"What is next to Missouri and divides into Calloway County?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1581 wdt:P47 ?answer . ?answer wdt:P150 wd:Q491927 }","paraphrases":["What is another to Missouri and partitions into Calloway District?"],"info":{}}
{"id":"train_6823","question":"Tell me fungal part whose name has the word stroma in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56883667 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'stroma' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me parasitic portion whose title has the word stroma in it."],"info":{}}
{"id":"train_6824","question":"Which the is composition of The Blue Lotus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q76210 wdt:P50 ?X . ?X wdt:P800 ?answer }","paraphrases":["what is the composition of The Blue Lotus?"],"info":{}}
{"id":"train_6826","question":"Name a music genre that contain the word \"black \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188451 . ?sbj wdt:P2959 wd:Q1868278 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'black' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a music genre containing the word \"black\" in its name?"],"info":{}}
{"id":"train_6831","question":"Victoria Bridge is a member of which architecture firm?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2890014 wdt:P84 ?X . ?X wdt:P106 ?answer }","paraphrases":["Victoria Bridge could be a part of which engineering firm?"],"info":{}}
{"id":"train_6832","question":"When did Nauru become a member of the Asian Development Bank?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q697 p:P463 ?s . ?s ps:P463 wd:Q188822 . ?s pq:P580 ?value }","paraphrases":["Nauru joined the Asian Development Bank in what year?"],"info":{}}
{"id":"train_6835","question":"What is the name of this isolated human group that contain the word \"wenrohronon\" in their name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3117863 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wenrohronon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the name of this isolated group of people containing in their name the word \"wenrohronon?\""],"info":{}}
{"id":"train_6836","question":"In which country is Dutch the official language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q7411 . ?sbj wdt:P31 wd:Q133156 }","paraphrases":["In which nation is Dutch the official dialect?"],"info":{}}
{"id":"train_6838","question":"Name an instruction set architecture designed by Intel and that contains the word \"x86\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q272683 . ?sbj wdt:P287 wd:Q248 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'x86' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title an instruction set design outlined by Intel which contains the word \"x86\" in its name"],"info":{}}
{"id":"train_6840","question":"Who is the winner for High Noon who was awarded as Academy Award for Best Film Editing?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q245208 p:P166 ?s . ?s ps:P166 wd:Q281939 . ?s pq:P1346 ?value }","paraphrases":["Who won the Academy Award for Best Film Editing for the film High Noon?"],"info":{}}
{"id":"train_6843","question":"What is the capital of the Achaemenid Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q389688 wdt:P36 ?obj . ?obj wdt:P31 wd:Q5119 }","paraphrases":["What is the capital of the Achaemenid Empire?"],"info":{}}
{"id":"train_6846","question":"What academic degree did Franz Kafka get for studying at Karl-Ferdinands-Universität and what was his academic major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q905 p:P69 ?s . ?s ps:P69 wd:Q1729754 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What tutorial diploma did Franz Kafka get for studying at Karl-Ferdinands-Universität and what was once his educational major?"],"info":{}}
{"id":"train_6850","question":"When did Antioch on the Orontes become referred to as Antakya?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q200441 p:P131 ?s . ?s ps:P131 wd:Q80561 . ?s pq:P580 ?value }","paraphrases":["What was the date when Antioch on the Orontes became known as Antakya?"],"info":{}}
{"id":"train_6851","question":"How do you say culinary mustard in Dutch?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131748 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q7411 }","paraphrases":["What is the Dutch word for mustard used in cooking?"],"info":{}}
{"id":"train_6852","question":"What does the Apostolic see for the organization directed from the papal office?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q19546 wdt:P2389 ?obj . ?obj wdt:P31 wd:Q1147274 }","paraphrases":["What does the Apostolic see for the association coordinated from the ecclesiastical office?"],"info":{}}
{"id":"train_6854","question":"When did Dijon have a population of 155114?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7003 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '155114' ) ) . ?s pq:P585 ?value }","paraphrases":["What year did Dijon have a population of at least 155k?"],"info":{}}
{"id":"train_6856","question":"What significant event happened when Anna Wintour was experiencing childbirth?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q230744 p:P793 ?s . ?s ps:P793 wd:Q34581 . ?s pq:P585 ?value }","paraphrases":["What was a big event that occurred when Anna Wintour was experiencing childbirth?"],"info":{}}
{"id":"train_6857","question":"What was named for Herschel Space Observatory that has a birthday of 3-16-1750?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q209630 wdt:P138 ?answer . ?answer wdt:P569 ?x FILTER ( contains ( YEAR ( ?x ) , '1750' ) ) }","paraphrases":["What was named for the 3 - 16 - 1750 birthday Herschel Space Observatory?"],"info":{}}
{"id":"train_6859","question":"what is the heavy equipment that starts with t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q874311 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is the heavy equipment that begins with t"],"info":{}}
{"id":"train_6864","question":"What is studies of coined for periodic table ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10693 wdt:P61 ?X . ?X wdt:P101 ?answer }","paraphrases":["What is thinks about of coined for occasional table ?"],"info":{}}
{"id":"train_6866","question":"Who commissioned the Taj Mehal","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9141 wdt:P88 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who commissioned the Taj Mehal"],"info":{}}
{"id":"train_6868","question":"What award did Aleksandr Solzhenitsyn receive and how much was the prize money?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q34474 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }","paraphrases":["What grant did Aleksandr Solzhenitsyn get and what amount was the prize cash?"],"info":{}}
{"id":"train_6869","question":"What is the name of the rocket used by the Pioneer 11?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q59113 wdt:P375 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6870","question":"What degree did Walter Benjamin earn at University of Bern?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q61078 p:P69 ?s . ?s ps:P69 wd:Q659080 . ?s pq:P512 ?value }","paraphrases":["Give me the name of the degree that Walter Benjamin earned at University of Bern."],"info":{}}
{"id":"train_6872","question":"WHICH IS THE BOOK THAT PUBLISHED IN JOURNAL DES DEBATS THAT CONTAINS THE WORD COUNT IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q571 . ?sbj wdt:P1433 wd:Q2565164 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'count' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE BOOK THAT PUBLISHED IN JOURNAL DES DEBATS THAT CONTAINS THE WORD COUNT IN THEIR NAME"],"info":{}}
{"id":"train_6873","question":"What duties does Valerian Agafonoff perform?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4056733 wdt:P184 ?X . ?X wdt:P101 ?answer }","paraphrases":["What obligations does Valerian Agafonoff perform?"],"info":{}}
{"id":"train_6874","question":"IS THE CALIBER OF THE M1939 GREATER THAN 44.4","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q701703 wdt:P4403 ?obj filter ( ?obj > 44.4 ) }","paraphrases":["What is the caliber of the M1939?"],"info":{}}
{"id":"train_6875","question":"What was the population of Bacolod on May 5, 2010?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5217 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2010' ) ) }","paraphrases":["Give me the population of Bacolod on May 5, 2010."],"info":{}}
{"id":"train_6876","question":"Which was the award received by Shoji Hamada on 1-1-1968?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3090171 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1968' ) ) }","paraphrases":["On 1/1/1968, what award did Shoji Hamada win?"],"info":{}}
{"id":"train_6878","question":"When was Ernesto Zedillo awarded the Wilbur Cross Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q298149 p:P166 ?s . ?s ps:P166 wd:Q8000166 . ?s pq:P585 ?value }","paraphrases":["In which year Ernesto Zedillo was awarded the Wilbur Cross Medal?."],"info":{}}
{"id":"train_6881","question":"What are the {province of China which starts with letters z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1615742 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the {territory of China which begins with letters z"],"info":{}}
{"id":"train_6882","question":"What is  the higher taxon of resident animal species of Hellabrunn Zoo ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q264691 wdt:P1990 ?X . ?X wdt:P171 ?answer }","paraphrases":["The higher taxon of resident animal species of Hellabrunn Zoo is what?"],"info":{}}
{"id":"train_6883","question":"Which is the archive for the architectural style of Bauhaus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P149 wd:Q124354 . ?sbj wdt:P31 wd:Q166118 }","paraphrases":["Which is the chronicle for the engineering fashion of Bauhaus?"],"info":{}}
{"id":"train_6885","question":"Where did Vladimir Nabokov live on 4-22-1899?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q36591 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1899' ) ) }","paraphrases":["Where was Vladimir Nabokov's home on 4-22-1899?"],"info":{}}
{"id":"train_6886","question":"When was the peseta replaced by the euro?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q4916 p:P1365 ?s . ?s ps:P1365 wd:Q189097 . ?s pq:P585 ?value }","paraphrases":["The euro replaced the peseta on what date?"],"info":{}}
{"id":"train_6887","question":"What state does Mobutu Sese Seko proside over","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P35 wd:Q164535 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["Mobutu Sese Seko presides over which state?"],"info":{}}
{"id":"train_6889","question":"Which is the film genre of the series of Unmasked?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16746470 wdt:P179 ?X . ?X wdt:P136 ?answer }","paraphrases":["Which is the film sort of the arrangement of Unmasked?"],"info":{}}
{"id":"train_6893","question":"Where can data about Wakayama Prefecture be found that is open to the public?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131314 p:P1325 ?s . ?s ps:P1325 ?obj . ?s pq:P642 wd:Q309901 }","paraphrases":["Where can one of the public find information about Wakayama Prefecture?"],"info":{}}
{"id":"train_6894","question":"When did Leonard Cohen receive the Grammy Lifetime Achievement Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1276 p:P166 ?s . ?s ps:P166 wd:Q935843 . ?s pq:P585 ?value }","paraphrases":["On what date was Leonard Cohen awarded the Grammy Lifetime Achievement Award?"],"info":{}}
{"id":"train_6895","question":"Which is the name of Ruth Benedict?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q228822 wdt:P2561 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6896","question":"What is the place of death of Endre Ady, which is the twin city of Daejeon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q211392 wdt:P20 ?answer . ?answer wdt:P190 wd:Q20921 }","paraphrases":["What is the put of passing of Endre Ady, which is the twin city of Daejeon?"],"info":{}}
{"id":"train_6898","question":"What language did the Ancient Greek's speak?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q35497 wdt:P4913 ?obj . ?obj wdt:P31 wd:Q34770 }","paraphrases":["What dialect did the Old Greek's speak?"],"info":{}}
{"id":"train_6899","question":"Which museum tugboat has the most net tonnage ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q191826 . ?ent wdt:P2790 ?obj . ?ent wdt:P366 wd:Q575727 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What tugboat found in a museum weighs the most?"],"info":{}}
{"id":"train_6901","question":"is the time zone in trentino-south tyrol utc+01:00?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1237 p:P421 ?s . ?s ps:P421 wd:Q6655 . ?s pq:P1264 ?value }","paraphrases":["Is UTC 01:00 trentino south tyrol proper time zone?"],"info":{}}
{"id":"train_6902","question":"which is executioner of lyracist of In My Life ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1324384 wdt:P676 ?X . ?X wdt:P157 ?answer }","paraphrases":["Who sang In My Life?"],"info":{}}
{"id":"train_6903","question":"Which is the charge of Joan of Arc?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7226 wdt:P1595 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6904","question":"Tell me the media player with a license of proprietary license and starts with the letter w?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q210337 . ?sbj wdt:P275 wd:Q3238057 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the media participant with a license of proprietary license and begins with the letter w?"],"info":{}}
{"id":"train_6905","question":"What player ID is given to George Weah by L'Équipe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q173139 wdt:P3665 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6906","question":"What town in Woodward County is birthplace to Reba McEntire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q229430 wdt:P19 ?answer . ?answer wdt:P150 wd:Q489447 }","paraphrases":["What town in Woodward Province is origin to Reba McEntire?"],"info":{}}
{"id":"train_6907","question":"What is Action Comics' online books page publication ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q343615 wdt:P5396 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6908","question":"Which is the deepest point for Mekong River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1589 wd:Q41179 }","paraphrases":[],"info":{}}
{"id":"train_6909","question":"What is not the same as the globe, whose time zone is Mountain Time Zone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q133792 wdt:P1889 ?answer . ?answer wdt:P421 wd:Q3134980 }","paraphrases":["What isn't the same as the globe, whose time zone is Mountain Time Zone?"],"info":{}}
{"id":"train_6912","question":"what is the antonym of father that has series is Ahnentafel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7565 wdt:P461 ?answer . ?answer wdt:P179 wd:Q267388 }","paraphrases":["what is the antonym of father that has arrangement is Ahnentafel?"],"info":{}}
{"id":"train_6913","question":"Mention the name of the companion of Johnny Cash in his discography","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q369160 wdt:P175 ?X . ?X wdt:P26 ?answer }","paraphrases":["Say the title of the companion of Johnny Cash in his discography"],"info":{}}
{"id":"train_6914","question":"Which animated character has got more number of children?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15711870 . ?ent wdt:P1971 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What cartoon character has the greatest amount of kids?"],"info":{}}
{"id":"train_6918","question":"Which country does Roberto Rossellini, who died in Rome, belong to?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q53003 p:P20 ?s . ?s ps:P20 wd:Q220 . ?s pq:P17 ?value }","paraphrases":["Which nation does Roberto Rossellini, who passed on in Rome, have a place with?"],"info":{}}
{"id":"train_6919","question":"What is the academic specialty of the author of journal article \"Research on Middle Age: An Assessment?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40468747 wdt:P1433 ?X . ?X wdt:P101 ?answer }","paraphrases":["What is the academic specialty of the writer of journal article \"Research on Middle Age: An Assessment?\""],"info":{}}
{"id":"train_6921","question":"Who is the sponsor of Anne, Princess Royal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P859 wd:Q151754 }","paraphrases":[],"info":{}}
{"id":"train_6922","question":"What are the recurring events which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15275719 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the recurring events beginning with the letter w"],"info":{}}
{"id":"train_6923","question":"Which is the maximum capacity for Wright Flyer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q688605 wdt:P1083 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6924","question":"does the age events of the totoro equivelant to 3000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1939137 wdt:P3629 ?obj filter ( ?obj = 3000 ) }","paraphrases":["does the age occasions of the totoro equivelant to 3000?"],"info":{}}
{"id":"train_6925","question":"How many operators are by Texas A&M University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P137 wd:Q49212 }","paraphrases":["Which is the number of operators that are there in Texas A&M University?"],"info":{}}
{"id":"train_6926","question":"Where  is Charles Nirmalanathan job located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20855546 wdt:P102 ?X . ?X wdt:P159 ?answer }","paraphrases":["which is the job location of Charles Nirmalanathan"],"info":{}}
{"id":"train_6927","question":"\"Which Science, that studies deformation, has a  history in The History of Engineering?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2672013 wdt:P2579 ?answer . ?answer wdt:P2184 wd:Q5867819 }","paraphrases":["\"Which Science, that considers distortion, incorporates a history within The History of Designing?\""],"info":{}}
{"id":"train_6928","question":"Which is the river that is different from the mass?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11423 wdt:P1889 ?obj . ?obj wdt:P31 wd:Q4022 }","paraphrases":["Which is the waterway that is not the same as the mass?"],"info":{}}
{"id":"train_6930","question":"What is the secret locomotion of child?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7569 wdt:P2849 ?X . ?X wdt:P3512 ?answer }","paraphrases":["What is the mystery movement of child?"],"info":{}}
{"id":"train_6931","question":"What (in the Julian calendar) is the date of birth of Antipater?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q204760 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["In the Julian calendar, when is Anipater born?"],"info":{}}
{"id":"train_6933","question":"How many languages are based on the {Latin script} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P144 wd:Q8229 }","paraphrases":["Latin script  has how many languages that are based on it?"],"info":{}}
{"id":"train_6934","question":"In which locations did Jan Brueghel the Elder work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q209050 wdt:P937 ?obj }","paraphrases":["Where did Jan Brueghel the Elder work?"],"info":{}}
{"id":"train_6935","question":"What is an electrical connector system that is published by USB Implementers Forum with the word \"usb\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58184783 . ?sbj wdt:P123 wd:Q3847420 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'usb' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is an electrical connector framework that's distributed by USB Implementers Gathering with the word \"usb\" in its name?"],"info":{}}
{"id":"train_6936","question":"When were Jessica Lange and Sam Shephard together?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q173585 p:P451 ?s . ?s ps:P451 wd:Q294583 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["At what point in time where Jessica Lange and Sam Shephard in a romantic relationship?"],"info":{}}
{"id":"train_6937","question":"What is parent company for alumna of Thomas Hobbes ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37621 wdt:P69 ?X . ?X wdt:P355 ?answer }","paraphrases":["What is the parent company for the alumna of Thomas Hobbes?"],"info":{}}
{"id":"train_6939","question":"Tell me craft  whose name has the word woodworker in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2207288 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'woodworker' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know create whose title has the word carpenter in it."],"info":{}}
{"id":"train_6940","question":"Which {makes use of} {sports} of {football boots} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q512804 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["Which {makes utilize of} {sports} of {football boots} ?"],"info":{}}
