{"id":"train_15278","question":"Name a town sharing a border with Ottawa.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1930 wdt:P47 ?obj . ?obj wdt:P31 wd:Q3957 }","paraphrases":[],"info":{}}
{"id":"train_15282","question":"does foreground depicts grande odalisque?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1978815 p:P180 ?s . ?s ps:P180 ?obj . ?s pq:P518 wd:Q2533752 }","paraphrases":["Is Grande odalisque depicted by foreground?"],"info":{}}
{"id":"train_15283","question":"How many characters are there on Sesame Street?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q155629 wdt:P1881 ?obj }","paraphrases":["The total number of characters on Sesame Street is what?"],"info":{}}
{"id":"train_15284","question":"When were the Red Hot Chili Peppers nominated for America's Favorite Alternative Music Award Artist?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q10708 p:P1411 ?s . ?s ps:P1411 wd:Q1527242 . ?s pq:P585 ?value }","paraphrases":["When were the Red Hot Chili Peppers selected for America's Favorite Alternative Music Award Artist?"],"info":{}}
{"id":"train_15286","question":"How much time in a given Edo period?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184963 wdt:P155 ?X . ?X wdt:P576 ?answer }","paraphrases":["How much time in a given Edo period?"],"info":{}}
{"id":"train_15287","question":"how many habitats does varanus komodoensis have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q4504 wdt:P2974 ?obj }","paraphrases":["What is the number of habitats that varanus komodoensis has?"],"info":{}}
{"id":"train_15288","question":"What a ketone that begins with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q170744 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What a ketone that starts with the letter p"],"info":{}}
{"id":"train_15290","question":"What was the name of the reward that John Cleese received for his work \"A Fish Called Wanda\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q25014 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q466186 }","paraphrases":["What honor was given to John Cleese for appearing in \"A Fish Called Wanda\"?"],"info":{}}
{"id":"train_15294","question":"What award did Grazia Deledda received, and when did he receive it ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q7728 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What award was given to Grazie Deledda, and on what date?"],"info":{}}
{"id":"train_15298","question":"Which Roman deity corresponds to Apollo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q37340 wdt:P460 ?obj . ?obj wdt:P31 wd:Q11688446 }","paraphrases":["Which Roman God is Apollo?"],"info":{}}
{"id":"train_15300","question":"Who is the {moon of Jupiter} for {parent astronomical body} of {Jupiter}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P397 wd:Q319 . ?sbj wdt:P31 wd:Q61702557 }","paraphrases":["Who is the {moon of Jupiter} for {parent cosmic body} of {Jupiter}"],"info":{}}
{"id":"train_15302","question":"What is the birth place of Blackbeard, that is in the region of Avon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q213518 wdt:P19 ?answer . ?answer wdt:P131 wd:Q929902 }","paraphrases":["What is the birth put of Blackbeard, that's within the locale of Avon?"],"info":{}}
{"id":"train_15304","question":"When did Sharon Stone divorce from Michael Greenburg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q62975 p:P26 ?s . ?s ps:P26 wd:Q6830777 . ?s pq:P582 ?value }","paraphrases":["What year did Sharon Stone receive a divorce from Michael Greenburg?"],"info":{}}
{"id":"train_15306","question":"What international law dictates the Pope?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q19546 wdt:P2389 ?obj . ?obj wdt:P31 wd:Q1896989 }","paraphrases":["What worldwide law manages the Pope?"],"info":{}}
{"id":"train_15308","question":"How many works are attributed to Aristotle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1773 wd:Q868 }","paraphrases":["How many operations are assigned to Aristotle?"],"info":{}}
{"id":"train_15310","question":"Who was Count of Jaffa and Ascalon before and after Guy of Lusignan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 wd:Q52160370 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Who was once Count of Jaffa and Ascalon earlier than and after Guy of Lusignan?"],"info":{}}
{"id":"train_15312","question":"How long were Drew Barrymore and Tom Green married?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q676094 p:P26 ?s . ?s ps:P26 wd:Q315826 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["Drew Barrymore and Tom Green have been married for how long?"],"info":{}}
{"id":"train_15313","question":"Where is Gilda Radner buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q266808 wdt:P119 ?X . ?X wdt:P2633 ?answer }","paraphrases":["Where is Gilda Radner buried?"],"info":{}}
{"id":"train_15314","question":"Which human has the highest Erdos number?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P2021 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What person has the best Erdos number?"],"info":{}}
{"id":"train_15317","question":"Did the American Civil War have a catagory of associated people by the name of People of the American Civil War?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q8676 wdt:P1792 wd:Q9073497 }","paraphrases":["During the American Civil War there were many groups of people banned together, was one named People of the American Civil War?"],"info":{}}
{"id":"train_15321","question":"What is the diplomatic relation of Peyton Manning's nationality?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7539 wdt:P27 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is the political connection of Peyton Manning's nationality?"],"info":{}}
{"id":"train_15322","question":"who  is the child of bernie ecclestone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q172724 wdt:P40 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["who is the child of bernie ecclestone?"],"info":{}}
{"id":"train_15323","question":"What is the Wikimedia category for staff of the New York University organization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q49210 wdt:P4195 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["What is the Wikimedia category for staff of the Unused York College organization?"],"info":{}}
{"id":"train_15326","question":"What chapter of your edition does Hamlet start on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41567 wdt:P747 ?obj . ?obj wdt:P31 wd:Q1980247 }","paraphrases":["Which is  chapter of your edition does Hamlet start on?"],"info":{}}
{"id":"train_15328","question":"Who is the human director of Forrest Gump?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q134773 wdt:P57 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the human chief of Forrest Gump?"],"info":{}}
{"id":"train_15330","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1492 wdt:P832 ?obj . ?obj wdt:P31 wd:Q64161 }","paraphrases":["n/a"],"info":{}}
{"id":"train_15331","question":"What was Benoit Mandelbrot's major and what degree did he obtain at the California Institute of Technology?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q101740 p:P69 ?s . ?s ps:P69 wd:Q161562 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What was Benoit Mandelbrot's principal and what degree did he attain at the California Institute of Technology?"],"info":{}}
{"id":"train_15332","question":"Who  is discoverer  of musical instrument of Sidney Bechet ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q313519 wdt:P1303 ?X . ?X wdt:P61 ?answer }","paraphrases":["Who is pioneer of melodic instrument of Sidney Bechet ?"],"info":{}}
{"id":"train_15333","question":"Name a song composed by Michael Jackson that contains the word \"world \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7366 . ?sbj wdt:P86 wd:Q2831 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a song composed by Michael Jackson containing in his name the word \"world\""],"info":{}}
{"id":"train_15335","question":"What are the first principle which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q536351 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the first principle which begin with the letter s"],"info":{}}
{"id":"train_15337","question":"Name a territorial entity that starts with letter Z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1496967 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a territorial entity beginning with letter Z"],"info":{}}
{"id":"train_15339","question":"\"What is topic of history of South America, that has has wards is Ecuador ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q912852 wdt:P1269 ?answer . ?answer wdt:P150 wd:Q736 }","paraphrases":["\"What is subject of records of South America, that has has wards is Ecuador ?\""],"info":{}}
{"id":"train_15340","question":"Who is the contestant of the famous works by John Bell?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16466630 wdt:P800 ?X . ?X wdt:P161 ?answer }","paraphrases":["Who competed with John Bell's famous works?"],"info":{}}
{"id":"train_15341","question":"When did Diego Rivera and Angelina Beloff get divorced?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q171128 p:P26 ?s . ?s ps:P26 wd:Q529975 . ?s pq:P582 ?value }","paraphrases":["Diego Rivera and Angelina Beloff got divorced on what date?"],"info":{}}
{"id":"train_15342","question":"Tell me the number of games played and points achieved by Gordan Banks who plays for the England national football team.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q213879 p:P54 ?s . ?s ps:P54 wd:Q47762 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["Tell me the number of games played and factors completed through Gordan Banks who performs for the England country wide soccer team."],"info":{}}
{"id":"train_15344","question":"What award did Eddy Mercks receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q103756 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 ?value1 . }","paraphrases":["What grant did Vortex Mercks receive?"],"info":{}}
{"id":"train_15345","question":"When was Halle (Saale) a Soviet occupation zone?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2814 p:P17 ?s . ?s ps:P17 wd:Q55300 . ?s pq:P580 ?value }","paraphrases":["During what time period was Halle (Saale) occupied by the Soviet Union?"],"info":{}}
{"id":"train_15346","question":"What is the culture of Seljuk dynasty having first language as Turkic languages?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3708255 wdt:P172 ?answer . ?answer wdt:P103 wd:Q34090 }","paraphrases":["What is the subculture of Seljuk dynasty having first language as Turkic languages?"],"info":{}}
{"id":"train_15347","question":"Which is a sports discipline competed in weightlifting?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2416 wd:Q83462 }","paraphrases":[],"info":{}}
{"id":"train_15348","question":"What is the alumna of Harvey Weinstein whose geocoordunates is 43.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q531599 wdt:P69 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '43.0' ) ) }","paraphrases":["What is the alumna of Harvey Weinstein whose geocoordunates is 43.0?"],"info":{}}
{"id":"train_15349","question":"Which is the InChlKey for zinc chloride?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q204714 wdt:P235 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15350","question":"On the shore of Rabat, what has a tributary of Mystic River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3551 wdt:P206 ?answer . ?answer wdt:P974 wd:Q1758000 }","paraphrases":["On the shore of Rabat, what contains a tributary of Spiritualist River?"],"info":{}}
{"id":"train_15352","question":"Which is the state with limited recognition that is located on the terrain featured on East Asia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P706 wd:Q27231 . ?sbj wdt:P31 wd:Q15634554 }","paraphrases":["Which is the state with restricted acknowledgment that's found on the territory highlighted on East Asia?"],"info":{}}
{"id":"train_15353","question":"Who was elected the president of Tampere in 2017?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q40840 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2017' ) ) }","paraphrases":["Who won the presidential election in Tampere in 2017?"],"info":{}}
{"id":"train_15354","question":"What are the physical constant which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q173227 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the physical consistent which begin with the letter w"],"info":{}}
{"id":"train_15355","question":"Tell me which is the ice age which contains the word age in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49367 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'age' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me which is the ice age which carries the word age in it is name?"],"info":{}}
{"id":"train_15356","question":"Tell me reform whose name has the word reform in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q900406 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'reforms' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me change whose title has the word change in it."],"info":{}}
{"id":"train_15359","question":"Who gave the {subject} of {part of work} of {Sexual reproduction in Aspergillus tubingensis from section Nigri.} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q48039247 wdt:P1433 ?X . ?X wdt:P101 ?answer }","paraphrases":["Who gave the {subject} of {part of work} of {Sexual replica in Aspergillus tubingensis from area Nigri.} ?"],"info":{}}
{"id":"train_15361","question":"What was the twin city of Bangkok from 2010?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1861 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2010' ) ) }","paraphrases":["In 2010, what became the twin city of Bangkok?"],"info":{}}
{"id":"train_15362","question":"Which of the work of Rodin is significant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q30755 wdt:P800 ?X . ?X wdt:P195 ?answer }","paraphrases":["What is the significant work of Rodin?"],"info":{}}
{"id":"train_15364","question":"What genre and record label do The Beach Boys belong to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q183048 wdt:P264 ?ans_1 . wd:Q183048 wdt:P136 ?ans_2 }","paraphrases":["What's the genre and record label of The Beach Boys?"],"info":{}}
{"id":"train_15365","question":"What single is part of hard rocks current work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q83270 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q134556 }","paraphrases":["What single is portion of difficult rocks current work?"],"info":{}}
{"id":"train_15366","question":"What medication is prescribed for the treatment of Major Depressive Disorder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2175 wd:Q42844 . ?sbj wdt:P31 wd:Q12140 }","paraphrases":["What medicine is endorsed for the treatment of Major Depressive Clutter?"],"info":{}}
{"id":"train_15370","question":"What are the different parts of cable television?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2670 wd:Q184452 }","paraphrases":[],"info":{}}
{"id":"train_15371","question":"Is it true that Harshvardhan Kapoor and Rhea Kapoor were the sons of Anil Kapoor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q313956 wdt:P40 wd:Q23007906 . wd:Q313956 wdt:P40 wd:Q7320299 }","paraphrases":["Were Anil Kapoor's children really Harshvardhan Kapoor and Rhea Kapoor?"],"info":{}}
{"id":"train_15373","question":"Who is the {parent taxon} and {this taxon is source of} of {Turtle} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q223044 wdt:P171 ?ans_1 . wd:Q223044 wdt:P1672 ?ans_2 }","paraphrases":["Identify the parent taxon and the if it's the source of Turtle."],"info":{}}
{"id":"train_15375","question":"Which is the Movieplayer character ID for Cuba Gooding Jr. ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q136209 wdt:P4782 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15376","question":"What is Jeffrey Archer's position in the 46th United Kingdom Parliament?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q313489 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2937 wd:Q21084463 }","paraphrases":["What position does Jeffery Archer hold in the 46th UK Parliament?"],"info":{}}
{"id":"train_15380","question":"Where did Pedro Almodovar win Best Writing, Original Screenplay?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q55171 p:P166 ?s . ?s ps:P166 wd:Q41417 . ?s pq:P805 ?value }","paraphrases":["FRANCIA"],"info":{}}
{"id":"train_15381","question":"WHICH IS THE LIKNED DATSA STRUCTURE THAT STARTS WITH I","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6554356 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE LIKNED DATSA STRUCTURE THAT Begins WITH I"],"info":{}}
{"id":"train_15383","question":"was wolfgang amadeus mozart given birth to in Salzburg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q254 p:P19 ?s . ?s ps:P19 wd:Q34713 . ?s pq:P17 ?value }","paraphrases":["What was the birthplace of Mozart?"],"info":{}}
{"id":"train_15384","question":"The Gardener is employed by who?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20540843 wdt:P170 ?X . ?X wdt:P108 ?answer }","paraphrases":["Who has employed The Gardener?"],"info":{}}
{"id":"train_15385","question":"What is in the district of Nord-Pas-de-Calais whose member is International Hydrographic Organization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16987 wdt:P131 ?answer . ?answer wdt:P463 wd:Q233611 }","paraphrases":["What is in the district of Nord-Pas-de-Calais whose member is International Hydrographic Organization?"],"info":{}}
{"id":"train_15386","question":"When did Gustav Stresemann stop being the Chancellor of Germany?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q103955 p:P39 ?s . ?s ps:P39 wd:Q56022 . ?s pq:P582 ?value }","paraphrases":["Gustav Stresemann ended his Chancellorship of Germany when?"],"info":{}}
{"id":"train_15387","question":"Is the combustion enthalpy of the graphite equal 393.5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5309 wdt:P2117 ?obj filter ( ?obj = 393.5 ) }","paraphrases":["Is the combustion enthalpy of the graphite break even with 393.5?"],"info":{}}
{"id":"train_15389","question":"Who are the founders of the seat of Guinness?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q194297 wdt:P159 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who are the authors of the situate of Guinness?"],"info":{}}
{"id":"train_15390","question":"What are the operation which start with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3884033 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the operation which begin with the letter p"],"info":{}}
{"id":"train_15391","question":"What is the diplomatic relation of the African Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7159 wdt:P530 ?obj . ?obj wdt:P31 wd:Q4209223 }","paraphrases":["What is the conciliatory connection of the African Union?"],"info":{}}
{"id":"train_15392","question":"Name the headquarters location of Secret Intelligence Service that is postal code of OL9 6AA?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q184560 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P281 ?x filter ( contains ( ?x , 'OL9 6AA' ) ) }","paraphrases":["The Secret Intelligence Service, postal code OL9 6AA has headquarters located where?"],"info":{}}
{"id":"train_15393","question":"When did Louis XI of France become King of France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8058 p:P39 ?s . ?s ps:P39 wd:Q18384454 . ?s pq:P580 ?value }","paraphrases":["When did Louis XI of France become the King?"],"info":{}}
{"id":"train_15394","question":"which  area of engineering stats with e","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12015335 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which region of designing stats with e"],"info":{}}
{"id":"train_15395","question":"what type of wood name starts with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1493054 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what sort of wood title begins with the letter z"],"info":{}}
{"id":"train_15398","question":"tell me that automobile manufacturer which contains the word zongshen name in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q786820 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zongshen' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["inform me that automobile manufacturer which contains the word zongshen title in it"],"info":{}}
{"id":"train_15399","question":"when did lyudmila zubovich tenure as the head of government of barnaul come to an end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6014 p:P6 ?s . ?s ps:P6 wd:Q4194399 . ?s pq:P582 ?value }","paraphrases":["Lyudmila Zubovich's was no longer head of government of Barnaul as of what date?"],"info":{}}
