{"id":"train_16259","question":"Was Immanuel Kant a doctoral student of Johann Gottlieb Fichted and Anton Friedrich Justus Thibaut?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9312 wdt:P185 wd:Q102585 . wd:Q9312 wdt:P185 wd:Q60865 }","paraphrases":["Was both Gottlieb Fichted and Anton Friedrich Justus Thibaut teach Immanuel Kant as a doctoral student?"],"info":{}}
{"id":"train_16260","question":"What is victory for  Niki Lauda ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q78489 wdt:P2522 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16261","question":"Is the patronage of Crnl. FAP Francisco Secada Vignetta International Airport less than 0.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1431540 wdt:P3872 ?obj filter ( ?obj < 0.0 ) }","paraphrases":["Was there no patronage of Crnl. FAP Francisco Secada Vignetta International Airport?"],"info":{}}
{"id":"train_16263","question":"What kinship did Philip of Cognac have with Richard I of England","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42305 p:P40 ?s . ?s ps:P40 wd:Q1405919 . ?s pq:P1039 ?value }","paraphrases":["How were Philip of Cognac and Richard I of England in kinship?"],"info":{}}
{"id":"train_16265","question":"What head of government began in Bordeaux on October 19, 1947?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1479 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1947' ) ) }","paraphrases":["What prime minister began in Bordeaux on October 19, 1947?"],"info":{}}
{"id":"train_16267","question":"Bucharest is the capital of which country?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q19660 wdt:P1376 ?obj . ?obj wdt:P31 wd:Q3024240 }","paraphrases":["Bucharest is the capital of which nation?"],"info":{}}
{"id":"train_16269","question":"What caused Ian Paisley to end his position as a member of the 45th Parliament of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q296597 p:P39 ?s . ?s ps:P39 wd:Q41582612 . ?s pq:P1534 ?value }","paraphrases":["Why did Ian Paisley decide to leave his position as a member of the 45th Parliament of Great Britain?"],"info":{}}
{"id":"train_16271","question":"Which is the Kvikmyndir film ID of Amélie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q484048 wdt:P3340 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16272","question":"Enlist the number of goals scored and the number of total matches played by Marco Van Basten while playing in the Netherlands national under-21 football team.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q483629 p:P54 ?s . ?s ps:P54 wd:Q1811026 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["Enroll the quantity of objectives scored and the quantity of all out matches played by Marco Van Basten while playing in the Netherlands national under-21 football crew."],"info":{}}
{"id":"train_16278","question":"Which is relative to the stack?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2210 wd:Q177929 }","paraphrases":[],"info":{}}
{"id":"train_16279","question":"What are Hollywood's borders and where is the location of the administrative territorial  entity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q34006 wdt:P47 ?ans_1 . wd:Q34006 wdt:P131 ?ans_2 }","paraphrases":["Where exactly does Hollywood end and what is the civic governing body?"],"info":{}}
{"id":"train_16280","question":"When did Howard Hawks marriage to Dee Hartford end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q51581 p:P26 ?s . ?s ps:P26 wd:Q5249911 . ?s pq:P582 ?value }","paraphrases":["When did Howard Hawks marriage to Dee Hartford end?"],"info":{}}
{"id":"train_16281","question":"Does the Harz Railway have a speed limit of less than 48.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q520404 wdt:P3086 ?obj filter ( ?obj < 48.0 ) }","paraphrases":["Is 48.0 greater than the speed limit of the Harz Railway?"],"info":{}}
{"id":"train_16282","question":"When did Angela Merkel complete her doctoral thesis at the German Academy of Sciences at Berlin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q567 p:P69 ?s . ?s ps:P69 wd:Q49738 . ?s pq:P582 ?value1 . ?s pq:P1026 ?value2 }","paraphrases":["On what date did Angela Merkel complete her doctoral thesis at the German Academy of Sciences at Berlin?"],"info":{}}
{"id":"train_16283","question":"What is Julie Andrews' blood type and voice type?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q161819 wdt:P1853 ?ans_1 . wd:Q161819 wdt:P412 ?ans_2 }","paraphrases":["What's Julie Andrew's voice and blood type?"],"info":{}}
{"id":"train_16285","question":"What is the name of the city next to where Yue Fei died?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q334398 wdt:P20 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the title of the city another to where Yue Fei died?"],"info":{}}
{"id":"train_16286","question":"What is the safety classification and labelling of the occupational carcinogen that starts with \"b\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21074597 . ?sbj wdt:P4952 wd:Q2005334 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the safety classification and labelling of the occupational carcinogen that starts with \"b\"?"],"info":{}}
{"id":"train_16287","question":"What is the population of Macapá per the census?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q180215 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["How many people are living in Macapa as per the census?"],"info":{}}
{"id":"train_16288","question":"WHICH IS CLADE THAT CONTAINS THE WORD TETRAPHYTINA IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q713623 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tetraphytina' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS CLADE THAT CONTAINS THE WORD TETRAPHYTINA IN THEIR NAME"],"info":{}}
{"id":"train_16289","question":"Who is guilty of the adaptation of T-3000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20648364 wdt:P144 ?X . ?X wdt:P1399 ?answer }","paraphrases":["Who is responsible for the T-3000 adaptation?"],"info":{}}
{"id":"train_16293","question":"WHICH CITES IS ROE V WADE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q300950 wdt:P2860 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16295","question":"What are the recorded work done during Ramadan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41662 wdt:P156 ?X . ?X wdt:P837 ?answer }","paraphrases":["What are the recorded work done amid Ramadan?"],"info":{}}
{"id":"train_16297","question":"Which is the dedication date of the school of swing music?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q203775 wdt:P135 ?X . ?X wdt:P571 ?answer }","paraphrases":["Which is the devotion date of the school of swing music?"],"info":{}}
{"id":"train_16301","question":"Cape Cod belongs to which state, and tends towards which diplomatic relation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49152 wdt:P17 ?X . ?X wdt:P530 ?answer }","paraphrases":["Cape Cod has a place to which state, and tends towards which discretionary relation?"],"info":{}}
{"id":"train_16302","question":"Tell me heavy metal band whose name has the word witchmaste  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56816954 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'witchmaster' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me heavy metallic band whose title has the phrase witchmaste in it."],"info":{}}
{"id":"train_16303","question":"How many architectural styles are associated with Colonial architecture?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P149 wd:Q508475 }","paraphrases":["Give me the number of the architectural styles that are associated with Colonial architecture."],"info":{}}
{"id":"train_16304","question":"tell me computer network protocol that edition or translation of Internet Protocol  which  starts with i","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15836568 . ?sbj wdt:P629 wd:Q8795 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal me computer network protocol that edition or translation of Internet Protocol which starts with i"],"info":{}}
{"id":"train_16305","question":"who antonym of input set of natural logarithm?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q204037 wdt:P1851 ?X . ?X wdt:P461 ?answer }","paraphrases":["What is the natural logarithm antonym input set?"],"info":{}}
{"id":"train_16306","question":"who played Dr. John Watson in Sherlock Holmes?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q187349 p:P175 ?s . ?s ps:P175 ?obj . ?s pq:P642 wd:Q1764019 }","paraphrases":["Which actor starred as Dr. John Watson in Sherlock Holmes?"],"info":{}}
{"id":"train_16307","question":"What is the time zone where the Battle of Mars Los Angeles Tour is located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q699262 wdt:P276 ?X . ?X wdt:P421 ?answer }","paraphrases":["What is the time zone where the Fight of Defaces Los Angeles Visit is found?"],"info":{}}
{"id":"train_16308","question":"Tell me paramedical speciality whose name has the word therapy in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q30109942 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'therapy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know paramedical forte whose title has the word treatment in it."],"info":{}}
{"id":"train_16309","question":"What do the zoo animals of Downtown Aquarium, Houston play with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5303351 wdt:P1990 ?X . ?X wdt:P1535 ?answer }","paraphrases":["At the Houston Downtown Aquarium, what do the zoo animals play with?"],"info":{}}
{"id":"train_16310","question":"Name the second language of Toots Thielemans that has the typology of subject-verb-object.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q365567 wdt:P1412 ?answer . ?answer wdt:P4132 wd:Q651641 }","paraphrases":["Title the moment dialect of Toots Thielemans that has the typology of subject-verb-object."],"info":{}}
{"id":"train_16311","question":"Who is The Lion King's storyboard artist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q36479 wdt:P3275 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16312","question":"Mention the medicinal specialty maintained by positive regulation of hypersensitivity","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21102285 wdt:P128 ?X . ?X wdt:P1995 ?answer }","paraphrases":["Which medicinal specialty is maintained by positive regulation of hypersensitivity?"],"info":{}}
{"id":"train_16313","question":"What is the type of kinship between Prince George of Cambridge and Prince Charles of Wales?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q13590412 p:P1038 ?s . ?s ps:P1038 wd:Q43274 . ?s pq:P1039 ?value }","paraphrases":["What does relate Prince George of Cambridge to Prince Charles of Wales?"],"info":{}}
{"id":"train_16314","question":"Where is the Jhelum River located?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q214874 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '33.429737 75.376174' ) ) . ?s pq:P518 ?value }","paraphrases":["Where is the Jhelum River?"],"info":{}}
{"id":"train_16315","question":"How many public holidays are on Boxing Day?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P832 wd:Q956699 }","paraphrases":["Which is the number of the public holidays that are on Boxing Day?"],"info":{}}
{"id":"train_16316","question":"What is the surface that contains the Mato Grosso?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42824 wdt:P150 ?X . ?X wdt:P2046 ?answer }","paraphrases":["Which is the surface that contains the Mato Grosso?"],"info":{}}
{"id":"train_16317","question":"Tell me the history of a country or state that starts with the letter h","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17544377 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal  me the history of a country or state that starts with the letter h"],"info":{}}
{"id":"train_16318","question":"DOES THE NUMBER OF PARTS OF THIS WORK OF ART OF THE GAME PANETRATING THE SECRET SOCIETY OF PICK UP ARTISTS EQUALS 1","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q143031 wdt:P2635 ?obj filter ( ?obj = 1 ) }","paraphrases":["THE PART NUMBER OF THIS WORK OF ART OF THE SECRET SOCIETY OF PICK UP ARTISTS EQUALS 1"],"info":{}}
{"id":"train_16319","question":"Tell me the security agency of chairperson Yuri Andropov that contains the word kgb in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3238445 . ?sbj wdt:P488 wd:Q44071 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'kgb' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the security office of chairperson Yuri Andropov that contains the word kgb in it's title?"],"info":{}}
{"id":"train_16321","question":"What is the name of Alexander Blok's birthplace, that has Manchester as a sister city?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q164765 wdt:P19 ?answer . ?answer wdt:P190 wd:Q18125 }","paraphrases":["What is the title of Alexander Blok's origin, that has Manchester as a sister city?"],"info":{}}
{"id":"train_16322","question":"WHICH IS THE PALACE THAT CONTAINS THE WORD THERESIANUM IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16560 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'theresianum' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE PALACE THAT CONTAINS THE WORD THERESIANUM IN THEIR NAME"],"info":{}}
{"id":"train_16323","question":"What is the trend of tribute to Malevich?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20031254 wdt:P825 ?X . ?X wdt:P135 ?answer }","paraphrases":["What is Malevich's tribute trend?"],"info":{}}
{"id":"train_16324","question":"In the equation: F_g = m g, what is the antonym of buoyancy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6497624 wdt:P461 ?answer . ?answer wdt:P2534 ?x FILTER ( contains ( ?x , 'F_g = m g' ) ) }","paraphrases":["In the equation: F_g = m g, what is the antonym of buoyancy?"],"info":{}}
{"id":"train_16325","question":"What is the name of H. P. Lovecraft's spouse that passed away on the 3rd of March 1926?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q169566 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1926' ) ) }","paraphrases":["Who was H.P. Lovecraft's wife that passed away on March 3rd 1926?"],"info":{}}
{"id":"train_16326","question":"What is the twin city of Aichi Prefecture, which has boroughs in the Shire of Belfast?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q80434 wdt:P190 ?answer . ?answer wdt:P150 wd:Q7498381 }","paraphrases":["What is the twin city of Aichi Prefecture, which has boroughs within the Shire of Belfast?"],"info":{}}
{"id":"train_16327","question":"What is a cat breed that starts with the letter t?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43577 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a cat breed which starts with the letter t"],"info":{}}
{"id":"train_16328","question":"how much number of out of school children of region of Mongolian Plateau?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q560198 wdt:P276 ?X . ?X wdt:P2573 ?answer }","paraphrases":["how much wide variety of out of school children of region of Mongolian Plateau?"],"info":{}}
{"id":"train_16329","question":"What is the Scopus Source ID of Astronomy and Astrophysics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q752075 wdt:P1156 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16330","question":"When did Woody Guthrie receive the Grammy Lifetime Achievement Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q4061 p:P166 ?s . ?s ps:P166 wd:Q935843 . ?s pq:P585 ?value }","paraphrases":["When did Woody Guthrie get awarded the Grammy LAA?"],"info":{}}
{"id":"train_16331","question":"what is love deity starts with the letter i","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1670614 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is cherish divinity begins with the letter i"],"info":{}}
{"id":"train_16333","question":"What award Thomas Alva Edison received at 1892-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8743 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1892' ) ) }","paraphrases":["What award did Thomas Alva Edison receive in 1892?"],"info":{}}
{"id":"train_16334","question":"What is Adama Smith's Classiques des sciences sociales author ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9381 wdt:P5390 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16335","question":"What is the english pronunciation for the word \"rice\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5090 p:P443 ?s . ?s ps:P443 ?x filter ( contains ( ?x , 'En-us-rice.ogg' ) ) . ?s pq:P407 ?value }","paraphrases":["How is \"rice\" pronounced in English?"],"info":{}}
{"id":"train_16336","question":"What was the population of the United Kingdom in 1967?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q145 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1967' ) ) }","paraphrases":["In 1967, what was the population of the United Kingdom?"],"info":{}}
{"id":"train_16337","question":"Tell me the extreme murder ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q132821 . ?ent wdt:P1120 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What was the most gruesome murder?"],"info":{}}
{"id":"train_16340","question":"What is the start period for fertilization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3415 wd:Q14890574 }","paraphrases":[],"info":{}}
{"id":"train_16342","question":"Which taxon has the biggest/largest genome size?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P2143 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the taxon with the biggest/largest genome size?"],"info":{}}
{"id":"train_16343","question":"Which 1.2 has the longest event distance?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22231111 . ?ent wdt:P3157 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which 1.2 has the longest occasion distance?"],"info":{}}
{"id":"train_16344","question":"When did Kwame Nkruman hold the position as Prime Minister of Ghana?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8620 p:P39 ?s . ?s ps:P39 wd:Q3657870 . ?s pq:P582 ?value }","paraphrases":["Kwame Nkruman was Prime Minister of Ghana during what years?"],"info":{}}
{"id":"train_16345","question":"What is Wyoming's population as determined by a census?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1214 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["What is Wyoming's demographic determined by a counting."],"info":{}}
{"id":"train_16347","question":"What republic starts with the letter \"z\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7270 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What republic begins with the letter \"z\"?"],"info":{}}
{"id":"train_16348","question":"Did {David_Hasselhoff} is {participant of} {list of The Young and the Restless cast members} and {Knight Rider} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q201927 wdt:P1344 wd:Q3245640 . wd:Q201927 wdt:P1344 wd:Q464009 }","paraphrases":["Was David Hasselhoff a participant of the list of The Young and the Restless cast members and also of the Knight Rider?"],"info":{}}
{"id":"train_16349","question":"What is the historic replacement country of the German Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1365 wd:Q43287 . ?sbj wdt:P31 wd:Q3024240 }","paraphrases":["Historically, what country replaced the German Empire?"],"info":{}}
{"id":"train_16350","question":"Which is the fictional universe of the fictional universe that is described in Harry Potter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1445 wd:Q8337 . ?sbj wdt:P31 wd:Q559618 }","paraphrases":["What is the fictional setting for the Harry Potter series?"],"info":{}}
{"id":"train_16351","question":"What country does the National Aeronautics and Space Administration belong to","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2389 wd:Q23548 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["What country is NASA a apart of?"],"info":{}}
{"id":"train_16352","question":"What sports team did Cristiano Ronaldo join in 2009?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11571 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["Which was the team that Cristiano Ronaldo join in 2009"],"info":{}}
{"id":"train_16354","question":"What are the ice hockey team which start with the letter straubing","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4498974 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'straubing' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the ice hockey group which begin with the letter straubing"],"info":{}}
{"id":"train_16355","question":"na","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q36488 p:P166 ?s . ?s ps:P166 wd:Q38104 . ?s pq:P2121 ?value1 . ?s pq:P1706 ?value2 }","paraphrases":["na"],"info":{}}
{"id":"train_16358","question":"Which mythological Greek character did Hercules kill?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P157 wd:Q122248 . ?sbj wdt:P31 wd:Q22988604 }","paraphrases":[],"info":{}}
{"id":"train_16360","question":"What are the kinship  which start with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q171318 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the connection which begin with the letter u"],"info":{}}
{"id":"train_16362","question":"How many people speak the Urdu language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1617 wdt:P1098 ?answer }","paraphrases":[],"info":{}}
