{"id":"train_22471","question":"What criterion used for December as декабря?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q126 p:P2561 ?s . ?s ps:P2561 ?x filter ( contains ( ?x , 'декабря' ) ) . ?s pq:P1013 ?value }","paraphrases":["What criterion are for December as декабря?"],"info":{}}
{"id":"train_22473","question":"What are the cola which start with the letter pepsi","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134041 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pepsi' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the cola which begin with the letter pepsi"],"info":{}}
{"id":"train_22482","question":"which superhero that hair color black hair and which contains the word woman in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188784 . ?sbj wdt:P1884 wd:Q1922956 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'woman' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which superhero that hair color black hair and which includes the word female in their title"],"info":{}}
{"id":"train_22483","question":"Mention the Vidhan Sabha body of Karnataka.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1185 wdt:P208 ?obj . ?obj wdt:P31 wd:Q3091020 }","paraphrases":["What is the Vidhan Sabha body of Karnataka?"],"info":{}}
{"id":"train_22494","question":"What is the name of the binary star in the constellation of Canis Major which has the word \"sirius\" in their name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q50053 . ?sbj wdt:P59 wd:Q10538 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sirius' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the name of the binary star in Canis Major's constellation that has in its name the word \"sirius?\""],"info":{}}
{"id":"train_22498","question":"is it true that james clerk maxwell is influenced by albert_einstein","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q937 wdt:P737 wd:Q9095 }","paraphrases":["Was James Clerk Maxwell really influenced by albert_einstein?"],"info":{}}
{"id":"train_22524","question":"What is a superpower that starts with the letter w.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1047698 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a superpower that begins with the letter w."],"info":{}}
{"id":"train_22537","question":"what is television series of lorne michaels of executive producer  and also which starts with letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5398426 . ?sbj wdt:P1431 wd:Q521221 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is television series of lorne michaels of executive producer and also which begins with letter t"],"info":{}}
{"id":"train_22546","question":"Tell me a declaration of independence that is signed by Thomas Jefferson with the word \"declaration\" in its name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1464916 . ?sbj wdt:P1891 wd:Q11812 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'declaration' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a assertion of independence that is signed through Thomas Jefferson with the word \"declaration\" in its name."],"info":{}}
{"id":"train_22548","question":"What is Cité de la Musique-Philharmonie de Paris ID for The Rite of Spring?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q206015 wdt:P5235 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22549","question":"What case is the sign language of Gabriel Fauré?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q104919 wdt:P1412 ?X . ?X wdt:P2989 ?answer }","paraphrases":["What case is the sign dialect of Gabriel Fauré?"],"info":{}}
{"id":"train_22550","question":"Which is Academia Brasileira de Letras ID for João Guimarães Rosa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q13012 wdt:P5527 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22555","question":"WHICH IS THE BEER FESTIVAL THAT ORGANIZED BY LANDESHAUPTSTADT MUNCHEN AND WHICH STARTS WITH  O","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2919327 . ?sbj wdt:P664 wd:Q1361384 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE BEER FESTIVAL THAT ORGANIZED BY LANDESHAUPTSTADT MUNCHEN AND WHICH STARTS WITH O"],"info":{}}
{"id":"train_22561","question":"Name the Class IIIB combustible liquid that is an occupational carcinogen with the lowest melting point.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009059 . ?ent wdt:P2101 ?obj . ?ent wdt:P31 wd:Q21074597 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the occupational carcinogen with the lowest melting point that is a Class IIB combustible liquid?"],"info":{}}
{"id":"train_22563","question":"Name an anime series broadcasted on TX Network and that contains the word \"gp\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11086742 . ?sbj wdt:P449 wd:Q1323547 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'gp' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a TX Network anime series that contains the word \"gp\" in its name"],"info":{}}
{"id":"train_22568","question":"What has Phèdre inspired?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q969098 wdt:P941 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22584","question":"which brand contains the word vicks in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q431289 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vicks' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which brand contains the word vicks in their name"],"info":{}}
{"id":"train_22591","question":"What are the triple star system which start with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2088753 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the triple star framework which begin with the letter p"],"info":{}}
{"id":"train_22592","question":"what are the civil liberties which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29556 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the gracious freedoms which begin with the letter w"],"info":{}}
{"id":"train_22598","question":"which salad location of discovery Tijuana  starts with c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9266 . ?sbj wdt:P189 wd:Q124739 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which serving of mixed greens area of revelation Tijuana begins with c"],"info":{}}
{"id":"train_22599","question":"When Ferenc Puskás started as member of Hungary national football team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q482931 p:P54 ?s . ?s ps:P54 wd:Q170561 . ?s pq:P580 ?value }","paraphrases":["On what date did Ferenc Puskas start as a member of Hungary national football team?"],"info":{}}
{"id":"train_22600","question":"Tell me which borough of New York city starts with the letter q.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q408804 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'q' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know which borough of Modern York city begins with the letter q."],"info":{}}
{"id":"train_22602","question":"WHICH IS THE MOBYGAMES DEVELOPER ID OF RICHARD GARRIOTTI","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q319269 wdt:P3913 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22603","question":"Tell me the medal received by Linus Pauling.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q48983 wdt:P166 ?obj . ?obj wdt:P31 wd:Q131647 }","paraphrases":[],"info":{}}
{"id":"train_22619","question":"Name a English spoken channel that starts with letter R","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q561068 . ?sbj wdt:P2936 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the English spoken channel that starts with letter R?"],"info":{}}
{"id":"train_22621","question":"Tell me thermodynamic potential whose name has the word grand in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2420179 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'grand' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me thermodynamic attainable whose name has the word grand in it."],"info":{}}
{"id":"train_22628","question":"What are the card game which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q142714 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the game of cards starting with the letter z?"],"info":{}}
{"id":"train_22635","question":"Who is the {arena} for {home venue} of {Toronto Maple Leafs}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q203384 wdt:P115 ?obj . ?obj wdt:P31 wd:Q641226 }","paraphrases":["Who is the {field} for {domestic scene} of {Toronto Maple Leafs}"],"info":{}}
{"id":"train_22639","question":"when did Claude Shannon receive an award as Josiah Willard Gibbs Lectureship","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q92760 p:P166 ?s . ?s ps:P166 wd:Q1522873 . ?s pq:P585 ?value }","paraphrases":["Claude Shannon received an award as Josiah Willard Gibbs Lectureship in what year?"],"info":{}}
{"id":"train_22643","question":"Which is the document that contains the word öltagebuch in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49848 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'öltagebuch' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the file that carries the phrase öltagebuch in it is name?"],"info":{}}
{"id":"train_22649","question":"What are the military campaign which start with the letter o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q831663 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the miltary campaign that starts with the letter o"],"info":{}}
{"id":"train_22654","question":"Who is the {video game developer} for {developer} of {Final Fantasy}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q189842 wdt:P178 ?obj . ?obj wdt:P31 wd:Q210167 }","paraphrases":["Who is the {video diversion designer} for {engineer} of {Last Fantasy}"],"info":{}}
{"id":"train_22663","question":"Name a region in China whose highest point is K2 that starts with letter X","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q57362 . ?sbj wdt:P610 wd:Q43512 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a locale in China whose most elevated point is K2 that begins with letter X"],"info":{}}
{"id":"train_22685","question":"WHICH IS THE READIO INTERFEROMETER WITH  THE MOST WAVELENTGTH OF SENSITIVITY","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q349772 . ?ent wdt:P3737 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["THE READIO INTERFEROMETER WITH THE MOST WAVELENTGTH OF SENSITIVITY IS?"],"info":{}}
{"id":"train_22707","question":"DOES THE URBAN POPULATION OF THE HIRAMANDALAM MANDAL GREATER THAN 0.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3422508 wdt:P6343 ?obj filter ( ?obj > 0.0 ) }","paraphrases":["DOES THE URBAN Populace OF THE HIRAMANDALAM MANDAL More prominent THAN 0.0"],"info":{}}
{"id":"train_22709","question":"What award did Louis-Ferdinand Céline receive for his work Journey to the End of the Night?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q151820 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q774233 }","paraphrases":["Name the award that was given to Louis-Ferdinand Céline for his work Journey to the End of the Night?"],"info":{}}
{"id":"train_22711","question":"tell me age whose name has the word generation in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185836 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'generation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What age has the name has the word generation within it?"],"info":{}}
{"id":"train_22712","question":"Mention the name of the F=Gemini spacecraft sent for astronautic mission's with Neil Armstrong","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1615 wdt:P450 ?obj . ?obj wdt:P31 wd:Q831109 }","paraphrases":["Notice the name of the F=Gemini shuttle sent for astronautic mission's with Neil Armstrong"],"info":{}}
{"id":"train_22715","question":"who is author of Eugénie Grandet","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1373644 wdt:P50 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22716","question":"Where is Rome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q220 . ?sbj wdt:P31 wd:Q839954 }","paraphrases":["Where is Rome?"],"info":{}}
{"id":"train_22717","question":"What is Shironet artist ID for Shoshana Damari","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2360762 wdt:P4034 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22726","question":"Tell me the occurrence that contains the word world in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1190554 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me what happens in their name containing the word world"],"info":{}}
{"id":"train_22731","question":"Tell me mythology  whose name has the word religion in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9134 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'religion' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What mythological name is religious?"],"info":{}}
{"id":"train_22740","question":"Tell me me a space agency whose name consist of the word \"administration\" and whose website account on Foursquare Labs, Inc.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17505024 . ?sbj wdt:P553 wd:Q51709 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'administration' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me me a space business enterprise whose title consist of the word \"administration\" and whose website account on Foursquare Labs, Inc."],"info":{}}
{"id":"train_22747","question":"Who is the {Olympic sporting event} for {victory} of {Tara Lipinski}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q232999 wdt:P2522 ?obj . ?obj wdt:P31 wd:Q18536594 }","paraphrases":["Tara Lipinski has what Olympic sporting event for victory?"],"info":{}}
{"id":"train_22766","question":"Which is the record held of 100 metres/","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1000 wd:Q164761 }","paraphrases":[],"info":{}}
{"id":"train_22767","question":"TELL ME THE CRISIS THAT CONTAINS THE WORD UNITED IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q381072 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'united' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME THE CRISIS THAT CONTAINS THE WORD UNITED IN THEIR NAME"],"info":{}}
{"id":"train_22771","question":"Tell me scientific model whose name has the word world in it-","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q193946 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know logical demonstrate whose title has the word world in it-"],"info":{}}
{"id":"train_22773","question":"Which is the Croatian Football Federation player ID for Davor Šuker?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q189217 wdt:P3577 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22783","question":"Name the award received by George Boole in 1844","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q134661 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1844' ) ) }","paraphrases":["What award did George Boole receive in 1844?"],"info":{}}
{"id":"train_22785","question":"Where is the seat of Association des États Généraux des Étudiants de l'Europe whose enclavation is Flemish Brabant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q431534 wdt:P159 ?answer . ?answer wdt:P501 wd:Q1118 }","paraphrases":["Where is the situate of Affiliation des États Généraux des Étudiants de l'Europe whose enclavation is Flemish Brabant?"],"info":{}}
{"id":"train_22787","question":"How many matches David Beckham played and how many goals he scored for Paris Saint-Germain.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q10520 p:P54 ?s . ?s ps:P54 wd:Q483020 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How numerous matches David Beckham played and how numerous objectives he scored for Paris Saint-Germain."],"info":{}}
{"id":"train_22797","question":"What is the city neighboring Giovanni Battista Guadagnini's deathplace.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q691385 wdt:P20 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the metropolis neighboring Giovanni Battista Guadagnini's deathplace."],"info":{}}
{"id":"train_22804","question":"What are the computational problem which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3435924 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is tall speed get ready track gage BY 1435 mm track gage that starts with LETTERS V"],"info":{}}
{"id":"train_22807","question":"What was the population of Marikina in 1960-2-15","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q17175 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1960' ) ) }","paraphrases":["in 1960-2-15 Marikina  had a population of what?"],"info":{}}
{"id":"train_22814","question":"What is Ramsay MacDonald's MSBI Person ID","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q166646 wdt:P2914 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22818","question":"Mention the unit to measure the physical quantity named as frequency","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P111 wd:Q11652 . ?sbj wdt:P31 wd:Q47574 }","paraphrases":["Specify the unit to degree the physical amount named as frequency"],"info":{}}
{"id":"train_22824","question":"na","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q367825 wdt:P410 ?obj . ?obj wdt:P31 wd:Q49614 }","paraphrases":["na"],"info":{}}
{"id":"train_22826","question":"Name the office building with the lowest floors below ground who just started construction.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1021645 . ?ent wdt:P1139 ?obj . ?ent wdt:P793 wd:Q27136782 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Name the office constructing with the lowest flooring under floor who just started out construction."],"info":{}}
{"id":"train_22836","question":"What is that is of","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q258 wdt:P47 ?answer . ?answer wdt:P1448 ?x FILTER ( contains ( ?x , 'República de Moçambique' ) ) }","paraphrases":["What is that's of"],"info":{}}
{"id":"train_22844","question":"Tell me the subsidiaries of CBS.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P355 wd:Q43380 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Let me know the backups of CBS."],"info":{}}
{"id":"train_22851","question":"WHAT ARE THE MAGAZINE GENRE WHICH START WITH THE LETTER Z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21114848 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE MAGAZINE Class WHICH Begin WITH THE LETTER Z"],"info":{}}
{"id":"train_22852","question":"What is CHGIS ID FOR Taiwan under Japanese rule","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q137816 wdt:P4711 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22858","question":"Who gave the {academic discipline} of {music genre} of {František Ludvík Poppe} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12017269 wdt:P136 ?X . ?X wdt:P101 ?answer }","paraphrases":["Who gave the {scholarly teach} of {music class} of {František Ludvík Poppe} ?"],"info":{}}
{"id":"train_22876","question":"What vehicle is used in the cartoon Donald Duck","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q6550 wdt:P3438 ?obj . ?obj wdt:P31 wd:Q15707563 }","paraphrases":["What car does Donald Duck's cartoon use?"],"info":{}}
{"id":"train_22877","question":"DOES THE COMPRESSIVE STRENGTH OF CONCRETE EQUALS TO 30","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q22657 wdt:P5669 ?obj filter ( ?obj = 30 ) }","paraphrases":["Is the concrete strength capacity equal to 30?"],"info":{}}
{"id":"train_22878","question":"What is parent of brother or sister of tatiana von Fürstenberg ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7688127 wdt:P3373 ?X . ?X wdt:P25 ?answer }","paraphrases":["Who is the parent of the brother or sister of Tatiana von Fürstenberg?"],"info":{}}
{"id":"train_22883","question":"What are the aqueous solution which starts with letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q906356 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the watery arrangement which begins with letter v"],"info":{}}
{"id":"train_22906","question":"What are the diffusion which start with the letter o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q163214 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the diffusion which begin with the letter o"],"info":{}}
