{"id":"train_10860","question":"What is the mouth of the watercourse of Mississippi River at Mississippi River Delta?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1497 p:P403 ?s . ?s ps:P403 ?obj . ?s pq:P805 wd:Q1528035 }","paraphrases":["Where is the mouth of the watercourse of Mississippi River at the Mississippi River Delta?"],"info":{}}
{"id":"train_10862","question":"How many chairperson for Musee d'Orsay","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q23402 wdt:P488 ?obj }","paraphrases":["Which is the number of chairperson for Musee d'Orsay?"],"info":{}}
{"id":"train_10863","question":"Mention the concept highlighted by Social Science subject","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2579 wd:Q34749 . ?sbj wdt:P31 wd:Q151885 }","paraphrases":["Notice the idea featured by Social Science subject"],"info":{}}
{"id":"train_10864","question":"What is the name of the man with a successful career as a record producer and is a cohabitant with actress Courtney Cox?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q58912 wdt:P451 ?answer . ?answer wdt:P106 wd:Q183945 }","paraphrases":["What is the title of the man with a effective career as a record maker and could be a cohabitant with on-screen character Courtney Cox?"],"info":{}}
{"id":"train_10866","question":"Which runway in LAX are made of concrete?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8731 p:P529 ?s . ?s ps:P529 ?obj . ?s pq:P186 wd:Q22657 }","paraphrases":["What runways in LAX are made of concrete?"],"info":{}}
{"id":"train_10868","question":"How many executives held by the capital state {Romania} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q218 wdt:P1906 ?obj }","paraphrases":["The capital stteof Romanis has hold now many executives?"],"info":{}}
{"id":"train_10869","question":"Is Pinto Colvig the name of the performer who plays Goofy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q111135 p:P175 ?s . ?s ps:P175 wd:Q945591 . ?s pq:P642 ?value }","paraphrases":["Is Goofy played by Pinto Colvig?"],"info":{}}
{"id":"train_10870","question":"was ribavirin and capravirine a drug used for treatment of Hepatitis C?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q154869 wdt:P2176 wd:Q421862 . wd:Q154869 wdt:P2176 wd:Q5036216 }","paraphrases":["Treatment of hepatitis C virus: the first decade. ... However, ribavirin can induce reversible hemolytic anemia, and combination therapy with a ribavirin/interferon regimen is not tolerated as well as interferon is alone."],"info":{}}
{"id":"train_10871","question":"Which is the introduced feature for air conditioning?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P751 wd:Q173725 }","paraphrases":[],"info":{}}
{"id":"train_10872","question":"origin of people who speak japanese","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q5287 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["root of individuals who talk japanese"],"info":{}}
{"id":"train_10873","question":"Which countries speak Hungarian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q9067 . ?sbj wdt:P31 wd:Q43702 }","paraphrases":["What are the countries that speak Hungarian?"],"info":{}}
{"id":"train_10875","question":"How much more fabrication methods are need to start cloning?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2079 wd:Q120877 }","paraphrases":["What fabrication methods are needed to begin cloning?"],"info":{}}
{"id":"train_10876","question":"What is the dialect used in Ancient Greek?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q35497 wdt:P4913 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10877","question":"What is the work of inventor Lucy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q245388 wdt:P61 ?X . ?X wdt:P106 ?answer }","paraphrases":["What is crafted by innovator Lucy?"],"info":{}}
{"id":"train_10878","question":"Name this psychoactive drug made from Papaver somniferum that contains the word \"opium \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3706669 . ?sbj wdt:P1582 wd:Q131584 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'opium' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which psychoactive drug made of Papaver somniferum containing in its name the word \"opium\""],"info":{}}
{"id":"train_10881","question":"What sport does Bob Pettit play that has a runtime of 40?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q368561 wdt:P641 ?answer . ?answer wdt:P2047 ?x FILTER ( contains ( ?x , '40' ) ) }","paraphrases":["What wear does Sway Pettit play that contains a runtime of 40?"],"info":{}}
{"id":"train_10882","question":"What disease burden does Brian Wilson suffers from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q313013 wdt:P1050 ?X . ?X wdt:P2854 ?answer }","paraphrases":["NAME OF DISEASE THAT BRIAN WILSON SUFFERS FROM"],"info":{}}
{"id":"train_10883","question":"Did Timothy ever work as a soldier or a security guard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q220850 wdt:P106 wd:Q4991371 . wd:Q220850 wdt:P106 wd:Q856887 }","paraphrases":["Has Tim ever had the job of soldier or security guard?"],"info":{}}
{"id":"train_10884","question":"What is a computer model which uses the word zx81 in it's name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55990535 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zx81' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a computer show which employments the word zx81 in it's name"],"info":{}}
{"id":"train_10886","question":"What is the method for Cretaceous -145000000-0-?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44626 wdt:P155 ?answer . ?answer wdt:P582 ?x FILTER ( contains ( YEAR ( ?x ) , '0000' ) ) }","paraphrases":["What is the strategy for Cretaceous -145000000-0-?"],"info":{}}
{"id":"train_10888","question":"which was the academic  major  and degree  of rowan  atkinson who has educated as  newcastle university?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q23760 p:P69 ?s . ?s ps:P69 wd:Q837164 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["which was the scholarly major and degree of rowan atkinson who has taught as newcastle college?"],"info":{}}
{"id":"train_10890","question":"Every year there is an event involving a Eurovision Song Contest and it is called what?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q276 wdt:P144 ?obj . ?obj wdt:P31 wd:Q18574946 }","paraphrases":["What is the Eurovision Song Contest event called?"],"info":{}}
{"id":"train_10891","question":"Who is elected in The Joong-ang Ilbo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2715 wd:Q483903 }","paraphrases":[],"info":{}}
{"id":"train_10892","question":"who mediatised to supersedes the service tax?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7455814 wdt:P1366 ?X . ?X wdt:P1365 ?answer }","paraphrases":["who mediatised to supersedes the benefit tax?"],"info":{}}
{"id":"train_10894","question":"What is that it has","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5681 wdt:P937 ?answer . ?answer wdt:P190 wd:Q58570 }","paraphrases":["What is that it has"],"info":{}}
{"id":"train_10895","question":"who governing body of worked for of Charles mcLean andrews ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q472498 wdt:P108 ?X . ?X wdt:P797 ?answer }","paraphrases":["Who worked for Charles mcLean's governing body andrews?"],"info":{}}
{"id":"train_10897","question":"What was the quantity of fatalities in the action of Matt Busby?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q206237 wdt:P607 ?X . ?X wdt:P1120 ?answer }","paraphrases":["Matt Busby has how many fatalities in action?"],"info":{}}
{"id":"train_10898","question":"What state church has the word church in their name, and has office held by the head of the organisation Archbishop of Canterbury?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2325038 . ?sbj wdt:P2388 wd:Q29282 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'church' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What state church has the word church in their name, and has workplace held by way of the head of the employer Archbishop of Canterbury?"],"info":{}}
{"id":"train_10899","question":"In what year did William Howard Taft become President of the USA?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q35648 p:P39 ?s . ?s ps:P39 wd:Q11696 . ?s pq:P580 ?value }","paraphrases":["When was William Howard Taft elected as President of the United States?"],"info":{}}
{"id":"train_10900","question":"Is the marriageable age of Ireland equal to18?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q27 wdt:P3000 ?obj filter ( ?obj = 18 ) }","paraphrases":["Is Ireland's marriage age equal to 18?"],"info":{}}
{"id":"train_10901","question":"What tributaries are near the Lake of Cadiz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15682 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["Who managed the series Win Some, Lose Some?"],"info":{}}
{"id":"train_10903","question":"What is the word for \"part of\" in Hungarian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1269 wd:Q9067 . ?sbj wdt:P31 wd:Q6499736 }","paraphrases":["What is the word for \"portion of\" in Hungarian?"],"info":{}}
{"id":"train_10906","question":"What product, made from raspberry, has the common name Малина?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13179 wdt:P1582 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'Малина' ) ) }","paraphrases":["What product, made from raspberry, has the common identify Малина?"],"info":{}}
{"id":"train_10907","question":"Tell me religious denomination whose name has the word unitarianism in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13414953 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'unitarianism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me religious denomination, the name of which contains the word unitarianism."],"info":{}}
{"id":"train_10909","question":"Where is the Mona Lisa exhibited?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12418 wdt:P608 ?obj . ?obj wdt:P31 wd:Q667276 }","paraphrases":["Where is the Mona Lisa shown?"],"info":{}}
{"id":"train_10910","question":"From where did Richard von Weizsacker win the recognition title of 1st place medalist of Medecins Sans Frontiers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49330 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q2567 }","paraphrases":["From where did Richard von Weizsacker win the recognition title of 1st vicinity medalist of Medecins Sans Frontiers?"],"info":{}}
{"id":"train_10911","question":"What are theeconomic policy which start with the letter tripartism","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q582577 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tripartism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are theeconomic policy which begin with the letter tripartism"],"info":{}}
{"id":"train_10912","question":"From when and until when did Nastia Liukin perform in female artistic gymnastics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q230164 p:P641 ?s . ?s ps:P641 wd:Q3122646 . ?s pq:P2032 ?value1 . ?s pq:P2031 ?value2 }","paraphrases":["Nastia Liukin performed in female artistic gymnastics from when and until when?"],"info":{}}
{"id":"train_10914","question":"What are the castle which start with the letter o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23413 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ö' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the palace which begin with the letter o"],"info":{}}
{"id":"train_10915","question":"What role did the amphitheatre play in the culture of ancient Rome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2596 wd:Q1747689 . ?sbj wdt:P31 wd:Q7362268 }","paraphrases":["In ancient Romen culture why were amphitheater plays important?"],"info":{}}
{"id":"train_10917","question":"What is sexually homologous with for ovary ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9631 wdt:P4545 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10918","question":"Cricket ball causes how many deaths?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P509 wd:Q1139973 }","paraphrases":["How many deaths are caused by cricket ball?"],"info":{}}
{"id":"train_10922","question":"Who is the tributary of on harbour of Raotonga?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q471793 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["Who is the Raotonga harbor tributary?"],"info":{}}
{"id":"train_10923","question":"Which is the mineral variety that starts with the letter z?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q429795 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the mineral variety that starts the letter z."],"info":{}}
{"id":"train_10924","question":"What literary genre is the prequel of Alien?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q103569 wdt:P156 ?X . ?X wdt:P136 ?answer }","paraphrases":["What is the Alien prequel's genre?"],"info":{}}
{"id":"train_10925","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1071312 wdt:P127 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":["n/a"],"info":{}}
{"id":"train_10927","question":"What is the alma mater of John Sinclair with a parent company of the University of Michigan School of Music, Theater and Dance?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q706977 wdt:P69 ?answer . ?answer wdt:P355 wd:Q7895775 }","paraphrases":["What is the alma mater of John Sinclair with a parent company of the College of Michigan School of Music, Theater and Dance?"],"info":{}}
{"id":"train_10931","question":"What part of the earth is seen measuring radius-6339.9?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2 p:P2120 ?s . ?s ps:P2120 ?x filter ( contains ( ?x , '6339.9' ) ) . ?s pq:P18 ?value }","paraphrases":["what some portion of the earth is seen estimating range 6339.9?"],"info":{}}
{"id":"train_10936","question":"Is it true that sexual intercourse has an effect on abortion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5873 wdt:P1542 wd:Q8452 }","paraphrases":["Does sexual intercourse effect abortion?"],"info":{}}
{"id":"train_10937","question":"What topic of the history of Wales has cities like Caerphilly County Borough as central areas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1063608 wdt:P1269 ?answer . ?answer wdt:P150 wd:Q748065 }","paraphrases":["What subject of the history of Ridges has cities like Caerphilly District Borough as central areas?"],"info":{}}
{"id":"train_10938","question":"When was Boleslaw Bierut came to the position of President of Poland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q55832 p:P39 ?s . ?s ps:P39 wd:Q1054799 . ?s pq:P580 ?value }","paraphrases":["When did Boleslaw Bierut become Poland's President?"],"info":{}}
{"id":"train_10939","question":"When was the part of series of Heroes of Might and Magic III: Armageddon's Blade published on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q507074 wdt:P179 ?X . ?X wdt:P400 ?answer }","paraphrases":["When was Magic 3 from the series Heroes of Might published?"],"info":{}}
{"id":"train_10940","question":"What is the name of a television series that starts with the letter z.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5398426 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What tv series starts with \"z\"?"],"info":{}}
{"id":"train_10942","question":"What is this sausage sandwich that contains the word \"dog \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7427595 . ?sbj wdt:P397 wd:Q14266 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dog' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the sausage sandwich which begins with the word \"dog\"."],"info":{}}
{"id":"train_10943","question":"Martin Ludwig Bormann (17 June 1900 – 2 May 1945) was a prominent official in Nazi ... Bormann joined a paramilitary Freikorps organisation in 1922 while working as manager of a large ... Bormann was released from prison in February 1925. ..... The Führerbunker was located under the Reich Chancellery garden in the ...","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q76367 wdt:P937 ?X . ?X wdt:P1249 ?answer }","paraphrases":["Martin Ludwig Bormann (17 June 1900 – 2 May 1945) used to be a outstanding respectable in Nazi ... Bormann joined a paramilitary Freikorps corporation in 1922 while working as manager of a massive ... Bormann used to be released from jail in February 1925. ..... The Führerbunker was once positioned underneath the Reich Chancellery backyard in the ..."],"info":{}}
{"id":"train_10945","question":"Name a city that contains the word \" manila\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1907114 . ?sbj wdt:P126 wd:Q259278 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'manila' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a city that contains the word \" manila\" in its name"],"info":{}}
{"id":"train_10946","question":"Where are the papers of the music by String Quartet No. 14 (Beethoven)?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q188081 wdt:P86 ?X . ?X wdt:P485 ?answer }","paraphrases":["Where are the papers of the music by String Quartet No. 14 (Beethoven)?"],"info":{}}
{"id":"train_10947","question":"What is the conflation for the product or material produced?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5 wdt:P1056 ?obj . ?obj wdt:P31 wd:Q14946528 }","paraphrases":["Which is the conflation for the product or material produced?"],"info":{}}
{"id":"train_10949","question":"Which is {sculptor} of {series} {First Responders} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18392016 wdt:P179 ?X . ?X wdt:P170 ?answer }","paraphrases":["Which is {artist} of {arrangement} {To begin with Responders} ?"],"info":{}}
{"id":"train_10951","question":"Who are conflicted amongst Battle of Ayta ash-Shab?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2888072 wdt:P710 ?X . ?X wdt:P607 ?answer }","paraphrases":["Who are clashed among Fight of Ayta ash-Shab?"],"info":{}}
{"id":"train_10952","question":"What is the maximum vibration of drill model?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23811262 . ?ent wdt:P2806 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the drill's max vibration?"],"info":{}}
{"id":"train_10954","question":"For what role was Terry Southern nominated  for an award in the movie Easy Rider?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q503638 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q591270 }","paraphrases":["Terry Southern nominated for an award for this role in the movie Easy Rider?"],"info":{}}
{"id":"train_10955","question":"What is the natural script for written Ancient Greek?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q35497 wdt:P282 ?obj . ?obj wdt:P31 wd:Q29517555 }","paraphrases":["What is the characteristic script for composed Antiquated Greek?"],"info":{}}
{"id":"train_10956","question":"What is the signed language of Nicole Oresme that started in 1350?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q310777 wdt:P1412 ?answer . ?answer wdt:P580 ?x FILTER ( contains ( YEAR ( ?x ) , '1350' ) ) }","paraphrases":["What is the signed language of Nicole Oresme that started out in 1350?"],"info":{}}
{"id":"train_10957","question":"What was the parent organization of Bayer AG starting in 1925?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q152051 p:P749 ?s . ?s ps:P749 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1925' ) ) }","paraphrases":["NI IDEA"],"info":{}}
{"id":"train_10958","question":"What is the time zone of Hebei, which is the equivalent of China Standard Time?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21208 wdt:P421 ?answer . ?answer wdt:P460 wd:Q1143153 }","paraphrases":["What is the time zone of Hebei, which is the equal of China Standard Time?"],"info":{}}
{"id":"train_10960","question":"What is the setting of King Kong that borders Westchester County.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q309048 wdt:P840 ?answer . ?answer wdt:P47 wd:Q54066 }","paraphrases":["What is the setting of Lord Kong that borders Westchester County."],"info":{}}
{"id":"train_10961","question":"Was Sunny_Leone religion Hindu denomination?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q260794 wdt:P140 wd:Q1318257 }","paraphrases":["Was Sunny Leone a Hindu?"],"info":{}}
{"id":"train_10962","question":"Which is {used for treatment} of {capable of inhibiting or preventing pathological process} of {methenamine hippurate} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27283414 wdt:P2175 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What is the catalyst in the making of methenamine?"],"info":{}}
{"id":"train_10963","question":"Who is the creator of Bart Simpson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5480 wdt:P170 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10964","question":"Name a university affiliated to Purdue University that contains the word \"Purdue\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q615150 . ?sbj wdt:P1416 wd:Q929715 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'purdue' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a university affiliated to Purdue University that contains the word \"Purdue\" in its name"],"info":{}}
{"id":"train_10965","question":"Who is the mother of Diana Gabaldon ,","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q272492 wdt:P737 ?X . ?X wdt:P25 ?answer }","paraphrases":["Diana Gabaldon's mother is who?"],"info":{}}
{"id":"train_10968","question":"In 2014, what was the population of New Haven?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q49145 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["Give the population of New Haven as of 2014."],"info":{}}
{"id":"train_10969","question":"Is Bali located in the Gulf of Thailand and Indian Ocean?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4648 wdt:P206 wd:Q1239 . wd:Q4648 wdt:P206 wd:Q131217 }","paraphrases":["Is the location of Bali in the Gulf of Thailand and Indian Ocean?"],"info":{}}
{"id":"train_10970","question":"tell me animated character that starts name with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15711870 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know energized character that begins title with w"],"info":{}}
