{"id":"train_14012","question":"Tell me the resort which contains the word vdara in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q875157 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vdara' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the resort which contains the word vdara in it's name?"],"info":{}}
{"id":"train_14013","question":"Which is the online database that is maintained by the International Olympic Committee?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P126 wd:Q40970 . ?sbj wdt:P31 wd:Q7094076 }","paraphrases":["The International Olympic Committee maintains which online database?"],"info":{}}
{"id":"train_14014","question":"Which astronomical survey does the California Institute of Technology operate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P137 wd:Q161562 . ?sbj wdt:P31 wd:Q550089 }","paraphrases":[],"info":{}}
{"id":"train_14015","question":"Name an anatomic named by Realdo Colombo that contains the word \"vagina \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4936952 . ?sbj wdt:P3938 wd:Q367016 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vagina' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an anatomic named by means of Realdo Colombo that incorporates the word \"vagina \" in its name"],"info":{}}
{"id":"train_14016","question":"Who was the person that was the child of Alexander Pushkin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P40 wd:Q7200 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["who conduit for found in or taking after to body of water of Aachen?"],"info":{}}
{"id":"train_14017","question":"Name an art that starts with the letter T","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q735 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an craftsmanship that begins with the letter T"],"info":{}}
{"id":"train_14018","question":"What is the Virtual Person ID by Jan Evangelista Purkyně?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q159542 wdt:P5516 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14019","question":"What gun has the highest firing rate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15142894 . ?ent wdt:P3792 ?obj . ?ent wdt:P31 wd:Q15142894 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What weapon has the most elevated terminating rate?"],"info":{}}
{"id":"train_14020","question":"How many series are there of The Flinstones?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P179 wd:Q201358 }","paraphrases":["What's the number of Flintstones television shows?"],"info":{}}
{"id":"train_14021","question":"What is the ideology of George Steinbrenner political party?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q220210 wdt:P102 ?X . ?X wdt:P1142 ?answer }","paraphrases":["What is the philosophy of George Steinbrenner political party?"],"info":{}}
{"id":"train_14023","question":"tell me about sex that starts with o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q290 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the sex that begins with o"],"info":{}}
{"id":"train_14025","question":"What software does Aeroflot use","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q58707 wdt:P2283 ?obj . ?obj wdt:P31 wd:Q7397 }","paraphrases":["What program does Aeroflot utilize"],"info":{}}
{"id":"train_14027","question":"What motorcycle model has the least compression ratio and uses water as a coolant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23866334 . ?ent wdt:P1247 ?obj . ?ent wdt:P588 wd:Q283 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Who has the lest compression ratio and uses the water as a coolant of all the motorcycle models?"],"info":{}}
{"id":"train_14028","question":"What has the height of 633.0 in the city of Goiás?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41587 wdt:P150 ?answer . ?answer wdt:P2044 ?x FILTER ( contains ( ?x , '633.0' ) ) }","paraphrases":["What has the stature of 633.0 within the city of Goiás"],"info":{}}
{"id":"train_14030","question":"How many contain settlements relate to The Hague","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q36600 wdt:P1383 ?obj }","paraphrases":["Which is the number of contain settlements relate to The Hague?"],"info":{}}
{"id":"train_14032","question":"Name a wizard in \"Harry Potter\".","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8337 wdt:P674 ?obj . ?obj wdt:P31 wd:Q15298259 }","paraphrases":[],"info":{}}
{"id":"train_14033","question":"What is the total area of the place where Elvy Sukaesih is a citizen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2746631 wdt:P27 ?X . ?X wdt:P2046 ?answer }","paraphrases":["What is the overall area of the put where Elvy Sukaesih could be a citizen?"],"info":{}}
{"id":"train_14035","question":"When was James Cagney's spouse born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q94041 wdt:P26 ?X . ?X wdt:P569 ?answer }","paraphrases":["On which date, James Cagney's spouse was born"],"info":{}}
{"id":"train_14038","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P166 wd:Q203535 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_14039","question":"Who is the person that was the doctoral student of Carl Friedrich Gauss?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P185 wd:Q6722 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was the doctoral student of Carl Friedrich Gauss?"],"info":{}}
{"id":"train_14040","question":"What is the municipality of Catalonia that has the highest population?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q33146843 . ?ent wdt:P1082 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What part of Catalonia has the highest population?"],"info":{}}
{"id":"train_14041","question":"What languages use the Arabic alphabet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8196 wdt:P407 ?obj . ?obj wdt:P31 wd:Q34770 }","paraphrases":["Which languages are using the Arabic alphabet?"],"info":{}}
{"id":"train_14043","question":"What San Francisco Bay tributary is the Iburi-Horobetsu River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q232264 wdt:P403 ?answer . ?answer wdt:P974 wd:Q11611681 }","paraphrases":["What San Francisco Bay tributary is the Iburi-Horobetsu River?"],"info":{}}
{"id":"train_14044","question":"Tell me the human-geographic territorial entity that contains the word wielopole in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15642541 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wielopole' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the human-geographic regional substance that contains the word wielopole in their name"],"info":{}}
{"id":"train_14045","question":"What did Edward Thorndike major in at Harvard University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q309765 p:P69 ?s . ?s ps:P69 wd:Q13371 . ?s pq:P812 ?value }","paraphrases":["At Harvard University, what was Edward Thorndike's area of study?"],"info":{}}
{"id":"train_14050","question":"For which position Emmanuel Macron has been elected ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3052772 wdt:P39 ?obj . ?obj wdt:P31 wd:Q17279032 }","paraphrases":["What position was Emmanuel Macron elected into?"],"info":{}}
{"id":"train_14051","question":"Which sovereign state of Sofia has the administrative territorial entity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P150 wd:Q472 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["Which Sofia sovereign state has the territorial administrative entity?"],"info":{}}
{"id":"train_14053","question":"Name the steam locomotive that is known as a tender locomotive and has the least amount of stroke.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q171043 . ?ent wdt:P2557 ?obj . ?ent wdt:P279 wd:Q20650761 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which steam locomotive has the least amount of stroke?"],"info":{}}
{"id":"train_14055","question":"What is located around Edmonton and who lives there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2096 wdt:P47 ?X . ?X wdt:P466 ?answer }","paraphrases":["What is found around Edmonton and who lives there?"],"info":{}}
{"id":"train_14056","question":"When did John Galsworthy win the Nobel Prize in Literature and how much was the prize money?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q82248 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P2121 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["When did John Galsworthy win the Nobel Prize in Literature and how much used to be the prize money?"],"info":{}}
{"id":"train_14057","question":"What is the treatment for the symptoms of Frailty Syndrome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q177171 wdt:P780 ?X . ?X wdt:P2176 ?answer }","paraphrases":["Which is the treatment for the symptoms of Frailty Syndrome?"],"info":{}}
{"id":"train_14058","question":"Tell me album whose name has the word wall in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482994 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wall' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know collection whose title has the word divider in it."],"info":{}}
{"id":"train_14059","question":"Who is the CEO of Society of Jesus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q36380 wdt:P169 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What's the name of the Society of Jesus' CEO?"],"info":{}}
{"id":"train_14060","question":"Who was the architect of the Brandenburg Gate","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q82425 wdt:P84 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Which architect constructed the Brandenburg Gate?"],"info":{}}
{"id":"train_14061","question":"Which means  {material used} at {The Motherland Calls} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1601986 wdt:P186 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14062","question":"What award Scarlett Johansson received which statement is subject of in 64th Tony Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q34436 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q571852 }","paraphrases":["Which category did Scarlett Johansson earn during the 64th Tony Awards?"],"info":{}}
{"id":"train_14063","question":"Who was the final cause of the election at John Stuart Mill who has a position as a member of the 19th UK Parliament?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q50020 p:P39 ?s . ?s ps:P39 wd:Q41582559 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }","paraphrases":["John Stuart Mill, who has a position as a member of the 19th UK parliament, faced an election. What happened at the end?"],"info":{}}
{"id":"train_14064","question":"Who is the {father} and the {spouse} of {Roger_Waters} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q180861 wdt:P22 ?ans_1 . wd:Q180861 wdt:P26 ?ans_2 }","paraphrases":["Who is Roger Waters Paternal Parent, and who did he join in matrimony with?"],"info":{}}
{"id":"train_14065","question":"What is the rank of the Taxon Parent of Roe Deer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q122069 wdt:P171 ?X . ?X wdt:P105 ?answer }","paraphrases":["What is the rank of the Taxon Parent of Roe Deer?"],"info":{}}
{"id":"train_14066","question":"Who is the {abjad} for {writing system} of {Urdu}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1617 wdt:P282 ?obj . ?obj wdt:P31 wd:Q185087 }","paraphrases":["Who is the {abjad} for {composing framework} of {Urdu}"],"info":{}}
{"id":"train_14068","question":"Who is a follower and followed by Carlos the Bald, who has the title of nobleman as king of the Franks?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q71231 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Who could be a supporter and taken after by Carlos the Bare, who has the title of aristocrat as lord of the Franks?"],"info":{}}
{"id":"train_14069","question":"Is WWE the owner of The World?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q35339 wdt:P1830 wd:Q7775919 }","paraphrases":["Is The World owned by WWE?"],"info":{}}
{"id":"train_14070","question":"What media company is The Economist owned by?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q180089 wdt:P127 ?obj . ?obj wdt:P31 wd:Q1331793 }","paraphrases":["What media company is The Financial analyst claimed by?"],"info":{}}
{"id":"train_14075","question":"What is the official website for the John Betjeman archives at Leeds University Library?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q962308 p:P485 ?s . ?s ps:P485 wd:Q24568958 . ?s pq:P856 ?value }","paraphrases":["What is the website for John Betjeman archives at Leeds?"],"info":{}}
{"id":"train_14077","question":"Is the number of masts of Carroll A Deering more than 4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1045146 wdt:P1099 ?obj filter ( ?obj > 4.0 ) }","paraphrases":["Is the number of poles of Carroll A Deering more than 4?"],"info":{}}
{"id":"train_14078","question":"What legislative body under Lincoln had 7 seats?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q28260 p:P194 ?s . ?s ps:P194 ?obj . ?s pq:P1342 ?x filter ( contains ( ?x , '7.0' ) ) }","paraphrases":["Which legislative body had seven seats under Lincoln?"],"info":{}}
{"id":"train_14081","question":"What genetic association caused John Gotti to die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q301646 wdt:P509 ?X . ?X wdt:P2293 ?answer }","paraphrases":["What hereditary affiliation caused John Gotti to die?"],"info":{}}
{"id":"train_14082","question":"In what year did Franklin Delano Roosevelt graduate from Columbia Law School?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8007 p:P69 ?s . ?s ps:P69 wd:Q1149089 . ?s pq:P582 ?value }","paraphrases":["The year Franklin Delano Roosevelt graduated from Columbia Law School was?"],"info":{}}
{"id":"train_14083","question":"IS THE DATA SIZE OF DPECIAL ARCHIVE MOSCOW IS LESS THAN 5873840.8","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2300917 wdt:P3575 ?obj filter ( ?obj < 5873840.8 ) }","paraphrases":["What is the data size of Dpecial archive Moscow?"],"info":{}}
{"id":"train_14084","question":"Which member of originates of Saturday Night Live?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13979 wdt:P495 ?X . ?X wdt:P463 ?answer }","paraphrases":["What members have come from Saturday Night Live?"],"info":{}}
{"id":"train_14085","question":"What is the position  elected in  for  Robert Gascoyne - Cecil, 3rd Marquess of Salisbury held as  Member of the 18th Parliament of the United Kingdom ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q243705 p:P39 ?s . ?s ps:P39 wd:Q41582558 . ?s pq:P2715 ?value }","paraphrases":["What is the official position for Robert Gascoyne?"],"info":{}}
{"id":"train_14096","question":"When did research center for subsidiary of Brown University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q49114 wdt:P355 ?obj . ?obj wdt:P31 wd:Q7315155 }","paraphrases":[],"info":{}}
{"id":"train_14102","question":"Tell me sports club whose name has the word akers in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q847017 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'åkers' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know sports club whose title has the word akers in it."],"info":{}}
{"id":"train_14105","question":"Name someone living in Indianapolis","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P551 wd:Q6346 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Name an Indianapolis resident"],"info":{}}
{"id":"train_14106","question":"Name a royal rank in Ancient Egypt that contains the word \"pharaoh\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q355567 . ?sbj wdt:P1001 wd:Q11768 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pharaoh' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a royal rank in Ancient Egypt that consists of the phrase \"pharaoh\" in its identify"],"info":{}}
{"id":"train_14113","question":"What are the scientific theory which start with the letter universe","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3239681 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'universe' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the logical hypothesis which begin with the letter universe"],"info":{}}
{"id":"train_14114","question":"Did Emma Thompson win the Academy Award for best Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q168724 p:P166 ?s . ?s ps:P166 wd:Q103618 . ?s pq:P805 ?value }","paraphrases":["Did Emma Thompson win the Academy Award for best Actress?"],"info":{}}
{"id":"train_14116","question":"Which highly urbanized city has the highest mains voltage?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q29946056 . ?ent wdt:P2884 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What city has the highest mains voltage?"],"info":{}}
{"id":"train_14120","question":"Ann Powers left what employer in 1988?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12066347 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1988' ) ) }","paraphrases":["Ann Powers resigned with which employer in 1988?"],"info":{}}
{"id":"train_14121","question":"What magnitude on the Richter magnitude scale was the 2011 Tohoku earthquake and tsunami?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q36204 wdt:P2528 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14122","question":"What country shares a border with Iran and Afghanistan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q794 p:P47 ?s . ?s ps:P47 wd:Q889 . ?s pq:P805 ?value }","paraphrases":["Which country has Iran and Afghanistan on its border?"],"info":{}}
{"id":"train_14123","question":"tell me the flux that starts with the letter f in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6485344 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tell me the flux that starts with the letter f in it."],"info":{}}
{"id":"train_14124","question":"Are TD Garden and Boston Garden home venue for Boston Celtics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q131371 wdt:P115 wd:Q432105 . wd:Q131371 wdt:P115 wd:Q894567 }","paraphrases":["Do the Boston Celtics have to home stadiums TD gardens and Boston gardens?"],"info":{}}
{"id":"train_14126","question":"What is the unit that measures mass?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11423 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q286017 }","paraphrases":["What is the mass measuring unit?"],"info":{}}
{"id":"train_14128","question":"Does the face value of the 50 cent euro coin equal less than 0.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2002797 wdt:P3934 ?obj filter ( ?obj < 0.6 ) }","paraphrases":["Is the face value of the 50 cent euro coin less than 0.6?"],"info":{}}
{"id":"train_14131","question":"What are the active ingredients of the pharmaceutical product niacin","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3781 wd:Q134658 . ?sbj wdt:P31 wd:Q28885102 }","paraphrases":["What are the pharmaceutical niacin's active ingredients?"],"info":{}}
{"id":"train_14135","question":"Which weapon model has the highest rate of fire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15142894 . ?ent wdt:P3792 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which model has the highest rate of fire?"],"info":{}}
{"id":"train_14136","question":"Are Son Guku and Yamcha Dragon Ball characters?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2020 wdt:P674 wd:Q2142 . wd:Q2020 wdt:P674 wd:Q843345 }","paraphrases":["Does Son Goku and Yamcha belong to Dragon Ball characters?"],"info":{}}
{"id":"train_14137","question":"Who was the Dean of Pompeu Fabra University as of June 18, 1990?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q24543 p:P1075 ?s . ?s ps:P1075 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1990' ) ) }","paraphrases":["What was the name of Pompeu Fabra University's Dean on June 18, 1990?"],"info":{}}
{"id":"train_14138","question":"tell me about use starts with t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1724915 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know approximately utilize begins with t"],"info":{}}
{"id":"train_14141","question":"With geography as the topic, which subject in the history of Maine describes the geography of Maine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4204667 wdt:P1269 ?answer . ?answer wdt:P2633 wd:Q16636155 }","paraphrases":["With geology as the subject, which subject within the history of Maine portrays the topography of Maine?"],"info":{}}
{"id":"train_14142","question":"What language is signed in The Walrus and the Carpenter/","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1290846 wdt:P50 ?X . ?X wdt:P1412 ?answer }","paraphrases":["Specify the language inscribed in The Walrus and the Carpenter."],"info":{}}
{"id":"train_14143","question":"Which historical country is Achaemenid Empire the capital of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q389688 wdt:P36 ?obj . ?obj wdt:P31 wd:Q3024240 }","paraphrases":[],"info":{}}
{"id":"train_14144","question":"Where is the publishing house from The Very hungry Catterpillar ins the town of New York City?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q491657 wdt:P123 ?answer . ?answer wdt:P131 wd:Q60 }","paraphrases":["Where is The Very Hungry Catterpillar's publishing house in New York City?"],"info":{}}
{"id":"train_14145","question":"For which sports team did Stanley Matthews play and in how many matches did he compete?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q216140 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["What sports team has Stanley Matthews played for and how many matches has he competed for?"],"info":{}}
{"id":"train_14147","question":"When did Joseph Liouville begin and end the time as an employer at Collège de France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q214549 p:P108 ?s . ?s ps:P108 wd:Q202660 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["What span of time was Joseph Liouville an employer at College de France?"],"info":{}}
{"id":"train_14148","question":"What is inhabitants of born in  Joseph Colombo ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q640717 wdt:P19 ?X . ?X wdt:P1082 ?answer }","paraphrases":["What is tenants of born in Joseph Colombo ?"],"info":{}}
