{"id":"train_6334","question":"What was Seán O'Casey nominated for on 1962-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q315170 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1962' ) ) }","paraphrases":["Which award was Sean O'Casey nominated for on January 1, 1962?"],"info":{}}
{"id":"train_6335","question":"What are the ionizing radiation which start with the letter n","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q186161 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the ionizing radiation that begins with letter n"],"info":{}}
{"id":"train_6337","question":"Which is the Genius artist ID for Keith Urban?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q315547 wdt:P2373 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6338","question":"Which terrorist attack in France resulted in the highest number of injuries?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5710433 . ?ent wdt:P1339 ?obj . ?ent wdt:P17 wd:Q142 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["How many people were injured in France's worst terrorist attack?"],"info":{}}
{"id":"train_6339","question":"What kinds of symptoms does aspirin treat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2176 wd:Q18216 . ?sbj wdt:P31 wd:Q169872 }","paraphrases":["What are the types of symptoms that treat aspirin?"],"info":{}}
{"id":"train_6340","question":"tell  me maritime republic language used  Latinstarts with r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43185013 . ?sbj wdt:P2936 wd:Q397 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me maritime republic language used Latinstarts with r"],"info":{}}
{"id":"train_6341","question":"Which state of Mexico that contains the word zacatecas in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15149663 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zacatecas' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which state of Mexico that contains the word zacatecas in their name"],"info":{}}
{"id":"train_6342","question":"How many directors are there for Americal Idol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q201052 wdt:P57 ?obj }","paraphrases":["American Idol has how many directors?"],"info":{}}
{"id":"train_6343","question":"Which geosphere is studied by meteorology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2579 wd:Q25261 . ?sbj wdt:P31 wd:Q241284 }","paraphrases":["Which geosphere is considered by meteorology?"],"info":{}}
{"id":"train_6344","question":"Which is the HSDB ID for ethanol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q153 wdt:P2062 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6345","question":"Who did the author cite in the book Behavioral and neural correlates of delay of gratification 40 years later?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24601241 wdt:P2860 ?X . ?X wdt:P50 ?answer }","paraphrases":["Who did the creator cite within the book Behavioral and neural relates of delay of delight 40 a long time afterward?"],"info":{}}
{"id":"train_6347","question":"Who is Daimier AG's owner and what is its subsidiary?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q27530 wdt:P127 ?ans_1 . wd:Q27530 wdt:P355 ?ans_2 }","paraphrases":["What other connected companies are linked through the ownership of Daimier AG?"],"info":{}}
{"id":"train_6351","question":"Who  is the burial place of Nebettawy ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q460946 wdt:P22 ?X . ?X wdt:P119 ?answer }","paraphrases":["Who is the burial put of Nebettawy ?"],"info":{}}
{"id":"train_6352","question":"what is the musical composer id of bedrish smetana","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q48173 wdt:P4607 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6353","question":"Which house has the most floors above ground?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3947 . ?ent wdt:P1101 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["When you think of flower in front of an house, which house would it be?"],"info":{}}
{"id":"train_6357","question":"Kim Stanley received a prize for being nominated.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q259474 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Kim Stanley gotten a prize for being nominated."],"info":{}}
{"id":"train_6359","question":"Who are the owners of original air channel of CCTV spring Festival gala 1998?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24836991 wdt:P449 ?X . ?X wdt:P127 ?answer }","paraphrases":["Who are the owners of unique air channel of CCTV spring Festival gala 1998?"],"info":{}}
{"id":"train_6360","question":"What is the mortality rate with the highest frequency?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q58702 . ?ent wdt:P2844 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the mortality rate with the most noteworthy frequency?"],"info":{}}
{"id":"train_6361","question":"What was Burt Reynolds nominated for in 1-1-1997?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q202148 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1997' ) ) }","paraphrases":["What was the award Burt Reynolds was in the running for in 1997?"],"info":{}}
{"id":"train_6362","question":"What number President of Indonesia was Megawati Sukarnoputri?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q76179 p:P39 ?s . ?s ps:P39 wd:Q11755916 . ?s pq:P1545 ?value }","paraphrases":["Megawati Sukarnoputri was what number President of Indonesia?"],"info":{}}
{"id":"train_6364","question":"Tell me scalar physical quantity whose name has the word voltage in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q181175 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'voltage' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know scalar physical amount whose title has the word voltage in it."],"info":{}}
{"id":"train_6367","question":"How many military brances have anti-aircraft warfare?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P241 wd:Q843941 }","paraphrases":["What is the number of military branches that have anti-aircraft warfare?"],"info":{}}
{"id":"train_6368","question":"Who developed Need for Speed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q55679 wdt:P178 ?obj }","paraphrases":["Which company were the developers on Need for Speed?"],"info":{}}
{"id":"train_6369","question":"David Grossman together with Jessica Cohen won which award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q160263 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q30301433 }","paraphrases":["David Grossman together with Jessica Cohen won which grant?"],"info":{}}
{"id":"train_6371","question":"When was Horatio Nelson built?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83235 wdt:P607 ?X . ?X wdt:P580 ?answer }","paraphrases":["When was Horatio Nelson built?"],"info":{}}
{"id":"train_6375","question":"Tell me {house cat} whose name  starts with m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q146 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'м' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me whose name begins with m { house cat }"],"info":{}}
{"id":"train_6376","question":"What area of mathematics does Claude Shannon specialize in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q92760 wdt:P101 ?obj . ?obj wdt:P31 wd:Q1936384 }","paraphrases":["What is Claude Shannon's mathematic specialty?"],"info":{}}
{"id":"train_6379","question":"Is the ceiling exposure limit of hydrazine equal to 0.04?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q58447 wdt:P2405 ?obj filter ( ?obj = 0.04 ) }","paraphrases":["What is the ceiling exposure limit of hydrazine?"],"info":{}}
{"id":"train_6380","question":"What is the motif of chancellor Armand Marrast, that has Bal du moulin de la Galette?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q683274 wdt:P180 ?answer . ?answer wdt:P6 wd:Q677730 }","paraphrases":["What is the theme of chancellor Armand Marrast, that has Bal du moulin de la Galette?"],"info":{}}
{"id":"train_6381","question":"Where are the archives of Vietnam located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q212913 wdt:P1269 ?X . ?X wdt:P150 ?answer }","paraphrases":["What place are the archives of Vietnam situated?"],"info":{}}
{"id":"train_6382","question":"What is a contestant in the work of Walter Blakely?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28812083 wdt:P1441 ?X . ?X wdt:P161 ?answer }","paraphrases":["What could be a hopeful within the work of Walter Blakely?"],"info":{}}
{"id":"train_6383","question":"\"Who was born in Bernard Herrmann, with local calling code 917?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q296804 wdt:P19 ?answer . ?answer wdt:P473 ?x FILTER ( contains ( ?x , '917' ) ) }","paraphrases":["\"Who was once born in Bernard Herrmann, with local calling code 917?\""],"info":{}}
{"id":"train_6386","question":"Is the galactic longitude of the Orion Nebula equal to 209.010797","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13903 wdt:P6260 ?obj filter ( ?obj = 209.010797 ) }","paraphrases":["Is the Orion Nebula galactic longitude 209.010797"],"info":{}}
{"id":"train_6388","question":"Which is the business that is the publisher of The Economist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q180089 wdt:P123 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":["Which business is The Economist's publisher?"],"info":{}}
{"id":"train_6391","question":"Which child of Louis VIII of France died 8/25/1270?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q165284 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P570 ?x filter ( contains ( YEAR ( ?x ) , '1270' ) ) }","paraphrases":["The name of Louis VIII child who died in 9/25/1270?"],"info":{}}
{"id":"train_6392","question":"What is the queen of the land} of Bahia Toco Largo Lake ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7356830 wdt:P17 ?X . ?X wdt:P35 ?answer }","paraphrases":["What is the ruler of the arrive} of Bahia Toco Largo Lake ?"],"info":{}}
{"id":"train_6393","question":"Which are the people that participate in the religion of Islam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P140 wd:Q432 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Which are the individuals that take an interest within the religion of Islam?"],"info":{}}
{"id":"train_6394","question":"Who is the {historic county of England} for {shares border with} of {Hampshire}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q23204 . ?sbj wdt:P31 wd:Q1138494 }","paraphrases":["Who is the {notable province of Britain} for {offers border with} of {Hampshire}"],"info":{}}
{"id":"train_6395","question":"What job did Dorothy Stratten have during 1979?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q241081 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1979' ) ) }","paraphrases":["During 1979, Dorothy Stratten held what job?"],"info":{}}
{"id":"train_6396","question":"Bronislaw Malinowski used what drug as his method of murder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184992 wdt:P509 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What drug did Bronislaw Malinowski use as his method of killing?"],"info":{}}
{"id":"train_6397","question":"who version, edition, or translation for edition or translation  of Twenty Thousand Leagues Under the Sea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P629 wd:Q183565 . ?sbj wdt:P31 wd:Q3331189 }","paraphrases":["who form, version, or interpretation for version or interpretation of Twenty Thousand Associations Beneath the Sea?"],"info":{}}
{"id":"train_6398","question":"What time zone did the San Francisco Chronicle originate in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q139103 wdt:P495 ?X . ?X wdt:P421 ?answer }","paraphrases":["What time zone was the San Francisco Chronicle first published in?"],"info":{}}
{"id":"train_6401","question":"What is {portrayed by} {track listing} of {Invasion of Privacy} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51027746 wdt:P658 ?X . ?X wdt:P175 ?answer }","paraphrases":["What does Invasion of Privacy made by."],"info":{}}
{"id":"train_6403","question":"Does the elevation above sea level of the Jericho equals -220.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5687 wdt:P2044 ?obj filter ( ?obj = -220.0 ) }","paraphrases":["Is the sea level of Jericho's elevation -220.0?"],"info":{}}
{"id":"train_6405","question":"What what is brain region arterial supply superior cerebellar artery and also which starts with letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620186 . ?sbj wdt:P2286 wd:Q707592 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is Genius vicinity arterial provide foremost cerebellar artery and also which begins with letter c"],"info":{}}
{"id":"train_6406","question":"Whose professional harpsichordist's namesake was the Goldberg Variations named after?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q213728 wdt:P138 ?answer . ?answer wdt:P106 wd:Q5371902 }","paraphrases":["Whose expert harpsichordist's namesake was the Goldberg Variations named after?"],"info":{}}
{"id":"train_6407","question":"Tell me the border that contains the word line in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q133346 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'line' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which border in its name contains the word line"],"info":{}}
{"id":"train_6408","question":"Name the most-produced rolling stock class operated by the New York City Subway ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q811704 . ?ent wdt:P1092 ?obj . ?ent wdt:P137 wd:Q7733 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Give me the name of the most-produced rolling stock class operated by the New York City Subway."],"info":{}}
{"id":"train_6411","question":"How do you pronounce Georges Pompidous name? It's French.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2185 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q150 }","paraphrases":["What is the French pronunciation of the name Georges Pompidous?"],"info":{}}
{"id":"train_6412","question":"Which is the railway tunnel with terminus Erstfeld and contains the word base in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1311958 . ?sbj wdt:P559 wd:Q69642 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'base' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the railway tunnel with terminus Erstfeld and consists of the phrase base in it's name?"],"info":{}}
{"id":"train_6413","question":"What was the population of Thailand in 2006?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q869 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2006' ) ) }","paraphrases":["What was the number of inhabitants in Thailand in 2006?"],"info":{}}
{"id":"train_6414","question":"Of which enterprise is Mark Zuckerberg CEO?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P169 wd:Q36215 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["What is Mark Zuckerberg CEO of?"],"info":{}}
{"id":"train_6415","question":"What legislative body is the regional organization of European parliament?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P194 wd:Q8889 . ?sbj wdt:P31 wd:Q4120211 }","paraphrases":["What administrative body is the territorial organization of European parliament?"],"info":{}}
{"id":"train_6416","question":"What { sports team member } of { Bernard Thévenet } that is { end time } is { 1979 - 0 - 0 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q367064 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1979' ) ) }","paraphrases":["For what sports team did Bernard Thévenet play for until 1979?"],"info":{}}
{"id":"train_6417","question":"George Washington Bridge has what UglyBridges.com ID","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q125821 wdt:P1380 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6418","question":"How many movies have Georges Méliès as the production designer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2554 wd:Q152272 }","paraphrases":["How many movies has Georges Melies production designed?"],"info":{}}
{"id":"train_6420","question":"What is the population of Móstoles that is estimated by the census office?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q187826 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }","paraphrases":["According to estimates by the census office, what is the population of Móstoles?"],"info":{}}
{"id":"train_6422","question":"What is medical condition of Human Pregnancy ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1050 wd:Q11995 }","paraphrases":[],"info":{}}
{"id":"train_6423","question":"Where did George Wallace obtain his Bachelor of Laws degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q313776 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q798137 }","paraphrases":["From which college did George Wallace receive his Law Degree?"],"info":{}}
{"id":"train_6425","question":"Tell me a part of fungi that starts with {'s'}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56883667 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a portion of parasites that begins with {'s'}"],"info":{}}
{"id":"train_6428","question":"Who follows Charles the Fat as King of Franks?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q150712 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Who takes after Charles the Fat as Ruler of Franks?"],"info":{}}
{"id":"train_6429","question":"What Gdańsk twinned administrative body began in 1993?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1792 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1993' ) ) }","paraphrases":["In 1993 which Gadansk twinned  administrative body began?"],"info":{}}
{"id":"train_6431","question":"which type of anime television series starts with y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11086742 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which type of animal TV series begins with y"],"info":{}}
{"id":"train_6435","question":"Name an arts genre that starts with letter D","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q45971958 . ?sbj wdt:P1535 wd:Q43393537 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an arts genre that begins with letter D"],"info":{}}
{"id":"train_6436","question":"At what point in time did B.F Skinner receive the E.L. Thorndike Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q213195 p:P166 ?s . ?s ps:P166 wd:Q5322016 . ?s pq:P585 ?value }","paraphrases":["The E.L. Thorndike Award was received by B.F Skinner at what time?"],"info":{}}
{"id":"train_6437","question":"Sasha Grey is a member of what musical group?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P767 wd:Q2709 . ?sbj wdt:P31 wd:Q9212979 }","paraphrases":["Sasha Dark may be a part of what melodic bunch?"],"info":{}}
{"id":"train_6438","question":"What is the death place of Lavrentiy Beria and is the twin town of Tehran?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q141829 wdt:P20 ?answer . ?answer wdt:P190 wd:Q3616 }","paraphrases":["What is the death area of Lavrentiy Beria and is the twin city of Tehran?"],"info":{}}
{"id":"train_6439","question":"What is the version and date of publication of the Diary of Anne Frank?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q6911 p:P747 ?s . ?s ps:P747 ?obj . ?s pq:P577 ?value1 . }","paraphrases":["What is the form and date of distribution of the Journal of Anne Frank?"],"info":{}}
{"id":"train_6440","question":"Which is the age of onset for gout?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q133087 wdt:P2841 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6441","question":"What is the source of inspiration for the film character in Blackbeard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P941 wd:Q213518 . ?sbj wdt:P31 wd:Q15773347 }","paraphrases":["What is the source of motivation for the film character in Blackbeard?"],"info":{}}
{"id":"train_6442","question":"What awards were the Rolling Stones nominated for in 1989?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11036 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1989' ) ) }","paraphrases":["In 1989 the Rolling Stones were nominated for what awards?"],"info":{}}
{"id":"train_6446","question":"What is in the category of Wisława Szymborska?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q42552 wdt:P5344 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6447","question":"What is the population of Nashville at  2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23197 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["What was Nashville's population in 2016?"],"info":{}}
{"id":"train_6448","question":"Which is the poster that depicts Barack Obama?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P180 wd:Q76 . ?sbj wdt:P31 wd:Q429785 }","paraphrases":[],"info":{}}
{"id":"train_6449","question":"Which text does the Book of Genesis originate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9184 wdt:P179 ?obj . ?obj wdt:P31 wd:Q179461 }","paraphrases":["What text is the Book of Genesis from?"],"info":{}}
{"id":"train_6450","question":"What is bipedalism's means of locomotion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3512 wd:Q372949 }","paraphrases":[],"info":{}}
{"id":"train_6453","question":"When did Akita start in twinned administrative body at St. Cloud","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q17139 p:P190 ?s . ?s ps:P190 wd:Q736834 . ?s pq:P580 ?value }","paraphrases":["What is the date on which Akita began being a twinned administrative body at St. Cloud?"],"info":{}}
