{"id":"train_130","question":"What is the Velká pardubická with the lowest race time whose winner is Peter Gehm?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1701273 . ?ent wdt:P2781 ?obj . ?ent wdt:P1346 wd:Q12044712 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What Velka Pardubicka has the lowest race time that was won by Peter Gehm?"],"info":{}}
{"id":"train_132","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P417 wd:Q128267 . ?sbj wdt:P31 wd:Q486972 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_133","question":"Name a book written in Esperanto","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q143 . ?sbj wdt:P31 wd:Q571 }","paraphrases":["Name a book written in Esperanto"],"info":{}}
{"id":"train_134","question":"What is the general manager of Bernard Hinault?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P505 wd:Q109255 }","paraphrases":[],"info":{}}
{"id":"train_136","question":"How many are interested in Daniel Dennett?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q215263 wdt:P2650 ?obj }","paraphrases":["Daniel Dennett is interested in by how many people?"],"info":{}}
{"id":"train_138","question":"Where is the river source of the Rhine?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q584 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }","paraphrases":["Where does the river Rhine originate from?"],"info":{}}
{"id":"train_141","question":"What position was held by Harold Macmillan in the 34th Parliament of the United Kingdom, when was he elected, and why did he leave?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q128985 p:P39 ?s . ?s ps:P39 wd:Q41582587 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["Harold Macmillian of the 34th Parliament of the UK held which position starting from what date and then left for what reason?"],"info":{}}
{"id":"train_142","question":"is the maximum wavelength of sensitivity of the human eye equal to 700?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q430024 wdt:P3737 ?obj filter ( ?obj = 700 ) }","paraphrases":["Is 700 the maximum wavelength of sensitivity of the human eye?"],"info":{}}
{"id":"train_143","question":"Where was the location of birth of Hermann Heinrich Gossen, that has Q48460 such that 2--4355126?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q62835 wdt:P19 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '2--4355126' ) ) }","paraphrases":["Where was once the region of beginning of Hermann Heinrich Gossen, that has Q48460 such that 2--4355126?"],"info":{}}
{"id":"train_144","question":"Who received the Nobel Prize in Literature after Mo Yan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8998 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P156 ?value }","paraphrases":["Give me the person name who received nobel literature prize after Mo yan?"],"info":{}}
{"id":"train_145","question":"When did Eiji Toyoda win an award for his work in Order of Prince Henry?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1141740 p:P166 ?s . ?s ps:P166 wd:Q93488 . ?s pq:P585 ?value }","paraphrases":["Which year was Eiji Toyoda awarded for his work in Order of Prince Henry?"],"info":{}}
{"id":"train_148","question":"Who are worked for Michelle Wolf and its source location of group/organisation is located in New York City?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23883085 wdt:P108 ?answer . ?answer wdt:P740 wd:Q60 }","paraphrases":["Who are labored for Michelle Wolf and its source place of group/organisation is placed in New York City?"],"info":{}}
{"id":"train_150","question":"what was the publication date for iTunes which has software version as 12.7.5?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9589 p:P348 ?s . ?s ps:P348 ?x filter ( contains ( ?x , '12.7.5' ) ) . ?s pq:P577 ?value }","paraphrases":["When was iTunes version 12.7.5 published?"],"info":{}}
{"id":"train_151","question":"Dennis M. Ritchie designed which structured programming language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P287 wd:Q45575 . ?sbj wdt:P31 wd:Q28920117 }","paraphrases":["Dennis M. Ritchie outlined which organized programming language?"],"info":{}}
{"id":"train_153","question":"What is the stock exchange for the ticker symbol 0700 in Tencent?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q860580 p:P414 ?s . ?s ps:P414 ?obj . ?s pq:P249 ?x filter ( contains ( ?x , '0700' ) ) }","paraphrases":["What is the the symbol for stock 0700 in Tencent?"],"info":{}}
{"id":"train_154","question":"What are the head of state and the office held by head of state of the Soviet Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q15180 wdt:P35 ?ans_1 . wd:Q15180 wdt:P1906 ?ans_2 }","paraphrases":["What is the head of state of the Soviet Union?"],"info":{}}
{"id":"train_156","question":"What is the parent organization for the International Court of Justice?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7801 wdt:P749 ?obj . ?obj wdt:P31 wd:Q484652 }","paraphrases":["What is the parent organization for the Universal Court of Justice?"],"info":{}}
{"id":"train_157","question":"What is the beginning of Sarajevo's","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11194 p:P190 ?s . ?s ps:P190 wd:Q2274046 . ?s pq:P580 ?value }","paraphrases":["When was the start of Sarajevo's?"],"info":{}}
{"id":"train_158","question":"What significant event in 1978-6-1 is Michelle Bachelet known for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q320 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1978' ) ) }","paraphrases":["What did Michelle Bachelet do on 6/1/1978?"],"info":{}}
{"id":"train_160","question":"What five U.S. states does the Delaware River drain from?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q143762 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }","paraphrases":["Delaware rivers drains from what 5 us states"],"info":{}}
{"id":"train_161","question":"Which birth language is Chizoba Ejike?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21197460 wdt:P172 ?X . ?X wdt:P103 ?answer }","paraphrases":["Which birth dialect is Chizoba Ejike?"],"info":{}}
{"id":"train_162","question":"What is the ionization energy of the nicotine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12144 wdt:P2260 ?answer }","paraphrases":[],"info":{}}
{"id":"train_164","question":"Who is {creators} of {language of the original work} {Star Trek Into Darkness} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q171711 wdt:P364 ?X . ?X wdt:P170 ?answer }","paraphrases":["Who were the creators for the language of the original work of Star Trek Into Darkness?"],"info":{}}
{"id":"train_165","question":"Who is the spouse of Aaliyah and when did they divorce?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q11617 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who is the companion of Aaliyah and when did they divorce?"],"info":{}}
{"id":"train_166","question":"What is {inhabitants} {nationality} of {Leopold von Sacher-Masoch} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q78474 wdt:P27 ?X . ?X wdt:P1082 ?answer }","paraphrases":["What is {inhabitants} {nationality} of {Leopold von Sacher-Masoch} ?"],"info":{}}
{"id":"train_170","question":"What is Bram Stoker's occupation and field of work and did he work in Dublin Castle?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q36184 p:P108 ?s . ?s ps:P108 wd:Q742767 . ?s pq:P106 ?value1 . ?s pq:P101 ?value2 }","paraphrases":["What is Bram Stoker's occupation and field of work and did he work in Dublin Castle?"],"info":{}}
{"id":"train_171","question":"How many seasons of Handball-Bundesliga are there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q175762 wdt:P4794 ?X . ?X wdt:P1545 ?answer }","paraphrases":["How numerous seasons of Handball-Bundesliga are there?"],"info":{}}
{"id":"train_172","question":"\"What is place of residence of Wangari Maathai,that has inflation rate of consumer price index as 2.9?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q46795 wdt:P551 ?answer . ?answer wdt:P1279 ?x FILTER ( contains ( ?x , '2.9' ) ) }","paraphrases":["\"What is region of house of Wangari Maathai,that has inflation charge of client fee index as 2.9?\""],"info":{}}
{"id":"train_173","question":"Who is the child of Pompey and the mother, Mucia Tertia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q125414 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P25 wd:Q273616 }","paraphrases":["What kid did Pompey and Mucia Tertia have?"],"info":{}}
{"id":"train_174","question":"Name an alcoholic beverage that contains the word \"rum \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q154 . ?sbj wdt:P2079 wd:Q41760 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'rum' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title an alcoholic refreshment that contains the word \"rum \" in its name"],"info":{}}
{"id":"train_175","question":"How many terminus are in Vienna","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P559 wd:Q1741 }","paraphrases":["how many vienna in terminus"],"info":{}}
{"id":"train_176","question":"What is in the region of Paroo River, that divides into Ku-ring-gai Council?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1628056 wdt:P131 ?answer . ?answer wdt:P150 wd:Q133642 }","paraphrases":["What is within the locale of Paroo Stream, that isolates into Ku-ring-gai Committee?"],"info":{}}
{"id":"train_177","question":"What has been the ister city of Changchun since Aug 25th, 1992?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q92161 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1992' ) ) }","paraphrases":["Since Aug. 25th, 1992 this has been the ister city of Changchun?"],"info":{}}
{"id":"train_178","question":"How many rivers and lakes are connected to Lake Urmia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P469 wd:Q199551 }","paraphrases":["Can you tell me the amount of lakes are rivers attached to Lake Urmia?"],"info":{}}
{"id":"train_179","question":"Tell me soil type whose name has the word vertisol in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10926413 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vertisol' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose to me soil type whose name has the word vertisol in it."],"info":{}}
{"id":"train_180","question":"What is Lizzy Yarnold's TheSports.org athlete ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q658596 wdt:P4391 ?answer }","paraphrases":[],"info":{}}
{"id":"train_181","question":"What is { award received } from { Justin Timberlake } that is { point in time } is { 2007 - 0 - 0 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43432 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2007' ) ) }","paraphrases":["What is { grant gotten } from { Justin Timberlake } that's { point in time } is { 2007 - - }?"],"info":{}}
{"id":"train_182","question":"Which religious concept starts with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which devout concept begins with the letter t"],"info":{}}
{"id":"train_185","question":"Does the Becherovka alcohol by volume less than 30.4","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q742408 wdt:P2665 ?obj filter ( ?obj < 30.4 ) }","paraphrases":["Does the Becherovka liquor by volume less than 30.4"],"info":{}}
{"id":"train_186","question":"What are the prefecture-level city  which start with the letter ürümqi","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q748149 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ürümqi' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the prefecture-level metropolis which start with the letter ürümqi"],"info":{}}
{"id":"train_187","question":"tell me ceremony whose name has the word umhlanga in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2627975 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'umhlanga' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the ceremony in which the word umhlanga is named"],"info":{}}
{"id":"train_189","question":"What is edition runtime for League of Legends?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q223341 wdt:P400 ?X . ?X wdt:P747 ?answer }","paraphrases":["What is the League of Legends runtime edition?"],"info":{}}
{"id":"train_191","question":"Which is the sauce that originated in Korea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P495 wd:Q18097 . ?sbj wdt:P31 wd:Q178359 }","paraphrases":[],"info":{}}
{"id":"train_194","question":"Who gave the {is shown in} of {based upon} of {Clark Kent} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q774772 wdt:P144 ?X . ?X wdt:P1441 ?answer }","paraphrases":["Who gave the {is appeared in} of {based upon} of {Clark Kent} ?"],"info":{}}
{"id":"train_196","question":"Tell me national association football team whose name has the word team in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6979593 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'team' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me national association football team whose name has the word team in it."],"info":{}}
{"id":"train_197","question":"Tell me the most notable work of Christopher Hitchens and also the publisher.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P123 ?value1 . }","paraphrases":["Tell me the most high-quality work of Christopher Hitchens and additionally the publisher."],"info":{}}
{"id":"train_199","question":"What is the warheroes.ru ID for Yuri Gagarin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7327 wdt:P2943 ?answer }","paraphrases":[],"info":{}}
{"id":"train_201","question":"Is the stated age of Rolf-Axel Eberhardt greater than 52?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q50334841 wdt:P3629 ?obj filter ( ?obj > 52.0 ) }","paraphrases":["Is Rolf - Axel Eberhardt's stated age greater than 52?"],"info":{}}
{"id":"train_202","question":"When Podgorica started as Principality of Montenegro?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23564 p:P17 ?s . ?s ps:P17 wd:Q779011 . ?s pq:P580 ?value }","paraphrases":["When did Podgorica start as Principality of Montenegro?"],"info":{}}
{"id":"train_203","question":"IS THE ENTHALPY OF VAPORIZATION OF METHANOL IS EQUAL TO 37400","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q14982 wdt:P2116 ?obj filter ( ?obj = 37400 ) }","paraphrases":["Does the total quantity of Methanol Vaporization equal 37400?"],"info":{}}
{"id":"train_205","question":"what is Tuesday named after?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q127 p:P138 ?s . ?s ps:P138 wd:Q201 . ?s pq:P407 ?value }","paraphrases":["Where does Tuesday get its name from?"],"info":{}}
{"id":"train_206","question":"How many of the archives are for Grace Hopper?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q11641 wdt:P485 ?obj }","paraphrases":["Out of the archives, which are for Grace Hopper?"],"info":{}}
{"id":"train_208","question":"Where is the place of Tartuffe's first performance with the farthest east coordinates of 48.8363848 2.4697602?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q205875 wdt:P4647 ?answer . ?answer wdt:P1334 ?x FILTER ( contains ( ?x , '48.8363848 2.4697602' ) ) }","paraphrases":["Where is the put of Tartuffe's to begin with execution with the most remote east facilitates of 48.8363848 2.4697602?"],"info":{}}
{"id":"train_211","question":"Who is the mother and husband of Candice Bergen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q106942 wdt:P25 ?ans_1 . wd:Q106942 wdt:P26 ?ans_2 }","paraphrases":["Who are Candice Bergen's parents?"],"info":{}}
{"id":"train_212","question":"\"Which language written from Romy Schneider, has the grammatical person speaking as the third personal plural?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q78469 wdt:P1412 ?answer . ?answer wdt:P5110 wd:Q51929517 }","paraphrases":["\"Which dialect composed from Romy Schneider, has the syntactic individual talking as the third individual plural?\""],"info":{}}
{"id":"train_214","question":"Who is the opposite of the superhero?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q188784 wdt:P461 ?obj . ?obj wdt:P31 wd:Q636497 }","paraphrases":["What is the superhero's opposite?"],"info":{}}
{"id":"train_215","question":"What is the use of playing World Rugby?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q369225 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["What is the utilize of playing World Rugby?"],"info":{}}
{"id":"train_216","question":"What is the current population of Aden?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131694 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q791801 }","paraphrases":["How many people do currently live in Aden?"],"info":{}}
{"id":"train_218","question":"How many numbers of exclave for the  {Azerbaijan} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P500 wd:Q227 }","paraphrases":["How many exclaves does Azerbaijan have?"],"info":{}}
{"id":"train_219","question":"Which is the total equity of Micron Technology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1197548 wdt:P2137 ?answer }","paraphrases":[],"info":{}}
{"id":"train_220","question":"Was Michael J. Fox's place of birth in Edmonton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q395274 wdt:P19 wd:Q2096 }","paraphrases":["Where was Michael J. Fox born?"],"info":{}}
{"id":"train_221","question":"What is Palace of Westminster's architect and heritage designation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q62408 wdt:P84 ?ans_1 . wd:Q62408 wdt:P1435 ?ans_2 }","paraphrases":["Tell me the architect and heritage designation of Westminster Palace."],"info":{}}
{"id":"train_222","question":"is it true that the SSK6-1s optimum viable temperature is greater than 24.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q29565582 wdt:P3253 ?obj filter ( ?obj > 24.0 ) }","paraphrases":["Is it correct to say that the SSK6-1s optimum workable temperature is greater than 24.0?"],"info":{}}
{"id":"train_224","question":"Name a nonmetal discovered in England  that starts with letter O","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19600 . ?sbj wdt:P189 wd:Q21 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a nonmetal found in Britain that begins with letter O"],"info":{}}
{"id":"train_225","question":"What did Sidney Crosby draft?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q311280 wdt:P647 ?answer }","paraphrases":[],"info":{}}
{"id":"train_226","question":"How many shogun military ranks are there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P410 wd:Q131767 }","paraphrases":["What number of shogun military ranks exist?"],"info":{}}
{"id":"train_227","question":"Who was presumably thought to be a student of Strabo?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q45936 p:P1066 ?s . ?s ps:P1066 ?obj . ?s pq:P1480 wd:Q18122778 }","paraphrases":["Strabo's student was presumably known as who?"],"info":{}}
{"id":"train_233","question":"Is it true that the fee of Harvard University is less than 90?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13371 wdt:P2555 ?obj filter ( ?obj < 90.0 ) }","paraphrases":["Is the fee for Harvard University is less than 90?"],"info":{}}
{"id":"train_235","question":"Who is the captain of F.C. Porto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q128446 wdt:P634 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the captain of F.C. Porto?"],"info":{}}
{"id":"train_236","question":"What are the autonomous region of the People's Republic of China which start with the letter X","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q57362 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the independent locale of the People's Republic of China which begin with the letter X"],"info":{}}
{"id":"train_237","question":"What is the time zone that Marseille is located in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23482 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q1777301 }","paraphrases":["where is the  Marseille is located in?"],"info":{}}
{"id":"train_238","question":"What award did Harry Martinson adn Eyvind Johnson receive together?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q132695 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q131326 }","paraphrases":["Which award was given to both Harry Martinson and Eyvind Johnson?"],"info":{}}
{"id":"train_239","question":"Mention the headquarter location of the Russian Orthodox Church monastery.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q60995 wdt:P159 ?obj . ?obj wdt:P31 wd:Q44613 }","paraphrases":["Say the headquarter area of the Russian Standard Church monastery."],"info":{}}
{"id":"train_241","question":"Who are the writers of the academic subject Ten simple rules for editing Wikipedia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21145331 wdt:P50 ?X . ?X wdt:P101 ?answer }","paraphrases":["Who are the scholars of the scholastic subject Ten basic rules for altering Wikipedia?"],"info":{}}
{"id":"train_242","question":"Name the female who discovered the Horsehead Nebula.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14271 wdt:P61 ?answer . ?answer wdt:P21 wd:Q6581072 }","paraphrases":["Title the female who found the Horsehead Cloud."],"info":{}}
{"id":"train_243","question":"Name a fruit composed of Citrullus lanatus that starts with letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1364 . ?sbj wdt:P1582 wd:Q17507129 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a fruit composed of Citrullus lanatus that starts offevolved with letter W"],"info":{}}
{"id":"train_244","question":"What conflict is depicted is Raising the Flag on Iwo Jima?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q117693 wdt:P180 ?X . ?X wdt:P607 ?answer }","paraphrases":["Which conflict is depicted by the Raising of the Flag on Iwo Jima?"],"info":{}}
