{"id":"train_16720","question":"What significant event happened to Melinda Gates, and where did it happen?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q463877 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P276 ?value1 . }","paraphrases":["What great tournament befell to Melinda Gates, and where did it happen?"],"info":{}}
{"id":"train_16722","question":"WHO PLAYED PORTRAYED IN CAMP MEETING ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5027402 wdt:P175 ?X . ?X wdt:P1303 ?answer }","paraphrases":["In Camp Meeting, who played the character of Portrayed?"],"info":{}}
{"id":"train_16725","question":"Which is the scalar physical quantity which starts with the letter v?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q181175 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the scalar physical quantity which begins with the letter v?"],"info":{}}
{"id":"train_16727","question":"Where did Errol Flynn marry Nora Eddington?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q93188 p:P26 ?s . ?s ps:P26 wd:Q3343444 . ?s pq:P2842 ?value }","paraphrases":["What was the place of marriage of Errol Flynn and Nora Eddington?"],"info":{}}
{"id":"train_16728","question":"The humerus has what muscle origin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q162595 wdt:P3490 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16729","question":"How many notable works are done by the  {The Simpsons} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P800 wd:Q886 }","paraphrases":["Which notable works were done by The Simpsons?"],"info":{}}
{"id":"train_16730","question":"Who plays the medium of shovel ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7220961 wdt:P186 ?X . ?X wdt:P1535 ?answer }","paraphrases":["Who plays the medium of scoop ?"],"info":{}}
{"id":"train_16734","question":"Tell me the Palace that starts with t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16560 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the Royal residence that begins with t"],"info":{}}
{"id":"train_16735","question":"what is the alkane of NFPA 704: Standard System for the Identification of the Hazards of Materials for Emergency Response that starts with letter \"p\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41581 . ?sbj wdt:P4952 wd:Q51139288 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is the alkane of NFPA 704: Standard System for the Identification of the Hazards of Materials for Emergency Response that begins with letter \"p\""],"info":{}}
{"id":"train_16737","question":"IS THE MAXIMUM THRUST OF CONCORDE IS LESS THAN 669120.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6505 wdt:P2228 ?obj filter ( ?obj < 669120.0 ) }","paraphrases":["IS THE Greatest Pushed OF CONCORDE IS LESS THAN 669120.0"],"info":{}}
{"id":"train_16738","question":"What did Gavin McInnes major in at Concordia University and what was his degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q5528217 p:P69 ?s . ?s ps:P69 wd:Q326342 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What did Gavin McInnes foremost in at Concordia University and what was once his degree?"],"info":{}}
{"id":"train_16739","question":"tell me protestentism that starts with h","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23540 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know protestentism that begins with h"],"info":{}}
{"id":"train_16740","question":"What is in the category of Emmanuel Macron?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3052772 wdt:P2035 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16741","question":"What is the significance of the Rembrandt House Museum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5598 wdt:P551 ?obj . ?obj wdt:P31 wd:Q16735822 }","paraphrases":["What is the importance of the Rembrandt House Museum?"],"info":{}}
{"id":"train_16743","question":"When did Sub-Saharan Africa have a number of out of school children of 9.06105e+07?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132959 p:P2573 ?s . ?s ps:P2573 ?x filter ( contains ( ?x , '9.06105e+07' ) ) . ?s pq:P585 ?value }","paraphrases":["Sub-Saharan Africa had many out of school children of 9.06105e+07 during which time?"],"info":{}}
{"id":"train_16744","question":"who chairwoman of club played for of romário ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178649 wdt:P54 ?X . ?X wdt:P488 ?answer }","paraphrases":["who administrator of club played for of romário ?"],"info":{}}
{"id":"train_16746","question":"Name the mother and the date on which she gave birth to Joseph Stalin having child Svetlana Alliluyeva","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q228584 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["Who was the mother of Svetlana Alliluyeva, the child of Joseph Stalin, and what is her date of birth?"],"info":{}}
{"id":"train_16751","question":"Tell me economic sector whose name has the word service in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3958441 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'service' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know financial division whose title has the word benefit in it."],"info":{}}
{"id":"train_16752","question":"What are the resort  which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q875157 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the resort which begin with the letter s"],"info":{}}
{"id":"train_16754","question":"WHICH IS THE FUNDAMETAL INTERACTION THE CONTAINS THE WORD INTERACTION IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q104934 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'interaction' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT IS THE FUNDAMETAL INTERACTION THE WORLD INTERACTION IN THE NAME"],"info":{}}
{"id":"train_16756","question":"What physically interacts with food?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P129 wd:Q2095 }","paraphrases":["Which interacts physically with food?"],"info":{}}
{"id":"train_16757","question":"Name a trade association that starts with the letter O","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2178147 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["give me the name trade association that starts with the letter O"],"info":{}}
{"id":"train_16760","question":"Where and when did John Foster Dulles hold the position of diplomat?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q223677 p:P39 ?s . ?s ps:P39 wd:Q193391 . ?s pq:P585 ?value1 . ?s pq:P276 ?value2 }","paraphrases":["Where and when did John Foster Dulles preserve the function of diplomat?"],"info":{}}
{"id":"train_16761","question":"what is sea monster that starts with t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q920028 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is ocean beast that begins with t"],"info":{}}
{"id":"train_16762","question":"What is the administrative territorial entity of Timothy Dalton who was born at Colwyn Bay?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41233 p:P19 ?s . ?s ps:P19 wd:Q527467 . ?s pq:P131 ?value }","paraphrases":["What is Timothy Dalton's, born at Colwyn Bay, administrative territorial entity?"],"info":{}}
{"id":"train_16763","question":"Who is the {country within the United Kingdom} for {facet of} of {history of England}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11755949 wdt:P1269 ?obj . ?obj wdt:P31 wd:Q3336843 }","paraphrases":["which country is the facet of the history of England?"],"info":{}}
{"id":"train_16765","question":"Which is the vessel class of the galleon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P289 wd:Q181469 }","paraphrases":[],"info":{}}
{"id":"train_16766","question":"Tell me the comics character which start with letter v.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1114461 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which comic character starts with \"v\"?"],"info":{}}
{"id":"train_16767","question":"When did Dale Bumpers' position as Governor of Arkansas end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q881361 p:P39 ?s . ?s ps:P39 wd:Q20765963 . ?s pq:P582 ?value }","paraphrases":["Until what year was Dale Bumpers Governor of Arkansas?"],"info":{}}
{"id":"train_16768","question":"What position did Rodrigo Duterte hold afteer Benigno Aquino III?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q457786 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q1464 }","paraphrases":["In what job was Rodrigo Duterte placed following Benigno Aquino III?"],"info":{}}
{"id":"train_16770","question":"Name an academic major that starts with the letter E","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4671286 . ?sbj wdt:P3095 wd:Q188094 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title an scholarly major that begins with the letter E"],"info":{}}
{"id":"train_16772","question":"What is the detection method of that which is orbited by Tau Ceti?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15820 wdt:P398 ?X . ?X wdt:P1046 ?answer }","paraphrases":["What is the location strategy of that which is circled by Tau Ceti?"],"info":{}}
{"id":"train_16773","question":"Which is the fictional person inspired by George II of Great Britain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P941 wd:Q131981 . ?sbj wdt:P31 wd:Q15632617 }","paraphrases":["Which character is inspired by George II of Great Britain?"],"info":{}}
{"id":"train_16775","question":"Which chemical element follows silicon in the periodic table?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q670 p:P31 ?s . ?s ps:P31 wd:Q11344 . ?s pq:P155 ?value }","paraphrases":["What periodic element comes after silicon in the periodic table?"],"info":{}}
{"id":"train_16776","question":"What started in 1923-11-3 in Yekaterinburg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q887 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1923' ) ) }","paraphrases":["Name the event that begun on 3.11.1923 in Yekaterinburg."],"info":{}}
{"id":"train_16777","question":"Who is the voice actor of Super Smash Bros Melee in the character role of Nobuyuki Hiyama?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1052131 p:P725 ?s . ?s ps:P725 wd:Q2273472 . ?s pq:P453 ?value }","paraphrases":["Who voices Nobuyuki Hiyami in Super Smash brothers melee?"],"info":{}}
{"id":"train_16778","question":"How many field occupants are there for the {retail} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P425 wd:Q126793 }","paraphrases":["What is the number of field occupants for retail?"],"info":{}}
{"id":"train_16780","question":"Who first described ferrocerium and was taught by Adolf Lieben?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q759260 wdt:P61 ?answer . ?answer wdt:P1066 wd:Q84771 }","paraphrases":["Who to begin with depicted ferrocerium and was instructed by Adolf Lieben?"],"info":{}}
{"id":"train_16781","question":"What is the adaptation of the Sneezy narrative?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27148737 wdt:P1441 ?X . ?X wdt:P144 ?answer }","paraphrases":["What is the adjustment of the Sneezy narrative?"],"info":{}}
{"id":"train_16782","question":"When did Libya become a member of Arab League?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1016 p:P463 ?s . ?s ps:P463 wd:Q7172 . ?s pq:P580 ?value }","paraphrases":["On which date did Libya become a member of Arab League?"],"info":{}}
{"id":"train_16783","question":"Which is the volcano observatory for Haleakalā?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q515719 wdt:P3815 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16786","question":"What is the European Fashion creator ID for Diane von Furstenberg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q272438 wdt:P3482 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16787","question":"What position did Sergei Witte start on 11-6-1905?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q155329 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1905' ) ) }","paraphrases":["On 11-6-1905, what rank did Sergei Witte hold?"],"info":{}}
{"id":"train_16789","question":"What is the treated by of the signs of dengue fever?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q30953 wdt:P780 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What is the treated by of the signs of dengue fever?"],"info":{}}
{"id":"train_16790","question":"When did Weird Al Yankovic receive his Grammy Award for Best Concept Music video?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8349 p:P166 ?s . ?s ps:P166 wd:Q5593765 . ?s pq:P585 ?value }","paraphrases":["Weird Al Yankovic received a Grammy Award for Best Concept Music video. When was this?"],"info":{}}
{"id":"train_16792","question":"What is the record producer of the series of The Amazing Race 10 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3215578 wdt:P179 ?X . ?X wdt:P162 ?answer }","paraphrases":["Name the record producer of The Amazing Race 10 series."],"info":{}}
{"id":"train_16793","question":"Which is the recording or performance of Pavane, Op. 50?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2550 wd:Q923138 }","paraphrases":[],"info":{}}
{"id":"train_16795","question":"When did Beni Suef Governorate have a population of 3154100?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q30683 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '3154100' ) ) . ?s pq:P585 ?value }","paraphrases":["Give the date Beni Suef Governorate had a population of 3154100."],"info":{}}
{"id":"train_16796","question":"Steve Wozniak is associated with what company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q483382 wdt:P108 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":["What company does Steve Wozniak have an association with?"],"info":{}}
{"id":"train_16799","question":"Apollo is similar to which Celtic god?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P460 wd:Q37340 . ?sbj wdt:P31 wd:Q465434 }","paraphrases":["Apollo is comparative to which Celtic god?"],"info":{}}
{"id":"train_16800","question":"What what is public educational institution of the United States category for employees of the organization Category:Clemson University faculty and  also which that starts with c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23002039 . ?sbj wdt:P4195 wd:Q8382649 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is open instructive institution of the Joined together States category for representatives of the organization Category:Clemson College staff conjointly which that begins with c"],"info":{}}
{"id":"train_16802","question":"What is the artistic genre of Enûma Eliš that is distinguished from a poem?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q206063 wdt:P136 ?answer . ?answer wdt:P1889 wd:Q5185279 }","paraphrases":["What is the artistic genre of Enûma Eliš that is unique from a poem?"],"info":{}}
{"id":"train_16803","question":"Which is the number of cases for tuberculosis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12204 wdt:P1603 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16807","question":"Did Clark Gable marry Carole Lombard and Josephine Dillon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q71243 wdt:P26 wd:Q207739 . wd:Q71243 wdt:P26 wd:Q6288349 }","paraphrases":["Was Clark Gable married to Carole Lombard and Josephine Dillon?"],"info":{}}
{"id":"train_16808","question":"What is Nelly Don?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6990233 wdt:P1056 ?X . ?X wdt:P186 ?answer }","paraphrases":["How would you describe Nelly Don?"],"info":{}}
{"id":"train_16811","question":"Lactic acid contains what monomer and is used to treat what medical condition?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q161249 wdt:P4599 ?ans_1 . wd:Q161249 wdt:P2175 ?ans_2 }","paraphrases":["What monomer in the lactic acid which is used to treat what medical condition?"],"info":{}}
{"id":"train_16812","question":"What Transylvanian country ended in 1804?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q39473 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1804' ) ) }","paraphrases":["What's the name of the Transylvanian country that only existed up to 1804?"],"info":{}}
{"id":"train_16814","question":"How many matches Cha Bum-kun played as a member of the Bayer 04 Leverkusen team and how many goals did he score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q346751 p:P54 ?s . ?s ps:P54 wd:Q104761 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["How numerous matches Cha Bum-kun played as a part of the Bayer 04 Leverkusen group and how numerous objectives did he score?"],"info":{}}
{"id":"train_16816","question":"Who are some famous people educated at McGill University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P69 wd:Q201492 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Give me the name of some famous people educated at McGill University."],"info":{}}
{"id":"train_16817","question":"What town is Lyubov Kozyreval from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q261308 wdt:P27 ?X . ?X wdt:P150 ?answer }","paraphrases":["What town is Lyubov Kozyreval from?"],"info":{}}
{"id":"train_16818","question":"na","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2024618 wdt:P4791 ?X . ?X wdt:P937 ?answer }","paraphrases":["North America"],"info":{}}
{"id":"train_16819","question":"Is Will Ferrell married to Viveca Paulin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q218503 wdt:P26 wd:Q1646271 }","paraphrases":["Is Will Ferrell the husband of Viveca Paulin?"],"info":{}}
{"id":"train_16820","question":"who is the discoverer or inventor of gamma function?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q190573 wdt:P61 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who discovered the gamma function?"],"info":{}}
{"id":"train_16821","question":"Do you know Dan Gable's ID in the Iowa Sports Hall of Fame.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q238551 wdt:P4631 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16822","question":"What is the direction in relation to the location of Mesopotamia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q11767 wdt:P654 ?ans_1 . wd:Q11767 wdt:P276 ?ans_2 }","paraphrases":["In which direction is the location from Mesopotamia?"],"info":{}}
{"id":"train_16823","question":"Is the draft of the Far West equal to 0.912?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5434620 wdt:P2262 ?obj filter ( ?obj = 0.912 ) }","paraphrases":["Would the draft of the Far West equal to 0.912?"],"info":{}}
{"id":"train_16825","question":"Terry Pratchett was nominated for which medal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q46248 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q131647 }","paraphrases":["Terry Pratchett was assigned for which medal?"],"info":{}}
{"id":"train_16828","question":"where did Jammu_and_Kashmir office hold by head of state and office hold by head of government?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1180 wdt:P1906 ?ans_1 . wd:Q1180 wdt:P1313 ?ans_2 }","paraphrases":["Which head of government and state were Jammu and Kashmir?"],"info":{}}
{"id":"train_16829","question":"What are the stable version on each platform for Assassin's Creed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q420292 wdt:P400 ?X . ?X wdt:P348 ?answer }","paraphrases":["What are the steady form on each stage for Assassin's Creed?"],"info":{}}
{"id":"train_16830","question":"What was the population of Karlsruhe at the end of 2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1040 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["How many people lived in Karlsruhe at the end of 2000?"],"info":{}}
{"id":"train_16831","question":"What is the recurring tournament that starts with the letter w?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15259995 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the routine match that starts with the letter w?"],"info":{}}
{"id":"train_16833","question":"What was the name of Stan Laurel's spouse that ended on 1965-2-3?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q72869 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1965' ) ) }","paraphrases":["Who was Stan Laurel married to that he divorced on Feburary 2, 1965?"],"info":{}}
{"id":"train_16834","question":"Tell me the ceremonial county of England that starts with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q180673 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the ceremonial county of England that starts with the letter y"],"info":{}}
{"id":"train_16835","question":"Who is the employer of the {Hans Krebs} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q57191 wdt:P108 ?obj }","paraphrases":["Give me the name of the employer of Hans Krebs."],"info":{}}
