{"id":"train_1473","question":"What is governed by the Warsaw Pact effective from 12th March 1967?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41644 p:P4791 ?s . ?s ps:P4791 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1967' ) ) }","paraphrases":["Effective as of the 12th of March, 1967, what does the Warsaw pact govern?"],"info":{}}
{"id":"train_1474","question":"How many siblings does Fú Jiān have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3373 wd:Q967998 }","paraphrases":["How many brothers and sisters does Fu Jian have?"],"info":{}}
{"id":"train_1475","question":"What is the series ordinal for chairperson Kaoru Kamata at Waseda University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q274486 p:P488 ?s . ?s ps:P488 wd:Q10854980 . ?s pq:P1545 ?value }","paraphrases":["Chairperson Kaoru Kamata of Waseda University has what series ordinal?"],"info":{}}
{"id":"train_1476","question":"When does La Plata?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q44059 p:P138 ?s . ?s ps:P138 wd:Q40933 . ?s pq:P580 ?value }","paraphrases":["La Plata is when?"],"info":{}}
{"id":"train_1477","question":"Give the chemical compound with the least speed of sound who is part hydrogen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2075 ?obj . ?ent wdt:P527 wd:Q556 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the hydrogen chemical compund with the least speed of sound?"],"info":{}}
{"id":"train_1478","question":"Which is the fruit type of nut?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4000 wd:Q11009 }","paraphrases":[],"info":{}}
{"id":"train_1480","question":"What is the monomer of polyvinyl chloride","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4599 wd:Q146368 . ?sbj wdt:P31 wd:Q10913792 }","paraphrases":["What is the monomer of PVC?"],"info":{}}
{"id":"train_1481","question":"What is the quality of old age?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1552 wd:Q191089 }","paraphrases":[],"info":{}}
{"id":"train_1482","question":"Who is the sponsor of Henry Luce?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1962 wd:Q516473 }","paraphrases":[],"info":{}}
{"id":"train_1483","question":"Which musician is successor of Sleeping Beauty.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7539845 wdt:P156 ?X . ?X wdt:P175 ?answer }","paraphrases":["What is the  name of the musician that is successor of Sleeping Beauty?"],"info":{}}
{"id":"train_1484","question":"who brother of 1st place medalist of Screen actors guild life achievement award ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1631998 wdt:P1346 ?X . ?X wdt:P3373 ?answer }","paraphrases":["who brother of 1st put medalist of Screen performing artists society life accomplishment grant ?"],"info":{}}
{"id":"train_1489","question":"At what point in time, and in which league did Mike Trout receive his award as MVP?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3090378 p:P166 ?s . ?s ps:P166 wd:Q1514249 . ?s pq:P585 ?value1 . ?s pq:P118 ?value2 }","paraphrases":["At what factor in time, and in which league did Mike Trout receive his award as MVP?"],"info":{}}
{"id":"train_1492","question":"Mention the horse used by Robert E. Lee during mounting.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q165557 wdt:P3091 ?obj . ?obj wdt:P31 wd:Q726 }","paraphrases":["Mention of the horse used during mounting by Robert E. Lee."],"info":{}}
{"id":"train_1493","question":"Did Reinhard Heydrich die of cholangitis and/or ballistic trauma?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q60039 wdt:P509 wd:Q603644 . wd:Q60039 wdt:P509 wd:Q2140674 }","paraphrases":["Is it true that Reinhard Heydrich died of cholangitis and/or ballistic trauma?"],"info":{}}
{"id":"train_1494","question":"Was the lowest atmospheric pressure recorded during the 1935 Labor Day Hurricane higher than 1070.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q206825 wdt:P2532 ?obj filter ( ?obj > 1070.4 ) }","paraphrases":["During the 1935 Labor Day Hurricane, did they ever record an atmospheric pressure lower than 1070.4?"],"info":{}}
{"id":"train_1497","question":"For what Walter Huston nominated for The Treasure of the Sierra Madre?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q251559 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q162621 }","paraphrases":["In what category did Walter Huston get nominated for The Treasure of the Sierra Madre?"],"info":{}}
{"id":"train_1499","question":"Is it true that the memory capacity of the diskette equals to 1152?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5293 wdt:P2928 ?obj filter ( ?obj = 1152.0 ) }","paraphrases":["Is it genuine that the memory capacity of the diskette breaks even with to 1152?"],"info":{}}
{"id":"train_1501","question":"which of the villages has endemism of leafy seadragon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q501644 wdt:P183 ?X . ?X wdt:P150 ?answer }","paraphrases":["which of the towns has endemism of verdant seadragon?"],"info":{}}
{"id":"train_1503","question":"What is bordered by Netherlands Antilles and is located in the administrative unit of Amiens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41604 wdt:P131 ?answer . ?answer wdt:P47 wd:Q25227 }","paraphrases":["What is bordered by Netherlands Antilles and is found within the authoritative unit of Amiens?"],"info":{}}
{"id":"train_1504","question":"Which is the INEGI locality ID for Torreón?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q386991 wdt:P1976 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1506","question":"Mention the symptoms and the signs resulting from the tantalum","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1123 wdt:P1542 ?X . ?X wdt:P780 ?answer }","paraphrases":["Mention the symptoms and the signs and symptoms ensuing from the tantalum"],"info":{}}
{"id":"train_1509","question":"Tell me a civil parish that begins with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1115575 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know a gracious area that starts with the letter w"],"info":{}}
{"id":"train_1510","question":"How many discoveries have been made concerning radial velocity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1046 wd:Q240105 }","paraphrases":["Research concerning radial velocity has been discovered how many times?"],"info":{}}
{"id":"train_1511","question":"What is the used language of Jack Nicklaus, that has AWLD statues and is 1 safe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9424 wdt:P1412 ?answer . ?answer wdt:P1999 wd:Q20672086 }","paraphrases":["What is Jack Nicklaus ' used language, which has AWLD statues and is 1 safe"],"info":{}}
{"id":"train_1512","question":"Where there 3.2 perpetrators in the Enoch Brown school massacre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1297497 wdt:P3886 ?obj filter ( ?obj = 3.2 ) }","paraphrases":["Were the number of perpetrators in the Enoch Brown school massacre equal to 3.2?"],"info":{}}
{"id":"train_1513","question":"who enterprise for subsidiary of Sears?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P355 wd:Q6499202 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["Who is the for-profit parent company of Sears?"],"info":{}}
{"id":"train_1514","question":"How much acreage is the death place of Saul Bass?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q536884 wdt:P20 ?X . ?X wdt:P2046 ?answer }","paraphrases":["At the death place of Saul Bass, how much acreage was there?"],"info":{}}
{"id":"train_1515","question":"Which is the CERO rating for The Legend of Zelda?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12395 wdt:P853 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1516","question":"Who gave the{typology} of {language native} of {Uyghur people} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q46118 wdt:P103 ?X . ?X wdt:P4132 ?answer }","paraphrases":["Who gave the{typology} of {dialect local} of {Uyghur individuals} ?"],"info":{}}
{"id":"train_1517","question":"What is the female population of Karlovy Vary Region which has a total population of 150262.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q191091 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P1539 ?x filter ( contains ( ?x , '150262.0' ) ) }","paraphrases":["The Karlovy Vary Region has a total population of 150262. What is the percentage of females?"],"info":{}}
{"id":"train_1518","question":"When is the British museum open?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q6373 p:P3025 ?s . ?s ps:P3025 ?obj . ?s pq:P3027 ?value1 . }","paraphrases":["When is the British historical center open?"],"info":{}}
{"id":"train_1519","question":"What is the edition of the game platform of Star Trek Online?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1143426 wdt:P400 ?X . ?X wdt:P747 ?answer }","paraphrases":["what is the edition name of star trek"],"info":{}}
{"id":"train_1520","question":"What major event happened to Alfred Doblin and were did it happen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57389 wdt:P793 ?X . ?X wdt:P276 ?answer }","paraphrases":["What main tournament befell to Alfred Doblin and have been did it happen?"],"info":{}}
{"id":"train_1522","question":"What part of North Dakota is located in the Mountain Time Zone?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1207 p:P421 ?s . ?s ps:P421 wd:Q3134980 . ?s pq:P518 ?value }","paraphrases":["Give me the part of North Dakota that is located in the Mountain Time Zone."],"info":{}}
{"id":"train_1523","question":"When was Niels Bohr nominated for a Nobel Prize in Physics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7085 p:P1411 ?s . ?s ps:P1411 wd:Q38104 . ?s pq:P585 ?value }","paraphrases":["When was Niels Bohr shortlisted for the Nobel Prize in Physics?"],"info":{}}
{"id":"train_1525","question":"What was the total size of exhibition of Prado National Museum in the year 2012?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q160112 p:P1436 ?s . ?s ps:P1436 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2012' ) ) }","paraphrases":["Which is the total size of the exhibition of Prado National Museum in 2012?"],"info":{}}
{"id":"train_1530","question":"Is the position angle of the southwest by west equal 236.25?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q20968403 wdt:P2211 ?obj filter ( ?obj = 236.25 ) }","paraphrases":["Does southwest by west have a position angle of 236.25?"],"info":{}}
{"id":"train_1531","question":"tell me the agriculture revolution that contains the word revolution in their own name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6499967 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'revolution' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tell me the agriculture revolution that incorporates the phrase revolution in their very own name."],"info":{}}
{"id":"train_1534","question":"where is the powerpoint of  steam turbine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P516 wd:Q189859 }","paraphrases":[],"info":{}}
{"id":"train_1537","question":"What is the Mémoire du cyclisme cyclist ID for Bradley Wiggins?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q193876 wdt:P4516 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1543","question":"Is the nominal GDP per capita of Poland less than 15065.46?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q36 wdt:P2132 ?obj filter ( ?obj < 15065.46 ) }","paraphrases":["Does Poland have a nominal GDP per capita of less than 15065.45?"],"info":{}}
{"id":"train_1545","question":"Are Calophyllum inophyllum and Jasminum official symbols of Andhra Pradesh?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1159 wdt:P2238 wd:Q311471 . wd:Q1159 wdt:P2238 wd:Q82014 }","paraphrases":["Do the official symbols of Andhra Pradesh include Calophyllum inophyllum and Jasminum?"],"info":{}}
{"id":"train_1546","question":"Does the boiling point of the hexadecane equals 286.79?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q150843 wdt:P2102 ?obj filter ( ?obj = 286.79 ) }","paraphrases":["What is the boiling point of hexadecane?"],"info":{}}
{"id":"train_1547","question":"Who is the maker of the board game Score?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q47007593 wdt:P123 ?X . ?X wdt:P1056 ?answer }","paraphrases":["Who is the creator of the tabletop game Score?"],"info":{}}
{"id":"train_1550","question":"Which G-type main sequence star has the maximum stellar rotational velocity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5864 . ?ent wdt:P4296 ?obj . ?ent wdt:P31 wd:Q5864 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which G-type important sequence celebrity has the most stellar rotational velocity?"],"info":{}}
{"id":"train_1552","question":"A person who studies meteorology looks at what geosphere?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q25261 wdt:P2578 ?obj . ?obj wdt:P31 wd:Q241284 }","paraphrases":["A individual who considers meteorology looks at what geosphere?"],"info":{}}
{"id":"train_1554","question":"Is the numeric value of the Boltzmann constant less than 1.6567788e-23?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5962 wdt:P1181 ?obj filter ( ?obj < 1.6567788e-23 ) }","paraphrases":["Is the numeric esteem of the Boltzmann steady less than 1.6567788e-23?"],"info":{}}
{"id":"train_1555","question":"Are there more than 3.6 floors below ground of the Plaza 66.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q543353 wdt:P1139 ?obj filter ( ?obj > 3.6 ) }","paraphrases":["Are there more than 3.6 floors underneath ground of the Square 66."],"info":{}}
{"id":"train_1556","question":"Give the central processing unit with the lowest thermal design power whose part of the class is L3 cache?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5300 . ?ent wdt:P2229 ?obj . ?ent wdt:P2670 wd:Q28972917 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["what give the central processing unit with the lowest unit with the lowest thermal design power whose part of the class is L3 cache?"],"info":{}}
{"id":"train_1557","question":"What is Paolo Gentiloni academic degree and academic major at Laurea magistrale (Italy)?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q1071031 p:P512 ?s . ?s ps:P512 wd:Q4000966 . ?s pq:P69 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["What is Paolo Gentiloni scholarly degree and scholastic major at Laurea magistrale (Italy)?"],"info":{}}
{"id":"train_1559","question":"How many people are in the Labour Party?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q9630 wdt:P2124 ?obj }","paraphrases":["Which is the number of people that are in the Labour Party?"],"info":{}}
{"id":"train_1561","question":"What are the giants for Heracles ' murder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P157 wd:Q122248 . ?sbj wdt:P31 wd:Q191192 }","paraphrases":["What are the monsters for Heracles ' murder?"],"info":{}}
{"id":"train_1562","question":"What is venous drainage for hand ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q33767 wdt:P2289 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1567","question":"When was William Ramsay nominated for a Nobel Prize in Chemistry?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q950726 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value }","paraphrases":["During which year was William Ramsay nomited for the Nobel Prize in Chemistry?"],"info":{}}
{"id":"train_1568","question":"Who designed the nuclear weapons tests for the Manhattan Project?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P287 wd:Q127050 . ?sbj wdt:P31 wd:Q210112 }","paraphrases":["Who planned the atomic weapons tests for the Manhattan Project?"],"info":{}}
{"id":"train_1569","question":"which building has the highest cost?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q41176 . ?ent wdt:P2130 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the most expensive building?"],"info":{}}
{"id":"train_1570","question":"Who is the  {strip mall} for {architectural style} of {Bauhaus}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P149 wd:Q124354 . ?sbj wdt:P31 wd:Q7624088 }","paraphrases":["Who is the { strip mall } of { bauhaus } for { architectural style }"],"info":{}}
{"id":"train_1571","question":"When did Alan Greenspan leave his position as Chair of the Federal Reserve?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q193635 p:P39 ?s . ?s ps:P39 wd:Q2666591 . ?s pq:P582 ?value }","paraphrases":["Alan Greenspan left his position as Chair of the Federal Reserve on what date?"],"info":{}}
{"id":"train_1572","question":"What {civilisation} {denominates} {Yazdegerd III} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q208463 wdt:P140 ?X . ?X wdt:P2596 ?answer }","paraphrases":["What {civilisation} {denominates} {Yazdegerd III} ?"],"info":{}}
{"id":"train_1573","question":"What is KEPN ID for Wolverhampton ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q126269 wdt:P3639 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1576","question":"When did Ireland have a population of 2.85265e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q27 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '2.85265e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["Ireland had a population of 2.85265e+06 in which year?"],"info":{}}
{"id":"train_1578","question":"What isEncyclopædia Britannica Online ID for ton ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11247037 wdt:P1417 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1579","question":"Did Sarah Silverman play the guitar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q229013 wdt:P1303 wd:Q6607 }","paraphrases":["Did Sarah Silverman knows to play the guitar?"],"info":{}}
{"id":"train_1580","question":"What are the inhabitants of the location where Alexander Fleming died?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37064 wdt:P20 ?X . ?X wdt:P1082 ?answer }","paraphrases":["In the location where Alexander Fleming died, who are the inhabitants?"],"info":{}}
{"id":"train_1581","question":"What is the name of a tournament that starts with the letter w.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q500834 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a competition that begins with the letter w."],"info":{}}
{"id":"train_1584","question":"Did Katrina Kaif make films?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9550 wdt:P1283 wd:Q20814599 }","paraphrases":["Who did this film?"],"info":{}}
{"id":"train_1585","question":"Who is the person that was influenced by Hypatia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11903 wdt:P737 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who did Hypatia influence?"],"info":{}}
{"id":"train_1586","question":"who titleholder of nomination received of nebraska ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3337646 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who is the titleholder in Nebraska of the nomination?"],"info":{}}
{"id":"train_1588","question":"Is the flattening of Venus zero?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q313 wdt:P1102 ?obj filter ( ?obj = 0 ) }","paraphrases":["Is Venus ' flattening zero?"],"info":{}}
{"id":"train_1589","question":"Was Niki Lauda member of Scuderia Ferrari and Renault F1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q78489 wdt:P54 wd:Q169898 . wd:Q78489 wdt:P54 wd:Q172722 }","paraphrases":["Is it true that Niki Lauda was a member of the Scuderia Ferrari and Renault F1?"],"info":{}}
{"id":"train_1591","question":"What college libraries are at Yale University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P276 wd:Q49112 . ?sbj wdt:P31 wd:Q1622062 }","paraphrases":["What are the names of the colleges at Yale University?"],"info":{}}
{"id":"train_1592","question":"Who created Memoires d'Outre-Tombe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2263221 wdt:P50 ?X . ?X wdt:P19 ?answer }","paraphrases":["Tell me who created Memoores d'Oure-Tombre."],"info":{}}
{"id":"train_1593","question":"What award did Dirk Nowitzki receive in 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q44068 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["In 2011, what award was given Dirk Nowitzki?"],"info":{}}
{"id":"train_1594","question":"Which is the Encyclopaedia Metallum artist ID for Dave Grohl?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12006 wdt:P1989 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1595","question":"Florentino Perez is a member of what political party whose start time was 1982-0-0","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q245207 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1982' ) ) }","paraphrases":["What party does Florentino Perez's belong to since 1982?"],"info":{}}
{"id":"train_1596","question":"How many people self-identify as Democrats?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q29552 p:P2124 ?s . ?s ps:P2124 ?obj . ?s pq:P887 wd:Q7141040 }","paraphrases":["Give me the number of people self-identify as Democrats?"],"info":{}}
{"id":"train_1597","question":"When was Forrest Gump publication date","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q134773 wdt:P577 ?obj }","paraphrases":["In what year did Forrest Gump come out?"],"info":{}}
{"id":"train_1598","question":"Tell me the opera that location of first performance is the Theater auf der Wieden and which that starts with the letter f","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1344 . ?sbj wdt:P4647 wd:Q673479 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the opera that vicinity of first performance is the Theater auf der Wieden and which that starts with the letter f"],"info":{}}
{"id":"train_1599","question":"Which brother of Atahualpa has sons?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q179577 wdt:P3373 ?X . ?X wdt:P40 ?answer }","paraphrases":["Which sibling of Atahualpa has children?"],"info":{}}
{"id":"train_1600","question":"was zodiac killer's occupation serial killer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q218148 wdt:P106 wd:Q484188 }","paraphrases":["Did Zodiac Killer have serial killer as an occupation?"],"info":{}}
{"id":"train_1602","question":"Where is incumbent of professorship position of John Budden ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6223791 wdt:P803 ?X . ?X wdt:P1308 ?answer }","paraphrases":["The professorship position of John Budden is located where?"],"info":{}}
