{"id":"train_13026","question":"Was Catherine of Aragon's given name Katherine and Catalina ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q162819 wdt:P735 wd:Q108631 . wd:Q162819 wdt:P735 wd:Q5051251 }","paraphrases":["Was the given name of Catherine of Aragon Katherine and Catalina?"],"info":{}}
{"id":"train_13027","question":"What is the location of work for Anais Nin, that's municipalities are the 7th Arrondissement in Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q220018 wdt:P937 ?answer . ?answer wdt:P150 wd:Q259463 }","paraphrases":["What is the area of work for Anais Nin, that's regions are the 7th Arrondissement in Paris?"],"info":{}}
{"id":"train_13028","question":"which sport team was Younus Khan a member of in 2007","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3352654 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2007' ) ) }","paraphrases":["What sports team did Younus Khan play for in 2007?"],"info":{}}
{"id":"train_13030","question":"At which field of study is Jacques Halbronn a supervisor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3159075 wdt:P184 ?X . ?X wdt:P101 ?answer }","paraphrases":["Which field of study is a supervisor for Jacques Halbronn?"],"info":{}}
{"id":"train_13031","question":"Which is the colonial empire that has as basic form of government the constitutional monarchy and that contains the word british in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1790360 . ?sbj wdt:P122 wd:Q41614 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'british' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the colonial realm that has as fundamental frame of government the sacred government which  contains the word british in it's name?"],"info":{}}
{"id":"train_13033","question":"WHAT IS THE ULTIMATE CAUSE OF NOODLE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192874 wdt:P1542 ?X . ?X wdt:P828 ?answer }","paraphrases":["WHAT IS THE Extreme CAUSE OF NOODLE"],"info":{}}
{"id":"train_13035","question":"Is it true that the number of abstentions of Japeri municipal election, 2016 for Councillor is greater than 16410?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q61868549 wdt:P5043 ?obj filter ( ?obj > 16410.0 ) }","paraphrases":["Were there greater than 16410 abstaining votes in the Japeri city election of 2016 for Councillor?"],"info":{}}
{"id":"train_13036","question":"What is the twinned administrative body of Qiqihar starting April 2008?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q205922 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2008' ) ) }","paraphrases":["Which twinned administrative body of Qiqihar started April 2008?"],"info":{}}
{"id":"train_13037","question":"What are the band concept which start with the letter Z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215380 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the band concept which begin with the letter Z"],"info":{}}
{"id":"train_13038","question":"When did Amy Adams receive an award at the Independent Spirit Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q481832 p:P166 ?s . ?s ps:P166 wd:Q311836 . ?s pq:P585 ?value }","paraphrases":["On what date did Amy Adams receive an award at the Independent Spirit Awards?"],"info":{}}
{"id":"train_13039","question":"Name the rural district of Germany that shares its border with Munich.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q1726 . ?sbj wdt:P31 wd:Q106658 }","paraphrases":["Title the country locale of Germany that offers its border with Munich."],"info":{}}
{"id":"train_13040","question":"Who follows Berengar 1 of Italy as monarch of Italy","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q274606 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Who follows Italy's Berengar 1 as Italian monarch"],"info":{}}
{"id":"train_13042","question":"Which is the COAM architect ID of Álvaro Siza Vieira?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q251365 wdt:P4488 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13045","question":"What tributary of Kiel Canal is located at the following coordinates: 54.173891666667, 9.4427416666667?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q144825 p:P974 ?s . ?s ps:P974 ?obj . ?s pq:P625 ?x filter ( contains ( ?x , '54.173891666667 9.4427416666667' ) ) }","paraphrases":["Name the Kiel Canal tributary that is located at coordinate 54.173891666667, 9.4427416666667."],"info":{}}
{"id":"train_13046","question":"What deity is depicted in the Sermon on the Mount","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1344 wd:Q51640 . ?sbj wdt:P31 wd:Q178885 }","paraphrases":["What divinity is portrayed within the Sermon on the Mount"],"info":{}}
{"id":"train_13047","question":"Which {county seat}  {is in the Indian reserve of} of {A Capela} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q581926 wdt:P131 ?X . ?X wdt:P36 ?answer }","paraphrases":["Which {county seat} {is in the Indian reserve of} of {A Capela} ?"],"info":{}}
{"id":"train_13050","question":"What is the protein, found in its related taxon, in Homo sapiens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P703 wd:Q15978631 . ?sbj wdt:P31 wd:Q8054 }","paraphrases":["Which protein is the one found in humans?"],"info":{}}
{"id":"train_13051","question":"What is Babirusa's taxon parent's taxonomic rank in the tribe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q232558 wdt:P171 ?answer . ?answer wdt:P105 wd:Q227936 }","paraphrases":["What is Babirusa's taxon parent's taxonomic rank in the tribe?"],"info":{}}
{"id":"train_13056","question":"CAN YOU DESCRIBE THE WORK OF DEPICTION OF DAVID SLAYING GOLIATH?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21768313 wdt:P180 ?X . ?X wdt:P1441 ?answer }","paraphrases":["CAN YOU Depict THE WORK OF Portrayal OF DAVID Killing GOLIATH?"],"info":{}}
{"id":"train_13061","question":"Name a big city that contains the word \"łódź \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1549591 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'łódź' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a huge city that contains the word \"łódź \" in its name"],"info":{}}
{"id":"train_13062","question":"When did Queen get inducted into the Rock and Roll Hall of Fame?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q15862 p:P166 ?s . ?s ps:P166 wd:Q179191 . ?s pq:P585 ?value }","paraphrases":["When was the induction of Queen into the Rock and Roll Hall of Fame?"],"info":{}}
{"id":"train_13063","question":"tell  me agglutinative language that Ethnologue language status 3 Wider Communication name has  the word esperantoin in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q171263 . ?sbj wdt:P3823 wd:Q29051549 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'esperanto' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["inform me agglutinative language that Ethnologue language status three Wider Communication identify has the word esperantoin in it"],"info":{}}
{"id":"train_13065","question":"Tell me the expedition that has a start point in St. Louis and starts with the letter e?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2401485 . ?sbj wdt:P1427 wd:Q38022 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the expedition that has a begin factor in St. Louis and starts with the letter e?"],"info":{}}
{"id":"train_13066","question":"What is the Death location of Manuel Gamio which has a polulation of 8918653 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2602445 wdt:P20 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '8918653' ) ) }","paraphrases":["What is the Death region of Manuel Gamio which has a polulation of 8918653 ?"],"info":{}}
{"id":"train_13069","question":"What type of fuel does Blue Origin make?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q885836 wdt:P1056 ?X . ?X wdt:P618 ?answer }","paraphrases":["what kind of fuel is manufactured by Blue Origin?"],"info":{}}
{"id":"train_13070","question":"What method was used to determine Siena's demographic balance?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2751 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q15911027 }","paraphrases":["How was Siena's demographic balance determined?"],"info":{}}
{"id":"train_13071","question":"What are the edition and publisher of the Diary of Anne Frank?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q6911 p:P747 ?s . ?s ps:P747 ?obj . ?s pq:P123 ?value1 . }","paraphrases":["What are the version and distributer of the Journal of Anne Frank?"],"info":{}}
{"id":"train_13072","question":"What statement is Uzbekistan is a subject of in diplomatic Pakistan-Uzbekistan relations?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q265 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q4342347 }","paraphrases":["Pakistan was one of the first countries to recognize the independence of Uzbekistan. The relations between the two countries were initially strained by the situation in Afghanistan which both countries border as they supported opposing Afghan factions."],"info":{}}
{"id":"train_13074","question":"He was 88 and had reigned for 41 years. Tāufaʻāhau Tupou IV was buried on 19 September 2006 at Malaʻe Kula (the Royal cemetery) in the Tongan capital, Nukuʻalofa.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q273739 wdt:P20 ?answer . ?answer wdt:P190 wd:Q678 }","paraphrases":["He was 88 and had ruled for 41 a long time. Tāufaʻāhau Tupou IV was buried on 19 September 2006 at Malaʻe Kula (the Illustrious cemetery) within the Tongan capital, Nukuʻalofa."],"info":{}}
{"id":"train_13075","question":"Which is Chess.com player ID for Judit Polgár?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q183250 wdt:P3654 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13076","question":"Which is the city and state for the twinned administrative body of Auckland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q37100 . ?sbj wdt:P31 wd:Q133442 }","paraphrases":[],"info":{}}
{"id":"train_13077","question":"Gertrude Stein is the librettist of which opera?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P87 wd:Q188385 . ?sbj wdt:P31 wd:Q1344 }","paraphrases":["Gertrude Stein is the librettist of which opera?"],"info":{}}
{"id":"train_13079","question":"What is the place where they filmed featured in work of Chewbacca ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51803 wdt:P1441 ?X . ?X wdt:P915 ?answer }","paraphrases":["Where was the work of Chewbacca filmed?"],"info":{}}
{"id":"train_13082","question":"Is the number of constituencies of the municipal chamber of Contagem more than 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q56450233 wdt:P4253 ?obj filter ( ?obj > 0.0 ) }","paraphrases":["Does the amount of voters of the city chamber of Contagem greater than 0?"],"info":{}}
{"id":"train_13083","question":"\"What is headquarters of World Archery Federation, that counts 130421.0 inhabitants ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q684867 wdt:P159 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '130421.0' ) ) }","paraphrases":["\"What is base camp of World Arrow based weaponry League, that checks 130421.0 occupants ?\""],"info":{}}
{"id":"train_13084","question":"When did Jack Barry take over as the Head Coach of the Boston Red Sox?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q213959 p:P286 ?s . ?s ps:P286 wd:Q6111176 . ?s pq:P580 ?value }","paraphrases":["On what date did Jack Barry take over as the Head Coach of the Boston Red Sox?"],"info":{}}
{"id":"train_13086","question":"When did Jack Kramer start playing for the United States Davis Cup team and when did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q54529 p:P54 ?s . ?s ps:P54 wd:Q1389353 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["what period did jack kramer start playing for the united states davis cup team and when did he finish?"],"info":{}}
{"id":"train_13088","question":"What was the population of Fernando de Noronha during the date 2000-8-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q175057 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["On 2000-8-1, how many people lived in Fernando de Noronha."],"info":{}}
{"id":"train_13090","question":"What award was received by Octavio Paz and when was it received?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q46739 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What grant was gotten by Octavio Paz and when was it received?"],"info":{}}
{"id":"train_13091","question":"When did noble title of Guy of Lusignan and follows?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["When did respectable title of Guy of Lusignan and pursues?"],"info":{}}
{"id":"train_13093","question":"Which medal did Dara Torres receive for swimming in the Women's 50 metre freestyle during the 2008 Summer Olympics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q229926 p:P1344 ?s . ?s ps:P1344 wd:Q1094667 . ?s pq:P166 ?value }","paraphrases":["what medal did dara torres receive for swmming in the womens 50 metre freestyle during the 2008 summer olympics?"],"info":{}}
{"id":"train_13094","question":"What is DFB datacenter player ID for Birgit Prinz","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q109868 wdt:P4023 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13095","question":"When did William III end his time working in The Hague?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q129987 p:P937 ?s . ?s ps:P937 wd:Q36600 . ?s pq:P582 ?value }","paraphrases":["William III stopped working in The Hague in which year?"],"info":{}}
{"id":"train_13096","question":"which was the  deathdate   of thomas  boyiston adams who's father is  abigail  adams?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q7787805 . ?s pq:P570 ?value1 . ?s pq:P22 ?value2 }","paraphrases":["What was the death date of thomas boyiston adams who is Abigail adams ' father?"],"info":{}}
{"id":"train_13098","question":"Which is the JSTOR topic ID of the male reproductive system?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q842083 wdt:P3827 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13099","question":"Were Vauxhall and Chevrolet Sales India Private subsidiaries of General Motors?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q81965 wdt:P355 wd:Q59187 . wd:Q81965 wdt:P355 wd:Q5094411 }","paraphrases":["Did the Private subsidiaries of General Motors include Vauxhall and Chevrolet Sales?"],"info":{}}
{"id":"train_13100","question":"Ted Stevens was in what branch of the military until when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q50599 p:P241 ?s . ?s ps:P241 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Ted Stevens was in what department of the military until when?"],"info":{}}
{"id":"train_13102","question":"Does the Unforgivable Curse cause immediate death","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1536 wd:Q4 . ?sbj wdt:P31 wd:Q917362 }","paraphrases":["Is the unforgivable curse causing death immediately?"],"info":{}}
{"id":"train_13103","question":"Donald Trump was the defendant of how many?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1591 wd:Q22686 }","paraphrases":["Which is the number of people that Donald Trump was a defendant of?"],"info":{}}
{"id":"train_13104","question":"What did executive director Suzanne Greco create?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q31885117 wdt:P169 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What created managing director Suzanne Greco?"],"info":{}}
{"id":"train_13105","question":"Is the conversion to the standard unit of the minute less than 0.00055555552?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7727 wdt:P2442 ?obj filter ( ?obj < 0.00055555552 ) }","paraphrases":["Is 0.00055555552 the conversion of the minute?"],"info":{}}
{"id":"train_13106","question":"When did Lofti Aliasker Zaadeh receive the \"Benjamin Franklin Medal\" as a reward?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q92767 p:P166 ?s . ?s ps:P166 wd:Q817496 . ?s pq:P585 ?value }","paraphrases":["When did Lofti Aliasker Zaadeh get the \"Benjamin Franklin Award\" as a reward?"],"info":{}}
{"id":"train_13107","question":"How many people live in Pennsylvania?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1400 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["What is the population on Pennsylvania?"],"info":{}}
{"id":"train_13108","question":"Where and what did Daniel McFadden study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q312560 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["Where and what did Daniel McFadden think about?"],"info":{}}
{"id":"train_13110","question":"When did Yevhen Tomin stop being Governor for Poltava Oblast?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q169501 p:P6 ?s . ?s ps:P6 wd:Q12161920 . ?s pq:P582 ?value }","paraphrases":["In which year Yevhen Tomin have relieved from Governor post of Poltava Oblast?"],"info":{}}
{"id":"train_13111","question":"Which is the Kontinental Hockey League player ID of Dominik Hašek?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q312695 wdt:P3652 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13115","question":"Does the elongation at break of the Grivory GM-4H equal to 5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q57051271 wdt:P5811 ?obj filter ( ?obj = 5 ) }","paraphrases":["Is there 5 elongation at break of the Grivory GM-4H?"],"info":{}}
{"id":"train_13116","question":"What is a name of a dog that begins with the letter w.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q144 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a title of a puppy that starts with the letter w."],"info":{}}
{"id":"train_13117","question":"What recognition did Niki Lauda receive for her role?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q78489 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P518 wd:Q23640 }","paraphrases":["What acknowledgment did Niki Lauda get for her job?"],"info":{}}
{"id":"train_13120","question":"Who was in charge before Josef Kramer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57688 wdt:P102 ?X . ?X wdt:P155 ?answer }","paraphrases":["Who came before Josef Kramer in power?"],"info":{}}
{"id":"train_13121","question":"What is hometown of C. L. R. James, that has Human Development Index is 0.717?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q773828 wdt:P19 ?answer . ?answer wdt:P1081 ?x FILTER ( contains ( ?x , '0.717' ) ) }","paraphrases":["What is hometown of C. L. R. James, that has Human Advancement List is 0.717?"],"info":{}}
{"id":"train_13123","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P137 wd:Q49117 . ?sbj wdt:P31 wd:Q483110 }","paraphrases":["Not applicable"],"info":{}}
{"id":"train_13124","question":"when did Birgit Nilsson received the award of Leonie Sonning Music Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q233951 p:P166 ?s . ?s ps:P166 wd:Q1165751 . ?s pq:P585 ?value }","paraphrases":["Name the date Birgit Nilsson received the award of Leonie Sonning Music Prize."],"info":{}}
{"id":"train_13125","question":"Is the temperature of the Yunogo Onsen equal to 40?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q8061351 wdt:P2076 ?obj filter ( ?obj = 40 ) }","paraphrases":["Is the temperature of the Yunogo Onsen break even with to 40?"],"info":{}}
{"id":"train_13126","question":"Which is the Chinese Library Classification of sport?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q349 wdt:P1189 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13129","question":"Which is influenced by Friedrich Wilhelm Joseph Schelling?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P737 wd:Q60070 }","paraphrases":[],"info":{}}
{"id":"train_13130","question":"how does one determine the population of Delaware to be 238380?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1393 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '238380.0' ) ) . ?s pq:P459 ?value }","paraphrases":["What method was used to determine the population in Delaware to be 238380?"],"info":{}}
{"id":"train_13131","question":"Which is the theory for the facet of neuroscience?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1269 wd:Q207011 . ?sbj wdt:P31 wd:Q17737 }","paraphrases":["What is the theory for the neuroscience facet?"],"info":{}}
{"id":"train_13135","question":"WHICH IS THE INDUSTRY THAT STARTS WITH U","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8148 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE INDUSTRY THAT BEGINS WITH U"],"info":{}}
{"id":"train_13139","question":"What is the company owned by Bill Gates?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P488 wd:Q5284 . ?sbj wdt:P31 wd:Q149789 }","paraphrases":["What company does Bill Gate own?"],"info":{}}
{"id":"train_13140","question":"Who had the most votes on the Amendment to the Constitution of Ireland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q54086790 . ?ent wdt:P1697 ?obj . ?ent wdt:P31 wd:Q467578 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Tell me who got the most votes on the Amendment to the Constitution of Ireland?"],"info":{}}
{"id":"train_13144","question":"At {RWTH Aachen University} what is {eponym} of {wiens displacement law}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q214336 wdt:P138 ?answer . ?answer wdt:P108 wd:Q273263 }","paraphrases":["At {RWTH Aachen University} what is {eponym} of {wiens displacement law}?"],"info":{}}
{"id":"train_13145","question":"How many conflicts has Christopher Lee been involved in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q180338 wdt:P607 ?obj }","paraphrases":["What number of conflicts have involved Christopher Lee?"],"info":{}}
