{"id":"train_18073","question":"Is the age of consent in Catalonia over 19.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5705 wdt:P2999 ?obj filter ( ?obj > 19.2 ) }","paraphrases":["Is the age of assent in Catalonia over 19.2?"],"info":{}}
{"id":"train_18074","question":"What is the death location of Vercingetorix that has borders with Mentana?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178953 wdt:P20 ?answer . ?answer wdt:P47 wd:Q242942 }","paraphrases":["What is the passing area of Vercingetorix that has borders with Mentana?"],"info":{}}
{"id":"train_18079","question":"What is near Georgia that has the consumer price index inflation rate of 32.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q230 wdt:P530 ?answer . ?answer wdt:P1279 ?x FILTER ( contains ( ?x , '32.2' ) ) }","paraphrases":["What is close to Georgia that has the customer price index inflation price of 32.2?"],"info":{}}
{"id":"train_18080","question":"What is the angular acceleration of wurvoc.org","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q186300 wdt:P3328 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18082","question":"What is the human population and diplomatic relations of Brunei?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q921 wdt:P530 ?X . ?X wdt:P1082 ?answer }","paraphrases":["WHAT IS HUMAN POPULATION OF BRUNEI"],"info":{}}
{"id":"train_18084","question":"What language is native to Armenians?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P103 wd:Q8785 }","paraphrases":["Which language is native to Armenians?"],"info":{}}
{"id":"train_18086","question":"What is the point in time that Nicolaus Cusanus was made cardinal by the Holy Roman Church?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q154751 p:P39 ?s . ?s ps:P39 wd:Q1813197 . ?s pq:P580 ?value }","paraphrases":["At what time was Nicolaus Cusanus made cardinal by the Holy Roman Church?"],"info":{}}
{"id":"train_18087","question":"What is a mug made put of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q386215 wdt:P186 ?X . ?X wdt:P2079 ?answer }","paraphrases":["A mug is composed of what type of material?"],"info":{}}
{"id":"train_18088","question":"Name the Wikimedia categorization for the employees of the Princeton University organization.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q21578 wdt:P4195 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["Title the Wikimedia categorization for the workers of the Princeton College organization."],"info":{}}
{"id":"train_18091","question":"what is the history of topic and the geography of topic of  korea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q18097 wdt:P2184 ?ans_1 . wd:Q18097 wdt:P2633 ?ans_2 }","paraphrases":["What's the history and location of Korea?"],"info":{}}
{"id":"train_18092","question":"How many lakes outflow to the Barents Sea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P201 wd:Q45823 }","paraphrases":["Which is the number of lakes that outflow to the Barents Sea?4"],"info":{}}
{"id":"train_18093","question":"What was the underlying cause of the medical specialty of Peter B. Bennett?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7172599 wdt:P1995 ?X . ?X wdt:P828 ?answer }","paraphrases":["What was the basic cause of the restorative forte of Dwindle B. Bennett?"],"info":{}}
{"id":"train_18094","question":"What is the theme and unit symbol of newton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12438 wdt:P144 ?X . ?X wdt:P5061 ?answer }","paraphrases":["What is the subject and unit image of newton?"],"info":{}}
{"id":"train_18095","question":"When did Charles Lyell hold the position of  President of the Geological Society of London?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5333 p:P39 ?s . ?s ps:P39 wd:Q7241336 . ?s pq:P580 ?value }","paraphrases":["When was Charles Lyell President of the Geological Society of London?"],"info":{}}
{"id":"train_18096","question":"When did the marriage of Rocío Dúrcal and Antonio Morales Barretto end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q56074 p:P26 ?s . ?s ps:P26 wd:Q6321752 . ?s pq:P582 ?value }","paraphrases":["When did Rocio Durcal and Antonio Morales Baretto finalize their divorce?"],"info":{}}
{"id":"train_18098","question":"who Wikimedia category for category of associated people of Bucharest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q19660 wdt:P1792 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["who Wikimedia category for category of related individuals of Bucharest?"],"info":{}}
{"id":"train_18102","question":"What is {made from} of {derived from} of {Rum Collins} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7379095 wdt:P144 ?X . ?X wdt:P186 ?answer }","paraphrases":["What is {made from} of {determined from} of {Rum Collins} ?"],"info":{}}
{"id":"train_18103","question":"What is an SI derived unit that starts with the letter w.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q208469 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is an SI inferred unit that begins with the letter w."],"info":{}}
{"id":"train_18104","question":"Which District Councils of Hong Kong has the largest number of Constituencies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q836365 . ?ent wdt:P4253 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Hong Kong District Councils have the most constituencies?"],"info":{}}
{"id":"train_18107","question":"How is Structured Query Language managed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P277 wd:Q47607 . ?sbj wdt:P31 wd:Q131093 }","paraphrases":["How is Organized Inquiry Dialect managed?"],"info":{}}
{"id":"train_18110","question":"Where is a painting of Alexandre Cabanel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q310437 wdt:P800 ?X . ?X wdt:P180 ?answer }","paraphrases":["Where could be a portray of Alexandre Cabanel?"],"info":{}}
{"id":"train_18112","question":"When did Haruki Murakami receive the World Fantasy Award for Best Novel?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q134798 p:P166 ?s . ?s ps:P166 wd:Q898527 . ?s pq:P585 ?value }","paraphrases":["On what date did Haruki Murakami receive the World Fantasy Award for Best Novel?"],"info":{}}
{"id":"train_18115","question":"What award did Count Basie receive in 2001?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q107008 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["In 2001, Count Basie earned what award?"],"info":{}}
{"id":"train_18116","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1344 wd:Q8663 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["n/a"],"info":{}}
{"id":"train_18117","question":"What measure of torque has a conversion to the SI base unit of 1.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q48103 wdt:P1880 ?answer . ?answer wdt:P2370 ?x FILTER ( contains ( ?x , '1.0' ) ) }","paraphrases":["What degree of torque incorporates a change to the SI base unit of 1.0?"],"info":{}}
{"id":"train_18120","question":"Which Parisian cemetery has the highest number of graves?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2972684 . ?ent wdt:P2351 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which cemetery in Paris has the highest number of tombs?"],"info":{}}
{"id":"train_18121","question":"What is the unit of length that starts with the letter 'z'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1978718 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the unit of length that begins with the letter 'z'?"],"info":{}}
{"id":"train_18122","question":"What is Stephen III of Moldavia's middle name, which has a Latin script?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q218134 wdt:P735 ?answer . ?answer wdt:P282 wd:Q8229 }","paraphrases":["What is the Latin scripted middle name of Stephen III of Maldovia?"],"info":{}}
{"id":"train_18124","question":"What was the population nucleus for the settlement of Granada?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8810 wdt:P1383 ?obj . ?obj wdt:P31 wd:Q11939023 }","paraphrases":["What is the population center of Granada?"],"info":{}}
{"id":"train_18125","question":"what is  codon represented for encodes of L -Argine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P688 wd:Q173670 . ?sbj wdt:P31 wd:Q165052 }","paraphrases":["Name the codon represented for encodes of L -Argine."],"info":{}}
{"id":"train_18126","question":"What was the kinship of Ella Fitzgerald's child Ray Brown, Jr.?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1768 p:P40 ?s . ?s ps:P40 wd:Q7297244 . ?s pq:P1039 ?value }","paraphrases":["Who was the father of Ella Fitzgerald's son Ray Brown Jr?"],"info":{}}
{"id":"train_18127","question":"what is london borough starts with l","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q211690 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is london borough begins with l"],"info":{}}
{"id":"train_18128","question":"What are the alternatives to using CO2 snow cleaning?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44601707 wdt:P2283 ?X . ?X wdt:P461 ?answer }","paraphrases":["What methods of snow cleaning can be used other than CO2?"],"info":{}}
{"id":"train_18131","question":"What award did Edmond O'Brien receive January 1, 1951?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q119935 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1954' ) ) }","paraphrases":["Mention the award name, which was received by Edmond O'Brien on January 1, 1951?."],"info":{}}
{"id":"train_18132","question":"Who is the taxon parent of Pseudotsuga menziesii whose common name is Pseŭdocugo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q156687 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'Pseŭdocugo' ) ) }","paraphrases":["Who is the taxon parent of Pseudotsuga menziesii whose common title is Pseŭdocugo?"],"info":{}}
{"id":"train_18134","question":"What is a legal status of medicine that begins with the letter u.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26715005 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a legitimate status of medication that starts with the letter u."],"info":{}}
{"id":"train_18136","question":"Which second-level administrative country subdivision shares a border with Hamburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1055 wdt:P47 ?obj . ?obj wdt:P31 wd:Q13220204 }","paraphrases":["Hamburg shares a border with which second-level administrative country subdivision?"],"info":{}}
{"id":"train_18137","question":"Which is the trademarked record label of 50 Cent?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q6060 wdt:P264 ?obj . ?obj wdt:P31 wd:Q167270 }","paraphrases":[],"info":{}}
{"id":"train_18138","question":"Which memorial cemetery has the largest number of graves out of all memorial cemeteries?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2532223 . ?ent wdt:P2351 ?obj . ?ent wdt:P31 wd:Q2532223 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Out of all memorial graveyards, which has the most graves?"],"info":{}}
{"id":"train_18140","question":"When and where did Clive Granger get the Sveriges Riksbank Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q312575 p:P166 ?s . ?s ps:P166 wd:Q47170 . ?s pq:P1706 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["When and where did the Sveriges Riksbank Prize come from Clive Granger?"],"info":{}}
{"id":"train_18141","question":"What is the position held by Urho Kekkonen who replaces Ralf Törngren?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q179858 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q728830 }","paraphrases":["What position does Urho Kekkonen, who replaced Ralf Torngren, hold?"],"info":{}}
{"id":"train_18142","question":"Tell me geosphere whose name has the word pedosphere in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q241284 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pedosphere' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the name of the geosphere with the word pedosphere in it."],"info":{}}
{"id":"train_18143","question":"\"What is {developed by} of {Nintendo 3DS}, which has {chief operating officer} is {Reggie Fils-Aime} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q203597 wdt:P178 ?answer . ?answer wdt:P1789 wd:Q353420 }","paraphrases":["\"What is {created by} of {Nintendo 3DS}, which has {chief working officer} is {Reggie Fils-Aime} ?\""],"info":{}}
{"id":"train_18144","question":"Is the data size of the Atom greater than 344.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q16766305 wdt:P3575 ?obj filter ( ?obj > 344.0 ) }","paraphrases":["Is the information size of the Atom more noteworthy than 344.0?"],"info":{}}
{"id":"train_18145","question":"Tell me  system whose name has the word vendian  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q403523 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vendian' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose  me system whose name has the word vendian in it."],"info":{}}
{"id":"train_18148","question":"Which is the Literature Ireland ID for John Banville?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q313077 wdt:P5542 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18149","question":"What are the close combat weapon  which start with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q222405 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the close combat weapon which begin with the letter y"],"info":{}}
{"id":"train_18150","question":"What treats disease and is used for treatment of leiomyoma ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4667534 wdt:P2176 ?X . ?X wdt:P2175 ?answer }","paraphrases":["What treats disorder and is used for remedy of leiomyoma ?"],"info":{}}
{"id":"train_18151","question":"What is the significance of Vladimir Nabokov, whose bibliographic citation is Possessed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36591 wdt:P800 ?answer . ?answer wdt:P2860 wd:Q1604885 }","paraphrases":["What is the noteworthiness of Vladimir Nabokov, whose bibliographic quotation is Possessed?"],"info":{}}
{"id":"train_18152","question":"Who is the {skyscraper} for {based on} of {Flatiron Building}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P144 wd:Q220728 . ?sbj wdt:P31 wd:Q11303 }","paraphrases":["Who is the {high rise} for {based on} of {Flatiron Building}"],"info":{}}
{"id":"train_18153","question":"What is the name for someone who participates in theater","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P710 wd:Q329888 . ?sbj wdt:P31 wd:Q718893 }","paraphrases":["A person who participates in theater is called what?"],"info":{}}
{"id":"train_18154","question":"WHO IS THE BROTHER OF URSULE-CATHERINE-FRANCOISE SIEYES WIVES?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15623030 wdt:P26 ?X . ?X wdt:P3373 ?answer }","paraphrases":["WHO IS THE BROTHER OF URSULE-CATHERINE-FRANCOISE SIEYES WIVES?"],"info":{}}
{"id":"train_18155","question":"What was Indra Nooyi's academic major and degree at Madras Christian College?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q264913 p:P69 ?s . ?s ps:P69 wd:Q3524031 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What was Indra Nooyi's academic principal and diploma at Madras Christian College?"],"info":{}}
{"id":"train_18156","question":"Which is the Oxford Dictionary of National Biography ID of Arthur Henderson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q208665 wdt:P1415 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18157","question":"Tell me an aircraft power class part of a global airplane fleet, and which starts with \"a\".","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20027951 . ?sbj wdt:P1535 wd:Q24175399 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me an aircraft strength classification section of a international airplane fleet, and which starts offevolved with \"a\"."],"info":{}}
{"id":"train_18158","question":"What's the name of the island that includes the word \"zembra\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23442 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zembra' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the name of the island which includes in its name the word \"zembra"],"info":{}}
{"id":"train_18160","question":"What year is written in the state of Bengali?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9610 wdt:P17 ?X . ?X wdt:P571 ?answer }","paraphrases":["What year is Bengali state written?"],"info":{}}
{"id":"train_18162","question":"Which Dow Jones Industrial Average member has the least liabilities ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q891723 . ?ent wdt:P2138 ?obj . ?ent wdt:P361 wd:Q180816 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What company on the Dow Jones index has the lowest of liabilities?"],"info":{}}
{"id":"train_18163","question":"Which is the activating neurotransmitter for rod cell?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q505544 wdt:P928 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18164","question":"Who was the Chairperson of University of waterloo while that post was came to an end in 1981","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1049470 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1981' ) ) }","paraphrases":["When the University of Waterloo's post came to an end, who was the chairperson?"],"info":{}}
{"id":"train_18165","question":"Who is the defender for Johnnie Cochran?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1593 wd:Q1346641 }","paraphrases":[],"info":{}}
{"id":"train_18166","question":"Which is identifiers.org prefix for arXiv?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q118398 wdt:P4793 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18167","question":"Which is the medical treatment of psychotherapy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P924 wd:Q183257 }","paraphrases":[],"info":{}}
{"id":"train_18168","question":"what year was the population of Sekondi-Takorandi at 188203?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q243293 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '188203.0' ) ) . ?s pq:P585 ?value }","paraphrases":["what year was the number of inhabitants in Sekondi-Takorandi at 188203?"],"info":{}}
{"id":"train_18169","question":"Was Bernie Sanders married to Jane O'Meara Sanders?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q359442 wdt:P26 wd:Q20165782 }","paraphrases":["Was Jane O'Meara Sanders married to Bernie Sanders?"],"info":{}}
{"id":"train_18170","question":"What painting is in the final assembly location at UPenn?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1071 wd:Q49117 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["What painting is at UPenn's final assembly site"],"info":{}}
{"id":"train_18172","question":"Where is the educational head quarters of Jessica Lange?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q173585 wdt:P69 ?X . ?X wdt:P159 ?answer }","paraphrases":["Where is the instructive head quarters of Jessica Lange?"],"info":{}}
{"id":"train_18173","question":"Is the family relationship degree of the grandmother equal to 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q20776714 wdt:P4500 ?obj filter ( ?obj = 2 ) }","paraphrases":["Is the family relationship degree of the grandmother equal to 2?"],"info":{}}
{"id":"train_18176","question":"Which station is PBS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1416 wd:Q215616 . ?sbj wdt:P31 wd:Q1616075 }","paraphrases":["Which station is PBS?"],"info":{}}
{"id":"train_18177","question":"How many programming languages are for Skype?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q40984 wdt:P277 ?obj }","paraphrases":["What is the number of programming languages for Skype?"],"info":{}}
{"id":"train_18178","question":"Tell me chemical reaction whose name has the word synthesis in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q36534 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'synthesis' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["ell me chemical response whose title has the word blend in it."],"info":{}}
{"id":"train_18179","question":"Who is the  {international organization} for {developer} of {Julian Assange}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P178 wd:Q360 . ?sbj wdt:P31 wd:Q484652 }","paraphrases":["Who is the {worldwide organization} for {designer} of {Julian Assange}"],"info":{}}
{"id":"train_18180","question":"In which banknote has the highest face vale?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q47433 . ?ent wdt:P3934 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["the highest face value is in which banknote"],"info":{}}
{"id":"train_18181","question":"when did Ailsa Garland become the editor for vogue","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6351976 p:P98 ?s . ?s ps:P98 wd:Q21176318 . ?s pq:P580 ?value }","paraphrases":["UN"],"info":{}}
{"id":"train_18182","question":"What was Otto Hahn nominated for in the year 1945?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q57065 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1945' ) ) }","paraphrases":["In 1945, for what was Otto Hahn nominated?"],"info":{}}
{"id":"train_18184","question":"Did Inglorious Basterds feature Mike Myers and Michael Bacall?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q153723 wdt:P161 wd:Q185724 . wd:Q153723 wdt:P161 wd:Q2262850 }","paraphrases":["Were Mike Myers and Michael Bacall actors in Inglorious Basterds?"],"info":{}}
{"id":"train_18186","question":"What are the road type which start with the letter woonerf","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7860962 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'woonerf' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the street sort which begin with the letter woonerf"],"info":{}}
{"id":"train_18187","question":"What is the Hungarian MP identifier for Dezső Gyarmati?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q360879 wdt:P4966 ?answer }","paraphrases":[],"info":{}}
