{"id":"train_17089","question":"What is the home venue for Boston Celtics team ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q131371 wdt:P115 ?obj . ?obj wdt:P31 wd:Q41176 }","paraphrases":["Where is the venue for Boston Celtic team?"],"info":{}}
{"id":"train_17091","question":"koppen climate temperature is","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2564 wd:Q167466 }","paraphrases":[],"info":{}}
{"id":"train_17092","question":"Name a student of Max Planck","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9021 wdt:P185 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is a student of Max Planck?"],"info":{}}
{"id":"train_17093","question":"What is associated with religious affiliation of synagogue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34627 wdt:P140 ?X . ?X wdt:P3095 ?answer }","paraphrases":["What religious affiliation is a synogogue affiliated?"],"info":{}}
{"id":"train_17094","question":"Is it true that the quantity of DRB Class 19.10 is equal to 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q883118 wdt:P1114 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is it genuine that the amount of DRB Class 19.10 is equivalent to 1?"],"info":{}}
{"id":"train_17095","question":"Give me Russia's lowest ranking at the 2018 FIFA World Cup.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7381959 . ?ent wdt:P1352 ?obj . ?ent wdt:P1269 wd:Q170645 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is Russia's lowest ranking in the 2018 FIFA World Cup?"],"info":{}}
{"id":"train_17096","question":"What is the name of the Christian holy day ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60075825 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sunday' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of the Christian heavenly day ?"],"info":{}}
{"id":"train_17097","question":"What was Silvio Berlusconi's political party on November 16, 2013?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11860 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["To which political party did Silvio Berlusconi belong on November 16, 2013?"],"info":{}}
{"id":"train_17098","question":"What is the foundational document of the Soviet Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q15180 wdt:P457 ?obj . ?obj wdt:P31 wd:Q49848 }","paraphrases":["What is the foundational report of the Soviet Union?"],"info":{}}
{"id":"train_17099","question":"When was Nelson Riddle nominated in the 37th Academy Awards.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q961851 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917138 }","paraphrases":["On what date was Nelson Riddle nominated in the 37th Academy Awards?"],"info":{}}
{"id":"train_17100","question":"What what is triumphal arch heritage designationed by MHC and also which starts with letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q143912 . ?sbj wdt:P1435 wd:Q10387684 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is triumphal arch heritage designationed by MHC and also which begins with letter p"],"info":{}}
{"id":"train_17102","question":"What is Lega Serie A soccer ID for Andriy Shevchenko ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41244 wdt:P5339 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17103","question":"who has rural cities of neighborhood of saur revolution ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1341539 wdt:P276 ?X . ?X wdt:P150 ?answer }","paraphrases":["who has rustic cities of neighborhood of saur transformation ?"],"info":{}}
{"id":"train_17104","question":"What independent city of Germany starts with the letter \"z\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22865 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What autonomous city of Germany begins with the letter \"z\"?"],"info":{}}
{"id":"train_17106","question":"Which of {holding company} has {facility operator} as {Digby and Sowton railway station} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q735385 wdt:P137 ?X . ?X wdt:P749 ?answer }","paraphrases":["Which { holding company } has as { Digby and Sowton railway station } { facility operator }?"],"info":{}}
{"id":"train_17107","question":"Tell me the relationship that exists between Johann Sebastian Bach and Johann Jacob Bach","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1339 p:P3373 ?s . ?s ps:P3373 wd:Q539427 . ?s pq:P1039 ?value }","paraphrases":["Describe the relationship that Johann Sebastian Bach and Johann Jacob Bach?"],"info":{}}
{"id":"train_17108","question":"Name a military rank that starts with letter M","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5 . ?sbj wdt:P410 wd:Q111837 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the military rank that starts with the letter M?"],"info":{}}
{"id":"train_17109","question":"When did developer Raymond F boyce create SQL?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47607 p:P178 ?s . ?s ps:P178 wd:Q93007 . ?s pq:P585 ?value }","paraphrases":["At what point was SQL created by developer Raymond F Boyce?"],"info":{}}
{"id":"train_17110","question":"When did Nancy Astor, Viscountess Astor, held the position of Member of the 37th Parliament of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q195013 p:P39 ?s . ?s ps:P39 wd:Q41582593 . ?s pq:P580 ?value }","paraphrases":["Tell me when Nancy Astor, Viscountess Astor, took the position of Member of the 37th Parliament of the United Kingdom."],"info":{}}
{"id":"train_17111","question":"which was the end time leland stanford who's position held in united states senator?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q382109 p:P39 ?s . ?s ps:P39 wd:Q13217683 . ?s pq:P582 ?value }","paraphrases":["When did Leland Stanford stop being a U.S. senator?"],"info":{}}
{"id":"train_17112","question":"What is route diagram of Bay Area Rapid Transit ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q610120 wdt:P3858 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17115","question":"What are the stock exchange which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11691 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the stock trade which begin with the letter s"],"info":{}}
{"id":"train_17116","question":"What sovereign states make up the European Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q458 wdt:P530 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What autonomous states make up the European Union?"],"info":{}}
{"id":"train_17117","question":"Who is the occupant of Liberal International?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P466 wd:Q212712 }","paraphrases":[],"info":{}}
{"id":"train_17119","question":"WHICH IS THE PACIFIC HURRICANE WITH MAXIMUM SUSTAINED WINDS","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3306242 . ?ent wdt:P2895 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Out of all hurricanes that have occurred in the Pacific ocean, which has had the fastest sustained winds?"],"info":{}}
{"id":"train_17123","question":"Tell me the IP network which starts with the letter i!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11224256 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the IP arrange which begins with the letter i!"],"info":{}}
{"id":"train_17124","question":"Who  is parent company  made by  Fermi Gamma-ray Space Telescope ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q726648 wdt:P176 ?X . ?X wdt:P355 ?answer }","paraphrases":["Who is parent company made by Fermi Gamma-ray Space Telescope ?"],"info":{}}
{"id":"train_17125","question":"Which is the currency for filmmaking?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P38 wd:Q932586 }","paraphrases":[],"info":{}}
{"id":"train_17126","question":"What city is the twinned administrative city of Auckland ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q37100 . ?sbj wdt:P31 wd:Q13218391 }","paraphrases":["What city is the twinned regulatory city of Auckland ?"],"info":{}}
{"id":"train_17127","question":"When did Shmuel Yosef Agnon win the Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q133042 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["In what year did Shmuel Yosef Agnon win the Nobel Prize in Literature?"],"info":{}}
{"id":"train_17128","question":"When did significant event of Nancy Pelosi and spouse?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q170581 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P26 ?value1 . }","paraphrases":["When did critical occasion of Nancy Pelosi and companion?"],"info":{}}
{"id":"train_17130","question":"What coordinate system starts with the letter \"u\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11210 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what coordinate system begins with the letter \"u\"?"],"info":{}}
{"id":"train_17131","question":"Tell me if the ceiling exposure limit of the Petroleum naphtha is less than 2160.0.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7178974 wdt:P2405 ?obj filter ( ?obj < 2160.0 ) }","paraphrases":["True or False: Petroleum naphtha ceiling exposure limit is less than 2160"],"info":{}}
{"id":"train_17132","question":"Does the radial velocity of the Messier 46 equal to 30.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13910 wdt:P2216 ?obj filter ( ?obj = 30.4 ) }","paraphrases":["Is 30.4 the radial velocity of the Messier 46?"],"info":{}}
{"id":"train_17133","question":"What was the award received by Julian Schwinger for a money prize equal to 94000.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q186465 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter ( contains ( ?x , '94000.0' ) ) }","paraphrases":["Julian Schwinger received an award for a money prize--what was the award?"],"info":{}}
{"id":"train_17134","question":"What are the film genre which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q201658 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the film sort which begin with the letter w"],"info":{}}
{"id":"train_17135","question":"Which pandemic had the word \"plague\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1516910 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'plague' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which widespread had the word \"torment\" in its name?"],"info":{}}
{"id":"train_17137","question":"At which Japanese castle did Tokugawa Ieyasu die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q171977 wdt:P20 ?obj . ?obj wdt:P31 wd:Q92026 }","paraphrases":["Tokygawa Ieyasu died in which castle in Japan?"],"info":{}}
{"id":"train_17138","question":"What are the working languages of the Indian Reservation of the Usti and Labem Region?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192702 wdt:P131 ?X . ?X wdt:P2936 ?answer }","paraphrases":["What are the working dialects of the Indian Reservation of the Usti and Labem Region?"],"info":{}}
{"id":"train_17140","question":"What is the Lisa Leslie WNBA player Id?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q257980 wdt:P3588 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17141","question":"WHAT ARE THE OLYMPIC SPORT WHICH START WITH THE LETTER W.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212434 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE LETTER WITH THE OLYMPIC SPORT WHICH START."],"info":{}}
{"id":"train_17144","question":"Who was Katharine Hepburn married to and when did the marriage end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q56016 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who was married to Katharine Hepburn and when ended the marriage?"],"info":{}}
{"id":"train_17149","question":"What acts as an inspiration for the depiction of Medea about to Kill her Children?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5573243 wdt:P941 ?X . ?X wdt:P180 ?answer }","paraphrases":["What acts as an motivation for the delineation of Medea almost to Murder her Children?"],"info":{}}
{"id":"train_17150","question":"what are thetheorem which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q65943 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What theories start with \"t\"?"],"info":{}}
{"id":"train_17152","question":"In what country is the region of Levant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P706 wd:Q81483 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["Give the name of the country in which the Levant region is located."],"info":{}}
{"id":"train_17153","question":"What is the record label of Metro-Goldwyn-Mayer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P264 wd:Q179200 }","paraphrases":[],"info":{}}
{"id":"train_17154","question":"Which is the business that is subsidiary of Twitch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P355 wd:Q4555537 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["What is Twitch's subsidiary?"],"info":{}}
{"id":"train_17155","question":"Give me an energy production unit, that starts with alphabet 'h'.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3406659 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me an energy generation unit starting with the ' h ' alphabet."],"info":{}}
{"id":"train_17156","question":"Which School authors attended Mutations in the DJ-1 gene associated with autosomal recessive early-onset parkinsonism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24321359 wdt:P50 ?X . ?X wdt:P69 ?answer }","paraphrases":["Which School creators gone to Changes within the DJ-1 quality related with autosomal latent early-onset parkinsonism?"],"info":{}}
{"id":"train_17157","question":"which file system starts with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q174989 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the file system that starts with the letter z"],"info":{}}
{"id":"train_17160","question":"What is the name of the fictional universe described in the cycle of Calpamos ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26996374 wdt:P1080 ?X . ?X wdt:P1445 ?answer }","paraphrases":["Name the fictional universe the cycle of Calpamos describes."],"info":{}}
{"id":"train_17161","question":"Is it true that the market capitalization of Apple equals to 1000000000000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q312 wdt:P2226 ?obj filter ( ?obj = 1000000000000 ) }","paraphrases":["Is it correct that Apple's market capitalization is equal to 1000000000000?"],"info":{}}
{"id":"train_17163","question":"Which county seat of Paris has 75809.0 number of out of school children?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q90 wdt:P1376 ?answer . ?answer wdt:P2573 ?x FILTER ( contains ( ?x , '75809.0' ) ) }","paraphrases":["Which county seat of Paris has 75809.0 variety of out of college children?"],"info":{}}
{"id":"train_17164","question":"What is the basin country of Spain which is including Mediterranean Sea?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q4918 p:P205 ?s . ?s ps:P205 wd:Q29 . ?s pq:P1012 ?value }","paraphrases":["The Mediterranean Sea is part of what Spanish basin country?"],"info":{}}
{"id":"train_17166","question":"What is Museus.br ID for ão Paulo Museum of Art ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q82941 wdt:P4401 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17167","question":"which was the place of  marriage  and start time  of henry 1 of france was spoused as anne of kiev?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q178908 p:P26 ?s . ?s ps:P26 wd:Q230073 . ?s pq:P2842 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["Where did Henry I marry Anne of Kiev?"],"info":{}}
{"id":"train_17169","question":"Who is the translator of The Jungle Book?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q189509 wdt:P655 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who translated The Jungle Book?"],"info":{}}
{"id":"train_17171","question":"Who replaced Miguel Díaz-Canel as the Prime Minister of Cuba?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1932603 p:P39 ?s . ?s ps:P39 wd:Q6502015 . ?s pq:P1365 ?value }","paraphrases":["Who became Cuba's Prime Minister after Miguel Diaz-Canel?"],"info":{}}
{"id":"train_17173","question":"How much money was Shimon Peres awarded as the recipient of the Nobel Peace Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q57410 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P585 ?value1 . ?s pq:P2121 ?value2 }","paraphrases":["How much did Shimon Peres get for his Nobel Peace Prize?"],"info":{}}
{"id":"train_17174","question":"What are the television station  which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1616075 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the TV station that starts with the letter w"],"info":{}}
{"id":"train_17175","question":"What is the name after Reynolds number, who is someone with employment as a civil engineer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178932 wdt:P138 ?answer . ?answer wdt:P106 wd:Q13582652 }","paraphrases":["What is the identify after Reynolds number, who is anybody with employment as a civil engineer?"],"info":{}}
{"id":"train_17176","question":"What academic degree did Michael Bloomberg get at Johns Hopkins University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q607 p:P69 ?s . ?s ps:P69 wd:Q193727 . ?s pq:P512 ?value }","paraphrases":["Michael Bloomberg earned which degree at John Hopkins University?"],"info":{}}
{"id":"train_17177","question":"Nazarbayev has no apparent long-term successor. His decision hit the price of Kazakh bonds, while the London-listed shares of Kazakhstan’s biggest bank, Halyk Bank, tumbled 5 percent. The news also appeared to weigh on the Russian rouble. Moscow is Kazakhstan’s main trade partner.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q240526 wdt:P40 ?X . ?X wdt:P3373 ?answer }","paraphrases":["Nazarbayev has no clear long-term successor. His choice hit the cost of Kazakh bonds, whereas the London-listed offers of Kazakhstan’s greatest bank, Halyk Bank, tumbled 5 percent. The news moreover showed up to weigh on the Russian rouble. Moscow is Kazakhstan’s fundamental exchange partner."],"info":{}}
{"id":"train_17179","question":"Which is record held of Hicham El Guerrouj?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q83905 wdt:P1000 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17180","question":"What is the name of the highest peak in Hong Kong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8646 wdt:P610 ?obj . ?obj wdt:P31 wd:Q8502 }","paraphrases":["What is the title of the most elevated crest in Hong Kong?"],"info":{}}
{"id":"train_17182","question":"\"Which party membership from Thomas Nast, named Garrison is located in Washington, D.C.?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q214957 wdt:P102 ?answer . ?answer wdt:P159 wd:Q61 }","paraphrases":["\"Which party participation from Thomas Nast, named Battalion is found in Washington, D.C.?\""],"info":{}}
{"id":"train_17183","question":"Tell me field of study whose name has the word technology in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2267705 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'technology' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the study field whose name contains the word technology."],"info":{}}
{"id":"train_17184","question":"Who influenced the Ernest Hemingway style of writing ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23434 wdt:P1412 ?X . ?X wdt:P737 ?answer }","paraphrases":["Ernest Hemingway style of writing was influenced by who?"],"info":{}}
{"id":"train_17186","question":"Who gave the  {tributary} of {on coast of} of {Cape of Good Hope} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4092 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["On the cost of the Cape of Good Hope, who gave the tributary?"],"info":{}}
{"id":"train_17189","question":"Who is a member of a subitem of the history of Montenegro?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q628024 wdt:P1269 ?X . ?X wdt:P463 ?answer }","paraphrases":["The history of Montenegro has what member of the subitem?"],"info":{}}
{"id":"train_17190","question":"Where is the site of astronomical discovery of Arecibo Observatory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P65 wd:Q44547 }","paraphrases":[],"info":{}}
{"id":"train_17191","question":"\"Who is {songwriter} of {Symphonie Fantastique}, which has {plays} is {guitar} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q462313 wdt:P86 ?answer . ?answer wdt:P1303 wd:Q6607 }","paraphrases":["\"Who is {songwriter} of {Symphonie Fantastique}, which has {plays} is {guitar} ?\""],"info":{}}
{"id":"train_17193","question":"What position did Cuauhtémoc Cárdenas Solórzano hold in September 1976?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q922837 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1976' ) ) }","paraphrases":["In September 1976, which position was held by Cuauhtémoc Cárdenas Solórzano?"],"info":{}}
{"id":"train_17194","question":"Which is the trunk prefix for Jordan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q810 wdt:P3238 ?answer }","paraphrases":[],"info":{}}
