{"id":"train_6705","question":"Tell me flammable gas whose name has the word vinyl in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10913792 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vinyl' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal  me flammable gas whose name has the word vinyl in it."],"info":{}}
{"id":"train_6707","question":"Why did the lyricist split from the Fatal Illusion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21186583 wdt:P155 ?X . ?X wdt:P676 ?answer }","paraphrases":["Why did the lyricist part from the Deadly Figment?"],"info":{}}
{"id":"train_6708","question":"Who developed Nintendo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8093 wdt:P199 ?obj . ?obj wdt:P31 wd:Q210167 }","paraphrases":["Who created Nintendo?"],"info":{}}
{"id":"train_6709","question":"Who is the mother and what is the date of death of Pedro I who has daughter Isabel Maria de Alcântara Brasileira?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q3154857 . ?s pq:P25 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["Who is the mother and what is the date of passing of Pedro I who has girl Isabel Maria de Alcântara Brasileira?"],"info":{}}
{"id":"train_6710","question":"Which are the Bantu languages which start with letter z?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33146 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which are the Bantu dialects which begin with letter z?"],"info":{}}
{"id":"train_6711","question":"who  is the discoverer or inventor of quicksort?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q486598 wdt:P61 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the quicksort discoverer or inventor?"],"info":{}}
{"id":"train_6712","question":"What is {established by} {political office} of {Thomas de Lisle} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7795481 wdt:P39 ?X . ?X wdt:P112 ?answer }","paraphrases":["What is {built up by} {political office} of {Thomas de Lisle} ?"],"info":{}}
{"id":"train_6713","question":"Who was Francisco Goya's student?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1066 wd:Q5432 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What artist was the mentee of Francisco Goya?"],"info":{}}
{"id":"train_6715","question":"Is the{compression ratio} on {Fiat A.22} {equals} {4.4}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3744416 wdt:P1247 ?obj filter ( ?obj = 4.4 ) }","paraphrases":["Is the{compression proportion} on {Fiat A.22} {rises to} {4.4}"],"info":{}}
{"id":"train_6716","question":"who Wikimedia duplicated page for said to be the same as of Nintendo Entertainment System?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q172742 wdt:P460 ?obj . ?obj wdt:P31 wd:Q17362920 }","paraphrases":["who Wikimedia copied page for said to be the same as of Nintendo Excitement System?"],"info":{}}
{"id":"train_6717","question":"Is 1 the lower limit of the set of positive integers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47339953 wdt:P5447 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is 1 the lower restrain of the set of positive integers?"],"info":{}}
{"id":"train_6720","question":"Which qualification did Emmy Noether get and from which Institution?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q7099 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P276 ?value1 . }","paraphrases":["Which capability did Emmy Noether get and from which Institution?"],"info":{}}
{"id":"train_6721","question":"What was the profession of St Thomas Aquinas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P417 wd:Q9438 . ?sbj wdt:P31 wd:Q28640 }","paraphrases":["What was the calling of St Thomas Aquinas?"],"info":{}}
{"id":"train_6725","question":"What was Wally Pfister of the The Dark Knight nominated for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q163872 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q460144 }","paraphrases":["Wally Pfister received a nomination for The Dark Knight in which categoy?"],"info":{}}
{"id":"train_6726","question":"Sarah Silverman stars in which animated film?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P725 wd:Q229013 . ?sbj wdt:P31 wd:Q202866 }","paraphrases":["Sarah Silverman stars in which energized film?"],"info":{}}
{"id":"train_6728","question":"What was Senegal’s inflation rate in 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1041 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["In 2016 what was the invlation rate for Senegal?"],"info":{}}
{"id":"train_6729","question":"What are the part of speech which start with the letter verb","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q82042 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'verb' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the part of speech which begin with the letter verb"],"info":{}}
{"id":"train_6730","question":"Which is the {member of political party} where {member of} of {James_Monroe} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q11815 wdt:P102 ?ans_1 . wd:Q11815 wdt:P463 ?ans_2 }","paraphrases":["Which is the {part of political party} where {part of} of {James_Monroe} ?"],"info":{}}
{"id":"train_6731","question":"Tell me ceremonial county of England whose name has the word yorkshire in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q180673 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yorkshire' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know ceremonial province of Britain whose title has the word yorkshire in it."],"info":{}}
{"id":"train_6732","question":"Which is the voltage for Jersey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q785 wdt:P2436 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6733","question":"What film was directed by photographer Laszlo Kovacs and starts with the letter G.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24869 . ?sbj wdt:P344 wd:Q498696 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which film was directed by photographer Laszlo Kovacs and starts with letter G?"],"info":{}}
{"id":"train_6736","question":"Where is the location of work by Yayoi Kusama that also has counties in Shinjuku-ku?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q231121 wdt:P937 ?answer . ?answer wdt:P150 wd:Q179645 }","paraphrases":["Where is the area of work by Yayoi Kusama that too has districts in Shinjuku-ku?"],"info":{}}
{"id":"train_6737","question":"What is the statue of David?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q179900 wdt:P3467 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6738","question":"What are thecountry within the United Kingdom which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3336843 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are thecountry within the United Kingdom which begin with the letter s"],"info":{}}
{"id":"train_6739","question":"What is the artistic genre of the portrait The Deer Park?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7729563 wdt:P136 ?X . ?X wdt:P180 ?answer }","paraphrases":["What is the imaginative sort of the representation The Deer Stop?"],"info":{}}
{"id":"train_6740","question":"Name an historical period in the Christian calendar that starts with letter E","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11514315 . ?sbj wdt:P3075 wd:Q5043 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an historical duration in the Christian calendar that starts offevolved with letter E"],"info":{}}
{"id":"train_6743","question":"who country for head of government of mauricio macri?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q561837 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["who nation for head of government of mauricio macri?"],"info":{}}
{"id":"train_6745","question":"Which is the Bashkir encyclopedia ID of Bashkir version for Chinghiz Aitmatov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q484292 wdt:P4210 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6746","question":"WHAT IS THE CABLE STAYED BRIDGE THT STARTS WITH Y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q158555 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT IS THE CABLE Remained BRIDGE THT Begins WITH Y"],"info":{}}
{"id":"train_6748","question":"Who is the video game publisher of Hex whose shareholder is Hasbro, Inc.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q844874 wdt:P123 ?answer . ?answer wdt:P127 wd:Q501476 }","paraphrases":["Which shareholder of Hasbro, Inc. publishes Hex video games?"],"info":{}}
{"id":"train_6751","question":"What takes place in and what are the reasons for failure of Yan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1055713 wdt:P770 ?X . ?X wdt:P706 ?answer }","paraphrases":["What takes region in and what are the reasons for failure of Yan?"],"info":{}}
{"id":"train_6754","question":"Another term for Aphex Twin is Rikardo.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q223161 wdt:P735 ?answer . ?answer wdt:P460 wd:Q39164767 }","paraphrases":["Another term for Aphex Twin is Rikardo."],"info":{}}
{"id":"train_6755","question":"Name a character in The Da Vinci Code","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q81689 wdt:P674 ?obj . ?obj wdt:P31 wd:Q3658341 }","paraphrases":["Name a character in Code of Da Vinci"],"info":{}}
{"id":"train_6756","question":"What is Michael Schumacher's job title and when did he start?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q9671 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["What is the job title of Michael Schumacher and when did he begin?"],"info":{}}
{"id":"train_6757","question":"What degree did Mario Vargas receive at the Leoncio Prado Military Academy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q39803 p:P69 ?s . ?s ps:P69 wd:Q839058 . ?s pq:P512 ?value }","paraphrases":["With what degree did Mario Vargas graduate from Leoncio Prado Military Academy?"],"info":{}}
{"id":"train_6758","question":"what criteria is used to differentiate Proboscidea from Proboscidea?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q26308 p:P1889 ?s . ?s ps:P1889 wd:Q137309 . ?s pq:P1013 ?value }","paraphrases":["What information is used to determine the difference from Proboscidea and Proboscidea?"],"info":{}}
{"id":"train_6760","question":"What diplomatic ties exist between China and Eritrea?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q148 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q5100211 }","paraphrases":["What diplomatic ties is in between China and Eritrea?"],"info":{}}
{"id":"train_6761","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q220 . ?sbj wdt:P31 wd:Q79007 }","paraphrases":["n/a"],"info":{}}
{"id":"train_6762","question":"What was composed by Giselle that had his father as Louis Adam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q827436 wdt:P86 ?answer . ?answer wdt:P22 wd:Q1349517 }","paraphrases":["What was composed by Giselle that had his father as Louis Adam?"],"info":{}}
{"id":"train_6764","question":"Name a decay mode working with  gamma ray that contain the word \" beta\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3317792 . ?sbj wdt:P1542 wd:Q11523 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'beta' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a decay mode working with gamma ray that include the word \" beta\" in its name"],"info":{}}
{"id":"train_6765","question":"What are the belligerents of competes in Liu Xiang?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q211088 wdt:P1344 ?X . ?X wdt:P710 ?answer }","paraphrases":["What are Liu Xiang's contest belligerents?"],"info":{}}
{"id":"train_6770","question":"Which is the flood that the rain has effect in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1542 wd:Q7925 . ?sbj wdt:P31 wd:Q8068 }","paraphrases":["Which is the flood that the downpour has impact in?"],"info":{}}
{"id":"train_6772","question":"When did David Beckham receive the PFA Team of the Year award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q10520 p:P166 ?s . ?s ps:P166 wd:Q2044044 . ?s pq:P585 ?value }","paraphrases":["What year did David Beckham get the PFA Team of the Year award?"],"info":{}}
{"id":"train_6773","question":"In 1969-0-0 what is Greenland's population?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q223 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1969' ) ) }","paraphrases":["What is Greenland's population in 1969-0-0?"],"info":{}}
{"id":"train_6775","question":"Where did Nancy Pelosi major in political science ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q170581 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q36442 }","paraphrases":["Where did Nancy Pelosi major in political science ?"],"info":{}}
{"id":"train_6777","question":"Name a MediaWiki website located in Amsterdam that contains the word \"wikipedia\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15633582 . ?sbj wdt:P276 wd:Q727 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wikipedia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me me a province of China whose name consist of the word \"woman\" and whose category for films shot at this location Category:Films shot in Sichuan sichuan"],"info":{}}
{"id":"train_6778","question":"What is the length and cause of human fertilizaiton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2666904 wdt:P1542 ?X . ?X wdt:P2047 ?answer }","paraphrases":["What is the length and cause of human fertilizaiton?"],"info":{}}
{"id":"train_6779","question":"What is the catalog for \"A Love Supreme?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5106 wdt:P972 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6780","question":"What are the newspaper which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11032 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ş' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the newspaper that begins with the letter s"],"info":{}}
{"id":"train_6781","question":"What software version of Scala was published on June 23, 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q460584 p:P348 ?s . ?s ps:P348 ?obj . ?s pq:P577 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["What Scala version came out on June 23, 2015?"],"info":{}}
{"id":"train_6782","question":"What replaced the culture of Old English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q42365 wdt:P1366 ?ans_1 . wd:Q42365 wdt:P2596 ?ans_2 }","paraphrases":["The zeitgeist of Old English was usurped by what?"],"info":{}}
{"id":"train_6784","question":"What is Jerry O'Connel's birth location where John Lindsay is the mayor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q378672 wdt:P19 ?answer . ?answer wdt:P6 wd:Q666931 }","paraphrases":["What is Jerry O'Connel's birth area where John Lindsay is the mayor?"],"info":{}}
{"id":"train_6786","question":"Name the reservoir with the lowest hydraulic head whose tributary is ERROR1.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q131681 . ?ent wdt:P4441 ?obj . ?ent wdt:P974 wd:Q5882177 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Title the store with the most reduced water powered head whose tributary is ERROR1."],"info":{}}
{"id":"train_6787","question":"What is Robert McNamara's academic degree and major at University of California, Berkeley?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q191999 p:P69 ?s . ?s ps:P69 wd:Q168756 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What is Robert McNamara's scholarly degree and major at College of California, Berkeley?"],"info":{}}
{"id":"train_6788","question":"How many school children were in the neighborhood of the Arab Spring?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q33761 wdt:P276 ?X . ?X wdt:P2573 ?answer }","paraphrases":["How numerous school children were within the neighborhood of the Middle easterner Spring"],"info":{}}
{"id":"train_6789","question":"When was Benito Juárez elected as President of Mexico?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q182276 p:P39 ?s . ?s ps:P39 wd:Q628004 . ?s pq:P580 ?value }","paraphrases":["Benito Juarez was elected to the Presidency of Mexico in what year?"],"info":{}}
{"id":"train_6790","question":"Which sect of Christianity belongs to the Eastern Orthodox Church","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q35032 wdt:P140 ?obj . ?obj wdt:P31 wd:Q879146 }","paraphrases":["What christianity is in eastern orthodox church?"],"info":{}}
{"id":"train_6793","question":"What is the biography of Donald Trump","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q22686 wdt:P1455 ?obj . ?obj wdt:P31 wd:Q26876682 }","paraphrases":["What is the memoir of Donald Trump"],"info":{}}
{"id":"train_6794","question":"Which is the {religion} and the {sex or gender} of {Emma_Stone} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q147077 wdt:P140 ?ans_1 . wd:Q147077 wdt:P21 ?ans_2 }","paraphrases":["List Emma Stones religion and gender."],"info":{}}
{"id":"train_6795","question":"What time does Mercel Proust have his funeral?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7199 p:P793 ?s . ?s ps:P793 wd:Q201676 . ?s pq:P585 ?value }","paraphrases":["When does Mercel Proust's funeral begin?"],"info":{}}
{"id":"train_6798","question":"is it true that the flux of the leo cluster is greater than 6.512e-11","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2636046 wdt:P2221 ?obj filter ( ?obj > 6.512e-11 ) }","paraphrases":["Are the caps of the national campomar juan team equal to 26?"],"info":{}}
{"id":"train_6801","question":"When did member of sports team of Just Fontaine and number of points/goals/set scored?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q192749 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }","paraphrases":["When did part of sports group of Fair Fontaine and number of points/goals/set scored?"],"info":{}}
{"id":"train_6804","question":"Who is the president of the company that Karen Czarnecki works for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6369578 wdt:P108 ?X . ?X wdt:P1037 ?answer }","paraphrases":["Who is the president of the company that Karen Czarnecki works for?"],"info":{}}
{"id":"train_6805","question":"Tell me noble family whose name has the word usenberger in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13417114 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'üsenberger' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the noble family that has in it the word usenberger."],"info":{}}
{"id":"train_6807","question":"When did Toots Thielemans receive the award octave d'honneur?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q365567 p:P166 ?s . ?s ps:P166 wd:Q26481897 . ?s pq:P585 ?value }","paraphrases":["On which day was the octave d'honneur prize awarded to Toots Thielemans?"],"info":{}}
{"id":"train_6808","question":"How is the founder of the protoplanetary disk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q505781 wdt:P1542 ?X . ?X wdt:P61 ?answer }","paraphrases":["who founded the protoplanetary disk?"],"info":{}}
{"id":"train_6809","question":"What is an archaeological site located in Bodrum with the word \"mausoleum\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q839954 . ?sbj wdt:P131 wd:Q172267 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'mausoleum' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is an archaeological website online positioned in Bodrum with the word \"mausoleum\" in its name?"],"info":{}}
{"id":"train_6810","question":"What is the field of study and architectural style of Ramos de Azevedo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9300159 wdt:P149 ?X . ?X wdt:P101 ?answer }","paraphrases":["Which is the field of study and architectural style of Ramos de Azevedo"],"info":{}}
{"id":"train_6811","question":"How many illustrations are by Hirohika Araki ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P110 wd:Q719354 }","paraphrases":["Hirohika Araki made how many illustrations?"],"info":{}}
{"id":"train_6812","question":"What's the programming paradigm of the MXE language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28671337 wdt:P277 ?X . ?X wdt:P3966 ?answer }","paraphrases":["What's the programming worldview of the MXE language?"],"info":{}}
{"id":"train_6813","question":"What family was Genghis Khan in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q720 wdt:P53 ?obj . ?obj wdt:P31 wd:Q211503 }","paraphrases":["What family did Genghis Khan belong to?"],"info":{}}
{"id":"train_6814","question":"By what method was it determined that Cordoba has a population of 322867?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5818 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '322867.0' ) ) . ?s pq:P459 ?value }","paraphrases":["Cordoba has a population of 322867 according to which method?"],"info":{}}
{"id":"train_6815","question":"When did Dimitri Mendeleiv receive the Faraday Lectureship Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9106 p:P166 ?s . ?s ps:P166 wd:Q1994574 . ?s pq:P585 ?value }","paraphrases":["The Faraday Lectureship Prize was awarded to Dimitri Mendeleiv on what date?"],"info":{}}
{"id":"train_6816","question":"When did Plzeň receive the European Capital of Culture award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43453 p:P166 ?s . ?s ps:P166 wd:Q129372 . ?s pq:P585 ?value }","paraphrases":["Give me the date that Plzeň got his reward from the European Capital of Culture."],"info":{}}
