{"id":"train_2195","question":"Tell me the branch of biology that contains the word virology in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28598684 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'virology' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the department of science that contains the word virology in their name"],"info":{}}
{"id":"train_2196","question":"Which is the domain of saint or deity of Francis of Assisi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q676555 wdt:P2925 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2197","question":"Who gave the {titleholder} of {nomination received} of {Jennifer Capriati} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11680 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who gave the {titleholder} of {assignment gotten} of {Jennifer Capriati} ?"],"info":{}}
{"id":"train_2199","question":"When did noble title of Guy of Lusignan and follows?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["When did respectable title of Fellow of Lusignan and follows?"],"info":{}}
{"id":"train_2201","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1052846 wdt:P725 ?answer . ?answer wdt:P551 wd:Q49236 }","paraphrases":["What is it?"],"info":{}}
{"id":"train_2202","question":"Which is replaced by Tamar of Georgia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q244007 wdt:P1366 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2204","question":"Who is the {discography} for {discography} of {Yo-Yo Ma}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q234891 wdt:P358 ?obj . ?obj wdt:P31 wd:Q273057 }","paraphrases":["Who is the { discography } of { Yo - Yo Ma } for { discography }"],"info":{}}
{"id":"train_2206","question":"who citrate anion for conjugate base of citric acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q159683 wdt:P4149 ?obj . ?obj wdt:P31 wd:Q55502846 }","paraphrases":["What is the conjugate base of Citric Acid?"],"info":{}}
{"id":"train_2207","question":"What timezone has the largest UTC offset?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q17272482 . ?ent wdt:P2907 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What timezone has the largest UTC offset?"],"info":{}}
{"id":"train_2208","question":"what is the speed of sound of a nitric oxide at a temperature of 10 degree celcius?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q207843 p:P2075 ?s . ?s ps:P2075 ?obj . ?s pq:P2076 ?x filter ( contains ( ?x , '10.0' ) ) }","paraphrases":["At 10 degrees celcius, what is nitric oxide's speed of sound?"],"info":{}}
{"id":"train_2209","question":"when did receive the award of Golden Hocky Stick?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q295345 p:P166 ?s . ?s ps:P166 wd:Q207219 . ?s pq:P585 ?value }","paraphrases":["Who received the Golden Hocky Stick Award?"],"info":{}}
{"id":"train_2211","question":"Name the Original Public Ivy led by a chancellor that contains the word \"Carolina\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20971972 . ?sbj wdt:P2388 wd:Q61061 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'carolina' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title the First Open Ivy driven by a chancellor that contains the word \"Carolina\" in its name"],"info":{}}
{"id":"train_2212","question":"Who was Ruby Dee's spouse when their marriage ended in 2005?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q234360 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2005' ) ) }","paraphrases":["What was the name of Ruby Dee's spouse when their marriage ended in 2005?"],"info":{}}
{"id":"train_2213","question":"Which is located and participated in the conflict of Thomas Blamey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q952813 wdt:P607 ?X . ?X wdt:P276 ?answer }","paraphrases":["Which is positioned and participated in the battle of Thomas Blamey?"],"info":{}}
{"id":"train_2214","question":"When is the season beginning for the ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q301938 wdt:P1344 ?X . ?X wdt:P4794 ?answer }","paraphrases":["At which point in time is the season beginning?"],"info":{}}
{"id":"train_2215","question":"What unit of time can bu used to measure duration and contains the word \"year\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1790144 . ?sbj wdt:P111 wd:Q2199864 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'year' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What unit of time can bu used to measure period and contains the phrase \"year\" in its name"],"info":{}}
{"id":"train_2216","question":"When was Ralph Richardson nominated for Best Supporting Actor at the Academy awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q381285 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P805 ?value }","paraphrases":["When was the Academy Award for Best Supporting Actor awarded to Ralph Richardson?"],"info":{}}
{"id":"train_2217","question":"How was the population of the Los Rios Region determined to be 380131?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2177 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '380131' ) ) . ?s pq:P459 ?value }","paraphrases":["What information was used to determine a population of 380131 in the Los Rios Region?"],"info":{}}
{"id":"train_2219","question":"What are the Mahavidya which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1076022 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Mahavidya which begin with the letter t"],"info":{}}
{"id":"train_2220","question":"What style of architecture is Geraldine Page?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q228650 wdt:P485 ?X . ?X wdt:P149 ?answer }","paraphrases":["What is Geraldine Page's architectural style?"],"info":{}}
{"id":"train_2222","question":"What is the country code and internet domain of the European Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q458 wdt:P78 ?obj . ?obj wdt:P31 wd:Q42032 }","paraphrases":["What is the European Union's country code and internet domain?"],"info":{}}
{"id":"train_2223","question":"Tell me the activity which has social control as fabrication method and contains the word management in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1914636 . ?sbj wdt:P2079 wd:Q623971 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'management' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the action which has social control as creation strategy and contains the word administration in it's name?"],"info":{}}
{"id":"train_2224","question":"Who is the chef-lieu of the Deccan sultanates?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1183649 wdt:P36 ?X . ?X wdt:P1376 ?answer }","paraphrases":["Who is the chef-lieu of the Deccan sultanates?"],"info":{}}
{"id":"train_2226","question":"What's a significant universal event?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q1 wdt:P793 ?obj }","paraphrases":["What is a universal event of significance?"],"info":{}}
{"id":"train_2227","question":"Name a group of programming languages that contains the word \"linux \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16887380 . ?sbj wdt:P277 wd:Q165436 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'linux' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a crew of programming languages that carries the word \"linux \" in its name"],"info":{}}
{"id":"train_2228","question":"Is John Wayne and Marlene Dietricha a couple?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q40531 wdt:P451 wd:Q4612 }","paraphrases":["Are John Wayne and Marlene Dietricha in a relationship?"],"info":{}}
{"id":"train_2229","question":"Which is the review score for 12 Angry Men?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2345 wdt:P444 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2230","question":"what is  classical Japanese performing arts practiced by kabuki actor whose  name has the word kabuki in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11615913 . ?sbj wdt:P3095 wd:Q48146261 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'kabuki' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is classical Japanese performing arts practiced via kabuki actor whose name has the phrase kabuki in it"],"info":{}}
{"id":"train_2232","question":"Who does Michael Jordan play for and how many matches has he played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q41421 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["Who does Michael Jordan play for and how numerous matches has he played?"],"info":{}}
{"id":"train_2234","question":"What animated series does Phil LaMarr voice in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P725 wd:Q356541 . ?sbj wdt:P31 wd:Q581714 }","paraphrases":["What vivified arrangement does Phil LaMarr voice in?"],"info":{}}
{"id":"train_2236","question":"What geographical feature in Honshu is located at 39.533333333333 142.06666666667?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q13989 p:P1334 ?s . ?s ps:P1334 ?x filter ( contains ( ?x , '39.533333333333 142.06666666667' ) ) . ?s pq:P706 ?value }","paraphrases":["What geological include in Honshu is found at 39.533333333333 142.06666666667?"],"info":{}}
{"id":"train_2239","question":"what were the architecture  firm of  home water of  boston  celitics/","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131371 wdt:P115 ?X . ?X wdt:P84 ?answer }","paraphrases":["what were the engineering firm of domestic water of boston celitics/"],"info":{}}
{"id":"train_2240","question":"What is the time zone in Oxford?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q34217 p:P421 ?s . ?s ps:P421 wd:Q843589 . ?s pq:P1264 ?value }","paraphrases":["Can you tell me the time zone in Oxford?"],"info":{}}
{"id":"train_2241","question":"What person holding an honorary title was the Nobel prize in Physics for the becquerel named after?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q102573 wdt:P138 ?answer . ?answer wdt:P166 wd:Q38104 }","paraphrases":["What person holding an honorary title used to be the Nobel prize in Physics for the becquerel named after?"],"info":{}}
{"id":"train_2242","question":"What is the award received by Amnesty International and the amount of the prize money?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q42970 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }","paraphrases":["What is the grant gotten by Pardon Universal and the sum of the prize cash?"],"info":{}}
{"id":"train_2243","question":"What is the characters of the appears in of Stacy Warner ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2737645 wdt:P1441 ?X . ?X wdt:P674 ?answer }","paraphrases":["What characters does Stacy Warner appear as?"],"info":{}}
{"id":"train_2244","question":"Which monetary authority on the Singapore dollar has the lowest target interest rate ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q6899005 . ?ent wdt:P2661 ?obj . ?ent wdt:P38 wd:Q190951 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which Singapore Bank has the lowest interest rate?"],"info":{}}
{"id":"train_2245","question":"When was Ruhollah Khomeini, Supreme Leader of Iran, born, and when did he die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q38823 p:P39 ?s . ?s ps:P39 wd:Q332486 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When was Ruhollah Khomeini, Preeminent Pioneer of Iran, born, and when did he die?"],"info":{}}
{"id":"train_2246","question":"Who is the Inventor who was named after Titanium?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q716 wdt:P61 ?ans_1 . wd:Q716 wdt:P138 ?ans_2 }","paraphrases":["An inventor was named after Titanium- who?"],"info":{}}
{"id":"train_2250","question":"Tell me the timezone of the main office of the company Uber","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q780442 wdt:P159 ?X . ?X wdt:P421 ?answer }","paraphrases":["Let me know the timezone of the most office of the company Uber"],"info":{}}
{"id":"train_2251","question":"What position did Ahmad ibn Ibrihim al-Ghazi hold beginning in 1526?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q335728 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1526' ) ) }","paraphrases":["Ahmad ib Ibrhim al Ghazi held what position in 1526"],"info":{}}
{"id":"train_2252","question":"In the field of screenplays, what is Steve Gerber's craft?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2569995 wdt:P106 ?answer . ?answer wdt:P425 wd:Q103076 }","paraphrases":["What is Steve Gerber's craft in the screenplay field?"],"info":{}}
{"id":"train_2253","question":"When was Xi Jinping educated in year 1975?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q15031 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1975' ) ) }","paraphrases":["Was Xi Jinping educated in 1975?"],"info":{}}
{"id":"train_2254","question":"When is Louis Leakey received award of Hubbard Medal","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q14837 p:P166 ?s . ?s ps:P166 wd:Q4287207 . ?s pq:P585 ?value }","paraphrases":["On what date did Louis Leakey receive the Hubbard Medal award?"],"info":{}}
{"id":"train_2256","question":"Who is the head of government of Delaware?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1393 wdt:P6 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2259","question":"What award did Susan Sarandon receive in the year 1994?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q133050 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["In 1994, what award did Susan Sarandon receive?"],"info":{}}
{"id":"train_2260","question":"When did James Prescott Joule receive an Albert Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8962 p:P166 ?s . ?s ps:P166 wd:Q4710826 . ?s pq:P585 ?value }","paraphrases":["At what time did James Prescott Joule receive an Albert Medal?"],"info":{}}
{"id":"train_2261","question":"What is on the Bay of Tsushima Island, that is a tributary of Iwaki River","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q52051 wdt:P206 ?answer . ?answer wdt:P974 wd:Q5359180 }","paraphrases":["What is on the Bay of Tsushima Island, that is a tributary of Iwaki River"],"info":{}}
{"id":"train_2262","question":"What timeframe did Lucas Cranach, the Elder, work in Vienna?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q191748 p:P937 ?s . ?s ps:P937 wd:Q1741 . ?s pq:P580 ?value }","paraphrases":["During what time did Lucas Cranach, the Elder, work in Vienna?"],"info":{}}
{"id":"train_2263","question":"Is Prince George of Cambridge related to Charles, Prince of Wales and Pippa Middleton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13590412 wdt:P1038 wd:Q43274 . wd:Q13590412 wdt:P1038 wd:Q232465 }","paraphrases":["Are Charles, Prince of Wales, and Pippa Middleton related to Prince George?"],"info":{}}
{"id":"train_2264","question":"What is at the extreme point deepest of Guatemala, whose tributary is Riviere de Cavaillon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q774 wdt:P1589 ?answer . ?answer wdt:P974 wd:Q7338932 }","paraphrases":["What is at the extraordinary point most profound of Guatemala, whose tributary is Riviere de Cavaillon?"],"info":{}}
{"id":"train_2265","question":"What is Sanskrit's writing system?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11059 wdt:P282 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2266","question":"In what year was Grand Theft Auto developed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132730 wdt:P178 ?X . ?X wdt:P571 ?answer }","paraphrases":["In what year did they develop Grand Theft Auto?"],"info":{}}
{"id":"train_2268","question":"In what position did Arthur Henderson replace Austen Chamberlain?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q208665 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q188999 }","paraphrases":["Arthur Henderson replaced Austen Chamberlain in what position?"],"info":{}}
{"id":"train_2269","question":"What is the cat films shot of One Flew Over the Cuckoo's Nest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q171669 wdt:P840 ?X . ?X wdt:P1740 ?answer }","paraphrases":["What is the cat movies shot of One Flew Over the Cuckoo's Nest?"],"info":{}}
{"id":"train_2272","question":"Who has the daughter and son of Aglaé Auguié ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2826888 wdt:P40 ?X . ?X wdt:P22 ?answer }","paraphrases":["Who has the daughter and son of Aglaé Auguié ?"],"info":{}}
{"id":"train_2273","question":"What's the capital of Ōtsu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P36 wd:Q202907 }","paraphrases":[],"info":{}}
{"id":"train_2274","question":"What is the sub-item of the History of engineering, that has the same name as the technique?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5867819 wdt:P1269 ?answer . ?answer wdt:P460 wd:Q2695280 }","paraphrases":["What is the sub-item of the History of building, that has the same title as the technique?"],"info":{}}
{"id":"train_2276","question":"Was Srinivasa Ramanujan's field of work number theory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q83163 wdt:P101 wd:Q12479 }","paraphrases":["Did Srinivasa Ramanujan do number theory?"],"info":{}}
{"id":"train_2277","question":"What is Isiah Thomas' team position and specialty and participation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q298512 wdt:P413 ?ans_1 . wd:Q298512 wdt:P1344 ?ans_2 }","paraphrases":["What is Isiah Thomas' crew position and uniqueness and participation?"],"info":{}}
{"id":"train_2278","question":"What was the immediate outcome  originating  from the Silvertown explosion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3960716 wdt:P828 ?X . ?X wdt:P1536 ?answer }","paraphrases":["Which was the immediate outcome originating from the Silvertown explosion?"],"info":{}}
{"id":"train_2279","question":"What are the chemical phenomenon which start with the letter corrosion","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3382117 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'corrosion' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the chemical marvel which begin with the letter corrosion"],"info":{}}
{"id":"train_2280","question":"What's the currency for the Ryukyu Kingdom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q28025 wdt:P38 ?obj }","paraphrases":["What currency does the Ryukyu Kingdom utilize?"],"info":{}}
{"id":"train_2281","question":"What is the ticker symbol for NEC which has Nagoya as Stock Exchange?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q219203 p:P414 ?s . ?s ps:P414 wd:Q1188840 . ?s pq:P249 ?value }","paraphrases":["On the Nagoya Stock Exchange, what is the stock ticker symbol for NEC?"],"info":{}}
{"id":"train_2282","question":"Were Lionel Richie and Alexander Osminin singers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q26695 wdt:P106 wd:Q177220 . wd:Q26695 wdt:P106 wd:Q620773 }","paraphrases":["Did Both Alexander Osminin and Lionel Richie sing?"],"info":{}}
{"id":"train_2283","question":"Was Rafael Nadal nominated for Best Male Athlete ESPY Award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q10132 wdt:P1411 wd:Q4896724 }","paraphrases":["Has Rafael Nadal ever been nominated for the the Best Male Athlete ESPY Award?"],"info":{}}
{"id":"train_2284","question":"Where was Intel formed and where is the administrative territorial entity located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q248 wdt:P1454 ?ans_1 . wd:Q248 wdt:P131 ?ans_2 }","paraphrases":["Where was the place in which Intel formed located?"],"info":{}}
{"id":"train_2285","question":"When did John Wooden receive the Sports Illustrated Sportsperson of the Year award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q551032 p:P166 ?s . ?s ps:P166 wd:Q1653207 . ?s pq:P585 ?value }","paraphrases":["In what year was John Wooden awarded as Sports Illustrated Sportsperson of the Year?"],"info":{}}
{"id":"train_2286","question":"Where was the Frantisek Kupka burried whose catalog code is 22696","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q167414 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P528 ?x filter ( contains ( ?x , '22696' ) ) }","paraphrases":["Could you provide the Frantisek Kupka burried place, whose catalog code is 22696?."],"info":{}}
{"id":"train_2288","question":"Where is the birth place of Arnold Rothstein during the time Ardolph L. Kline was head of the National Guard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q696052 wdt:P19 ?answer . ?answer wdt:P6 wd:Q4121154 }","paraphrases":["Where is the beginning location of Arnold Rothstein for the duration of the time Ardolph L. Kline used to be head of the National Guard?"],"info":{}}
{"id":"train_2289","question":"What divisions are directed by the United Nations Secretary-General?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2388 wd:Q81066 . ?sbj wdt:P31 wd:Q15899789 }","paraphrases":["What divisions are coordinated by the Joined together Countries Secretary-General?"],"info":{}}
{"id":"train_2290","question":"Where was Brain Johnson born and where is his citizenship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q295948 wdt:P19 ?ans_1 . wd:Q295948 wdt:P27 ?ans_2 }","paraphrases":["In what year was Brian Johnson born, and where is he a citizen?"],"info":{}}
{"id":"train_2291","question":"What is the number of manufacturers held by Daimler AG?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P176 wd:Q27530 }","paraphrases":["By Daimler AF, what is the number of manufacturers held?"],"info":{}}
{"id":"train_2292","question":"Which is the form of currency of renminbi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P38 wd:Q39099 . ?sbj wdt:P31 wd:Q1172284 }","paraphrases":["Which is the shape of money of renminbi?"],"info":{}}
{"id":"train_2300","question":"Chris Froome has how many points classifications?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3494 wd:Q319591 }","paraphrases":["Provide the number of points classifications for Cris Froome."],"info":{}}
