{"id":"train_20413","question":"Where is the coastline of Bouvet Island?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q23408 wdt:P5141 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20414","question":"What volcanic rock starts starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q108689 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What volcanic shake begins begins with the letter \"t\"?"],"info":{}}
{"id":"train_20415","question":"Do Passiflora have a chromosome count equal to 72?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q161185 wdt:P5230 ?obj filter ( ?obj = 72 ) }","paraphrases":["Does Passiflora have a count of 72 chromosomes?"],"info":{}}
{"id":"train_20417","question":"What are the legal profession which start with the letter solicitor","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15987302 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'solicitor' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the criminal occupation which start with the letter solicitor"],"info":{}}
{"id":"train_20419","question":"Which country contains Sofia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P150 wd:Q472 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":[],"info":{}}
{"id":"train_20420","question":"Did Barack Obama give an academic degree to Gilbert Teodoro?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q76 wdt:P512 wd:Q1396192 }","paraphrases":["Is it true that Barack Obama gave an academic degree to Gilbert Teodoro?"],"info":{}}
{"id":"train_20421","question":"What is Reddit's working, name, or programming language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1136 wdt:P407 ?ans_1 . wd:Q1136 wdt:P277 ?ans_2 }","paraphrases":["Which programming language, working, and name does Reddit use?"],"info":{}}
{"id":"train_20422","question":"Where and what did David Cameron studied","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q192 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["Where and what did David Cameron considered"],"info":{}}
{"id":"train_20423","question":"What degree did Martin Luther King Jr. receive at the Crozer Theological Seminary?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8027 p:P69 ?s . ?s ps:P69 wd:Q687514 . ?s pq:P512 ?value }","paraphrases":["Martin Luther King Jr. was given what degree at the Crozer Theological Seminary?"],"info":{}}
{"id":"train_20425","question":"Tell me leather whose name has the word suede  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q286 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'suede' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know calfskin whose title has the word calfskin in it."],"info":{}}
{"id":"train_20426","question":"Which is the road that connects with Seville?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8717 wdt:P2789 ?obj . ?obj wdt:P31 wd:Q34442 }","paraphrases":["Which is the street that interfaces with Seville?"],"info":{}}
{"id":"train_20427","question":"How many children are out of school because of the decolonization of Africa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1146918 wdt:P30 ?X . ?X wdt:P2573 ?answer }","paraphrases":["How many youngsters are out of faculty due to the fact of the decolonization of Africa?"],"info":{}}
{"id":"train_20428","question":"Who is the person in the field of work of ophthalmology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P101 wd:Q161437 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is the title for people working in Ophthalmology?"],"info":{}}
{"id":"train_20429","question":"Who is the owner and where is the location of Southwest Airlines?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q503308 wdt:P1830 ?ans_1 . wd:Q503308 wdt:P740 ?ans_2 }","paraphrases":["What is the name of the owner of Southwest Airlines, and where is it based?"],"info":{}}
{"id":"train_20430","question":"The National Aeronautics and Space Administration is an organization from which federal government?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q23548 wdt:P749 ?obj . ?obj wdt:P31 wd:Q1006644 }","paraphrases":["Which federal government owns NASA?"],"info":{}}
{"id":"train_20431","question":"What method was used to determine that ASRGL1 had a genetic association to chronic obstructive pulmonary disease?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q199804 p:P2293 ?s . ?s ps:P2293 wd:Q18046601 . ?s pq:P459 ?value }","paraphrases":["In order to determine that ASRGL1 had a genetic association to chronic obstructive pulmonary disease, which method was used?"],"info":{}}
{"id":"train_20432","question":"Where is the birth place of Fred MacMurray?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q356309 wdt:P19 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20433","question":"Who is {musician} of {prequel of} of {Hero} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13423114 wdt:P156 ?X . ?X wdt:P175 ?answer }","paraphrases":["Who wrote the prequel of Hero?"],"info":{}}
{"id":"train_20434","question":"When did Rocío Jurado marry Pedro Carrasco?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q259152 p:P26 ?s . ?s ps:P26 wd:Q3374028 . ?s pq:P582 ?value }","paraphrases":["What date did Pedro Carrasco and Rocío Jurado get married?"],"info":{}}
{"id":"train_20435","question":"Who was the second doctoral advisor to Andreas Vesalius?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q170267 p:P184 ?s . ?s ps:P184 ?obj . ?s pq:P3831 wd:Q26236691 }","paraphrases":["Tell me who is Andreas Vesalius's second doctoral advisor?"],"info":{}}
{"id":"train_20436","question":"Which is the doctoral thesis for literary theory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1026 wd:Q459381 }","paraphrases":[],"info":{}}
{"id":"train_20437","question":"When did Muhammad Ali convert to Sunni Islam?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36107 p:P140 ?s . ?s ps:P140 wd:Q483654 . ?s pq:P580 ?value }","paraphrases":["Muhammad Ali's conversion to Sunni Islam took place when?"],"info":{}}
{"id":"train_20438","question":"What is unit symbol of lumen ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q484092 wdt:P558 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20439","question":"Who published the video game Pong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q216293 wdt:P123 ?obj . ?obj wdt:P31 wd:Q1137109 }","paraphrases":["Who released the Pong video game?"],"info":{}}
{"id":"train_20440","question":"What was the population of Mito on 4/1/2018?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q204249 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2018' ) ) }","paraphrases":["What was Mito's population on April 1, 2018?"],"info":{}}
{"id":"train_20441","question":"What was Harrison Ford's character role in Star Wars Episode VI: Return of the Jedi?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q181803 p:P161 ?s . ?s ps:P161 wd:Q81328 . ?s pq:P453 ?value }","paraphrases":["What part did Harrison Ford play in  Episode VI of Star Wars (i.e., Return of the Jedi)?"],"info":{}}
{"id":"train_20443","question":"What record is the held for disc golf and where is it held?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q876737 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P276 ?value1 . }","paraphrases":["What record is the held for plate golf and where is it held?"],"info":{}}
{"id":"train_20445","question":"What award did Ilya Mehnikov win where the champ was Louis Agassoz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q172254 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q122972 }","paraphrases":["What was the award Ilya Mehnikov won when Louis Agassoz was the champ?"],"info":{}}
{"id":"train_20446","question":"What award did Snow Crash receive in the year 2001?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q768389 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["In 2001, what was Snow Crash awarded?"],"info":{}}
{"id":"train_20447","question":"What TV network, broadcasting in English, contains the letters \"RT\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q561068 . ?sbj wdt:P2936 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'rt' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What TV network, broadcasting in English, includes the letters \"RT\" in its name?"],"info":{}}
{"id":"train_20448","question":"Which colony of the British Empire is the capital of Melbourne?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q3141 . ?sbj wdt:P31 wd:Q1351282 }","paraphrases":[],"info":{}}
{"id":"train_20449","question":"What are the aspect of music  which start with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15198957 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT IS THE ASPECT OF MUSIC THAT START WITH THE LETTER P"],"info":{}}
{"id":"train_20450","question":"How many different ways can you ingest acetaminophen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q57055 wdt:P636 ?obj }","paraphrases":["You can ingest acetaminophen how many different ways?"],"info":{}}
{"id":"train_20453","question":"What is the theme of Isaac's significant work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q671872 wdt:P793 ?obj . ?obj wdt:P31 wd:Q1406161 }","paraphrases":["What is the topic of Isaac's noteworthy work?"],"info":{}}
{"id":"train_20454","question":"What cast member's role is Miss Rosa in Orange is the New Black?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7099650 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q18158769 }","paraphrases":["WHICH  ACTOR PLAYED MISS ROSA IN ORANGE IS THE BLACK?"],"info":{}}
{"id":"train_20456","question":"What is the child astronomical body of makemake?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P398 wd:Q604 }","paraphrases":[],"info":{}}
{"id":"train_20458","question":"When did the Yukon have a population of 33,897?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2009 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '33897.0' ) ) . ?s pq:P585 ?value }","paraphrases":["The Yukon had a population of 33,897 in which year?"],"info":{}}
{"id":"train_20460","question":"Name a deity that starts with letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q178885 . ?sbj wdt:P2650 wd:Q106782 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a deity beginning with letter c"],"info":{}}
{"id":"train_20462","question":"Which decimal classification that has edition DDC 23 and which that starts with the letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1207369 . ?sbj wdt:P747 wd:Q15222117 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which decimal classification that has version DDC 23 and which that starts offevolved with the letter c"],"info":{}}
{"id":"train_20463","question":"Which is the magnetic ordering for Iron?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q677 wdt:P922 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20464","question":"What is the main location of Khanate of Khiva, who has the official title of Xiva, Хива?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q491106 wdt:P36 ?answer . ?answer wdt:P1448 ?x FILTER ( contains ( ?x , 'Xiva, Хива' ) ) }","paraphrases":["What is the most area of Khanate of Khiva, who has the official title of Xiva, Хива?"],"info":{}}
{"id":"train_20465","question":"Which voting round had the most abstentions?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q24097670 . ?ent wdt:P5043 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which round of voting was the most abstentive?"],"info":{}}
{"id":"train_20466","question":"Which are the subsidiary entities of shareholders of Harvard Mark I?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q776823 wdt:P127 ?X . ?X wdt:P355 ?answer }","paraphrases":["Which are the backup substances of shareholders of Harvard Stamp I?"],"info":{}}
{"id":"train_20471","question":"Is the Rosetta Stone an example of a stele?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q48584 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P642 wd:Q178743 }","paraphrases":["True or False:  The Rosetta Stone is an example of a stele."],"info":{}}
{"id":"train_20472","question":"For Superman, who was nominated for the Academy Award for Best Sound Mixing?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q213053 p:P1411 ?s . ?s ps:P1411 wd:Q830079 . ?s pq:P2453 ?value }","paraphrases":["Regarded the Academies Award nominations, who won for sound mixing on Superman?"],"info":{}}
{"id":"train_20473","question":"Name the Class IB flammable liquid with highest density?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P2054 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which flammable liquid is considered Class IB and also has the highest density?"],"info":{}}
{"id":"train_20476","question":"How is called the inscription on a remote control unit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q185091 wdt:P61 ?X . ?X wdt:P1412 ?answer }","paraphrases":["What is the inscription on a remote control unit called?"],"info":{}}
{"id":"train_20477","question":"what did the writers of the aryl hydrocarbon receptor work on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23917017 wdt:P50 ?X . ?X wdt:P108 ?answer }","paraphrases":["what did the journalists of the aryl hydrocarbon receptor work on?"],"info":{}}
{"id":"train_20478","question":"When did John Stockton finished his education at the Gonzaga University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q213346 p:P69 ?s . ?s ps:P69 wd:Q1537303 . ?s pq:P582 ?value }","paraphrases":["John Stockton completed his education a Gonzaga Univ on what date?"],"info":{}}
{"id":"train_20479","question":"What are the city/town which start with the letter yelnya","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7930989 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yelnya' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the city/town that begins with the letter yelnya"],"info":{}}
{"id":"train_20480","question":"What is the name of the tributary's river of the lake in New York?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1384 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["What is the name of the river connected to the lake in New York?"],"info":{}}
{"id":"train_20483","question":"was Alauddin Khalji the parent of Muiz ud din Qaiqabad and Qutb ud din Mubarak Shah?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q335362 wdt:P40 wd:Q2168115 . wd:Q335362 wdt:P40 wd:Q3179907 }","paraphrases":["Were Alauddin Khalji's children Muiz ud din Qaiqabad and Qutb ud din Mubarak Shah?"],"info":{}}
{"id":"train_20485","question":"What musical artists of Finlandia play the genre of music called incidental music?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q644152 wdt:P86 ?answer . ?answer wdt:P136 wd:Q1147752 }","paraphrases":["What musical artists of Finlandia play the genre of track called incidental music?"],"info":{}}
{"id":"train_20487","question":"What award did Walter Brennan receive in 1938?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q219521 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1938' ) ) }","paraphrases":["What was Walter Brennan awarded with in 1938?"],"info":{}}
{"id":"train_20489","question":"Tell me the polychoron that contains the word uniform in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2155148 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'uniform' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the polychoron in the name of the word uniform"],"info":{}}
{"id":"train_20490","question":"Name a movie in the Marvel Cinematic Universe released in 3D ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q642878 wdt:P1445 ?obj . ?obj wdt:P31 wd:Q229390 }","paraphrases":["Title a motion picture within the Wonder Cinematic Universe discharged in 3D ?"],"info":{}}
{"id":"train_20492","question":"Tell me Internet Standard whose name has the word utf  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q290378 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'utf' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know Web Standard whose title has the word utf in it."],"info":{}}
{"id":"train_20493","question":"Which is the award that Angus Deaton received following Jean Tirole","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q204078 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P155 wd:Q173994 }","paraphrases":["Following Jean Tirole, which award did Angus Deaton receive?"],"info":{}}
{"id":"train_20499","question":"Which Brazilian dam failure left the most missing people?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1033074 . ?ent wdt:P1446 ?obj . ?ent wdt:P17 wd:Q155 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the dam failure which occurred in Brazil that had the greatest amount of unaccounted for individuals."],"info":{}}
{"id":"train_20501","question":"Who is the person that was the wife of General Tom Thumb?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q918691 wdt:P26 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What is the name of General Tom Thumb's wife?"],"info":{}}
{"id":"train_20503","question":"\"Who is {died in} of {Patriarch Joseph}, that has {has districts} is {Yuzhnoye Tushino District} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q597539 wdt:P20 ?answer . ?answer wdt:P150 wd:Q2366829 }","paraphrases":["\"Who is {died in} of {Patriarch Joseph}, that has {has districts} is {Yuzhnoye Tushino District} ?\""],"info":{}}
{"id":"train_20507","question":"What colours are on Kashirskaya?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2329927 wdt:P81 ?X . ?X wdt:P462 ?answer }","paraphrases":["What colours are on Kashirskaya?"],"info":{}}
{"id":"train_20508","question":"\"Hannes Alfivén was a member of what organization that is headquartered in Frescati?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q54945 wdt:P463 ?answer . ?answer wdt:P159 wd:Q1455650 }","paraphrases":["\"Hannes Alfivén was a member of what agency that is headquartered in Frescati?\""],"info":{}}
{"id":"train_20510","question":"What is the unit of mass that contains the word \"way \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3647172 . ?sbj wdt:P111 wd:Q11423 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wey' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the unit of mass containing in its name the word \"way?\""],"info":{}}
{"id":"train_20511","question":"which is the {instance of} for {Solomon} where {date of death} as {-931-1-1} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q37085 p:P570 ?s . ?s ps:P570 ?x filter ( contains ( ?x , '-931-1-1' ) ) . ?s pq:P31 ?value }","paraphrases":["which Solomon died in -931-1-1"],"info":{}}
{"id":"train_20512","question":"Name a city next to LOS angeles","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q65 wdt:P47 ?obj . ?obj wdt:P31 wd:Q1093829 }","paraphrases":["Name a town next to the LOS angel"],"info":{}}
{"id":"train_20515","question":"What position ended for Louis Jules Trochu on 1-22-1871?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q441235 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1871' ) ) }","paraphrases":["On Jan. 22, 1871 what came to an end for Louis Jules Trochu?"],"info":{}}
{"id":"train_20517","question":"Is Forest Whitaker in genres of buddy films and drama?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q182763 wdt:P136 wd:Q663106 . wd:Q182763 wdt:P136 wd:Q21010853 }","paraphrases":["Does Forest Whitaker perform in the genres of buddy films and drama?"],"info":{}}
{"id":"train_20519","question":"Which  is symbol of inverse of impedance ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q179043 wdt:P461 ?X . ?X wdt:P416 ?answer }","paraphrases":["What symbol means the opposite of impedance?"],"info":{}}
{"id":"train_20521","question":"which battle that participant nazi germany starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q178561 . ?sbj wdt:P710 wd:Q7318 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which fight that member nazi germany begins with s"],"info":{}}
{"id":"train_20524","question":"What language pronounces kale as \"Ka-kale.ogg\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q45989 p:P443 ?s . ?s ps:P443 ?x filter ( contains ( ?x , 'Ka-kale.ogg' ) ) . ?s pq:P407 ?value }","paraphrases":["Who pronounces kale as \"ka-kale.ogg\"?"],"info":{}}
{"id":"train_20527","question":"Which is the extensive physical quantity measured by an electronvolt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q83327 wdt:P111 ?obj . ?obj wdt:P31 wd:Q3386703 }","paraphrases":[],"info":{}}
{"id":"train_20528","question":"When did Chris Hadfield receive an award and what for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q1076962 p:P166 ?s . ?s ps:P166 wd:Q11415564 . ?s pq:P585 ?value1 . ?s pq:P101 ?value2 }","paraphrases":["When did Chris Hadfield get an grant and what for?"],"info":{}}
{"id":"train_20532","question":"Which ship has the most masts?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11446 . ?ent wdt:P1099 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What ship has the most masts?"],"info":{}}
{"id":"train_20533","question":"What computer file can produce a spreadsheet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q183197 wdt:P1056 ?obj . ?obj wdt:P31 wd:Q82753 }","paraphrases":["What computer record can deliver a spreadsheet?"],"info":{}}
