{"id":"train_9780","question":"What is the citizenship of Henry Cavendish whose end cause is Acts of Union 1800?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131733 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P1534 wd:Q343100 }","paraphrases":["Henry Cavendish whose end cause is Acts of Union 1800, has a citizenship of what?"],"info":{}}
{"id":"train_9781","question":"How many architects are by Buckminster Fuller","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P84 wd:Q102289 }","paraphrases":["Which is the number of architects that are by Buckminster Fuller?"],"info":{}}
{"id":"train_9782","question":"What is the file extension for Prolog?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q163468 wdt:P1195 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9783","question":"how many lake inflows does the irtysh river have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P200 wd:Q128102 }","paraphrases":["Into how many lakes does the Irtysh river flow?"],"info":{}}
{"id":"train_9787","question":"What is the name of the United Methodist Church's cemetary?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P140 wd:Q329646 . ?sbj wdt:P31 wd:Q39614 }","paraphrases":["What is the title of the Joined together Methodist Church's cemetary?"],"info":{}}
{"id":"train_9788","question":"When did Fujitsu have a total revenue of 5.0317e + 10?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q186394 p:P2139 ?s . ?s ps:P2139 ?x filter ( contains ( ?x , '5.0317e+10' ) ) . ?s pq:P585 ?value }","paraphrases":["Give me the date that Fujitsu had a total revenue of 5.0317e + 10."],"info":{}}
{"id":"train_9789","question":"What illness did Lee Marvin die of which had symptoms including nausea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q76895 wdt:P509 ?answer . ?answer wdt:P780 wd:Q186889 }","paraphrases":["What was Lee Marvin's disease whose symptoms included nausea?"],"info":{}}
{"id":"train_9791","question":"What is the conjugate acid of nitric acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4147 wd:Q83320 . ?sbj wdt:P31 wd:Q3269344 }","paraphrases":["WHICH IS THE CONJUGATE ACID OF NITRIC ACID"],"info":{}}
{"id":"train_9793","question":"Who is the diplomatic relations citizen of Kitty Wells","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q272913 wdt:P27 ?X . ?X wdt:P530 ?answer }","paraphrases":["Who is the conciliatory relations citizen of Kitty Wells"],"info":{}}
{"id":"train_9794","question":"What agent participated in the conflict of Lajos Morocz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q47462699 wdt:P607 ?X . ?X wdt:P710 ?answer }","paraphrases":["In the conflict of Lajos Morocz, what agent participated?"],"info":{}}
{"id":"train_9795","question":"What type of destruction does a flood cause?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P770 wd:Q8068 }","paraphrases":[],"info":{}}
{"id":"train_9798","question":"What was Gianluigi Buffon`s point score for Italy`s under-23 football team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q68060 p:P54 ?s . ?s ps:P54 wd:Q3873569 . ?s pq:P1351 ?value }","paraphrases":["How many points did Gianluigi Buffon score in the under 23 football team?"],"info":{}}
{"id":"train_9799","question":"When did George Akerlof receive the Sverges Riksbank prize in Economic Sciences in memory of Alfred Nobel?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q222541 p:P166 ?s . ?s ps:P166 wd:Q47170 . ?s pq:P1706 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["On what date was George Akerlof awarded the Sverges Riksbank prize in Economic Sciences in memory of Alfred Nobel?"],"info":{}}
{"id":"train_9800","question":"What city became Guanajuato's sister city on November 6, 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q46475 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["WHAT TOWN BECAME GUANAJUATO'S TWIN TOWN ON NOVEMBER 6, 2014?"],"info":{}}
{"id":"train_9802","question":"What is the effect of cellulose administered by eye contact?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q80294 wdt:P1542 ?answer . ?answer wdt:P636 wd:Q21074571 }","paraphrases":["What is the impact of cellulose managed by eye contact?"],"info":{}}
{"id":"train_9804","question":"Which golf course with the highest par is in California?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1048525 . ?ent wdt:P3530 ?obj . ?ent wdt:P131 wd:Q99 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which golf course with the best possible par is in California?"],"info":{}}
{"id":"train_9808","question":"derive me that wikimedia set index article which starts with the letter t in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15623926 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["infer me that wikimedia set list article which begins with the letter t in it."],"info":{}}
{"id":"train_9812","question":"What was Ben Bernanke a member of when he left in June of 2005?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q201795 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2005' ) ) }","paraphrases":["What office did Ben Bernanake serve when he left in 2005?"],"info":{}}
{"id":"train_9814","question":"Which is the outcome of using treatment for chemotherapy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q974135 wdt:P1542 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What is the consequence of employing chemotherapy treatment?"],"info":{}}
{"id":"train_9816","question":"Give me the highest clock speed of chip on the system ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q610398 . ?ent wdt:P2149 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Provide me the most elevated clock speed of chip on the framework ?"],"info":{}}
{"id":"train_9817","question":"When will Shandong have a population of 9.57931e+07?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43407 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '9.57931e+07' ) ) . ?s pq:P585 ?value }","paraphrases":["What year will Shandong have a population of  9.57931e+07?"],"info":{}}
{"id":"train_9821","question":"When did Mahmoud Abbas begin his job as the President of the State of Palestine?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q127998 p:P39 ?s . ?s ps:P39 wd:Q3911022 . ?s pq:P580 ?value }","paraphrases":["Mahmoud Abbas begun his job as the President of the State of Palestine on what date?"],"info":{}}
{"id":"train_9824","question":"Who is the head coach of Arsenal F.C.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9617 wdt:P286 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9825","question":"Which boroughs was the birth place of Zhao Tuo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q701895 wdt:P19 ?X . ?X wdt:P150 ?answer }","paraphrases":["Which boroughs was the birth put of Zhao Tuo?"],"info":{}}
{"id":"train_9826","question":"What are the religious text which start with the letter tohorot","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179461 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tohorot' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the religious text which begin with the letter tohorot"],"info":{}}
{"id":"train_9827","question":"When was Saddam Hussein educated at Cairo University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1316 p:P69 ?s . ?s ps:P69 wd:Q194445 . ?s pq:P580 ?value }","paraphrases":["When did Saddam Hussein attended to Cairo University?"],"info":{}}
{"id":"train_9828","question":"What are theartistic theme which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1406161 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the theme that begins with the letter t"],"info":{}}
{"id":"train_9830","question":"What is { usage } of { Dick Cheney } that is { start time } { 2001 - 6 - 0 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q48259 p:P2283 ?s . ?s ps:P2283 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["What is { utilization } of { Dick Cheney } that's { begin time } { 2001 - 6 - }?"],"info":{}}
{"id":"train_9832","question":"What group or class of chemicals has the greatest tensile strength?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q17339814 . ?ent wdt:P5479 ?obj . ?ent wdt:P31 wd:Q17339814 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Chemicals from what class/group has the largest tensile strength?"],"info":{}}
{"id":"train_9833","question":"Where was Constantine the Great born, and where did he die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q8413 wdt:P19 ?ans_1 . wd:Q8413 wdt:P20 ?ans_2 }","paraphrases":["Give the locations of Constantine the Great's birth and death."],"info":{}}
{"id":"train_9834","question":"What is the award of Al Gore whose 1st place medalist is David Trimble?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19673 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q192556 }","paraphrases":["What is the award of Al Gore whose 1st vicinity medalist is David Trimble?"],"info":{}}
{"id":"train_9835","question":"Is water density more than 1.1998074?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q283 wdt:P2054 ?obj filter ( ?obj > 1.1998074 ) }","paraphrases":["Is water's density higher than 1.1998074?"],"info":{}}
{"id":"train_9836","question":"In the Mauna Kea Observatories, which asteroid had the maximum radius?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2120 ?obj . ?ent wdt:P65 wd:Q831790 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which asteroid in the Manuna Kea Observatories has the maximum radius?"],"info":{}}
{"id":"train_9838","question":"Is the maximum frequency of audible sound of the sheep less than 24000.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7368 wdt:P3465 ?obj filter ( ?obj < 24000.0 ) }","paraphrases":["Is 24000.0 more than the maximum frequency of sheep noises?"],"info":{}}
{"id":"train_9840","question":"What is the affiliation of the Hebrew University of Jerusalem?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1416 wd:Q174158 }","paraphrases":["What countries share borders with Chile?"],"info":{}}
{"id":"train_9841","question":"WHICH IS THE WEB SEARCH ENGINE THAT STARTS WITH Y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4182287 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What search engine starts with \"y\"?"],"info":{}}
{"id":"train_9845","question":"What is vehicle normally used for Convertible ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3438 wd:Q55989 }","paraphrases":[],"info":{}}
{"id":"train_9846","question":"which is the pronounciation audio  of ingredient of marmalade?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5834964 wdt:P186 ?X . ?X wdt:P443 ?answer }","paraphrases":["which is the pronounciation sound of fixing of marmalade?"],"info":{}}
{"id":"train_9848","question":"When was the University of Leeds known as Yorkshire College?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q503424 p:P155 ?s . ?s ps:P155 wd:Q24637302 . ?s pq:P585 ?value }","paraphrases":["University of Leeds was known as Yorkshire College when?"],"info":{}}
{"id":"train_9849","question":"Who is Ferdinand II of Aragon's son-in-law?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12860 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q3752578 }","paraphrases":["Who is the son-in-law of Ferdinand II of Aragon?"],"info":{}}
{"id":"train_9852","question":"Are the ballots cast in the Catalan regional election 2015 in Pontons more than 225.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44910740 wdt:P1868 ?obj filter ( ?obj > 225.6 ) }","paraphrases":["What are the number of ballots cast in the Catalan regional election in 2015?"],"info":{}}
{"id":"train_9855","question":"What are the based on and the influenced by of Linux?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q388 wdt:P144 ?ans_1 . wd:Q388 wdt:P737 ?ans_2 }","paraphrases":["What is Linux based on and influenced by?"],"info":{}}
{"id":"train_9859","question":"What vein is connected with the audio Ta-இதயம்.ogg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9609 wdt:P2789 ?answer . ?answer wdt:P443 ?x FILTER ( contains ( ?x , 'Ta-இதயம்.ogg' ) ) }","paraphrases":["what vain connects the audio Ta-இதயம்.ogg?"],"info":{}}
{"id":"train_9861","question":"What award nomination did Nick Park receive for the 66th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q336206 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q944352 }","paraphrases":["What award was Nick Park nominated for in the 66th Oscars?"],"info":{}}
{"id":"train_9862","question":"Which are the characters for Tosca?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q192941 wdt:P674 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9864","question":"When did Zeppotron produce Black Mirror?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q558112 p:P272 ?s . ?s ps:P272 wd:Q8069350 . ?s pq:P580 ?value }","paraphrases":["In what year was Black Mirror produced by Zeppotron?"],"info":{}}
{"id":"train_9865","question":"What is the first name of Jerzy Rubach, that is equivalent to the Gorch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11725319 wdt:P735 ?answer . ?answer wdt:P460 wd:Q13188334 }","paraphrases":["What is the first name of Jerzy Rubach, that is equal to the Gorch?"],"info":{}}
{"id":"train_9866","question":"Sovereignty has taken on a different meaning with the development of the principle of self-determination and the prohibition against the threat or use of force as jus cogens norms of modern international law. The United Nations Charter, the Draft Declaration on Rights and Duties of States, and the charters of regional international organizations express the view that all states are juridically equal and enjoy the same rights and duties based upon the mere fact of their existence as persons under international law.[8][9] The right of nations to determine their own political status and exercise permanent sovereignty within the limits of their territorial jurisdictions is widely recognized.[10][11][12]\n\nIn political science, sovereignty is usually defined as the most essential attribute of the state in the form of its complete self-sufficiency in the frames of a certain territory, that is its supremacy in the domestic policy and independence in the foreign one.[13]","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49241 wdt:P17 ?X . ?X wdt:P463 ?answer }","paraphrases":["Sway has taken on a distinctive meaning with the improvement of the rule of self-determination and the disallowance against the risk or utilize of drive as jus cogens standards of present day worldwide law. The Joined together Countries Constitution, the Draft Announcement on Rights and Obligations of States, and the charters of territorial worldwide organizations express the see that all states are juridically rise to and appreciate the same rights and obligations based upon the insignificant truth of their presence as people beneath worldwide law.[8][9] The correct of countries to decide their claim political status and work out changeless sway inside the limits of their regional locales is broadly recognized.[10][11][12] In political science, sovereignty is as a rule characterized as the foremost fundamental trait of the state within the form of its complete self-sufficiency within the outlines of a certain region, that's its matchless quality within the household approach and freedom within the outside one.[13]"],"info":{}}
{"id":"train_9867","question":"Did {J._Edgar_Hoover} is {educated at} {The Catholic University of America} and {George Washington University Law School} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q210435 wdt:P69 wd:Q179036 . wd:Q210435 wdt:P69 wd:Q5546035 }","paraphrases":["Did J. Edgar Hoover attend school at The Catholic University of America and George Washington University Law School?"],"info":{}}
{"id":"train_9869","question":"Tell me the theory that was named by Fred Hoyle and contains the word bang in the name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17737 . ?sbj wdt:P3938 wd:Q183397 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'bang' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the hypothesis that was named by Fred Hoyle and contains the word blast within the title"],"info":{}}
{"id":"train_9870","question":"Where did the head of national government, Jan Dismas Zelenka, die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q157777 wdt:P20 ?X . ?X wdt:P6 ?answer }","paraphrases":["Where did the head of national government, Jan Dismas Zelenka, kick the bucket?"],"info":{}}
{"id":"train_9871","question":"How much did Richie McCaw score and what team did he play for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q726148 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }","paraphrases":["How much did Richie McCaw score and what group did he play for?"],"info":{}}
{"id":"train_9872","question":"name a child of Leif Erikson","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P40 wd:Q42838 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["title a child of Leif Erikson"],"info":{}}
{"id":"train_9873","question":"Is the power consumed by the Montmartre funicular 129000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q99562 wdt:P2791 ?obj filter ( ?obj = 129000 ) }","paraphrases":["Does the amount of power that's consumed by the Montmartre funicular equal 129000?"],"info":{}}
{"id":"train_9874","question":"Tell me the medication used for the treatment of post-traumatic stress disorder.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q202387 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q12140 }","paraphrases":["Let me know the pharmaceutical utilized for the treatment of post-traumatic stretch clutter."],"info":{}}
{"id":"train_9876","question":"What genetic association with type I hypersensitivity has ortholog of abl2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42982 wdt:P2293 ?answer . ?answer wdt:P684 wd:Q29773403 }","paraphrases":["What genetic association with kind I hypersensitivity has ortholog of abl2?"],"info":{}}
{"id":"train_9877","question":"What is the total exports for Northern England?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1788657 wdt:P2135 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9879","question":"Which is the Infopatrimônio ID of Estádio do Maracanã?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q155174 wdt:P4372 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9880","question":"What award did Alice Hamilton receive in 1947?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q275600 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1947' ) ) }","paraphrases":["Wich award was given to Alice Hamilton in 1947?"],"info":{}}
{"id":"train_9881","question":"What are the album which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482994 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the album that begins with the letter w"],"info":{}}
{"id":"train_9882","question":"What character in Lawrence of Arabia is played by Jack Hawkins?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q228186 p:P161 ?s . ?s ps:P161 wd:Q26118 . ?s pq:P453 ?value }","paraphrases":["Who did Jack Hawkins play in Lawrence of Arabia?"],"info":{}}
{"id":"train_9885","question":"What church is dedicated to the Virgin Mary and the church name starts with D.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56242215 . ?sbj wdt:P825 wd:Q345 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What church is devoted to the Virgin Mary and the church name begins with D."],"info":{}}
{"id":"train_9886","question":"When was Bonar Law elected as a member of the 30th Parliament of the United Kingdom and why did he leave the position?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q166663 p:P39 ?s . ?s ps:P39 wd:Q41582581 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["When was Bonar Law elected as a member of the 30th Parliament of the United Kingdom and why did he leave the position?"],"info":{}}
{"id":"train_9887","question":"WHICH IS THE BOOK WITH MAXIMUM NUMBER OF PARTS OF A WORK OF ART","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q571 . ?ent wdt:P2635 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What book has the most parts of a work of art?"],"info":{}}
{"id":"train_9889","question":"What serial number the award received by Semyon timoshenko as Order of Victory?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q191702 p:P166 ?s . ?s ps:P166 wd:Q465316 . ?s pq:P2598 ?value }","paraphrases":["What was the serial number of the award received by Semyon Tmoshenkofrom Order of Victory?"],"info":{}}
{"id":"train_9890","question":"For U.S. jurisdiction what is the constitutional republic for the U.S. Declaration of  Independence","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q127912 wdt:P1001 ?obj . ?obj wdt:P31 wd:Q1520223 }","paraphrases":[],"info":{}}
{"id":"train_9893","question":"Name a confederation in the Roman Empire.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q2277 . ?sbj wdt:P31 wd:Q170156 }","paraphrases":[],"info":{}}
{"id":"train_9894","question":"Who {has sons} of {son of} of {Fu Xi} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q236972 wdt:P22 ?X . ?X wdt:P40 ?answer }","paraphrases":["Who {has children} of {child of} of {Fu Xi} ?"],"info":{}}
{"id":"train_9895","question":"What twinned administrative body of Cuenca began on March 14, 2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q54886 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["Which administrative twins began on March 14, 2000 in Cuenca?"],"info":{}}
{"id":"train_9897","question":"How many producer for Gladiator?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q128518 wdt:P162 ?obj }","paraphrases":["What is the number of producers for Gladiator?"],"info":{}}
{"id":"train_9898","question":"Is the number of points/goals/sets scored by the 2007 UEFA Futsal Championship more than 66.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q116525 wdt:P1351 ?obj filter ( ?obj > 66.4 ) }","paraphrases":["Were more that 66.4 goals scored in the 2007 UEFA Futsal Championship?"],"info":{}}
