{"id":"train_11232","question":"TELL ME METROPOLITAN CITY OF SOUTH KOREA WHICH START WITH THE LETTER U.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482821 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know METROPOLITAN CITY OF SOUTH KOREA WHICH Begin WITH THE LETTER U."],"info":{}}
{"id":"train_11233","question":"Is Budapest a twinned administrative body with Tehran and San Vito al Tagliamento?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1781 wdt:P190 wd:Q3616 . wd:Q1781 wdt:P190 wd:Q53194 }","paraphrases":["I want to know if Budapest is a twinned administrative body with Tehran and San Vito al Tagliamento?"],"info":{}}
{"id":"train_11238","question":"who subsidiary company of label of deep purple ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q101505 wdt:P264 ?X . ?X wdt:P355 ?answer }","paraphrases":["who auxiliary company of name of profound purple ?"],"info":{}}
{"id":"train_11239","question":"What is the filmography of Ron Howard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q103646 wdt:P1283 ?obj . ?obj wdt:P31 wd:Q1371849 }","paraphrases":["What is the filmography of Ron Howard?"],"info":{}}
{"id":"train_11240","question":"Where did Lionel of Antwerp's sister live?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q313846 wdt:P3373 ?X . ?X wdt:P53 ?answer }","paraphrases":["Where did Lionel of Antwerp's sister live?"],"info":{}}
{"id":"train_11241","question":"What is the voivodeship of Beni Suef Governorate that has diplomatic relation to South Korea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q30683 wdt:P131 ?answer . ?answer wdt:P530 wd:Q884 }","paraphrases":["What is Beni Suef Governorate's voivodeship with a diplomatic relationship with South Korea"],"info":{}}
{"id":"train_11245","question":"A professional in the field of ecology is given what title?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P425 wd:Q7150 . ?sbj wdt:P31 wd:Q28640 }","paraphrases":["An expert in the field of nature is given what title?"],"info":{}}
{"id":"train_11247","question":"What is the address of Robertt Louis Stevenson's birthplace in Edinburgh?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1512 p:P19 ?s . ?s ps:P19 wd:Q23436 . ?s pq:P969 ?value }","paraphrases":["Where is Robertt Louis Stevenson's birthplace in Edinburgh located?"],"info":{}}
{"id":"train_11249","question":"Who is the Captain of the Montreal Canadiens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q188143 wdt:P634 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11250","question":"How many students did Hans Hofmann have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1066 wd:Q215461 }","paraphrases":["Hans Hofmann had how many students?"],"info":{}}
{"id":"train_11253","question":"Was Ricky_Martin genre reggae  and beat music?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q128799 wdt:P136 wd:Q9794 . wd:Q128799 wdt:P136 wd:Q546264 }","paraphrases":["What genre of music did Ricky Martin perform?"],"info":{}}
{"id":"train_11255","question":"What is the craft of Maria Sharapova, whose field of this craft is tennis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11666 wdt:P106 ?answer . ?answer wdt:P425 wd:Q847 }","paraphrases":["What is the create of Maria Sharapova, whose field of this create is tennis?"],"info":{}}
{"id":"train_11256","question":"When did Mohammad Reza Pahlavi step down as Shah?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q128245 p:P39 ?s . ?s ps:P39 wd:Q184299 . ?s pq:P582 ?value }","paraphrases":["In what year di Mohammad Reza Pahlavi give up his throne."],"info":{}}
{"id":"train_11258","question":"What is the thermal conductivity of aluminium?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q663 wdt:P2068 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11260","question":"Is Lil Wayne's country of citizenship the United States of America?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q15615 wdt:P27 wd:Q30 }","paraphrases":["Is Lil Wayne a US citizen?"],"info":{}}
{"id":"train_11261","question":"WHICH IS THE NUCLEAR WEAPON WITH MAXIMUM EXPLOSIVE ENERGY EQUIVALENT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12802 . ?ent wdt:P2145 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["WHAT IS THE NUCLEAR WEAPON WITH MAXIMUM EQUIVALENT ENERGY"],"info":{}}
{"id":"train_11263","question":"What is the featured work in Albany?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27990788 wdt:P1441 ?X . ?X wdt:P156 ?answer }","paraphrases":["What is the highlighted work in Albany?"],"info":{}}
{"id":"train_11264","question":"Tell me book of the bible whose name has the word song in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29154430 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'song' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what book of the bible has the word song within it?"],"info":{}}
{"id":"train_11265","question":"\"Who has local government areas in Inchecon, with co-ords of 37.4094?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20934 wdt:P150 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '37.4094' ) ) }","paraphrases":["\"Who has nearby government regions in Inchecon, with co-ords of 37.4094?\""],"info":{}}
{"id":"train_11268","question":"Who designed the Mausoleum of Maussollos?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q45368 wdt:P84 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who planned the Tomb of Maussollos?"],"info":{}}
{"id":"train_11270","question":"Which is the science award that is conferred by the Columbia University and contains the word prize in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11448906 . ?sbj wdt:P1027 wd:Q49088 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'prize' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the science grant that is given by the Columbia University and contains the word prize in it's name?"],"info":{}}
{"id":"train_11272","question":"Which is the IDESCAT territorial code in Catalonia for Badalona?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q15468 wdt:P4335 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11275","question":"What is the name of the circular saw model and its acoustic power?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23811261 . ?ent wdt:P2797 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the name and acoustic power of the circular saw?"],"info":{}}
{"id":"train_11278","question":"Jimmy Page has how many producers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P162 wd:Q165467 }","paraphrases":["Which is the number of producers that Jimmy Page has?"],"info":{}}
{"id":"train_11279","question":"Which is the television film that was based on Twenty Thousand Leagues Under the Sea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P144 wd:Q183565 . ?sbj wdt:P31 wd:Q506240 }","paraphrases":["Which is the tv film that was based on Twenty Thousand Associations Beneath the Sea?"],"info":{}}
{"id":"train_11281","question":"How many series are with Metroid} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P179 wd:Q12397 }","paraphrases":["What is the string number with Metroid}?"],"info":{}}
{"id":"train_11284","question":"What is the artistic works of Isabelle Adjan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q106383 wdt:P800 ?answer . ?answer wdt:P1877 wd:Q38337 }","paraphrases":["What is the imaginative works of Isabelle Adjan?"],"info":{}}
{"id":"train_11286","question":"which construction has starts with z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q811430 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which construction has begins with z"],"info":{}}
{"id":"train_11291","question":"Who was the spouse of Cher in 1979?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12003 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1979' ) ) }","paraphrases":["Who was the life partner of Cher in 1979? Give the title of the grant gotten by Walter Gropius in 1961?"],"info":{}}
{"id":"train_11292","question":"What is the native language and history of the Romani people?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q8060 wdt:P103 ?ans_1 . wd:Q8060 wdt:P2184 ?ans_2 }","paraphrases":["What is Romani people native language and history?"],"info":{}}
{"id":"train_11295","question":"What is the population and nationality of Zip the Pinhead?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5399386 wdt:P27 ?X . ?X wdt:P1082 ?answer }","paraphrases":["What is the populace and nationality of Zip the Pinhead?"],"info":{}}
{"id":"train_11296","question":"Tell me me a unit of energy whose name consist of the word \"joule\" and whose based on metre","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2916980 . ?sbj wdt:P144 wd:Q11573 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'joule' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know me a unit of vitality whose title comprise of the word \"joule\" and whose based on metre"],"info":{}}
{"id":"train_11297","question":"How many inventions were fone by Sagittarius A ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q237284 wdt:P61 ?obj }","paraphrases":["Sagisttarius  A provided how many inventions?"],"info":{}}
{"id":"train_11298","question":"How many matches Ian Rush played and how many goals he scored for Liverpool F.C.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q219354 p:P54 ?s . ?s ps:P54 wd:Q1130849 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How many suits Ian Rush played and how many desires he scored for Liverpool F.C."],"info":{}}
{"id":"train_11301","question":"When did Audrey Hepburn receive the Grammy Award for Best Spoken Word Album for Children?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42786 p:P166 ?s . ?s ps:P166 wd:Q3113382 . ?s pq:P585 ?value }","paraphrases":["In what year did Audrey Hepburn earn the Grammy for Best Spoken Word Album for Children?"],"info":{}}
{"id":"train_11302","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q83270 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q7366 }","paraphrases":["not applicible"],"info":{}}
{"id":"train_11303","question":"Is Joaquin Phoenix a citizen of the United States of America?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q185140 wdt:P27 wd:Q30 }","paraphrases":["Is Joaquin Phoenix a US citizen?"],"info":{}}
{"id":"train_11304","question":"Where was the U.S. Declaration of Independence signed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P457 wd:Q127912 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["Where was the U.S. Announcement of Freedom marked?"],"info":{}}
{"id":"train_11305","question":"tell me border whose name has the starts with I in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q133346 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know border whose title has the begins with I in it"],"info":{}}
{"id":"train_11306","question":"\"What instrument does Frank Sinatra play that was created by Manuel Nunes?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40912 wdt:P1303 ?answer . ?answer wdt:P61 wd:Q21850546 }","paraphrases":["\"What instrument does Frank Sinatra play that used to be created with the aid of Manuel Nunes?\""],"info":{}}
{"id":"train_11307","question":"For which sports team did Abby Wambach play 39 matches?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q233112 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter ( contains ( ?x , '39.0' ) ) }","paraphrases":["For which sports group did Abby Wambach play 39 matches?"],"info":{}}
{"id":"train_11308","question":"What are the possible examinations of the murder method of Rattana Pestonji?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6585331 wdt:P509 ?X . ?X wdt:P923 ?answer }","paraphrases":["What are the possible exams of Rattana Pestonji's murder method?"],"info":{}}
{"id":"train_11309","question":"How many students are there in the {Constantin Brâncuși} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q153048 wdt:P802 ?obj }","paraphrases":["What is the number of students in the Constantin Brancusi?"],"info":{}}
{"id":"train_11310","question":"tell me medical attribute whose name starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q44476427 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know therapeutic quality whose title begins with w"],"info":{}}
{"id":"train_11311","question":"What is the religious text provided by the biblical figure David?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41370 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q179461 }","paraphrases":["What is the devout content given by the scriptural figure David?"],"info":{}}
{"id":"train_11315","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q9067 . ?sbj wdt:P31 wd:Q132241 }","paraphrases":["n/a"],"info":{}}
{"id":"train_11316","question":"Who was the head of government of Saarbrücken that ended at 2004-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1724 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["Give me the name of the head of government of Saarbrücken that was replaced in 2004."],"info":{}}
{"id":"train_11317","question":"What was Helen Hayes in that she was nominated for Academy Award for Best Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q213302 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value }","paraphrases":["For which movie did Helen Hayes receive a Best Actress nomination?"],"info":{}}
{"id":"train_11318","question":"Is the wheelbase of the Lunar Roving Vehicle equal to 2.3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q275816 wdt:P3039 ?obj filter ( ?obj = 2.3 ) }","paraphrases":["Is the wheelbase of the Lunar Wandering Vehicle rise to to 2.3?"],"info":{}}
{"id":"train_11319","question":"What is the name of the person that the Euler equations are named for, that died in Saint Petersburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q375175 wdt:P138 ?answer . ?answer wdt:P20 wd:Q656 }","paraphrases":["What is the title of the man or woman that the Euler equations are named for, that died in Saint Petersburg?"],"info":{}}
{"id":"train_11321","question":"What is based in the Arab Revolt that resulted in inflation rate of consumer price index of 34.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q239060 wdt:P276 ?answer . ?answer wdt:P1279 ?x FILTER ( contains ( ?x , '34.2' ) ) }","paraphrases":["What is primarily based in the Arab Revolt that resulted in inflation fee of customer fee index of 34.2?"],"info":{}}
{"id":"train_11323","question":"Does the vertical depth of the Pervomayskaya equal 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3900622 wdt:P4511 ?obj filter ( ?obj = 0 ) }","paraphrases":["Is 0 the vertical depth of the Pervomayskaya?"],"info":{}}
{"id":"train_11324","question":"Who plays the role of Superman in the movie Superman?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q79015 p:P175 ?s . ?s ps:P175 ?obj . ?s pq:P642 wd:Q2405659 }","paraphrases":["What is the name of the actor who plays Superman in the Superman movie?"],"info":{}}
{"id":"train_11326","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7264 wdt:P138 ?answer . ?answer wdt:P106 wd:Q49757 }","paraphrases":["It is what?"],"info":{}}
{"id":"train_11327","question":"What position does Hu Jintao hold as part of the 9th National People's Congress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q15029 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2937 wd:Q4646623 }","paraphrases":["What position does Hu Jintao hold as portion of the 9th National People's Congress?"],"info":{}}
{"id":"train_11329","question":"Which is the website account of Twitch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P553 wd:Q4555537 }","paraphrases":[],"info":{}}
{"id":"train_11331","question":"What species of plants can be found in the botanical garden on the Toronto Zoo Domain Ride?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7826576 wdt:P137 ?X . ?X wdt:P1990 ?answer }","paraphrases":["WHICH SPECIES OF PLANTS CAN FIND IN THE BOTANICAL GARDENON THETORONTO ZOO DOMAIN RIDE"],"info":{}}
{"id":"train_11332","question":"Is the heart rate of a horse equal to 40.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q726 wdt:P3395 ?obj filter ( ?obj = 40.8 ) }","paraphrases":["Is 40.8 the rate of the heart of a horse?"],"info":{}}
{"id":"train_11334","question":"When did Ohio have the population of 9.7064e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1397 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '9.7064e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["What year did Ohio have over 9,000,000 people living in that state?"],"info":{}}
{"id":"train_11335","question":"Which is the occupational carcinogen for the polymer of polyvinyl chloride?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q146368 wdt:P4600 ?obj . ?obj wdt:P31 wd:Q21074597 }","paraphrases":["Which is the word related carcinogen for the polymer of polyvinyl chloride?"],"info":{}}
{"id":"train_11338","question":"Who is the head of country (or state)?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P35 wd:Q22686 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["Who is the head of nation (or state)?"],"info":{}}
{"id":"train_11340","question":"Which is the ethnic group which contains the word zambo in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41710 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zambo' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the ethnic group in the name of the word zambo?"],"info":{}}
{"id":"train_11342","question":"What chemical compound has a significant drug interaction with astemizole starts with the letter t?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11173 . ?sbj wdt:P769 wd:Q423437 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What chemical compound has a sizable drug interaction with astemizole starts with the letter t?"],"info":{}}
{"id":"train_11345","question":"What town was lived in by Aristotle, whose partner town is Cali?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q868 wdt:P551 ?answer . ?answer wdt:P190 wd:Q51103 }","paraphrases":["What town was lived in by Aristotle, whose accomplice town is Cali?"],"info":{}}
{"id":"train_11346","question":"What was the primary profession of the author of \"The Road to Serfdom?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1638194 wdt:P50 ?X . ?X wdt:P106 ?answer }","paraphrases":["What was the essential calling of the creator of \"The Street to Serfdom?\""],"info":{}}
{"id":"train_11347","question":"What do the authors of Needle in the Groove inform us about?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6986611 wdt:P50 ?X . ?X wdt:P737 ?answer }","paraphrases":["What do the creators of Needle within the Groove educate us about?"],"info":{}}
{"id":"train_11348","question":"What lake of São Jorge Island has the Curoca River, a tributary?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q743362 wdt:P206 ?answer . ?answer wdt:P974 wd:Q10361834 }","paraphrases":["What lake of Sao Jorge island has the tributary Curoca River?"],"info":{}}
{"id":"train_11349","question":"What award did Emile Berliner receive on 1-1-1929?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q71004 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1929' ) ) }","paraphrases":["Emile Berliner won which award on 1-1-1929?"],"info":{}}
{"id":"train_11351","question":"How is a bone fracture, a medical specialty in traumatology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q68833 wdt:P828 ?answer . ?answer wdt:P1995 wd:Q376680 }","paraphrases":["How is a bone fracture, a traumatology medical specialty?"],"info":{}}
{"id":"train_11352","question":"What are the low-cost airline which start with the letter vueling","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q190915 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vueling' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the low-cost airline which begin with the letter vueling"],"info":{}}
{"id":"train_11353","question":"What's the name of the instrument used in clustering of scientific?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26857876 wdt:P2860 ?X . ?X wdt:P2283 ?answer }","paraphrases":["What is the name of the instrument used for scientific clustering?"],"info":{}}
{"id":"train_11354","question":"Tell me which is the single-family detached home which contains the word villa in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1307276 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'villa' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know which is the single-family segregated domestic which contains the word estate in it's name?"],"info":{}}
{"id":"train_11358","question":"Mention the border participants of Livonian War?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q246863 wdt:P710 ?X . ?X wdt:P47 ?answer }","paraphrases":["Say the border members of Livonian War?"],"info":{}}
{"id":"train_11359","question":"Does the short term exposure limit of benzene get greater than 2.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2270 wdt:P2407 ?obj filter ( ?obj > 2.4 ) }","paraphrases":["Does benzene's short - term exposure limit exceed 2.4?"],"info":{}}
{"id":"train_11360","question":"What is the CPU with the fastest FSB speed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5300 . ?ent wdt:P2150 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Tell me the CPU with the high FSB speed"],"info":{}}
{"id":"train_11361","question":"Are Kelsey and Allen given names of Kelsey Grammer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q196560 wdt:P735 wd:Q16277805 . wd:Q196560 wdt:P735 wd:Q18118122 }","paraphrases":["Are Kelsey and Allen names used by Kelsey Grammer?"],"info":{}}
{"id":"train_11362","question":"Tell me about the flag of Rome.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1001 wd:Q220 . ?sbj wdt:P31 wd:Q14660 }","paraphrases":["Tell me almost the hail of Rome."],"info":{}}
{"id":"train_11365","question":"Is it true that the mean lifetime of W or Z boson equals to 0.0000000000000000000000003?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q211922 wdt:P2645 ?obj filter ( ?obj = 0.0000000000000000000000003 ) }","paraphrases":["Is it genuine that the cruel lifetime of W or Z boson breaks even with to 0.0000000000000000000000003?"],"info":{}}
