{"id":"train_4382","question":"How many heads of state does Ukraine have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q212 wdt:P35 ?obj }","paraphrases":["What is the number of the heads of state of the Ukraine?"],"info":{}}
{"id":"train_4383","question":"Which is the fictional analog of the source of inspiration of Captain Ahab?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2630009 wdt:P941 ?X . ?X wdt:P1074 ?answer }","paraphrases":["Which is the anecdotal analog of the source of motivation of Captain Ahab?"],"info":{}}
{"id":"train_4384","question":"\"Which is {endemism} of {Mantella}, where {member of} is {International Bank for Reconstruction and Development} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1627754 wdt:P183 ?answer . ?answer wdt:P463 wd:Q191384 }","paraphrases":["\"Which is {endemism} of {Mantella}, where {part of} is {Universal Bank for Recreation and Advancement} ?\""],"info":{}}
{"id":"train_4387","question":"What is Francois Guzot's position in the government of Calvados","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q157324 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 wd:Q3249 }","paraphrases":["Tell me the position of Francois Guzot in the government of Calvados"],"info":{}}
{"id":"train_4391","question":"What year and historical period was 'Zeno' written?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q183452 wdt:P2348 ?X . ?X wdt:P571 ?answer }","paraphrases":["What year and chronicled period was 'Zeno' composed?"],"info":{}}
{"id":"train_4393","question":"What skill contains the word \"suction\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q205961 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'suction' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What skill does in its name contain the word \"suction?\""],"info":{}}
{"id":"train_4399","question":"Which communications protocol contains the word zmodem in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q132364 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zmodem' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which communications convention contains the word zmodem in their name"],"info":{}}
{"id":"train_4401","question":"Who wrote the lyrics of Auld Lang Syne ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q211939 wdt:P676 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What is Saudi Arabia's hereditary title of Salman?"],"info":{}}
{"id":"train_4402","question":"When did Alexander Ovechkin receive a gold medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q311374 p:P166 ?s . ?s ps:P166 wd:Q406039 . ?s pq:P585 ?value }","paraphrases":["Alexander Ovechkin received a gold medal in what year?"],"info":{}}
{"id":"train_4403","question":"Mariano Rajoy is a member of what political party?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10819 wdt:P102 ?obj . ?obj wdt:P31 wd:Q7278 }","paraphrases":["Mariano Rajoy may be a part of what political party?"],"info":{}}
{"id":"train_4405","question":"Which extinct human group starts with the letter w?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55208590 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which terminated human bunch begins with the letter w?"],"info":{}}
{"id":"train_4406","question":"Tell me condiment whose name has the word yondu in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2596997 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yondu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me condiment whose title has the word yondu in it."],"info":{}}
{"id":"train_4410","question":"Tell me the name of the female idol group whose name contains the word zero?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11446438 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zero' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the title of the female icon gather whose title contains the word zero?"],"info":{}}
{"id":"train_4412","question":"What television program is produced by Ellen DeGeneres?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P162 wd:Q483325 . ?sbj wdt:P31 wd:Q15416 }","paraphrases":[],"info":{}}
{"id":"train_4413","question":"Tell medisputed territory whose name has the word triangle in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15239622 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'triangle' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell medisputed domain whose title has the word triangle in it."],"info":{}}
{"id":"train_4414","question":"Who is the creator of Quantum mechanics, and who was its creator?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q944 wdt:P2184 ?ans_1 . wd:Q944 wdt:P170 ?ans_2 }","paraphrases":["Who created Quantum mechanics?"],"info":{}}
{"id":"train_4416","question":"Name the Wikimedia disambiguation page including \"Diplo\".","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q533781 wdt:P710 ?obj . ?obj wdt:P31 wd:Q4167410 }","paraphrases":[],"info":{}}
{"id":"train_4417","question":"tell  me mineral species that streak color black that name has  the word tenorite in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55076514 . ?sbj wdt:P534 wd:Q23445 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tenorite' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tell me mineral species that streak coloration black that name has the word tenorite in it"],"info":{}}
{"id":"train_4418","question":"How many are designed by Niklaus Wirth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P287 wd:Q92604 }","paraphrases":["What is the number that was designed by Nikclaus Wirth?"],"info":{}}
{"id":"train_4420","question":"which painting movement that contains the word verismo in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3326867 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'verismo' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the painting movement that includes the term verismo in its name."],"info":{}}
{"id":"train_4421","question":"Who is a crew member and operator of the International Space Station?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q25271 wdt:P1029 ?ans_1 . wd:Q25271 wdt:P137 ?ans_2 }","paraphrases":["Who is the International Space Station's crew member and operator?"],"info":{}}
{"id":"train_4423","question":"What was spencer Perceval position in 1812?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q233992 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1812' ) ) }","paraphrases":["In 1812, Spencer Perceval position was?"],"info":{}}
{"id":"train_4425","question":"During what years were Gerard Reve and Hanny Michaelis married?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q364153 p:P26 ?s . ?s ps:P26 wd:Q2090463 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["Which years have Gerard Reve and Hanny Michaelis been married?"],"info":{}}
{"id":"train_4427","question":"Which federal state was the U.S. Declaration of Independence the foundation for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P457 wd:Q127912 . ?sbj wdt:P31 wd:Q43702 }","paraphrases":[],"info":{}}
{"id":"train_4430","question":"What is total fertility rate  in the principal area of Libertador General Bernardo O'Higgins Region","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2133 wdt:P131 ?X . ?X wdt:P4841 ?answer }","paraphrases":["What is add up to richness rate within the vital region of Libertador Common Bernardo O'Higgins Region"],"info":{}}
{"id":"train_4434","question":"On 1-1-1678 William Petty, 2nd Earl of Shelburne founded what party membership","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q312573 wdt:P102 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1678' ) ) }","paraphrases":["On 1-1-1678 William Petty, 2nd Earl of Shelburne headquartered what celebration membership"],"info":{}}
{"id":"train_4437","question":"During Star Wars Episode V: The Empire Strikes Back, what are the names of the vehicles used in the film.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q181795 . ?sbj wdt:P31 wd:Q20871196 }","paraphrases":["The names of the vehicles used in the film Star Wars Episode V: The Empire Strikes Back, are called what?"],"info":{}}
{"id":"train_4440","question":"Tell me bank whose name has the word unicredit in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22687 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'unicredit' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know bank whose title has the word unicredit in it."],"info":{}}
{"id":"train_4442","question":"Archbasilica of St. John Lateran architectural style?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q84090 wdt:P149 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4444","question":"How many medical conditions did Ludwig van Beethoven have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q255 wdt:P1050 ?obj }","paraphrases":["How many health defects did Ludwig van Beethoven have?"],"info":{}}
{"id":"train_4445","question":"\"Which Christian name from Charles I of Hungary, is close to the name Carl?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q213061 wdt:P735 ?answer . ?answer wdt:P460 wd:Q2529610 }","paraphrases":["\"Which Christian identify from Charles I of Hungary, is shut to the identify Carl?\""],"info":{}}
{"id":"train_4446","question":"Where is the head office location of the International Chamber of Commerce that is next to lssy-les-Moulineaux?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q848633 wdt:P159 ?answer . ?answer wdt:P47 wd:Q135265 }","paraphrases":["The head office of the International Chamber of Commerce that's next to Issy-les-Moulineaux is located where?"],"info":{}}
{"id":"train_4447","question":"Who is the voice actor of Aqua Teen Hunger Force?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q622946 wdt:P725 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["In Aqua Teen Hunger Force, who plays the voice actor?"],"info":{}}
{"id":"train_4449","question":"When was Abigail Adams' child Charles Adams born, and when did he die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q5074968 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When used to be Abigail Adams' toddler Charles Adams born, and when did he die?"],"info":{}}
{"id":"train_4451","question":"Who has children with Domnall mac Ailpín, who is buried at Iona?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q312589 wdt:P40 ?answer . ?answer wdt:P119 wd:Q610 }","paraphrases":["Who has children with Domnall mac Ailpín, who is buried at Iona?"],"info":{}}
{"id":"train_4452","question":"How many auto locations are there in the {heart} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P927 wd:Q1072 }","paraphrases":["Which is the number of auto locations that there are in the heart?"],"info":{}}
{"id":"train_4453","question":"WHICH IS THE PUBMED ID OF TUBERCULOSIS","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12204 wdt:P698 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4454","question":"Tell me the noble family who has the son of Georgina Kennard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5548261 wdt:P25 ?X . ?X wdt:P53 ?answer }","paraphrases":["What noble family has the son of Georgina Kennard?"],"info":{}}
{"id":"train_4456","question":"When was Arthur Sullivan's most notable work, The Yeomen of the Guard, produced?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q212692 p:P800 ?s . ?s ps:P800 wd:Q499778 . ?s pq:P2754 ?value }","paraphrases":["In which year did Arthur Sullivan create his most notable work, The Yeomen of the Guard?"],"info":{}}
{"id":"train_4457","question":"Which is the {list of characters} and the {characters} of {Game_of_Thrones} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q23572 wdt:P1881 ?ans_1 . wd:Q23572 wdt:P674 ?ans_2 }","paraphrases":["Which actors play the characters in the show Game of Thrones?"],"info":{}}
{"id":"train_4460","question":"What book by Siegfried has the famous work Tristan und Isolde?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q333146 wdt:P87 ?answer . ?answer wdt:P800 wd:Q1324254 }","paraphrases":["What book by Siegfried has the popular work Tristan und Isolde?"],"info":{}}
{"id":"train_4461","question":"The moons of HD 45364 b are part of which constellation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5174324 wdt:P397 ?X . ?X wdt:P59 ?answer }","paraphrases":["The moons of HD 45364 b are portion of which constellation?"],"info":{}}
{"id":"train_4462","question":"WHICH IS THE POLITICAL PARTY THAT STARTS WITH V","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7278 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE POLITICAL PARTY THAT Begins WITH V"],"info":{}}
{"id":"train_4463","question":"What is in Angles, whose partner city is Hyōgo Prefecture?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q104238 wdt:P276 ?answer . ?answer wdt:P190 wd:Q130290 }","paraphrases":["What is in Points, whose accomplice city is Hyōgo Prefecture?"],"info":{}}
{"id":"train_4465","question":"Name an infectious disease that afflicts liver and that contains the word \"hepatitis\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18123741 . ?sbj wdt:P689 wd:Q9368 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hepatitis' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a liver - affected infectious disease with the word \"hepatitis\" in its name"],"info":{}}
{"id":"train_4469","question":"What what is animated taxondistributed by MGM and {family}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16521 . ?sbj wdt:P105 wd:Q35409 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'xyridaceae' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is energized taxondistributed by MGM and {family}"],"info":{}}
{"id":"train_4471","question":"What Suezmax oil tanker has min net tonnage?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1290804 . ?ent wdt:P2790 ?obj . ?ent wdt:P31 wd:Q14928 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What Suezmax oil tanker has min net tonnage?"],"info":{}}
{"id":"train_4475","question":"Who was Hugh Hefner`s partner who died in 1976 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q194280 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1976' ) ) }","paraphrases":["Who was Hugh Hefner`s spouse who died in 1976 ?"],"info":{}}
{"id":"train_4477","question":"Is the maximum frequency of audible sound of the Varanus komodoensis equal 2400.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4504 wdt:P3465 ?obj filter ( ?obj = 2400.0 ) }","paraphrases":["Does the Varanus komodoensis have a maximum frequency of audible sound of 2400?"],"info":{}}
{"id":"train_4478","question":"What is the place of interment of Albert Anastasia, that has a foundation date of 1838-0-0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q706235 wdt:P119 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1838' ) ) }","paraphrases":["What is the put of interment of Albert Anastasia, that features a establishment date of 1838-0-0?"],"info":{}}
{"id":"train_4480","question":"Tell me which industry contains the word winemaking in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8148 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'winemaking' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know which industry contains the word winemaking in it's name?"],"info":{}}
{"id":"train_4482","question":"Alexander Scriabin is a tutor of which musical instrument?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q185647 wdt:P1066 ?X . ?X wdt:P1303 ?answer }","paraphrases":["Alexander Scriabin could be a mentor of which melodic instrument?"],"info":{}}
{"id":"train_4483","question":"What is date of death for Charles Le Brun ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q271676 wdt:P570 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4484","question":"What is the diplomatic relation of Slovenia whose acronym is ЗША?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q215 wdt:P530 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'ЗША' ) ) }","paraphrases":["What is the discretionary connection of Slovenia whose acronym is ЗША?"],"info":{}}
{"id":"train_4485","question":"How many religions are by animism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P140 wd:Q43004 }","paraphrases":["What is the number of religions by animism?"],"info":{}}
{"id":"train_4486","question":"who is user of fleet of Qantas ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q32491 wdt:P121 ?X . ?X wdt:P137 ?answer }","paraphrases":["The fleet of Qantas is used by whom?"],"info":{}}
{"id":"train_4487","question":"What variety is influenced by English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1860 wdt:P737 ?obj . ?obj wdt:P31 wd:Q3329375 }","paraphrases":["What assortment is impacted by English?"],"info":{}}
{"id":"train_4489","question":"What are the modern languages which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1288568 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the modern languages which begin with the letter t"],"info":{}}
{"id":"train_4491","question":"Which British Academy Film Award was Javier Bardem nominated for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q134895 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q732997 }","paraphrases":[],"info":{}}
{"id":"train_4494","question":"What is the used for treatment of the signs of rabies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q39222 wdt:P780 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What is the utilized for treatment of the signs of rabies?"],"info":{}}
{"id":"train_4495","question":"What are the children's game  which start with the letter zapp","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1509934 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zapp' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the children's amusement which begin with the letter zapp"],"info":{}}
{"id":"train_4496","question":"How wide is Lake District?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q211778 wdt:P2049 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4497","question":"Which is the enterprise that is a subsidiary of CBS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P355 wd:Q43380 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["Which is the endeavor that's a backup of CBS?"],"info":{}}
{"id":"train_4498","question":"Which aircraft family has highest time to altitude?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15056993 . ?ent wdt:P2362 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which family of aircraft has the highest altitude time?"],"info":{}}
{"id":"train_4501","question":"Was the inception of The Islamic State of Iraq and the Levant that is identifying of subject in context  with The Islamic State of Iraq ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2429253 p:P571 ?s . ?s ps:P571 ?obj . ?s pq:P4649 wd:Q18206631 }","paraphrases":["When did The Islamic State of Iraq come about?"],"info":{}}
{"id":"train_4502","question":"How many WHOIN names are there for amphetamine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q179452 wdt:P2275 ?obj }","paraphrases":["Amphetamine has how many WHOIN names?"],"info":{}}
{"id":"train_4503","question":"Which is language of platforms of Army of Darkness: Defense ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4794301 wdt:P400 ?X . ?X wdt:P277 ?answer }","paraphrases":["Which is dialect of stages of Armed force of Obscurity: Defense ?"],"info":{}}
{"id":"train_4507","question":"Who gave the {painters} of {series} of {Bash} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16243529 wdt:P179 ?X . ?X wdt:P170 ?answer }","paraphrases":["Who gave the artists of the series Bash?"],"info":{}}
{"id":"train_4509","question":"What was the instance of the so called \"Black Death\" on 1347?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42005 p:P585 ?s . ?s ps:P585 ?x filter ( contains ( YEAR ( ?x ) , '1347' ) ) . ?s pq:P31 ?value }","paraphrases":["What were the symptoms of the \"Black Death\" in 1347?"],"info":{}}
{"id":"train_4511","question":"How many illustrations are there by E. H. Shepard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P110 wd:Q382031 }","paraphrases":["In regards to E.H. Shepard, how many illustrations are there?"],"info":{}}
{"id":"train_4512","question":"What did Donald Trump study at The Wharton School?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q22686 p:P69 ?s . ?s ps:P69 wd:Q1329269 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What did the Wharton School study with Donald Trump?"],"info":{}}
{"id":"train_4513","question":"WHICH IS THE HEALTH SPECIALITY FOR INFECTION","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q166231 wdt:P1995 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4514","question":"Who was the Mayor of Atlanta starting in 2002?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23556 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["What person was the Mayor of Atlanta starting in 2002?"],"info":{}}
{"id":"train_4515","question":"What is the epitaph for Alwin Nikolais at Crématorium-columbarium du Père-Lachaise?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q449880 p:P119 ?s . ?s ps:P119 wd:Q3006253 . ?s pq:P965 ?value }","paraphrases":["At Crematorium-columbarium du Pere-Lachaise, what is Alwin Nikolais' epitaph?"],"info":{}}
{"id":"train_4517","question":"What was Czechoslovakia previously known as?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q33946 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q6256 }","paraphrases":["What was Czechoslovakia already known as?"],"info":{}}
{"id":"train_4519","question":"What is  thealphabet  language official of Tokugawa shogunate ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q205662 wdt:P37 ?X . ?X wdt:P282 ?answer }","paraphrases":["Name the official alphabet language of Tokugawa shogunate?"],"info":{}}
