{"id":"train_21764","question":"Was Dallas Mavericks and  Tim Duncan member of sports team Wake Forest Demon Deacons men's basketball","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q193020 wdt:P54 wd:Q132893 . wd:Q193020 wdt:P54 wd:Q7960924 }","paraphrases":["Did Tim Duncan of the Dallas Mavericks play for the Wake Forest Demon Deacons men's basketball team?"],"info":{}}
{"id":"train_21765","question":"Which historical country that is the  Head of government František Udržal and which that starts with the letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3024240 . ?sbj wdt:P6 wd:Q2756999 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which verifiable nation that's the Head of government František Udržal and which that begins with the letter c"],"info":{}}
{"id":"train_21774","question":"What are the reserve currency which start with the letter d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q756202 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the currency reserves that begin with alphabet D."],"info":{}}
{"id":"train_21777","question":"Name an aqueous solution obtained by fermentation that starts with letter V","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q906356 . ?sbj wdt:P2079 wd:Q41760 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an aqueous answer acquired by means of fermentation that begins with letter V"],"info":{}}
{"id":"train_21778","question":"WHAT IS THE NEUROLOGICAL FUNCTION OF RODCELL","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q505544 wdt:P970 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21784","question":"Tell me health profession whose name has the word registrar in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3922583 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'registrar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me health profession whose name has the word registrar in it."],"info":{}}
{"id":"train_21792","question":"what are the  province of  pakistan that starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15058985 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the province of pakistan that begins with s"],"info":{}}
{"id":"train_21793","question":"tell me the hindu denomination name has the word shaivism in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1318257 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'shaivism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know the hindu category title has the word shaivism in it"],"info":{}}
{"id":"train_21798","question":"When did the Université catholique de Louvain have 30824 students?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q378134 p:P2196 ?s . ?s ps:P2196 ?x filter ( contains ( ?x , '30824.0' ) ) . ?s pq:P582 ?value }","paraphrases":["On what date did the Université catholique de Louvain have 30824 students?"],"info":{}}
{"id":"train_21815","question":"which historical period contains the word in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11514315 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'venezuela' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which chronicled period contains the word in their name"],"info":{}}
{"id":"train_21823","question":"As a higher taxon of Abies, name the plant known by the common name of ( script).","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q25350 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , '松科' ) ) }","paraphrases":["As the next taxon of Abies, title the plant known by the common title of ( script)."],"info":{}}
{"id":"train_21830","question":"What did the Guangxi Zhuang Autonomous Region change into on 5 May 1982","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q15176 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1982' ) ) }","paraphrases":["On May 5, 1982 the Guangxi Zhuang Autonomous Region turned into what area?"],"info":{}}
{"id":"train_21833","question":"What position did Abdülmecid I hold on July, 2 1839?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q174772 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1839' ) ) }","paraphrases":["What was Abdulmecid I's title on July 2, 1839?"],"info":{}}
{"id":"train_21839","question":"Give me a country name which has economic crisis at present, that starts with an alphabet 'p'.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q290178 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the country beginning with letter P that is undergoing economic crisis."],"info":{}}
{"id":"train_21844","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2176 wd:Q171877 . ?sbj wdt:P31 wd:Q12136 }","paraphrases":["n/a"],"info":{}}
{"id":"train_21846","question":"Mention the book or the publication which has edition 1","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P747 wd:Q199 . ?sbj wdt:P31 wd:Q47461344 }","paraphrases":["Specify the book or the distribution which has version 1"],"info":{}}
{"id":"train_21847","question":"What was Scott Kelly’s job on expedition 26 launched on November 26, 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q362190 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2010' ) ) }","paraphrases":["Was Scott Kelly's job on expedition 26 launched on November 26, 2011?"],"info":{}}
{"id":"train_21852","question":"Which is the medical therapy of the cause of death of François-Nicolas Delaistre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3084399 wdt:P509 ?X . ?X wdt:P924 ?answer }","paraphrases":["WHAT IS THE MEDICAL THERAPY OF CAUS OF DEATH OF FRANCOIS-NICOLAS DELAISTRE"],"info":{}}
{"id":"train_21853","question":"Tell me economic union whose name has the word union in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3623811 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'union' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the name of economic union with the word union in it."],"info":{}}
{"id":"train_21854","question":"Tell me intelligence agency whose name has the word stations in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47913 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'stations' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me an agency of intelligence whose name contains the word stations."],"info":{}}
{"id":"train_21856","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P17 wd:Q79965 . ?sbj wdt:P31 wd:Q58778 }","paraphrases":["n/a"],"info":{}}
{"id":"train_21862","question":"Tell me the number of goals and matches played of Ricardo Zamora, member of the Real Madrid C.F.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q296337 p:P54 ?s . ?s ps:P54 wd:Q8682 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["What are the number of matches and goals are played by Ricardo Zamora, meber of the Real Madrid C.F."],"info":{}}
{"id":"train_21864","question":"Name a song composed by Billie Holliday","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P86 wd:Q104358 . ?sbj wdt:P31 wd:Q7366 }","paraphrases":["Billie Holliday wrote what song?"],"info":{}}
{"id":"train_21867","question":"what is agglutinative language of la espero of anthem and also which starts with letter e","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q171263 . ?sbj wdt:P85 wd:Q141005 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is agglutinative language of la espero of anthem and additionally which starts offevolved with letter e"],"info":{}}
{"id":"train_21876","question":"What is chemical formula of diamond.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5283 wdt:P186 ?X . ?X wdt:P246 ?answer }","paraphrases":["Write the chemical formula for diamond."],"info":{}}
{"id":"train_21878","question":"Tell me the animation technique that history of topic is history of computer animation and which that starts with the letter a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3516833 . ?sbj wdt:P2184 wd:Q5867556 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the animation method that history of topic is history of laptop animation and which that starts with the letter a"],"info":{}}
{"id":"train_21879","question":"What are the Twelve Olympians which start with the letter d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q101609 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What twelve Olympians start with \"d\"?"],"info":{}}
{"id":"train_21883","question":"WHICH IS THE FORM OF GOVERNMENT THAT STARTS WITH U","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1307214 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["NAME THE FORM OF GOVERMENT THAT STRTS WITH THE LETTER U"],"info":{}}
{"id":"train_21885","question":"Explain tense in the Italian language.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q652 wdt:P3103 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21886","question":"EDITION","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36479 wdt:P3092 ?X . ?X wdt:P69 ?answer }","paraphrases":["Which edition is this?"],"info":{}}
{"id":"train_21892","question":"What is the Römpp ID of glutamic acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q181136 wdt:P5076 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21893","question":"Name the parent taxon of Philodendron, which also goes by the common name of 천남성아과?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131880 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , '천남성아과' ) ) }","paraphrases":["Title the parent taxon of Philodendron, which too goes by the common title of 천남성아과?"],"info":{}}
{"id":"train_21902","question":"name a flammable gaz that starts with letter V","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10913792 . ?sbj wdt:P4952 wd:Q51139288 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["name a flammable gaz that begins with letter V"],"info":{}}
{"id":"train_21910","question":"Name the tributary of Bay Bengal for which the river source is Chembarambakkam Lake.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q38684 wdt:P974 ?answer . ?answer wdt:P885 wd:Q3524627 }","paraphrases":["Title the tributary of Cove Bengal for which the waterway source is Chembarambakkam Lake."],"info":{}}
{"id":"train_21920","question":"What is the name of language of Pāli Canon that is different from Pali language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q215685 wdt:P407 ?answer . ?answer wdt:P1889 wd:Q16919429 }","paraphrases":["What is the title of dialect of Pāli Rule that's diverse from Pali language?"],"info":{}}
{"id":"train_21937","question":"Find Juan Antonio Samaranch's person ID in the Trading Card Database.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q171166 wdt:P5421 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21938","question":"What is the name of the place where {Isambard Kingdom Brunel} died which has a {partner town} called {Tehran}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207380 wdt:P20 ?answer . ?answer wdt:P190 wd:Q3616 }","paraphrases":["(Isambard Kingdom Brunel) died at which place that also has a (partner town) known as (Tehran)."],"info":{}}
{"id":"train_21949","question":"Name a colossal statue depicting Zeus that contain the word \" olympia\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1779653 . ?sbj wdt:P180 wd:Q34201 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'olympia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a gigantic statue depicting Zeus that contain the phrase \" olympia\" in its name"],"info":{}}
{"id":"train_21954","question":"when did Wenzhou start his position in Prato","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42635 p:P190 ?s . ?s ps:P190 wd:Q13377 . ?s pq:P580 ?value }","paraphrases":["When did wenzhou begin his standpoint in prato"],"info":{}}
{"id":"train_21962","question":"On what continent is the Red River, as pronounced in the audio file \"De-Aseien.ogg\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q206850 wdt:P30 ?answer . ?answer wdt:P443 ?x FILTER ( contains ( ?x , 'De-Asien.ogg' ) ) }","paraphrases":["On what landmass is the Ruddy Stream, as articulated within the sound record \"De-Aseien.ogg\"?"],"info":{}}
{"id":"train_21963","question":"What is the unit of energy that starts with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2916980 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the unit of vitality that begins with the letter z"],"info":{}}
{"id":"train_21964","question":"Tell me seven deadly sins whose name has the word sloth in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q166502 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sloth' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me seven deadly sins whose name has the word sloth in it."],"info":{}}
{"id":"train_21968","question":"explain me that the class II combustible liquid which starts eith the letter t in this","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21009057 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Explain to me that Class II fuel liquid begins with the letter t in this"],"info":{}}
{"id":"train_21973","question":"What literary movement partially coincides with futurist architecture and includes the word \"futurism\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3326717 . ?sbj wdt:P1382 wd:Q333353 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'futurism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What literary movement partially coincides with futurist structure and consists of the phrase \"futurism\" in its name?"],"info":{}}
{"id":"train_21978","question":"Name the biycle race organized by Société du Tour de France that starts with letter D","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q866427 . ?sbj wdt:P664 wd:Q2452317 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the biycle race organized through Société du Tour de France that begins with letter D"],"info":{}}
{"id":"train_21988","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P88 wd:Q8474 . ?sbj wdt:P31 wd:Q53060 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_21990","question":"Tell me Indigenous peoples of the United States whose name has the word yatasi  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49297 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yatasi' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me Indigenous peoples of the United States whose name has the word yatasi in it."],"info":{}}
{"id":"train_21996","question":"What are the road type which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7860962 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the road type which begin with the letter w"],"info":{}}
{"id":"train_22002","question":"What are the accepted payment types of Rijksmuseum","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q190804 wdt:P2851 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22010","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q1726 . ?sbj wdt:P31 wd:Q15253706 }","paraphrases":["n/a"],"info":{}}
{"id":"train_22014","question":"What are the railway company which start with the letter viaquatro","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q249556 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'viaquatro' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the railway corporation which begin with the letter viaquatro"],"info":{}}
{"id":"train_22030","question":"What are the martial arts which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11417 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the military expressions which begin with the letter t"],"info":{}}
{"id":"train_22036","question":"Name a language family that contains the word \"languages\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25295 . ?sbj wdt:P4132 wd:Q318917 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'languages' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a dialect family that contains the word \"dialects\" in its name"],"info":{}}
{"id":"train_22037","question":"Name the French locomotive class with the lowest boiler pressure.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19832486 . ?ent wdt:P5071 ?obj . ?ent wdt:P17 wd:Q142 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Of the french locomotives which one has the lowest boiler pressure?"],"info":{}}
{"id":"train_22038","question":"What are the negative emotion which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60539481 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the negative feeling which begin with the letter w"],"info":{}}
{"id":"train_22044","question":"IS THE HIGHEST BREAK OF PAUL DAVISON EQUALS 170.4","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q536611 wdt:P6590 ?obj filter ( ?obj = 170.4 ) }","paraphrases":["IS THE HIGH BREAK OF EQUALS 170.4 PAUL DAVISON"],"info":{}}
{"id":"train_22047","question":"How does Julius Caesar wear his hair","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1048 wdt:P3828 ?obj . ?obj wdt:P31 wd:Q327496 }","paraphrases":["How does Julius Caesar style his hair?"],"info":{}}
{"id":"train_22050","question":"Mention the name of the publisher and the date of publication of Pasta in People's Republic of China","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q178 p:P495 ?s . ?s ps:P495 wd:Q148 . ?s pq:P123 ?value1 . ?s pq:P577 ?value2 }","paraphrases":["Mention the name of the publisher and the date of guide of Pasta in People's Republic of China"],"info":{}}
{"id":"train_22051","question":"What are the cable channel which start with the letter óčko","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5009242 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'óčko' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the cable channel which begin with the letter óčko"],"info":{}}
{"id":"train_22054","question":"What is cohabitant for parent of Adèle Hugo ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2082427 wdt:P25 ?X . ?X wdt:P451 ?answer }","paraphrases":["Who is the cohabitant parent of  Adèle Hugo?"],"info":{}}
{"id":"train_22057","question":"TELL ME WIKIMEDIA LIST ARTICLE WHICH START WITH THE LETTER N","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13406463 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME ARTICLE WIKIMEDIA WITH THE LETTER N"],"info":{}}
{"id":"train_22059","question":"Name the territoy whose main regulatory text are the Belavezha Accords that starts with letter D","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18603729 . ?sbj wdt:P92 wd:Q76986 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the territoy whose main regulatory text are the Belavezha Accords that begins with letter D"],"info":{}}
{"id":"train_22061","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P53 wd:Q161205 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_22062","question":"what happens in dota 2 universe","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1434 wd:Q771541 }","paraphrases":[],"info":{}}
{"id":"train_22070","question":"tell  me private not-for-profit educational institution that subsidiary Center for Study of Law and Culture, Columbia University  starts with letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23002054 . ?sbj wdt:P355 wd:Q45136769 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tell me private not-for-profit academic group that subsidiary Center for Study of Law and Culture, Columbia University starts offevolved with letter c"],"info":{}}
{"id":"train_22074","question":"Who is director of photography for Aki Kaurismäki?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P344 wd:Q276186 }","paraphrases":[],"info":{}}
{"id":"train_22083","question":"There were many participants for the October Revolution.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q42976 wdt:P710 ?obj }","paraphrases":["Which is the number of participants for the October Revolution?"],"info":{}}
