{"id":"train_7401","question":"What is {population} of {Los Lagos Region} where {determination method} is {census} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2178 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["What did the census determine is the population of the Los Lagos Region?"],"info":{}}
{"id":"train_7403","question":"Who replaced Louis XII of France as the King of France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q58514 p:P39 ?s . ?s ps:P39 wd:Q18384454 . ?s pq:P1365 ?value }","paraphrases":[],"info":{}}
{"id":"train_7405","question":"What is the AS.com athlete ID for Maria Sharapoval?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11666 wdt:P3427 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7406","question":"What is the population of Qalyubia Governorate if 2.51424e+06 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q31075 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '2.51424e+06' ) ) . ?s pq:P459 ?value }","paraphrases":["Qalyubia Governate population if 2.51424e+06 ?."],"info":{}}
{"id":"train_7407","question":"Who gave the{pronunciation audio} of {this taxon is a source of} of {Cucumis sativus} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23425 wdt:P1672 ?X . ?X wdt:P443 ?answer }","paraphrases":["Who gave the{pronunciation sound} of {this taxon may be a source of} of {Cucumis sativus} ?"],"info":{}}
{"id":"train_7408","question":"what is the","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q81103 . ?ent wdt:P4403 ?obj . ?ent wdt:P287 wd:Q7431877 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["-"],"info":{}}
{"id":"train_7409","question":"which  professorship of Isaac Newton ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q935 wdt:P803 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7410","question":"Who gave the {diplomatic relation} of {citizenship} of {Henri de la Tour d'Auvergne, Vicomte de Turenne} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q303216 wdt:P27 ?X . ?X wdt:P530 ?answer }","paraphrases":["Who gave the {political connection} of {citizenship} of {Henri de la Visit d'Auvergne, Vicomte de Turenne} ?"],"info":{}}
{"id":"train_7411","question":"What is the life stance of Margaret Thatcher, whose headquarters is Church House, Westminster?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7416 wdt:P140 ?answer . ?answer wdt:P159 wd:Q2967665 }","paraphrases":["What is the life position of Margaret Thatcher, whose central station is Church House, Westminster?"],"info":{}}
{"id":"train_7414","question":"What is the political environment in which American english originated?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7976 wdt:P495 ?obj . ?obj wdt:P31 wd:Q43702 }","paraphrases":["What is the political environment in which American english originated?"],"info":{}}
{"id":"train_7418","question":"Who discover (or invented) the Electron and who was the Electron named for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q2225 wdt:P61 ?ans_1 . wd:Q2225 wdt:P138 ?ans_2 }","paraphrases":["What was the electron named for and who invented it?"],"info":{}}
{"id":"train_7424","question":"What is the title of the TV movie based on The Count of Monte Cristo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P144 wd:Q191838 . ?sbj wdt:P31 wd:Q506240 }","paraphrases":["What is the TV movie based on The Count of Monte Cristo called?"],"info":{}}
{"id":"train_7427","question":"Is the number of houses of the Heroutice equal to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q24817397 wdt:P4080 ?obj filter ( ?obj = 0 ) }","paraphrases":["Are there 0 houses of the Heroutice?"],"info":{}}
{"id":"train_7428","question":"What is on the Godavari River at 19.93?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q191314 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '19.93' ) ) . ?s pq:P518 ?value }","paraphrases":["What can be found on the Godavari River at 19.93?"],"info":{}}
{"id":"train_7429","question":"In what year did Iloilo City become the capital of the Spanish East Indies?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q910648 p:P36 ?s . ?s ps:P36 wd:Q459787 . ?s pq:P580 ?value }","paraphrases":["When was Iloilo City made capital of Spanish East Indies?"],"info":{}}
{"id":"train_7431","question":"Which language is no longer spoken from the Hildegard of Bingen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q70991 wdt:P1412 ?obj . ?obj wdt:P31 wd:Q45762 }","paraphrases":["What language from Hildegard of Bingen is no longer spoken?"],"info":{}}
{"id":"train_7432","question":"What was the population of Tuvalu in 1996?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q672 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1996' ) ) }","paraphrases":["How many people were living in Tuvalu in the year 1996?"],"info":{}}
{"id":"train_7433","question":"Tell me the national sports team whose name contains the word team?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1194951 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'team' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which national sports team's name includes the term \"team\"?"],"info":{}}
{"id":"train_7434","question":"What is Peggy Lee's middle name?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q229139 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '2' ) ) }","paraphrases":["What is Peggy Lee's central name?"],"info":{}}
{"id":"train_7435","question":"What turquoise solvent is the most refractive?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q146505 . ?ent wdt:P1109 ?obj . ?ent wdt:P462 wd:Q5960345 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["which turquoise solvent is the most refractive?"],"info":{}}
{"id":"train_7436","question":"When was Calgary, Alberta founded?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36312 p:P131 ?s . ?s ps:P131 wd:Q1951 . ?s pq:P580 ?value }","paraphrases":["What date was Calgary, Alberta founded?"],"info":{}}
{"id":"train_7437","question":"what was the starting point by seville?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1427 wd:Q8717 }","paraphrases":["Which was the starting point by seville?"],"info":{}}
{"id":"train_7438","question":"IS THE G FACTOR OF PROTON EQUALS 5.585694713","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2294 wdt:P1097 ?obj filter ( ?obj = 5.585694713 ) }","paraphrases":["IS THE G Calculate OF PROTON Rises to 5.585694713"],"info":{}}
{"id":"train_7439","question":"Which architect represents Taipel 101?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q83101 wdt:P84 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Which modeler speaks to Taipel 101?"],"info":{}}
{"id":"train_7441","question":"What is Bangkok's central administrative unit code?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1861 wdt:P1067 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7442","question":"What  fruit image is on Tulipa's capsule?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q93201 p:P4000 ?s . ?s ps:P4000 wd:Q147768 . ?s pq:P18 ?value }","paraphrases":["Tulipa's capsule is what fruit?"],"info":{}}
{"id":"train_7444","question":"What is the denomination of the accused of Yemeni Civil War ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19686631 wdt:P710 ?X . ?X wdt:P140 ?answer }","paraphrases":["What is the number of the accused from the Yemeni Civil War?"],"info":{}}
{"id":"train_7446","question":"What award did Charles Antony Richard Hoare receive in 1990?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q92602 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1990' ) ) }","paraphrases":["Give the name of the award received by Charles Antony Richard Hoare in 1990."],"info":{}}
{"id":"train_7447","question":"What Academy Awards has Quentin Tarantino been nominated for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3772 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q19020 }","paraphrases":["What Institute Grants has Quentin Tarantino been assigned for?"],"info":{}}
{"id":"train_7449","question":"What is the Spotify broadcasting language which has a regulatory body in the Institute of the Czech Language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q689141 wdt:P407 ?answer . ?answer wdt:P1018 wd:Q1661875 }","paraphrases":["What is the Spotify broadcasting language which has a regulatory physique in the Institute of the Czech Language?"],"info":{}}
{"id":"train_7450","question":"who is the elizate for shares border with of bilbao?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q8692 . ?sbj wdt:P31 wd:Q2731185 }","paraphrases":["who is the elizate for offers border with of bilbao?"],"info":{}}
{"id":"train_7454","question":"How many matches did Hope Solo play, and what were his stats on the Atlanta Beat?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q229619 p:P54 ?s . ?s ps:P54 wd:Q756144 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["When Hope Solo played, how many matches did he play, and what were his stats when he played for Atlanta Beat?"],"info":{}}
{"id":"train_7455","question":"wasn't 50_cent employer of D-unit clothing company","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6060 wdt:P108 wd:Q5511932 }","paraphrases":["Did 50 Cent make D--unit clothing company?"],"info":{}}
{"id":"train_7456","question":"What type of people would compete in a marathon.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2416 wd:Q40244 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What sort of individuals would compete in a marathon."],"info":{}}
{"id":"train_7457","question":"What academic major is a facet of the history of mathematics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q185264 wdt:P1269 ?obj . ?obj wdt:P31 wd:Q4671286 }","paraphrases":["What scholarly major could be a aspect of the history of mathematics?"],"info":{}}
{"id":"train_7458","question":"Where did Hans Asperger die that is located near Simmering?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q78512 wdt:P20 ?answer . ?answer wdt:P150 wd:Q279028 }","paraphrases":["Where did Hans Asperger pass on that's found close Stewing?"],"info":{}}
{"id":"train_7460","question":"Why did the Philippine-American War end?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1534 wd:Q214456 }","paraphrases":[],"info":{}}
{"id":"train_7462","question":"Who replaced Charles I as monarch of England?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q81506 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P1365 ?value }","paraphrases":["Charles I replacement in monarch of England?"],"info":{}}
{"id":"train_7465","question":"What are the Indigenous peoples of the United States which start with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49297 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the U.S. indigenous peoples starting with the letter y"],"info":{}}
{"id":"train_7466","question":"Who was a student of Maurice Ravel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1178 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was a understudy of Maurice Ravel?"],"info":{}}
{"id":"train_7468","question":"What date did Lech Kaczyński die in the 2010 Polish Air Force Tu-154 crash?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2757 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P805 wd:Q131311 }","paraphrases":["When did Lech Kaczynski die?"],"info":{}}
{"id":"train_7469","question":"What is the main subgroup in Islam religion ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q642379 wdt:P1269 ?obj . ?obj wdt:P31 wd:Q6957341 }","paraphrases":["What is the main Islamic religion subgroup?"],"info":{}}
{"id":"train_7470","question":"What was Adventure Time nominated for in 2010?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q53093 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2010' ) ) }","paraphrases":["For what did Adventure Time earn a 2010 nomination?"],"info":{}}
{"id":"train_7471","question":"WHICH IS THE ARTISTIC TYPE THAT STARTS WITH V","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16767597 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT IS THE ARTISTIC TYPE WITH V"],"info":{}}
{"id":"train_7474","question":"What is written in The Interpretation of Dreams who is a male.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q726382 wdt:P50 ?answer . ?answer wdt:P21 wd:Q6581097 }","paraphrases":["What is composed within The Interpretation of Dreams who may be a male."],"info":{}}
{"id":"train_7475","question":"What is ADK member id of Engelbert Humperdinck?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q55010 wdt:P4114 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7476","question":"Which is the {constitutional republic} with the {MAX(Gini coefficient)} whom {diplomatic relation} is {Russia} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1520223 . ?ent wdt:P1125 ?obj . ?ent wdt:P530 wd:Q159 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What constitutional republic who has a diplomatic relation with Russia has the MAX Gini coefficient?"],"info":{}}
{"id":"train_7477","question":"What organization operates BMX races?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q215184 wdt:P121 ?X . ?X wdt:P641 ?answer }","paraphrases":["What organization works BMX races?"],"info":{}}
{"id":"train_7478","question":"What award did Nadia Comăneci receive for her participation at the 1976 Summer Olympics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q33228 p:P1344 ?s . ?s ps:P1344 wd:Q1439129 . ?s pq:P166 ?value }","paraphrases":["Nadia Comaneci won which award during the 1976 Summer Olympics?"],"info":{}}
{"id":"train_7479","question":"Who is the mother of Joseph Stalin and Yakov Dzhugashvili and when were they born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q163816 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["When was Joseph Stalin and Yakov Dzhugashvili born and who were their mothers?"],"info":{}}
{"id":"train_7480","question":"Who is the municipal council for legislative body of Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q90 wdt:P194 ?obj . ?obj wdt:P31 wd:Q2647159 }","paraphrases":["Who is the civil chamber for administrative body of Paris?"],"info":{}}
{"id":"train_7481","question":"Which is the MobyGames ID for Wii Sports?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q71936 wdt:P1933 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7482","question":"Tell me an human who may be fictional whose name starts with the letter č","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21070568 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'č' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me an human who may be fictional whose name starts offevolved with the letter č"],"info":{}}
{"id":"train_7484","question":"Which is the open period for Friday?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3028 wd:Q130 }","paraphrases":[],"info":{}}
{"id":"train_7486","question":"which academy that contains the word university in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162633 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'university' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which institute that contains the word college in their name"],"info":{}}
{"id":"train_7487","question":"Is it true that the borrowing rate of Barclaycard Visa equals to 16.99?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q56489433 wdt:P5898 ?obj filter ( ?obj = 16.99 ) }","paraphrases":["Is 16.99 the borrowing rate of Barclaycard Visa?"],"info":{}}
{"id":"train_7490","question":"Tell me the occupational carcinogen that has a safety classification and labelling as Regulation (EC) No. 1272/2008 whose name contains the word benzene?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21074597 . ?sbj wdt:P4952 wd:Q2005334 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'benzene' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the occupational carcinogen that has a safety classification and labelling as Regulation (EC) No. 1272/2008 whose name includes the word benzene?"],"info":{}}
{"id":"train_7491","question":"Which is {treatment} {murder method} of {Ted Hughes} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q272194 wdt:P509 ?X . ?X wdt:P2176 ?answer }","paraphrases":["Which is {treatment} {kill strategy} of {Ted Hughes} ?"],"info":{}}
{"id":"train_7493","question":"was miley_cyrus getting influence by britney spears?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4235 wdt:P737 wd:Q11975 }","paraphrases":["is it miley_cyrus is influenced by britney spears?"],"info":{}}
{"id":"train_7496","question":"Which is the amusement ride for presenting Ellen DeGeneres?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P371 wd:Q483325 . ?sbj wdt:P31 wd:Q1144661 }","paraphrases":["Name the amusement ride for presenting Ellen DeGeneres."],"info":{}}
{"id":"train_7497","question":"which river has the steepest tributary","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4022 . ?ent wdt:P4184 ?obj . ?ent wdt:P974 wd:Q46992264 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["The steepest tributary is part of which river?"],"info":{}}
{"id":"train_7499","question":"What award did the short story \"Flowers for Algernon\" receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q837934 p:P31 ?s . ?s ps:P31 wd:Q49084 . ?s pq:P166 ?value }","paraphrases":["What prize did the short story \"Flowers for Algernon\" win?"],"info":{}}
{"id":"train_7500","question":"IDoes the house mouse have a minimum frequency of audible sound of 1000","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q83310 wdt:P3387 ?obj filter ( ?obj = 1000 ) }","paraphrases":["IDoes the house mouse have a least recurrence of capable of being heard sound of 1000"],"info":{}}
{"id":"train_7501","question":"\"What is the {first name} of {John J. Pershing, which means {the same as} the name {Loann}?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q272383 wdt:P735 ?answer . ?answer wdt:P460 wd:Q17125945 }","paraphrases":["\"What is the {first name} of {John J. Pershing, which skill {the identical as} the title {Loann}?\""],"info":{}}
{"id":"train_7503","question":"Name a song produced by Quincy Jones that starts with letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7366 . ?sbj wdt:P162 wd:Q193645 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a melody created by Quincy Jones that begins with letter W"],"info":{}}
{"id":"train_7504","question":"WHICH IS THE MARITIME MUSEUM WITH THE MOST LUMINOUS INTENSITY","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1863818 . ?ent wdt:P3041 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which maritime museum is the brightest?"],"info":{}}
{"id":"train_7506","question":"Name an open content from the LAMP platform that contains the word \" wikipedia\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1293664 . ?sbj wdt:P400 wd:Q191342 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wikipedia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title an open substance from the Light stage that contains the word \" wikipedia\" in its name"],"info":{}}
{"id":"train_7507","question":"\"What is the {language used} by {A. E. van Vogt}, that is {endemic to} {England} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q315059 wdt:P1412 ?answer . ?answer wdt:P2341 wd:Q21 }","paraphrases":["\"What is the {language used} via {A. E. van Vogt}, that is {endemic to} {England} ?\""],"info":{}}
{"id":"train_7512","question":"Is Christopher Nolan a citizen of the UK?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q25191 wdt:P27 wd:Q145 }","paraphrases":["Does Christopher Nolan hold citizenship in the United Kingdom?"],"info":{}}
{"id":"train_7514","question":"What is quantity symbol of mass flow rate ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1366187 wdt:P416 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7517","question":"Is the price of the Danish krone equal to 0.14216?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q25417 wdt:P2284 ?obj filter ( ?obj = 0.14216 ) }","paraphrases":["Is 0.14216 equal to the price of the Danish krone?"],"info":{}}
{"id":"train_7518","question":"Which is the foundational text for Declaration of the Establishment of the State of Israel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P457 wd:Q223732 }","paraphrases":[],"info":{}}
{"id":"train_7519","question":"What is the name of Thomas Jefferson's residence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11812 wdt:P551 ?obj . ?obj wdt:P31 wd:Q188913 }","paraphrases":["Name Thomas Jefferson's estate."],"info":{}}
{"id":"train_7522","question":"Name a space station that starts with letter S","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25956 . ?sbj wdt:P1427 wd:Q4365460 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a space station beginning with letter S"],"info":{}}
{"id":"train_7523","question":"What Tel Aviv partner town is the place of formation of Sinopec?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q831445 wdt:P740 ?answer . ?answer wdt:P190 wd:Q33935 }","paraphrases":["What Tel Aviv companion town is the location of formation of Sinopec?"],"info":{}}
{"id":"train_7524","question":"Where did Rajinikanth and spouse Latha Rajinikanth get married and at which time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q60068 p:P26 ?s . ?s ps:P26 wd:Q6495834 . ?s pq:P2842 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["Where did Rajinikanth and partner Latha Rajinikanth get married and at which time?"],"info":{}}
{"id":"train_7526","question":"What is the source location of the group Megadeth, that has a border to Pasadena?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83431 wdt:P740 ?answer . ?answer wdt:P47 wd:Q485176 }","paraphrases":["What is the source region of the team Megadeth, that has a border to Pasadena?"],"info":{}}
