{"id":"train_21162","question":"What is the SoundCloud ID of Andy Milonakis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q326440 wdt:P3040 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21163","question":"Is the common equity tier 1 capital ration (CETI) of the IKD Deutsche Industriebank more than 9.432?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q152957 wdt:P2663 ?obj filter ( ?obj > 9.432 ) }","paraphrases":["Can you confirm if the common equity tier 1 capital ration (CETI) of the IKD Deutsche Industriebank is more than 9,432."],"info":{}}
{"id":"train_21164","question":"What is Artie Shaw's WikiTree person ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q320065 wdt:P2949 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21165","question":"What are the architectural style which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q32880 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE ARCHITECTURAL STYLE WHICH START WITH THE LETTER S"],"info":{}}
{"id":"train_21166","question":"WHICH HAS INFLUENCE OF POTRAIT OF HEY JUDE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q607742 wdt:P175 ?X . ?X wdt:P737 ?answer }","paraphrases":["WHICH HAS Impact OF POTRAIT OF Hello JUDE"],"info":{}}
{"id":"train_21171","question":"Who were the administrators of Haifa on January 1st, 1972?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41621 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1972' ) ) }","paraphrases":["Which administrators rulled over Haifa on January 1st, 1972?"],"info":{}}
{"id":"train_21174","question":"How many breeds of Arabian horse are there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P4743 wd:Q184138 }","paraphrases":["Which is the number of the breeds that are for Arabian horse?"],"info":{}}
{"id":"train_21177","question":"What is {symptom} of {this taxon is the source of} {sunflower} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q171497 wdt:P1672 ?X . ?X wdt:P1542 ?answer }","paraphrases":["What is {indication} of {this taxon is the source of} {sunflower} ?"],"info":{}}
{"id":"train_21179","question":"How many confederations are formed of democracies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P122 wd:Q170156 }","paraphrases":["Democracies formed how many confederations?"],"info":{}}
{"id":"train_21180","question":"Who is the creator of the series \\W\\ Is for Wasted?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13422918 wdt:P179 ?X . ?X wdt:P170 ?answer }","paraphrases":["Who created the series /W/ Is for Wasted?"],"info":{}}
{"id":"train_21181","question":"Which is the state owned by the Lake Washington?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1323525 wdt:P131 ?X . ?X wdt:P206 ?answer }","paraphrases":["Which is the state possessed by the Lake Washington?"],"info":{}}
{"id":"train_21182","question":"What is the parent of the taxon plant in the botanical garden of the Glady's Porter Zoo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5566451 wdt:P1990 ?X . ?X wdt:P171 ?answer }","paraphrases":["What is the parent of the taxon plant within the botanical plant of the Glady's Watchman Zoo?"],"info":{}}
{"id":"train_21183","question":"Who is the {human} for {partner} of {Paul Thomas Anderson}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q25132 wdt:P451 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {accomplice} of {Paul Thomas Anderson}"],"info":{}}
{"id":"train_21184","question":"Is the VAT-rate of Netherlands greater than 4.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q55 wdt:P2855 ?obj filter ( ?obj > 4.8 ) }","paraphrases":["Is the Netherland's VAT-rate higher than 4.8?"],"info":{}}
{"id":"train_21188","question":"What is Roe v. Wade published in and what jurisdiction applies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q300950 wdt:P1001 ?ans_1 . wd:Q300950 wdt:P1433 ?ans_2 }","paraphrases":["What are the terms of Roe v. Wade?"],"info":{}}
{"id":"train_21189","question":"Which is the publication for the operator for the University of Toronto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P137 wd:Q180865 . ?sbj wdt:P31 wd:Q732577 }","paraphrases":[],"info":{}}
{"id":"train_21191","question":"Who was the person that was a student of Henri Matisse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5589 wdt:P802 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was the individual that was a understudy of Henri Matisse?"],"info":{}}
{"id":"train_21192","question":"Does the de Havilland Dragon have a maximum operating altitude equal to 4420?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q285270 wdt:P2254 ?obj filter ( ?obj = 4420 ) }","paraphrases":["Does the de Havilland Mythical serpent have a greatest working height break even with to 4420?"],"info":{}}
{"id":"train_21193","question":"During which year and with whom did Bob Barker shared the award of MTV Movie Award for Best Fight?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q381178 p:P166 ?s . ?s ps:P166 wd:Q734036 . ?s pq:P585 ?value1 . ?s pq:P1706 ?value2 }","paraphrases":["Give me the year and name of the person with whom Bob Barker shared the MTV Movie Award for Best Fight."],"info":{}}
{"id":"train_21194","question":"Is the flux of Abell 1689 equal to 0.00000000014729?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q318630 wdt:P2221 ?obj filter ( ?obj = 0.00000000014729 ) }","paraphrases":["What is the flux of Abell 1689?"],"info":{}}
{"id":"train_21196","question":"What are the city-state which start with the letter vulci","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q133442 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vulci' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the city-state which begin with the letter vulci"],"info":{}}
{"id":"train_21197","question":"The writing system of Urdu is based on which Arabic script based alphabet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1617 wdt:P282 ?obj . ?obj wdt:P31 wd:Q30016797 }","paraphrases":["The composing framework of Urdu is based on which Arabic script based alphabet?"],"info":{}}
{"id":"train_21198","question":"Phosphoric acid conjugates phosphate ion with wich acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4147 wd:Q184782 . ?sbj wdt:P31 wd:Q55168228 }","paraphrases":["What acid does Phosphoric acid conjugate phosphate ion with?"],"info":{}}
{"id":"train_21200","question":"Which record label does the Disney Company own?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P199 wd:Q1431781 . ?sbj wdt:P31 wd:Q18127 }","paraphrases":["Which label is owned by the Disney Company."],"info":{}}
{"id":"train_21201","question":"Name the manned spacecraft in low Earth orbit with the smallest periapsis ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7217761 . ?ent wdt:P2244 ?obj . ?ent wdt:P522 wd:Q663611 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the name of a manned spacecraft in low Earth orbit with smallest periapsis?"],"info":{}}
{"id":"train_21202","question":"What is the county seat of Sylvester II?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q172383 wdt:P937 ?X . ?X wdt:P1376 ?answer }","paraphrases":["Name Sylvester II's county seat."],"info":{}}
{"id":"train_21207","question":"How many songs has Oscar Hammerstein II made?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P87 wd:Q319693 }","paraphrases":["Provide the number of Songs has Oscar Hammerstein released."],"info":{}}
{"id":"train_21208","question":"Provide an airplane class that is used by an international airline that has the word airplane in their name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20027951 . ?sbj wdt:P1535 wd:Q24175399 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'airplane' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give an plane course that's utilized by an worldwide aircraft that has the word plane in their name."],"info":{}}
{"id":"train_21209","question":"WHICH IS THE HUMAN WITH THE MAX POINTS FOR","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1358 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What human has the max points?"],"info":{}}
{"id":"train_21210","question":"What is named in language as New Musical Express, whose typology is fusional language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192632 wdt:P407 ?answer . ?answer wdt:P4132 wd:Q318917 }","paraphrases":["What is named in language as New Musical Express, whose typology is fusional language?"],"info":{}}
{"id":"train_21211","question":"What is the periodization of Roman Empire with shared border","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2277 wdt:P47 ?obj . ?obj wdt:P31 wd:Q816829 }","paraphrases":[],"info":{}}
{"id":"train_21212","question":"What is the name of business which operates the Airbus A330?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q6478 wdt:P137 ?obj . ?obj wdt:P31 wd:Q46970 }","paraphrases":["What is the name of the company running the Airbus A330?"],"info":{}}
{"id":"train_21213","question":"What is the capital city of Eastern Wu that has a surface of 1504.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q274488 wdt:P36 ?answer . ?answer wdt:P2046 ?x FILTER ( contains ( ?x , '1504.0' ) ) }","paraphrases":["What is the capital city of Eastern Wu that incorporates a surface of 1504.0?"],"info":{}}
{"id":"train_21214","question":"Who is voiced by in the part of series of Life with Feathers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2016621 wdt:P179 ?X . ?X wdt:P725 ?answer }","paraphrases":["Who vocalized a part in Life with Feathers series?"],"info":{}}
{"id":"train_21215","question":"Where was Takeshi Kitano born in Tokyo?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q26372 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1490 }","paraphrases":["Takeshi Kitano born where in Tokyo?"],"info":{}}
{"id":"train_21216","question":"Is the speed of SS Stettin equal to 14.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q462691 wdt:P2052 ?obj filter ( ?obj = 14.2 ) }","paraphrases":["Is the speed of SS Stettin rise to to 14.2?"],"info":{}}
{"id":"train_21217","question":"What is the birthplace of Ella Fitzgerald that has a human population of 182,385?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1768 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '182385.0' ) ) }","paraphrases":["What is the birthplace of Ella Fitzgerald that has a human population of 182,385?"],"info":{}}
{"id":"train_21219","question":"What is Sammantha Teuscher's line of work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11999315 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["What is Sammantha Teuscher's line of work?"],"info":{}}
{"id":"train_21220","question":"Tell me unit of area whose name has the word wente in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1371562 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wente' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know unit of region whose title has the word wente in it."],"info":{}}
{"id":"train_21223","question":"What award did Ilya Mechnikov receive in the year 2005?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q172254 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2005' ) ) }","paraphrases":["IN 2005 which award Ilya Mechnikov received ?"],"info":{}}
{"id":"train_21224","question":"What are the Greek primordial deity which start with the letter uranus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q878099 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'uranus' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What old Greek deity starts with Uranus?"],"info":{}}
{"id":"train_21226","question":"what is business of euronext in stock exchange and also which starts with letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4830453 . ?sbj wdt:P414 wd:Q842108 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What's euronext's stock exchange business and what's starting with letter s?"],"info":{}}
{"id":"train_21227","question":"Where did Andy Griffith die and where was he buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q312252 wdt:P20 ?ans_1 . wd:Q312252 wdt:P119 ?ans_2 }","paraphrases":["What was Andy Griffith's time and place of death? Where is his burial site?"],"info":{}}
{"id":"train_21230","question":"What is the name of the City that Christian Slater was born in New York?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q204590 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1384 }","paraphrases":["In which New York city was Christian Slater born?"],"info":{}}
{"id":"train_21231","question":"What is the governor of the citizens of Barbara Stanwyck ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q94002 wdt:P27 ?X . ?X wdt:P6 ?answer }","paraphrases":["Who is the leader of the constituents of Barbara Stanwyck?"],"info":{}}
{"id":"train_21232","question":"What hypothesis starts with the letter \"s\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41719 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What speculation begins with the letter \"s\"?"],"info":{}}
{"id":"train_21233","question":"What is the most metallic galaxy discovered by James Dunlop?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11276 . ?ent wdt:P2227 ?obj . ?ent wdt:P61 wd:Q375158 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which galaxy discovered by James Dunlop has the highest metallicity?"],"info":{}}
{"id":"train_21234","question":"Who is the  {physical quantity} for {different from} of {mass}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11423 wdt:P1889 ?obj . ?obj wdt:P31 wd:Q107715 }","paraphrases":["Who is the { physical quantity } of the { mass }"],"info":{}}
{"id":"train_21235","question":"What codon is used to encode glycine ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P688 wd:Q620730 . ?sbj wdt:P31 wd:Q165052 }","paraphrases":["What is glycine encoded with?"],"info":{}}
{"id":"train_21238","question":"What musicals were written by Andrew Lloyd Webber?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P58 wd:Q180975 . ?sbj wdt:P31 wd:Q58483083 }","paraphrases":["What musicals were composed by Andrew Lloyd Webber?"],"info":{}}
{"id":"train_21239","question":"Which is the war for the conflict of Stonewall Jackson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q216124 wdt:P607 ?obj . ?obj wdt:P31 wd:Q198 }","paraphrases":[],"info":{}}
{"id":"train_21240","question":"Tell me state of Malaysia whose name has the word terengganu in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15063586 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'terengganu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me Malaysia state whose name includes the word terengganu."],"info":{}}
{"id":"train_21241","question":"What is the name of the birthplace of Marcel Dassault that also has the web address Paris banner.jpg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q160802 wdt:P19 ?answer . ?answer wdt:P948 ?x FILTER ( contains ( ?x , 'Paris banner.jpg' ) ) }","paraphrases":["What is the title of the birthplace of Marcel Dassault that additionally has the web address Paris banner.jpg?"],"info":{}}
{"id":"train_21242","question":"What is the name of the county seat of Herat that was disestablished in 1-1-1507?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q45313 wdt:P1376 ?answer . ?answer wdt:P576 ?x FILTER ( contains ( YEAR ( ?x ) , '1507' ) ) }","paraphrases":["What is the title of the district situate of Herat that was disestablished in 1-1-1507?"],"info":{}}
{"id":"train_21246","question":"Where was Alexander I of Russia buried on 1826-3-25?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q15193 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1826' ) ) }","paraphrases":["When Alexander I of Russia was buried on March 25, 1826, what was the burial location?"],"info":{}}
{"id":"train_21248","question":"Who is the Budapest Metro media legend in the logo image BKV metro.svg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q211044 p:P154 ?s . ?s ps:P154 ?x filter ( contains ( ?x , 'BKV metro.svg' ) ) . ?s pq:P2096 ?value }","paraphrases":["The logo image from BKVmetro.svg is what Budapest Metro media legend?"],"info":{}}
{"id":"train_21250","question":"What city in Ukraine is the twinned administrative body of Vancouver?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q24639 wdt:P190 ?obj . ?obj wdt:P31 wd:Q12131624 }","paraphrases":["Vancouver's administrative body is twinned in what city of Ukraine?"],"info":{}}
{"id":"train_21252","question":"When was {historical period} of {zenith} of {Roraima} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42508 wdt:P610 ?X . ?X wdt:P2348 ?answer }","paraphrases":["When was {chronicled period} of {apex} of {Roraima} ?"],"info":{}}
{"id":"train_21253","question":"What is succeeded by Thirteen Colonies, that has diplomatic relation with Maldives?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q179997 wdt:P1366 ?answer . ?answer wdt:P530 wd:Q826 }","paraphrases":["What is succeeded with the aid of Thirteen Colonies, that has diplomatic relation with Maldives?\""],"info":{}}
{"id":"train_21254","question":"Is Pluto a Charon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q339 wdt:P398 wd:Q6604 }","paraphrases":["Does Pluto is a Charon?"],"info":{}}
{"id":"train_21256","question":"Which civil parish with people from Castle Bromwich has the highest average age?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1115575 . ?ent wdt:P4442 ?obj . ?ent wdt:P1792 wd:Q8729948 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which respectful area with individuals from Castle Bromwich has the most elevated normal age?"],"info":{}}
{"id":"train_21257","question":"What is the football team that was coached by José Mourinho that contains the word \"Porto \" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q476028 . ?sbj wdt:P286 wd:Q79983 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'porto' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the big party that the Social Democratic Party chairman holds the office as the organization's head and whose name contains the word democracy?"],"info":{}}
{"id":"train_21259","question":"WHO BUILT THE LIFE STANCE OF SVETI SEMOCHISLENITSI CHURCH?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2989415 wdt:P88 ?X . ?X wdt:P140 ?answer }","paraphrases":["WHO BUILT THE LIFE Position OF SVETI SEMOCHISLENITSI CHURCH?"],"info":{}}
{"id":"train_21260","question":"Where is the European Union headquarters located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q458 wdt:P159 ?obj . ?obj wdt:P31 wd:Q515 }","paraphrases":["Where is the European Union central command found?"],"info":{}}
{"id":"train_21261","question":"Are are the list of decagonal numbers?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q199 p:P31 ?s . ?s ps:P31 wd:Q663029 . ?s pq:P155 ?value }","paraphrases":["Generate a list of decagonal numbers."],"info":{}}
{"id":"train_21263","question":"Who is the MAMSL narrator set in Journey to the End of the Night ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q774233 wdt:P840 ?X . ?X wdt:P2044 ?answer }","paraphrases":["In \" Journey to the End of the Night\", who is the MAMSL  narrator set?"],"info":{}}
{"id":"train_21264","question":"What is the W3C Recommendation translation of HTML5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2053 wdt:P629 ?obj . ?obj wdt:P31 wd:Q2661442 }","paraphrases":[],"info":{}}
{"id":"train_21265","question":"What country in Dhaka formed on 3-26-1971?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1354 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1971' ) ) }","paraphrases":["Which country in Dhaka formed in 1971?"],"info":{}}
{"id":"train_21266","question":"Who is the{comics character} for {said to be the same as} of {Superman}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P460 wd:Q79015 . ?sbj wdt:P31 wd:Q1114461 }","paraphrases":["Who is the{comics character} for {said to be the same as} of {Superman}"],"info":{}}
{"id":"train_21267","question":"What was the population of Gambia in the year 2009?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1005 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["About of the Nation of Gambia: What was its population in 2009?"],"info":{}}
{"id":"train_21271","question":"What is the chef-lieu of the district of Gannaram?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5521412 wdt:P131 ?X . ?X wdt:P36 ?answer }","paraphrases":["What is the chef-lieu of the area of Gannaram?"],"info":{}}
{"id":"train_21272","question":"Which Seyfert galaxy has the largest apparent magnitude?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q213930 . ?ent wdt:P1215 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the brightest Seyfert galaxy as viewed from Earth?"],"info":{}}
{"id":"train_21273","question":"When did Konstantin Rokossovsky start bearing the military rank of Komdiv?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q40482 p:P410 ?s . ?s ps:P410 wd:Q2618052 . ?s pq:P580 ?value }","paraphrases":["At what point did Konstantin Rokossovsky receive the Komdiv military rank?"],"info":{}}
{"id":"train_21275","question":"Tell me sport in antiquity whose name has the word pankrationin it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16465962 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pankration' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know wear in relic whose title has the word pankrationin it."],"info":{}}
{"id":"train_21276","question":"Were Kim Jong-nam and Kim Yo-jong the children of Kim Jong-il?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q10665 wdt:P40 wd:Q317824 . wd:Q10665 wdt:P40 wd:Q4330912 }","paraphrases":["Are Kim Jong-Il's children named Kim Jong-nam and Kim Yo-jong?"],"info":{}}
{"id":"train_21278","question":"Which is the record label Chris Brown belongs to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q155700 wdt:P264 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21279","question":"What award did Todd Ray and Clive Davis receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1101938 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q7812581 }","paraphrases":["Name the award received by Todd Ray and Clive Davis."],"info":{}}
