{"id":"train_19564","question":"What method  was used the to determine the population of Naples as 989789.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2634 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '989789.0' ) ) . ?s pq:P459 ?value }","paraphrases":["How was the population of Naples determined to be 989789?"],"info":{}}
{"id":"train_19568","question":"What award did Brigitte Bardot receive in 2003?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q36268 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2003' ) ) }","paraphrases":["Which award was given to Brigette Bardot in the year 2003?"],"info":{}}
{"id":"train_19574","question":"Was Larry Page a member of the American Academy of Arts and Sciences and the National Academy of Engineering?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4934 wdt:P463 wd:Q463303 . wd:Q4934 wdt:P463 wd:Q1493021 }","paraphrases":["Page is a member of the National Academy of Engineering and a fellow of the American Academy of Arts and Sciences. He has received the Marconi Prize, given to those who achieve advances in communications and information technology for the social, economic and cultural development of all humanity.."],"info":{}}
{"id":"train_19575","question":"Which Montenegran head of state stepped down on November 25, 2002.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q236 p:P35 ?s . ?s ps:P35 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["Give me the name of the Montenegran head of state that stepped down on November 25, 2002."],"info":{}}
{"id":"train_19576","question":"In which city the main headquarters of the company PricewaterhouseCoopers are located ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q488048 wdt:P159 ?X . ?X wdt:P6 ?answer }","paraphrases":["In which city the most central station of the company PricewaterhouseCoopers are found ?"],"info":{}}
{"id":"train_19577","question":"Which club did Richard Bartel play for as team manager?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7323984 wdt:P54 ?X . ?X wdt:P286 ?answer }","paraphrases":["Which club did Richard Bartel play for as group manager?"],"info":{}}
{"id":"train_19579","question":"Which is {record label} of {Beastie Boys} where {start time} is {1992-1-1} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q214039 p:P264 ?s . ?s ps:P264 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1992' ) ) }","paraphrases":["What is the record label of Beastie Boys in 1992?"],"info":{}}
{"id":"train_19582","question":"Which is the ice giant that has Sun as parent astronomical body and contains the word uranus in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1319599 . ?sbj wdt:P397 wd:Q525 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'uranus' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the ice monster that has Sun as parent cosmic body and contains the word uranus in it's name?"],"info":{}}
{"id":"train_19583","question":"What is the twin city of Casimir III the Great's death place?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q53457 wdt:P20 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the twin city of Casimir III the Great's passing place?"],"info":{}}
{"id":"train_19584","question":"What organization decides who wins the Tony Awards?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q191874 wdt:P1027 ?obj . ?obj wdt:P31 wd:Q43229 }","paraphrases":["Who decides who wins the Tony Awards?"],"info":{}}
{"id":"train_19585","question":"What language did Mary, Queen of Hungary speak?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q154412 wdt:P103 ?answer . ?answer wdt:P5110 wd:Q51929447 }","paraphrases":["What language did Mary, Queen of Hungary speak?"],"info":{}}
{"id":"train_19586","question":"Name the explosion with the highest number of casualties in the Gulf of Mexico.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q179057 . ?ent wdt:P1590 ?obj . ?ent wdt:P131 wd:Q12630 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Of all the explosions in the Gulf of Mexico, name the one with the highest number of casualties?"],"info":{}}
{"id":"train_19587","question":"What is the gender identity of Yang Liwei, shortened name for мужской?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q147581 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'мужской' ) ) }","paraphrases":["What is the sex character of Yang Liwei, abbreviated title for мужской?"],"info":{}}
{"id":"train_19590","question":"What is commemorates of menorah ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P547 wd:Q170476 }","paraphrases":[],"info":{}}
{"id":"train_19591","question":"Which is the antonym for CFSI of Gujarat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1061 wdt:P1740 ?X . ?X wdt:P461 ?answer }","paraphrases":["Which is the antonym for CFSI of Gujarat?"],"info":{}}
{"id":"train_19592","question":"What is the first described death place of Ariel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3343 wdt:P61 ?X . ?X wdt:P20 ?answer }","paraphrases":["In what place was Ariel described to be death at first?"],"info":{}}
{"id":"train_19593","question":"Where was writer, Roald Dahl born and when did he die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q25161 p:P106 ?s . ?s ps:P106 wd:Q36180 . ?s pq:P570 ?value1 . ?s pq:P19 ?value2 }","paraphrases":["What is the location of writer, Roald Dahl's birthplace and death?"],"info":{}}
{"id":"train_19594","question":"What are the space probe which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26529 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the space test which begin with the letter v"],"info":{}}
{"id":"train_19595","question":"What does Metroid develop?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12397 wdt:P400 ?X . ?X wdt:P178 ?answer }","paraphrases":["What is developed by Metroid?"],"info":{}}
{"id":"train_19596","question":"Where is the next crossing downstream of the London Bridge.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2674 wd:Q130206 }","paraphrases":[],"info":{}}
{"id":"train_19597","question":"Lake Kariba, a tributary of the Luena River, is fed by which river inflows?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1047206 wdt:P200 ?answer . ?answer wdt:P974 wd:Q1178822 }","paraphrases":["Lake Kariba, a tributary of the Luena Stream, is encouraged by which waterway inflows?"],"info":{}}
{"id":"train_19598","question":"What was Sagittarius A, discovered by Andrea M. Ghez?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q237284 p:P61 ?s . ?s ps:P61 wd:Q493956 . ?s pq:P518 ?value }","paraphrases":["which one was the Sagittarius A, discovered by Andrea M. Ghez"],"info":{}}
{"id":"train_19599","question":"What sports team did Birgit Prinz play for and what was the number of points, goals and sets scored?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q109868 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }","paraphrases":["What sports activities group did Birgit Prinz play for and what was once the quantity of points, desires and sets scored?"],"info":{}}
{"id":"train_19601","question":"What is an attendee of the Russian Air Force called?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q209833 wdt:P607 ?X . ?X wdt:P710 ?answer }","paraphrases":["What is an attendee of the Russian Discuss Constrain called?"],"info":{}}
{"id":"train_19603","question":"Which airline uses Airbus A330","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P121 wd:Q6478 . ?sbj wdt:P31 wd:Q46970 }","paraphrases":["Which carrier utilizes Airbus A330"],"info":{}}
{"id":"train_19604","question":"What position was held by William Massey in the electoral district Waitemata?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q923806 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 wd:Q7960496 }","paraphrases":["William Massey held what position in the electoral district Waitemata?"],"info":{}}
{"id":"train_19605","question":"How many genres are there of religious music?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P136 wd:Q1065742 }","paraphrases":["Religious music has how many genres?"],"info":{}}
{"id":"train_19606","question":"Which is the mean anomaly of the 4 Vesta?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3030 wdt:P2325 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19608","question":"What is the Hanseatic city with the highest vehicles per capita (1000) whose category of associated people is Category:People from Lübeck?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q707813 . ?ent wdt:P5167 ?obj . ?ent wdt:P1792 wd:Q8741076 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the Hanseatic city with the most noteworthy vehicles per capita (1000) whose category of related individuals is Category:People from Lübeck?"],"info":{}}
{"id":"train_19609","question":"Where was General Electric formed and who is it's current owner?\n'","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q54173 wdt:P740 ?ans_1 . wd:Q54173 wdt:P1830 ?ans_2 }","paraphrases":["Where was Common Electric shaped and who is it's current proprietor? '"],"info":{}}
{"id":"train_19610","question":"Is it true that the cruise speed of the Norwegian Spirit is greater than 25.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1457799 wdt:P2217 ?obj filter ( ?obj > 25.2 ) }","paraphrases":["Is the cruise speed of a Norwegian Spirit greater than 25.2?"],"info":{}}
{"id":"train_19614","question":"When was Harold Wilson elected as a member of the 41st Parliament of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q128956 p:P39 ?s . ?s ps:P39 wd:Q41582604 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["In what year was Harold Wilson elected to the UK's 41st House of Commons?"],"info":{}}
{"id":"train_19615","question":"With a Hornbostel-Sachs of 422.121, what is named after the tibia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178366 wdt:P138 ?answer . ?answer wdt:P1762 ?x FILTER ( contains ( ?x , '422.121' ) ) }","paraphrases":["With a Hornbostel-Sachs of 422.121, what is named after the tibia?"],"info":{}}
{"id":"train_19617","question":"As a member of Comecon, what did Bulat Okudzhave found?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q239652 wdt:P740 ?answer . ?answer wdt:P463 wd:Q191582 }","paraphrases":["As a part of Comecon, what did Bulat Okudzhave found?"],"info":{}}
{"id":"train_19618","question":"Formicidae has a Dewey Decimal Classification of 595.796, when was that established?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7386 p:P1036 ?s . ?s ps:P1036 ?x filter ( contains ( ?x , '595.796' ) ) . ?s pq:P747 ?value }","paraphrases":["What is the date that Formicidae was established in the Dewey Decimal system?"],"info":{}}
{"id":"train_19619","question":"which brand that starts with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q431289 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a brand that starts with V."],"info":{}}
{"id":"train_19620","question":"What is ICD-9  for tuberculosis","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12204 wdt:P493 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19621","question":"Do the annual number of weddings of the Zelzate equal 52?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q14062 wdt:P5982 ?obj filter ( ?obj = 52 ) }","paraphrases":["Are there 52 weddings of the Zelzate every year?"],"info":{}}
{"id":"train_19624","question":"Name the Class IB flammable liquid with maximum combustion enthalpy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P2117 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Title the Course IB combustible fluid with greatest combustion enthalpy?"],"info":{}}
{"id":"train_19625","question":"Tell me the academic writing of author Charles Darwin that contains the word origin in it's name!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4119870 . ?sbj wdt:P50 wd:Q1035 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'origin' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the tutorial writing of writer Charles Darwin that contains the word origin in it is name!"],"info":{}}
{"id":"train_19627","question":"Mention the public official holidays granted in Sweden related to the resurrection of Jesus and commemorates.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P547 wd:Q51624 . ?sbj wdt:P31 wd:Q1401522 }","paraphrases":["What is the public official holiday in Sweden related to the resurrection of Jesus and commemorates?"],"info":{}}
{"id":"train_19628","question":"Was Paracetamol medical condition treated pain and Amanita phalloides?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q57055 wdt:P2175 wd:Q81938 . wd:Q57055 wdt:P2175 wd:Q188643 }","paraphrases":["Has Paracetamol been treated by Amanita phalloides?"],"info":{}}
{"id":"train_19629","question":"How many license plate codes are there for Piraeus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q58976 wdt:P395 ?obj }","paraphrases":["Piraeus has how many license codes?"],"info":{}}
{"id":"train_19630","question":"\"Which is {place of activity} of {Eleftherios Venizelos}, that has {twin cities} is {Prague} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q205545 wdt:P937 ?answer . ?answer wdt:P190 wd:Q1085 }","paraphrases":["\"Which is {put of movement} of {Eleftherios Venizelos}, that has {twin cities} is {Prague} ?\""],"info":{}}
{"id":"train_19631","question":"What is the population of Malaga according to the register office?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8851 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }","paraphrases":["Tell me the population of Malaga according to the register office?"],"info":{}}
{"id":"train_19634","question":"What is the next platform of 1001 Spikes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17505226 wdt:P400 ?X . ?X wdt:P156 ?answer }","paraphrases":["What is the following stage of 1001 Spikes?"],"info":{}}
{"id":"train_19635","question":"What is Glenda Jackson's title?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q182408 wdt:P1035 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19637","question":"What is the German district key of Mönchengladbach","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2758 wdt:P440 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19638","question":"who  is the written work for notable work of hillary Clinton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q6294 wdt:P800 ?obj . ?obj wdt:P31 wd:Q47461344 }","paraphrases":["who is the composed work for outstanding work of hillary Clinton?"],"info":{}}
{"id":"train_19639","question":"Where is the sovereign state that plays God Save the Queen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P85 wd:Q40807 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["God Save the Queen plays in which sovereign state?"],"info":{}}
{"id":"train_19643","question":"Tell me about the unitary state that contains the administrative territorial entity of Sofia.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P150 wd:Q472 . ?sbj wdt:P31 wd:Q179164 }","paraphrases":["Let me know approximately the unitary state that contains the authoritative regional substance of Sofia."],"info":{}}
{"id":"train_19644","question":"What award did Bette Midler receive on 1-1-1974?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q190631 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1974' ) ) }","paraphrases":["With what was Bette Midler awarded in 1974?"],"info":{}}
{"id":"train_19645","question":"Where is Paracelsus buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q83428 wdt:P119 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19650","question":"What place with an area code of 075 is mistaken for Brachyura?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40802 wdt:P1889 ?answer . ?answer wdt:P473 ?x FILTER ( contains ( ?x , '075' ) ) }","paraphrases":["What put with an range code of 075 is mixed up for Brachyura?"],"info":{}}
{"id":"train_19652","question":"What heir of the Connecticut Colony has the motto \"Qui Transtulit Sustinet\"?","sparql":"SELECT ?answer WHERE { wd:Q951500 wdt:P1366 ?answer . ?answer wdt:P1451 wd:Qui transtulit sustinet}","paraphrases":["What beneficiary of the Connecticut Colony has the proverb \"Qui Transtulit Sustinet\"?"],"info":{}}
{"id":"train_19653","question":"What health specialty does clinical psychology cover?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1995 wd:Q199906 }","paraphrases":["Clinical psychology covers what healthy specialty?"],"info":{}}
{"id":"train_19655","question":"What is the district of Yemen} with the lowest female population whose located in the administrative territorial entity is 'Amran Governorate ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q6617100 . ?ent wdt:P1539 ?obj . ?ent wdt:P131 wd:Q275720 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What Yemen district has the lowest female population and is associated with the Governorate of Amran?"],"info":{}}
{"id":"train_19656","question":"What is the theme of \"katal,\" also known as \"Sekunde?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q208634 wdt:P144 ?answer . ?answer wdt:P1889 wd:Q22699224 }","paraphrases":["What is the topic of \"katal,\" moreover known as \"Sekunde?\""],"info":{}}
{"id":"train_19658","question":"What award did David Letterman receive in 2007?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q217298 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2007' ) ) }","paraphrases":["In 2007, which award did David Letterman win?"],"info":{}}
{"id":"train_19659","question":"IS THE MEAN ANOMALY OF 1099 FIGNERIA EQUALS 4.72006","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q135894 wdt:P2325 ?obj filter ( ?obj = 4.72006 ) }","paraphrases":["Is 4.72006 the average anomaly of 1099 Figneria?"],"info":{}}
{"id":"train_19661","question":"Where did the Lewis and Clark Expedition end in July 3, 1806?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q505802 p:P276 ?s . ?s ps:P276 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1806' ) ) }","paraphrases":["Give the location at which the Lewis and Clark expedition ended on July 3, 1806."],"info":{}}
{"id":"train_19662","question":"What award did Christopher Lambert receive in 1986?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q105158 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1986' ) ) }","paraphrases":["Which award was received by Christopher Lambert in 1986?"],"info":{}}
{"id":"train_19663","question":"Tell me hot spring whose name has the word unapdev in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q177380 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'unapdev' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know hot spring whose title has the word unapdev in it."],"info":{}}
{"id":"train_19664","question":"\"Whhere is {university attended} of {Gerard Manley Hopkins}, which {gps location} is {-3.3807} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q313693 wdt:P69 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-3.3807' ) ) }","paraphrases":["\"Whhere is {college gone to} of {Gerard Manley Hopkins}, which {gps area} is {-3.3807} ?\""],"info":{}}
{"id":"train_19665","question":"melbourne omni id?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3141 wdt:P3479 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19667","question":"Who is the inventor or discoverer of Messier 77 whose murder method is yellow fever?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14017 wdt:P61 ?answer . ?answer wdt:P509 wd:Q154874 }","paraphrases":["Who is Messier 77's inventor or discoverer whose method of killing is yellow fever?"],"info":{}}
{"id":"train_19668","question":"What award did Stephen Cook receive in 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q62870 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["Which was the award that Stephen Cook got in 2015?"],"info":{}}
{"id":"train_19671","question":"Where did Aldus Manutius last reside in the year 1511?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q213220 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1511' ) ) }","paraphrases":["In 1511, where did Aldus Manutius last reside?"],"info":{}}
{"id":"train_19672","question":"Mention the time and the  election year of Angela Merkel for being appointed as the member of the German Bundestag","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q567 p:P39 ?s . ?s ps:P39 wd:Q1939555 . ?s pq:P580 ?value1 . ?s pq:P2715 ?value2 }","paraphrases":["Mention the time and the election yr of Angela Merkel for being appointed as the member of the German Bundestag"],"info":{}}
{"id":"train_19673","question":"Did Jimi Hendrix serve in the US Army?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5928 wdt:P241 wd:Q9212 }","paraphrases":["Was Jimi Hendrix ever a member of the US Army?"],"info":{}}
{"id":"train_19674","question":"GPS coordinates 48.1415 11.5806 has works of Louis Daguerre.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131405 wdt:P463 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '48.1415 11.5806' ) ) }","paraphrases":["GPS arranges 48.1415 11.5806 has works of Louis Daguerre."],"info":{}}
{"id":"train_19675","question":"Which is the father and the date of death  of Abigail Adams child the Thomas Boylston Adams?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q7787805 . ?s pq:P22 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["Who was the father of Abigail Adams' child Thomas Boylston Adams, and when did the child die?"],"info":{}}
{"id":"train_19676","question":"What's the name of the color model that starts with an \"h\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2294018 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the color model name that begins with an \"h\""],"info":{}}
{"id":"train_19678","question":"What are the new religious movement which start with the letter syntheism","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q477544 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'syntheism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the unused devout development which begin with the letter syntheism"],"info":{}}
{"id":"train_19679","question":"Which is the Norwegian municipality number for Spitsbergen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q21162 wdt:P2504 ?answer }","paraphrases":[],"info":{}}
