{"id":"train_7167","question":"What is the noble title of Charles the Fat and follows.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q150712 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What is the respectable title of Charles the Fat and follows."],"info":{}}
{"id":"train_7169","question":"What was the statement that was made by the head of government for the Autonomous Republic of Crimea, Sergey Aksyonov?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q756294 p:P6 ?s . ?s ps:P6 wd:Q15838823 . ?s pq:P3680 ?value }","paraphrases":["What did Sergey Aksyonov, the government head of the Autonomous Republic of Crimea, state?"],"info":{}}
{"id":"train_7170","question":"Which stockholder has a label of Wanda Jackson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q235223 wdt:P264 ?X . ?X wdt:P127 ?answer }","paraphrases":["Which stockholder has Wanda Jackson's label?"],"info":{}}
{"id":"train_7172","question":"What is composed by Thaïs? Who is the child of Alexis Massenet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1144467 wdt:P86 ?answer . ?answer wdt:P22 wd:Q20895527 }","paraphrases":["What is composed via Thaïs? Who is the child of Alexis Massenet?"],"info":{}}
{"id":"train_7174","question":"Gordon Cooper was the crew member for which space launch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1029 wd:Q312833 . ?sbj wdt:P31 wd:Q752783 }","paraphrases":["Which space launch was Gordon Cooper a part of as a crew member?"],"info":{}}
{"id":"train_7176","question":"Tell me decimal classification whose name has the word classification in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1207369 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'classification' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal to me decimal arrangement whose name has the word grouping in it."],"info":{}}
{"id":"train_7178","question":"What is Q48460  portrait of  Arnolfini Portrait ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q220859 wdt:P180 ?X . ?X wdt:P1036 ?answer }","paraphrases":["What is Q48460 representation of Arnolfini Representation ?"],"info":{}}
{"id":"train_7179","question":"What is the name of Bashar al-Assad's sibling","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44329 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What is the title of Bashar al-Assad's sibling"],"info":{}}
{"id":"train_7180","question":"What did the cinematographer of Jim: The James Foley Story slaughter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24593936 wdt:P344 ?X . ?X wdt:P157 ?answer }","paraphrases":["What did the cinematographer of Jim: The James Foley Story slaughter?"],"info":{}}
{"id":"train_7182","question":"what is the stock price of the ING group?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q645708 p:P414 ?s . ?s ps:P414 ?obj . ?s pq:P249 ?x filter ( contains ( ?x , 'ING' ) ) }","paraphrases":["Can you advise me of the stock price for the ING group?"],"info":{}}
{"id":"train_7183","question":"What are the invasion which start with the letter  migration","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q467011 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'migration' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the attack which begin with the letter relocation"],"info":{}}
{"id":"train_7184","question":"What is the telephone numbering plan of the seat of Union Cycliste Internationale ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q48663 wdt:P159 ?X . ?X wdt:P473 ?answer }","paraphrases":["What is the phone numbering arrange of the situate of Union Cycliste Internationale ?"],"info":{}}
{"id":"train_7186","question":"Who is the writer of the preceeds of Choke?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2466091 wdt:P156 ?X . ?X wdt:P50 ?answer }","paraphrases":["Who is the author of the preceeds of Choke?"],"info":{}}
{"id":"train_7187","question":"Where was John Major elected as Member of the 51st Parliament of the United Kingdom and why did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q9559 p:P39 ?s . ?s ps:P39 wd:Q41582627 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["How did John Major end his mandate in the Parliament of the UK and where was he elected?"],"info":{}}
{"id":"train_7188","question":"What US company has the highest net profit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q219577 . ?ent wdt:P2295 ?obj . ?ent wdt:P17 wd:Q30 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which company in the USA makes the most money?"],"info":{}}
{"id":"train_7189","question":"Who is the chief executive officer of IBM","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q37156 wdt:P169 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the {physical wonder} for {highlight of} of {warm conductivity}"],"info":{}}
{"id":"train_7192","question":"Is the shear modulas of the glass equal to 26.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q11469 wdt:P5673 ?obj filter ( ?obj = 26.2 ) }","paraphrases":["Is 26.2 the shear modules of glass?"],"info":{}}
{"id":"train_7193","question":"Who is the {human} for {replaces} of {Ayman al-Zawahiri}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q186316 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {replaces} of {Ayman al-Zawahiri}"],"info":{}}
{"id":"train_7199","question":"Wich means{conjugate base} in {ammonium cation} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q190901 wdt:P4149 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7201","question":"Henry Goudy is the position holder of what professorship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16976151 wdt:P803 ?X . ?X wdt:P1308 ?answer }","paraphrases":["Henry Goudy is the position holder of what professorship?"],"info":{}}
{"id":"train_7202","question":"What is Davis Cup player ID for Ken Rosewall?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q312728 wdt:P2641 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7204","question":"What what is Olympic sport authority by International Biathlon Union  and which that starts with b","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212434 . ?sbj wdt:P797 wd:Q866910 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE OLYMPIC SPORT AUTHORITY BY INTERNATIONAL UNION AND WHICH STARTS WITH B"],"info":{}}
{"id":"train_7206","question":"how many allegiances does west germany have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P945 wd:Q713750 }","paraphrases":["Give me the number of allegiances west germany has"],"info":{}}
{"id":"train_7208","question":"Which academic degree did Bjarne Stroustrup earn from the University of Cambridge?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q92620 p:P69 ?s . ?s ps:P69 wd:Q35794 . ?s pq:P512 ?value }","paraphrases":["What degree was granted to Bjarne Stroustrup by the University of Cambridge?"],"info":{}}
{"id":"train_7209","question":"What was the location time zone of Donetsk Oblast as per standard time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2012050 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q1777301 }","paraphrases":["In standard time, what is the location time zone for Donetsk Oblast?"],"info":{}}
{"id":"train_7211","question":"Who is the publisher and the developer of Minecraft?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q49740 wdt:P123 ?ans_1 . wd:Q49740 wdt:P178 ?ans_2 }","paraphrases":["What company developed and published Minecraft?"],"info":{}}
{"id":"train_7212","question":"Tell me the ancient Greek temple that had as architect Chersiphron and contains the word artemis in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q267596 . ?sbj wdt:P84 wd:Q1070392 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'artemis' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the ancient Greek temple that contained the word artemis in its name as the architect Chersiphron?"],"info":{}}
{"id":"train_7213","question":"Is google's total equity 96,822,000,000.00?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q95 wdt:P2137 ?obj filter ( ?obj = 96822000000.0 ) }","paraphrases":["Is the total equity of Google 96,822,000,000.00?"],"info":{}}
{"id":"train_7214","question":"When was Jean Cocteau the President of the Cannes Festival jury?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q83158 p:P39 ?s . ?s ps:P39 wd:Q23958341 . ?s pq:P585 ?value }","paraphrases":["Jean Cocteau was the President of the Cannes Festival jury when?"],"info":{}}
{"id":"train_7215","question":"Where was Roald Dahl born and where did he work as a writer?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q25161 p:P106 ?s . ?s ps:P106 wd:Q36180 . ?s pq:P27 ?value1 . ?s pq:P19 ?value2 }","paraphrases":["In what location was Roald Dahl born and in which location did he work as an author?"],"info":{}}
{"id":"train_7218","question":"What is Alfred de Musset's Académie française ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q179680 wdt:P4717 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7221","question":"which public research university name was  starts with u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q62078547 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which open investigate college title was begins with u"],"info":{}}
{"id":"train_7222","question":"Who was the doctoral advisor of Isaac Newton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q935 wdt:P184 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What doctor advised Isasc Newton?"],"info":{}}
{"id":"train_7224","question":"Which chef-lieu was the hometown of George Orwell?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3335 wdt:P551 ?X . ?X wdt:P36 ?answer }","paraphrases":["Which chef-lieu was the hometown of George Orwell?"],"info":{}}
{"id":"train_7226","question":"How many operating systems does Skype have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q40984 wdt:P306 ?obj }","paraphrases":["What is the number of operating systems for Skype?"],"info":{}}
{"id":"train_7227","question":"What is the Wikimedia category of Surat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q4629 wdt:P1792 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["What is the Wikimedia category of Surat?"],"info":{}}
{"id":"train_7228","question":"What sports team did Jonah Lomu play for on 1-1-1999?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q363717 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1999' ) ) }","paraphrases":["which sports team did jonah paly for on 01-01-1999?"],"info":{}}
{"id":"train_7233","question":"Name a vegetation zone in Europa that contains the word \"taiga\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2083910 . ?sbj wdt:P30 wd:Q46 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'taiga' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a vegetation zone in Europa that contains the word \"taiga\" in its name"],"info":{}}
{"id":"train_7234","question":"tell me sexual orientation that name has the word sex in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17888 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sex' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the sexual orientation of the word ' sex '"],"info":{}}
{"id":"train_7235","question":"When was Pius X canonized as a Catholic saint?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43739 p:P411 ?s . ?s ps:P411 wd:Q3464126 . ?s pq:P585 ?value }","paraphrases":["On what date was Pius X canonized as a Catholic saint?"],"info":{}}
{"id":"train_7236","question":"Which is the Nobel prize ID of André Gide?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q47484 wdt:P3188 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7237","question":"Which is the name in kana of Akira?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1905968 wdt:P1814 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7239","question":"how many sexual orientations are bisexual?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P91 wd:Q43200 }","paraphrases":["What personal relationships are considered bisexual?"],"info":{}}
{"id":"train_7241","question":"What is the environment of Street Fighter that came before PlayStation4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q288035 wdt:P400 ?answer . ?answer wdt:P156 wd:Q5014725 }","paraphrases":["What is the environment of Street Fighter that came earlier than PlayStation4?"],"info":{}}
{"id":"train_7242","question":"Who was the film starring in the movie Happy Days, the birth place for the movie was in Los Angeles","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q518589 wdt:P161 ?answer . ?answer wdt:P19 wd:Q65 }","paraphrases":["Who was the film featuring within the motion picture Upbeat Days, the birth put for the motion picture was in Los Angeles"],"info":{}}
{"id":"train_7243","question":"What is safety classification and labelling of ferrous sulfate anhydrous, that has publishing house National Fire Protection Association has published?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q214863 wdt:P4952 ?answer . ?answer wdt:P123 wd:Q1806416 }","paraphrases":["What is protection classification and labelling of ferrous sulfate anhydrous, that has publishing residence National Fire Protection Association has published?"],"info":{}}
{"id":"train_7245","question":"Is it true that Zoroastrianism was the main regulatory text for the Prayer of Bahman Yasht?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9601 wdt:P92 wd:Q4842666 }","paraphrases":["Did the main regulatory text for the Prayer of Bahman include Zoroastrianism?"],"info":{}}
{"id":"train_7246","question":"What is the religion and sex of Hugh Laurie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q49017 wdt:P140 ?ans_1 . wd:Q49017 wdt:P21 ?ans_2 }","paraphrases":["What is Hugh Laurie's religion and sex?"],"info":{}}
{"id":"train_7248","question":"What cities contain the nationality of Eddie Robinson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1282951 wdt:P27 ?X . ?X wdt:P150 ?answer }","paraphrases":["What cities contain the nationality of Eddie Robinson?"],"info":{}}
{"id":"train_7249","question":"Were Eva Braun's siblings Gretl and Ilse Braun?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q76433 wdt:P3373 wd:Q1165052 . wd:Q76433 wdt:P3373 wd:Q6001165 }","paraphrases":["Were Greti and Ilse Braun siblings of Eva Braun?"],"info":{}}
{"id":"train_7250","question":"What is the noble title of Godfrey of Boullions and who follows him?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q76721 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What is the noble title of Godfrey of Boullions and who follows him?"],"info":{}}
{"id":"train_7253","question":"What was the population of Maryland in 1980?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1391 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["In 1980, what was Maryland's population?"],"info":{}}
{"id":"train_7254","question":"Name an art genre that contains the word \"dance\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q45971958 . ?sbj wdt:P1535 wd:Q43393537 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dance' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an art style that contains the phrase \"dance\" in its title"],"info":{}}
{"id":"train_7257","question":"Which solar calendar contains the word calendar in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q210953 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'calendar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which sunlight based date-book contains the word schedule in their name"],"info":{}}
{"id":"train_7258","question":"When are Taxon products determined for Pinus?\n ","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1582 wd:Q12024 }","paraphrases":["At which point in time are Taxon products determined for Pinus?"],"info":{}}
{"id":"train_7259","question":"Tell me the taxon that has capsule as fruit type and starts with the letter t?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16521 . ?sbj wdt:P4000 wd:Q147768 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE LAGUOID CLASS THAT CONTAINS THE WORD VARIETY IN THEIR NAME"],"info":{}}
{"id":"train_7260","question":"When did the Alexander pope die in the Kingdom of England","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q164047 p:P27 ?s . ?s ps:P27 wd:Q179876 . ?s pq:P582 ?value }","paraphrases":["May 30, 1744\nAlexander Pope, (born May 21, 1688, London, England—died May 30, 1744, Twickenham, near London), poet and satirist of the English Augustan period, best known for his poems An Essay on Criticism (1711), The Rape of the Lock (1712–14), The Dunciad (1728), and An Essay on Man (1733–34)."],"info":{}}
{"id":"train_7263","question":"What state has the highest fertility rate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q859563 . ?ent wdt:P4841 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["In which state is the fertility rate the highest?"],"info":{}}
{"id":"train_7265","question":"A solid is what phase of matter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P515 wd:Q11438 }","paraphrases":[],"info":{}}
{"id":"train_7266","question":"What is {slogan} of {working for} {Vilfredo Pareto} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11031 wdt:P108 ?X . ?X wdt:P1451 ?answer }","paraphrases":["Specify the slogan used by Vilfredo Pareto."],"info":{}}
{"id":"train_7268","question":"Which is the OSM tag or key for castle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q23413 wdt:P1282 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7269","question":"Name a child of Nargis","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P40 wd:Q159169 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Title a child of Nargis"],"info":{}}
{"id":"train_7270","question":"What is the governing body of Aktobe located at street address улица Т. Ахтанова, 50?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q477232 wdt:P797 ?answer . ?answer wdt:P969 ?x FILTER ( contains ( ?x , 'улица Т. Ахтанова, 50' ) ) }","paraphrases":["What is the overseeing body of Aktobe found at road address улица Т. Ахтанова, 50?"],"info":{}}
{"id":"train_7271","question":"which work place split from Pierre Puvis de Chavannes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q216873 wdt:P937 ?X . ?X wdt:P155 ?answer }","paraphrases":["which work put part from Pierre Puvis de Chavannes?"],"info":{}}
{"id":"train_7272","question":"Which character from Mario wasn´t in Super Mario?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12379 p:P2868 ?s . ?s ps:P2868 ?obj . ?s pq:P642 wd:Q4802838 }","paraphrases":["Who was the character in Super Mario that was not Mario?"],"info":{}}
{"id":"train_7273","question":"What is the main Japanese dialect ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4913 wd:Q5287 . ?sbj wdt:P31 wd:Q33384 }","paraphrases":["What's Japan's main dialect?"],"info":{}}
{"id":"train_7274","question":"What is the MetroLyrics ID of the Inernationale?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q49617 wdt:P2624 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7275","question":"What item, that is made by DC-10, would have a wound up on date of 1997-0-0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q208075 wdt:P176 ?answer . ?answer wdt:P576 ?x FILTER ( contains ( YEAR ( ?x ) , '1997' ) ) }","paraphrases":["What thing, that's made by DC-10, would have a wound up on date of 1997-0-What thing, that's made by DC-10, would have a wound up on date of 1997-0-0?"],"info":{}}
{"id":"train_7278","question":"What is Theatricalia person ID of Paul Scofield ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q223988 wdt:P2469 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7279","question":"Which  is public holiday for Eid al-Adha ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P832 wd:Q514400 }","paraphrases":[],"info":{}}
{"id":"train_7281","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2579 wd:Q25261 . ?sbj wdt:P31 wd:Q8104 }","paraphrases":["n/a"],"info":{}}
{"id":"train_7283","question":"When did Hugh Jackman receive the Golden Globe Award for Best Actor in a Motion Picture Musical or Comedy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q129591 p:P166 ?s . ?s ps:P166 wd:Q181883 . ?s pq:P585 ?value }","paraphrases":["When did Hugh Jackman get a Golden Globe?"],"info":{}}
{"id":"train_7284","question":"What are the road bridge which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q537127 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the road bridge that start with the letter V?"],"info":{}}
{"id":"train_7286","question":"Which tributary of the Ussuri River flows to the right?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q207777 p:P974 ?s . ?s ps:P974 ?obj . ?s pq:P560 wd:Q14565199 }","paraphrases":["What is the name of the tributary that runs to the right of the Ussuri River?"],"info":{}}
{"id":"train_7287","question":"What is anatomical branch of bronchus ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3262 wd:Q181602 }","paraphrases":[],"info":{}}
{"id":"train_7288","question":"Which disease does Daniel Wayne Smith's son suffer from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2566243 wdt:P25 ?X . ?X wdt:P1050 ?answer }","paraphrases":["what disease does Daniel Wayne Smith's son suffer from?"],"info":{}}
{"id":"train_7289","question":"What is the attendee that participated in Belarus in the Eurovision Song Contest 2004?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1899987 wdt:P1344 ?X . ?X wdt:P710 ?answer }","paraphrases":["What is the attendee that taken part in Belarus within the Eurovision Melody Challenge 2004?"],"info":{}}
