{"id":"train_5389","question":"Volgograd is the capital of governorate of the Russian Soviet Federative Socialist Republic","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q914 . ?sbj wdt:P31 wd:Q15733039 }","paraphrases":[],"info":{}}
{"id":"train_5390","question":"What is key event for film producer of Selma ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17183770 wdt:P162 ?X . ?X wdt:P793 ?answer }","paraphrases":["What is the film producer of Selma's key event?"],"info":{}}
{"id":"train_5391","question":"Who is the facet of and located in the administrative territorial entity of Assassination of John F. Kennedy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q193484 wdt:P1269 ?ans_1 . wd:Q193484 wdt:P131 ?ans_2 }","paraphrases":["Who was the mayor of Dallas at the time of John F. Kennedy's assassination?"],"info":{}}
{"id":"train_5392","question":"Where is the mouth of the Daugava River located?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8197 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q1233637 }","paraphrases":["At what place is located the mouth of the Daugava River?"],"info":{}}
{"id":"train_5393","question":"Tell me the type of statistic that starts with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47103999 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me what kind of statistics the letter v starts with"],"info":{}}
{"id":"train_5395","question":"Does the pulication interval of the Le Monde equal 0.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12461 wdt:P2896 ?obj filter ( ?obj = 0.8 ) }","paraphrases":["Is the Le Monde's pulication interval equal to 0.8?"],"info":{}}
{"id":"train_5396","question":"What is Les Enfoirés participant id for Celine Dion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5105 wdt:P5261 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5397","question":"Where is the river mouth of the Uruguay river?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18278 wdt:P403 ?X . ?X wdt:P974 ?answer }","paraphrases":["Do you know where the river mouth of the Uruguay River is located?"],"info":{}}
{"id":"train_5398","question":"When was Mitsubishi UFJ Financial Group owned by The Vanguard Group?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1542175 p:P127 ?s . ?s ps:P127 wd:Q849363 . ?s pq:P585 ?value }","paraphrases":["When did the Vanguard Group own Mitsubishi UFJ Financial Group?"],"info":{}}
{"id":"train_5399","question":"What is the stature of CN Tower that is the standard utilized is tallness to the involved floor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q134883 p:P2048 ?s . ?s ps:P2048 ?obj . ?s pq:P1013 wd:Q31271474 }","paraphrases":["What is the stature of CN Tower that is the standard used in height to the included floor?"],"info":{}}
{"id":"train_5400","question":"Who is the important person behind Rumi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43347 wdt:P3342 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the critical individual behind Rumi?"],"info":{}}
{"id":"train_5402","question":"What year was John Hunyadi buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q242688 wdt:P119 ?X . ?X wdt:P571 ?answer }","paraphrases":["When was John Hunyadi buried?"],"info":{}}
{"id":"train_5403","question":"What material is used in a gravitational wave and what is the effect of it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q190035 wdt:P186 ?ans_1 . wd:Q190035 wdt:P1542 ?ans_2 }","paraphrases":["What is a gravitational wave made of and what are it's effects?"],"info":{}}
{"id":"train_5404","question":"What is the Japan-Korea Treaty of 1910?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q503585 p:P571 ?s . ?s ps:P571 ?obj . ?s pq:P805 wd:Q495558 }","paraphrases":["In 1910, what was the Japan-Korea Treaty?"],"info":{}}
{"id":"train_5405","question":"Is the angular resolution of the Karl G. Jansky Very Large Array equal to 0.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q461382 wdt:P3439 ?obj filter ( ?obj = 0.2 ) }","paraphrases":["Is 0.2 the angular resolution of the Karl G. Jansky Very Large Array?"],"info":{}}
{"id":"train_5406","question":"Tell me archipelago  whose name has the word lies in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33837 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'îles' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which name of archipelago has word lies in it?"],"info":{}}
{"id":"train_5407","question":"What is the seal image for Medan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5972 wdt:P158 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5408","question":"Who produces and is the builder of the John Deere Model 4020?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6229075 wdt:P176 ?X . ?X wdt:P1056 ?answer }","paraphrases":["Who manufactures and is the John Deere Model 4020 builder?"],"info":{}}
{"id":"train_5409","question":"Who replaced James Stanhope as Chancellor of the Exchequer?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q332603 p:P39 ?s . ?s ps:P39 wd:Q531471 . ?s pq:P1365 ?value }","paraphrases":["Who became the new Chancellor of the Exchequer after James Stanhope?"],"info":{}}
{"id":"train_5410","question":"when is the {start time} for {Joseph-Louis Lagrange} who {member of} as {Prussian Academy of Sciences} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q80222 p:P463 ?s . ?s ps:P463 wd:Q329464 . ?s pq:P580 ?value }","paraphrases":["When did Joseph-Louis Lagrange become a member of the Prussian Academy of Sciences?"],"info":{}}
{"id":"train_5414","question":"What academic degree did Georges Méliès earn at Lycée Louis-le-Grand?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q152272 p:P69 ?s . ?s ps:P69 wd:Q1059546 . ?s pq:P512 ?value }","paraphrases":["What scholarly degree did Georges Méliès gain at Lycée Louis-le-Grand?"],"info":{}}
{"id":"train_5415","question":"Is the clock speed of the Uzebox less than 34.32?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q579739 wdt:P2149 ?obj filter ( ?obj < 34.32 ) }","paraphrases":["Does the Uzebox have a clock speed that is  lower than 34.32?"],"info":{}}
{"id":"train_5418","question":"When did Kara Hui win the Hong Kong Film Award for Best Supporting Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q707211 p:P166 ?s . ?s ps:P166 wd:Q5894572 . ?s pq:P585 ?value }","paraphrases":["On what date did Kara Hui win the Hong Kong Film Award for Best Supporting Actress?"],"info":{}}
{"id":"train_5420","question":"What is pronunciation audio made from pork ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q191768 wdt:P1582 ?X . ?X wdt:P443 ?answer }","paraphrases":["Pork makes what pronunciation audio?"],"info":{}}
{"id":"train_5421","question":"Louis VII of France held which position and when did he start?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q134259 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["What position was held by Louis VII of France and when did he start?"],"info":{}}
{"id":"train_5423","question":"Name the person behind the renowned work of Nineteen Eighty-Four","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P800 wd:Q208460 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Title the individual behind the famous work of Nineteen Eighty-Four"],"info":{}}
{"id":"train_5424","question":"How many matches were played, and points scored by David Icke, a member of Hereford United FC?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q333118 p:P54 ?s . ?s ps:P54 wd:Q18516 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["Hereford United FC's David Icke has played how many matches and scored how many points?"],"info":{}}
{"id":"train_5425","question":"Name a kind of detached home that starts with letter V","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1307276 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a kind of segregated domestic that begins with letter V"],"info":{}}
{"id":"train_5426","question":"Is the tensile modulus of elasticity of the UNS S32205 / EN 1.4462 duplex stainless steel greater than 223200.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7388539 wdt:P5480 ?obj filter ( ?obj > 223200.0 ) }","paraphrases":["Is the malleable modulus of versatility of the UNS S32205 / EN 1.4462 duplex stainless steel more prominent than 223200.0?"],"info":{}}
{"id":"train_5427","question":"Name a Norwegian radio station","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q9043 . ?sbj wdt:P31 wd:Q14350 }","paraphrases":["What is the name of the Norwegian radio station?"],"info":{}}
{"id":"train_5430","question":"Which is the free and open-source software that is named after Linux?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q388 wdt:P138 ?obj . ?obj wdt:P31 wd:Q506883 }","paraphrases":["Which is the free and open-source computer program that's named after Linux?"],"info":{}}
{"id":"train_5431","question":"WHICH IS THE RAILROAD WITH THE MAXIMUM GRADIENT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22667 . ?ent wdt:P2595 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the RR with the highest gradient?"],"info":{}}
{"id":"train_5433","question":"What is the resting place of Hayreddin Barbarossa, that has a sister in Lagos?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q200582 wdt:P119 ?answer . ?answer wdt:P190 wd:Q8673 }","paraphrases":["What is Hayreddin Barbarossa's resting place, having a sister in Lagos?"],"info":{}}
{"id":"train_5435","question":"What TV character did Benn Affleck perform?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P175 wd:Q483118 . ?sbj wdt:P31 wd:Q15773317 }","paraphrases":[],"info":{}}
{"id":"train_5437","question":"Who is Warren Beatty's wife or partner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q95030 wdt:P451 ?ans_1 . wd:Q95030 wdt:P26 ?ans_2 }","paraphrases":["What is the name of Warren Beatty's spouse?"],"info":{}}
{"id":"train_5440","question":"Which is the dam of Three Georges Dam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4792 wd:Q12514 }","paraphrases":[],"info":{}}
{"id":"train_5443","question":"Isambard Kingdom Brunel was the structural engineer of what railway bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P631 wd:Q207380 . ?sbj wdt:P31 wd:Q1210334 }","paraphrases":["Isambard Kingdom Brunel was the auxiliary design of what railroad bridge?"],"info":{}}
{"id":"train_5444","question":"When did the Kindgom of Prussia begin in 1701?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q27306 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1701' ) ) }","paraphrases":["Give me the kingdom of Prissia in the beginning of 1701."],"info":{}}
{"id":"train_5445","question":"How much {together with} {prize money} of {{Henry Dunant} has {received} {Nobel Peace Prize}}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q12091 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P1706 ?value1 . ?s pq:P2121 ?value2 }","paraphrases":["How much money did Henry Dunant get for the Nobel peace prize?"],"info":{}}
{"id":"train_5446","question":"Tell me lunisolar calendar  whose name has the word calendars in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q194235 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'calendars' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the  lunisoolar calender  that also includes  the word calender?"],"info":{}}
{"id":"train_5447","question":"What is Anatoly Karpov's work location where official language if Russian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131674 wdt:P937 ?answer . ?answer wdt:P37 wd:Q7737 }","paraphrases":["What is Anatoly Karpov's work area where official dialect on the off chance that Russian?"],"info":{}}
{"id":"train_5448","question":"What is the name of the study that isolated diabetes mellitus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12206 wdt:P2579 ?obj . ?obj wdt:P31 wd:Q930752 }","paraphrases":["What study secluded diabeted mellitus?"],"info":{}}
{"id":"train_5449","question":"Which is National Baseball Hall of Fame and Museum of Willie Mays","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q561852 wdt:P4164 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5451","question":"How in what year was James K. Polk govenor of Tennesse","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11891 p:P39 ?s . ?s ps:P39 wd:Q5589724 . ?s pq:P580 ?value }","paraphrases":["How in what year was James K. Polk govenor of Tennesse"],"info":{}}
{"id":"train_5452","question":"Which asteroid has got the most orbital inclination?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2045 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the asteroid that has got the most orbital inclination"],"info":{}}
{"id":"train_5454","question":"DOES THE TOTAL DEBT OF CARREFOUR GROUP IS EQUAL TO 4531000000","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3117359 wdt:P2133 ?obj filter ( ?obj = 4531000000 ) }","paraphrases":["What is the total debt of carrefour group?"],"info":{}}
{"id":"train_5455","question":"What is the charger for the rebellion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1595 wd:Q124734 }","paraphrases":[],"info":{}}
{"id":"train_5456","question":"What academic major studies World History?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q200325 wdt:P2579 ?obj . ?obj wdt:P31 wd:Q4671286 }","paraphrases":["What scholarly major considers World History?"],"info":{}}
{"id":"train_5460","question":"Is the highest no-effect level of chlorobenzene 27.25?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q407768 wdt:P2717 ?obj filter ( ?obj = 27.25 ) }","paraphrases":["If chlorobenzene levels are at 27.25, are they at their highest no-effect level?"],"info":{}}
{"id":"train_5462","question":"Who is chairwoman party membership of Jack Horner ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1677064 wdt:P102 ?X . ?X wdt:P488 ?answer }","paraphrases":["Who is chairwoman party participation of Jack Horner ?"],"info":{}}
{"id":"train_5464","question":"Which is the triumphal arch that Jean Chalgrin was the architect and contains the word arc in it's name!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q143912 . ?sbj wdt:P84 wd:Q525487 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'arc' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the triumphal arch that Jean Chalgrin was once the architect and contains the phrase arc in it is name!"],"info":{}}
{"id":"train_5465","question":"Who {has sons} of {daddy} {Noel Tata} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12779926 wdt:P22 ?X . ?X wdt:P40 ?answer }","paraphrases":["Who {has children} of {daddy} {Noel Tata} ?"],"info":{}}
{"id":"train_5470","question":"Was Carl_Sagan spouse Carl Woese and Linda Salzman Sagan ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q410 wdt:P26 wd:Q310067 . wd:Q410 wdt:P26 wd:Q4526447 }","paraphrases":["Is it true that Carl Sagan had as wife Carl Woese and Linda Salzman Sagan?"],"info":{}}
{"id":"train_5472","question":"Are the maximum sustained winds of the Tropical Storm Debby 54.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2400201 wdt:P2895 ?obj filter ( ?obj = 54.0 ) }","paraphrases":["Are Tropical Storm Debby's highest sustained winds 54.0?"],"info":{}}
{"id":"train_5474","question":"Where did Gianni Agnelli work and when did it ended?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q356351 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1534 ?value1 . }","paraphrases":["Where did Gianni Agnelli work and when did it ended?"],"info":{}}
{"id":"train_5475","question":"How many languages are used in Australia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q408 wdt:P2936 ?obj }","paraphrases":["How many Australian languages are there?"],"info":{}}
{"id":"train_5476","question":"What is implied of pyridine which has a route of administration by ingestion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q210385 wdt:P1542 ?answer . ?answer wdt:P636 wd:Q1663054 }","paraphrases":["What is inferred of pyridine which contains a course of organization by ingestion?"],"info":{}}
{"id":"train_5477","question":"Which English film has the longest average shot length?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11424 . ?ent wdt:P2208 ?obj . ?ent wdt:P364 wd:Q1860 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What film has the longest average shot length in England?"],"info":{}}
{"id":"train_5478","question":"In what way can things be described as similar that starts with the letter \"n\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7250271 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["How can things be described as similar starting with the letter \"n\""],"info":{}}
{"id":"train_5481","question":"What is the name of the famous Roman stadium","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q220 . ?sbj wdt:P31 wd:Q483110 }","paraphrases":["What is the title of the popular Roman stadium"],"info":{}}
{"id":"train_5482","question":"What are the trigonometric function which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q93344 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the trigonometric function that begins with letter v"],"info":{}}
{"id":"train_5484","question":"What is the profession of Amartya Sen, whose patron saint is Santo Tomás de Aquinas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132489 wdt:P106 ?answer . ?answer wdt:P417 wd:Q9438 }","paraphrases":["What is the profession of Amartya Sen, whose consumer saint is Santo Tomás de Aquinas?"],"info":{}}
{"id":"train_5486","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P941 wd:Q9592 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_5488","question":"Where was the Russian Revolution co-founded by Peter the Great?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8729 wdt:P276 ?answer . ?answer wdt:P112 wd:Q8479 }","paraphrases":["Where was the Russian Insurgency co-founded by Diminish the Great?"],"info":{}}
{"id":"train_5491","question":"What are the disjoint union and opposite of Real numbers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q12916 wdt:P2738 ?ans_1 . wd:Q12916 wdt:P461 ?ans_2 }","paraphrases":["What are the opposite of real numbers as well as the disjoint union?"],"info":{}}
{"id":"train_5493","question":"What is part of the background of Iran, that has racial group of I.A.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28926 wdt:P1269 ?answer . ?answer wdt:P172 wd:Q2426677 }","paraphrases":["What is portion of the foundation of Iran, that has racial gather of I.A.?"],"info":{}}
{"id":"train_5495","question":"What is adapted from mathematical analysis that has a Q48460 of 515?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7754 wdt:P144 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '515' ) ) }","paraphrases":["The mathematical analysis that includes Q48460 of 515 is adapted frm what?"],"info":{}}
{"id":"train_5497","question":"Tell me me a republic whose name consist of the word republic and whose capital venice","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7270 . ?sbj wdt:P36 wd:Q641 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'republic' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me me a republic whose name consist of the word republic and whose capital venice"],"info":{}}
{"id":"train_5501","question":"Who is a member of the crew of Enola Gay?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P5096 wd:Q204424 }","paraphrases":[],"info":{}}
{"id":"train_5502","question":"Tell me military offensive whose name has the word operation in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2001676 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'operation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know military hostile whose title has the word operation in it."],"info":{}}
{"id":"train_5503","question":"For what railway stations is Isambard Kingdom Brunel the architect?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P84 wd:Q207380 . ?sbj wdt:P31 wd:Q55488 }","paraphrases":["For what railroad stations is Isambard Kingdom Brunel the architect?"],"info":{}}
{"id":"train_5504","question":"Tell me me a musical  whose name consist of the word \"woods\" and whose lyrics by Stephen Sondheim","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2743 . ?sbj wdt:P676 wd:Q153579 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'woods' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me me a musical whose title consist of the phrase \"woods\" and whose lyrics through Stephen Sondheim"],"info":{}}
{"id":"train_5505","question":"Who were the participants of the Attack on Pearl Harbor and what effect as the end result of the attack?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q52418 wdt:P710 ?ans_1 . wd:Q52418 wdt:P1542 ?ans_2 }","paraphrases":["Who had been the participants of the Attack on Pearl Harbor and what effect as the give up result of the attack?"],"info":{}}
{"id":"train_5506","question":"What is the determination method for a substance dependence that has the genetic association of PLEKHG1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q182413 p:P2293 ?s . ?s ps:P2293 wd:Q18043072 . ?s pq:P459 ?value }","paraphrases":["How can you determine the substance dependence for a PLEKHG1 genetic association?"],"info":{}}
{"id":"train_5507","question":"Which is the surface tension of ethyl acetate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q407153 wdt:P3013 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5508","question":"Which landlocked country has the highest GDP PPP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q123480 . ?ent wdt:P4010 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Tell me which of the landlocked countries has the highest GDP PPP."],"info":{}}
{"id":"train_5510","question":"What position did Umar ibn Al-Khattab hold starting in 634-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8467 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( ?x , '634-0-0' ) ) }","paraphrases":["Which was the designation of Umar ibn Al-Khattab during 634-0-0?"],"info":{}}
