{"id":"train_14910","question":"What is office contested for United States House of Representatives ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P541 wd:Q11701 }","paraphrases":[],"info":{}}
{"id":"train_14911","question":"How was Brooklyn's 2592149 population determined?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q18419 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '2592149' ) ) . ?s pq:P459 ?value }","paraphrases":["In what way was it calculated that there are 2592149 people living in Brooklyn?"],"info":{}}
{"id":"train_14914","question":"What is the taxon parent of \"cassowary,\" which has a type of taxon that means \"family?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q201231 wdt:P171 ?answer . ?answer wdt:P105 wd:Q35409 }","paraphrases":["What is the taxon parent of \"cassowary,\" which encompasses a sort of taxon which means \"family?\""],"info":{}}
{"id":"train_14916","question":"How did Owain Glyndwr die in 1416?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q317279 p:P570 ?s . ?s ps:P570 ?x filter ( contains ( YEAR ( ?x ) , '1416' ) ) . ?s pq:P1480 ?value }","paraphrases":["Owain Glyndwr died in 1416 of what cause?"],"info":{}}
{"id":"train_14918","question":"What is Elizabeth Taylor's Munzinger IBA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q34851 wdt:P1284 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14921","question":"Which high-voltage direct current power line has the highest voltage?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q370607 . ?ent wdt:P2436 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the high-voltage direct current power line with the highest voltage."],"info":{}}
{"id":"train_14922","question":"which  is carries scientific instrument of thermometer ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1202 wd:Q646 }","paraphrases":[],"info":{}}
{"id":"train_14923","question":"When did Leopold Stokowski win the Grammy Trustees Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q297562 p:P166 ?s . ?s ps:P166 wd:Q5593916 . ?s pq:P585 ?value }","paraphrases":["In what year was Leopold Stokowski awarded the Grammy Trustees?"],"info":{}}
{"id":"train_14925","question":"When did Max Born begin his education at the University of Wrocław?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q58978 p:P69 ?s . ?s ps:P69 wd:Q315658 . ?s pq:P580 ?value }","paraphrases":["When did Max Born begin studying at Wroclaw University?"],"info":{}}
{"id":"train_14927","question":"What event of the Ottoman wars in Europe is located on earth at 41.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q698985 wdt:P710 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '41.0' ) ) }","paraphrases":["What event of Europe's Ottoman wars is 41.0 on earth?"],"info":{}}
{"id":"train_14928","question":"What position did Abedi Pele play in the year 1988?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q336916 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1988' ) ) }","paraphrases":["In 1988 in what position did Abedi Pele play?"],"info":{}}
{"id":"train_14929","question":"Which  is notable work On Liberty ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P800 wd:Q1055881 }","paraphrases":[],"info":{}}
{"id":"train_14931","question":"When is {instance of} of {platinum} which is {followed by} is {gold} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q880 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P156 wd:Q897 }","paraphrases":["When is {occurrence of} of {platinum} which is {taken after by} is {gold} ?"],"info":{}}
{"id":"train_14932","question":"In the signed language of Alexander Berkman, what label in sign language can be found at Csc-angles-spreadthesign.ogv?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q195390 wdt:P1412 ?answer . ?answer wdt:P2919 ?x FILTER ( contains ( ?x , 'Csc-anglès-spreadthesign.ogv' ) ) }","paraphrases":["Within the marked dialect of Alexander Berkman, what name in sign dialect can be found at Csc-angles-spreadthesign.ogv?"],"info":{}}
{"id":"train_14933","question":"Is Communism opposite of anti-communism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6186 wdt:P461 wd:Q182121 }","paraphrases":["Are Communism and anti-communism diametrically opposed?"],"info":{}}
{"id":"train_14934","question":"Name a cation with strong interactions that starts with letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q326277 . ?sbj wdt:P517 wd:Q11415 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a cation with strong interactions that begins with letter P"],"info":{}}
{"id":"train_14937","question":"What is birth place for starring of The 15:17 to Paris ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q31204331 wdt:P161 ?X . ?X wdt:P19 ?answer }","paraphrases":["What is birth put for featuring of The 15:17 to Paris ?"],"info":{}}
{"id":"train_14938","question":"Does Nintendo own Monolith Soft and Square Enix?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q8093 wdt:P1830 wd:Q1239326 . wd:Q8093 wdt:P1830 wd:Q207784 }","paraphrases":["Is the owner of Monolith Soft and Square Enix Nintendo?"],"info":{}}
{"id":"train_14940","question":"what are the web api which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20202982 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the internet api which begin with the letter w"],"info":{}}
{"id":"train_14941","question":"which civil code starts with c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1923776 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which common code begins with c"],"info":{}}
{"id":"train_14942","question":"Which is the military alliance which contains the word union in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1127126 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'union' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the military collusion which contains the word union in it's name?"],"info":{}}
{"id":"train_14945","question":"What is the most common lethal dose of acetone","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q49546 wdt:P2240 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14946","question":"who birth date of written by of hungarian dances ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1065126 wdt:P86 ?X . ?X wdt:P569 ?answer }","paraphrases":["who birth date of composed by of hungarian moves ?"],"info":{}}
{"id":"train_14947","question":"when does the Jericho building open in Alessandra","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5687 p:P190 ?s . ?s ps:P190 wd:Q6088 . ?s pq:P580 ?value }","paraphrases":["In wich moment does the Jericho building open in Alessandra?"],"info":{}}
{"id":"train_14948","question":"What is Vote Smart ID for Al Franken?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q319084 wdt:P3344 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14949","question":"Is Anthony Hopkins residence in Malibu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q65932 wdt:P551 wd:Q387047 }","paraphrases":["Does Anthony Hopkins live in Malibu?"],"info":{}}
{"id":"train_14951","question":"Tell me play  whose name has the word wit\nin it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25379 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wit' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know play whose title has the word mind in it."],"info":{}}
{"id":"train_14956","question":"What station used Amtrak technology  ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q23239 wdt:P2283 ?obj . ?obj wdt:P31 wd:Q22808404 }","paraphrases":["What train stations used Amtrak technology?"],"info":{}}
{"id":"train_14957","question":"was dominica inflation rate higher in 1983-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q784 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1983' ) ) }","paraphrases":["Did the Dominican inflation rate increase in 1983?"],"info":{}}
{"id":"train_14958","question":"Name the fertility deity in Ancient Greece that contains the word \"hera\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015914 . ?sbj wdt:P1049 wd:Q855270 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hera' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the fertility deity in Ancient Greece that incorporates the word \"hera\" in its identify"],"info":{}}
{"id":"train_14959","question":"What is the category of films filmed in that place and also the category of associates of Belgrade?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q3711 wdt:P1740 ?ans_1 . wd:Q3711 wdt:P1792 ?ans_2 }","paraphrases":["What category of films are filmed in Belgrade, and what is the category of associates?"],"info":{}}
{"id":"train_14960","question":"Who was the rector of Charles University in Prague whose administration ended in 1990?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q31519 p:P1075 ?s . ?s ps:P1075 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1990' ) ) }","paraphrases":["What was the name of the rector of Charles University in Prague whose administration ended in 1990?"],"info":{}}
{"id":"train_14961","question":"What was the net profit of Qantas in 2017?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q32491 p:P2295 ?s . ?s ps:P2295 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2017' ) ) }","paraphrases":["Give the net profit of Qantas in 2017."],"info":{}}
{"id":"train_14963","question":"When was the party membership formed by Atal Bihari Vajpayee?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q233289 wdt:P102 ?X . ?X wdt:P571 ?answer }","paraphrases":["At what point was the party membership formed by Atal Bihari Vajpayee?"],"info":{}}
{"id":"train_14965","question":"What is the position held by Jacob Zuma whose series ordinal is 4?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q57282 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '4' ) ) }","paraphrases":["What position does Jacob Zuma, whose series ordinal is 4, hold?"],"info":{}}
{"id":"train_14966","question":"What language used to be kwown as Middle English contains the word \"english\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33742 . ?sbj wdt:P1366 wd:Q36395 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'english' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What language used to be kwown as Middle English includes the phrase \"english\" in its identify ?"],"info":{}}
{"id":"train_14967","question":"Was Xi Jinping a President of the People's Republic of China and Chairman of the Central Military Commission of Communist Party of China?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q15031 wdt:P39 wd:Q655407 . wd:Q15031 wdt:P39 wd:Q20792297 }","paraphrases":["Is it true that Xi Jinping is both President of the People's Republic of China and Chairman of the Central Military Commission of Communist Party of China?"],"info":{}}
{"id":"train_14968","question":"Are PricePanda and UCWeb subsidiary to Alibaba Group?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1359568 wdt:P355 wd:Q17076151 . wd:Q1359568 wdt:P355 wd:Q17727179 }","paraphrases":["Is PricePanda and UCWeb part of the subsidiary th eof Alibaba Group?"],"info":{}}
{"id":"train_14969","question":"What is human population  topic  of history of the Dominican Republic ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q125775 wdt:P1269 ?X . ?X wdt:P1082 ?answer }","paraphrases":["What is human populace point of history of the Dominican Republic ?"],"info":{}}
{"id":"train_14970","question":"Tell me the sovereign state of Nowruz for public holiday","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P832 wd:Q483236 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_14971","question":"Does the vapor pressure of the isoamyl acetate equal 4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q221307 wdt:P2119 ?obj filter ( ?obj = 4 ) }","paraphrases":["What is the vapor pressure of isoamyl acetate?"],"info":{}}
{"id":"train_14972","question":"What is the language, spoken, written or signed, of Ernst Mayr that has Q48460 as 430?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5354 wdt:P1412 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '430' ) ) }","paraphrases":["What is the dialect, talked, composed or marked, of Ernst Mayr that has Q48460 as 430?"],"info":{}}
{"id":"train_14973","question":"Which is the video game that is distributed by Steam and starts with the letter z?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7889 . ?sbj wdt:P437 wd:Q337535 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the video game that is distributed by Steam and begins with the letter z?"],"info":{}}
{"id":"train_14974","question":"What Indian reservation region of Japan has diplomatic relations with Brazil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207520 wdt:P131 ?answer . ?answer wdt:P530 wd:Q155 }","paraphrases":["What Indian reservation vicinity of Japan has diplomatic members of the family with Brazil?"],"info":{}}
{"id":"train_14976","question":"In what year did Vanessa Redgrave receive the Tony Award for Best Address in a Play?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q347879 p:P166 ?s . ?s ps:P166 wd:Q185299 . ?s pq:P585 ?value }","paraphrases":["When was the Tony for Best Actress in a Play given to Vanessa Redgrave?"],"info":{}}
{"id":"train_14978","question":"Who holds the world record form swimming in a pool?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1501 wdt:P1535 ?X . ?X wdt:P2869 ?answer }","paraphrases":["Who holds the world record frame swimming in a pool?"],"info":{}}
{"id":"train_14980","question":"Tell me the filmography of Jerry Lewis.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q294927 wdt:P1283 ?obj . ?obj wdt:P31 wd:Q1371849 }","paraphrases":["Which movies did Jerry Lewis appear in?"],"info":{}}
{"id":"train_14981","question":"Tell me value whose name has the word beauty in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q194112 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'beauty' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know esteem whose title has the word excellence in it."],"info":{}}
{"id":"train_14982","question":"What prize is awarded to the family member of Ferenc Molnar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q296809 wdt:P1038 ?X . ?X wdt:P166 ?answer }","paraphrases":["What award is given to Ferenc Molnar's family member?"],"info":{}}
{"id":"train_14984","question":"Is Mary of Teck siblings with Alexander Cambridge, the 1st Earl of Athlone, and Prince Francis of Teck?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q76927 wdt:P3373 wd:Q335091 . wd:Q76927 wdt:P3373 wd:Q5641192 }","paraphrases":["Are Alexander Cambridge, 1st Earl of Athlone, Prince Francis of Teck and Mary of Teck related?"],"info":{}}
{"id":"train_14985","question":"Abu Bakr has how many spouses?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P26 wd:Q334923 }","paraphrases":["Provide the number of spouses that Abu Bakr has or has had."],"info":{}}
{"id":"train_14986","question":"What award did Lillian Gish receive in 1984?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q104183 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["Lillian Gish received what recognition in 1984?"],"info":{}}
{"id":"train_14987","question":"Name a subsidiary company that belongs to Melford Spiro","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q436119 wdt:P108 ?X . ?X wdt:P355 ?answer }","paraphrases":["Title a backup company that has a place to Melford Spiro"],"info":{}}
{"id":"train_14988","question":"When was Pokemon nominated for a Kid's Choice Award for Favorite Cartoon?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q239937 p:P1411 ?s . ?s ps:P1411 wd:Q6363475 . ?s pq:P585 ?value }","paraphrases":["Pokemon was nominated for a Kid's Choice Award for Favorite Cartoon on what date?"],"info":{}}
{"id":"train_14989","question":"What are the film studio which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5333510 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tripartism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the film studio which begin with the letter s"],"info":{}}
{"id":"train_14991","question":"To what constellation does HD 40307 f belong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q391576 wdt:P397 ?X . ?X wdt:P59 ?answer }","paraphrases":["To what star grouping does HD 40307 f have a place?"],"info":{}}
{"id":"train_14996","question":"Which performer plays the role of Count Dracula, the Nosferatu Vampyre?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3266236 p:P175 ?s . ?s ps:P175 ?obj . ?s pq:P642 wd:Q160259 }","paraphrases":["Which actor plays the Nosferatu Vampyre, Count Dracula?"],"info":{}}
{"id":"train_14997","question":"Who is a member or employee of Innocent IV?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q160609 wdt:P108 ?X . ?X wdt:P463 ?answer }","paraphrases":["Who may be a part or representative of Blameless IV?"],"info":{}}
{"id":"train_14999","question":"What was Louis the Pious' noble title and who follows?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What was Louis the Pious' respectable title and who follows?"],"info":{}}
{"id":"train_15002","question":"What is the craft of Patrick Henry, whose field of this craft is law.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q311885 wdt:P106 ?answer . ?answer wdt:P425 wd:Q7748 }","paraphrases":["What is the create of Patrick Henry, whose field of this create is law."],"info":{}}
{"id":"train_15003","question":"Which is the number of elevators in the World Trade Center?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11235 wdt:P1301 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15005","question":"Which is the federal state for the head of state Donald Trump?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P35 wd:Q22686 . ?sbj wdt:P31 wd:Q43702 }","paraphrases":[],"info":{}}
{"id":"train_15006","question":"How are Fernando Belaúnde Terry and Mariano A. Belaúnde related?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q116736 p:P1038 ?s . ?s ps:P1038 wd:Q19632208 . ?s pq:P1039 ?value }","paraphrases":["In what way are Fernando Belaúnde Terry and Mariano A. Belaúnde related?"],"info":{}}
{"id":"train_15007","question":"When did was Henry II of France the King of France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132545 p:P39 ?s . ?s ps:P39 wd:Q18384454 . ?s pq:P580 ?value }","paraphrases":["When did Henty II become King of Frnace?"],"info":{}}
{"id":"train_15009","question":"What are the team which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q327245 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the team that starts with the letter s"],"info":{}}
{"id":"train_15010","question":"What is the major that studies linguistics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2579 wd:Q8162 . ?sbj wdt:P31 wd:Q20829075 }","paraphrases":["What is the major that ponders linguistics?"],"info":{}}
{"id":"train_15012","question":"What is tributary of next to lake of Odessa Oblast ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q171852 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["What is tributary of following to lake of Odessa Oblast ?"],"info":{}}
{"id":"train_15013","question":"What is the name of the building where Mukeshi Ambani reside in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q298547 wdt:P551 ?obj . ?obj wdt:P31 wd:Q41176 }","paraphrases":["What is the title of the building where Mukeshi Ambani dwell in?"],"info":{}}
{"id":"train_15014","question":"How much Yasser Arafat received as a Nobel Peace Prize award receiver and who did he win with?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q34211 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P2121 ?value1 . ?s pq:P1706 ?value2 }","paraphrases":["How a good deal Yasser Arafat acquired as a Nobel Peace Prize award receiver and who did he win with?"],"info":{}}
{"id":"train_15015","question":"WHO FOLLOWS AND FOLLOWED BY CLOVISAS NOBLE TITLE AS KING OF FRANKS","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q82339 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["WHO FOLLOWS AND FOLLOWED BY CLOVISAS NOBLE TITLE AS KING OF FRANKS"],"info":{}}
{"id":"train_15016","question":"The NDF-RT ID of chromium is...?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q725 wdt:P2115 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15017","question":"\"Who has a designer in Amiga, that manufactures in Commodore PET?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q100047 wdt:P287 ?answer . ?answer wdt:P1056 wd:Q946661 }","paraphrases":["\"Who includes a originator in Amiga, that fabricates in Commodore PET?\""],"info":{}}
{"id":"train_15018","question":"Which area is the Cremation of Role Model C.S.Lewis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9204 wdt:P737 ?X . ?X wdt:P20 ?answer }","paraphrases":["Which zone is the Incineration of Part Demonstrate C.S.Lewis?"],"info":{}}
{"id":"train_15021","question":"William Blake had how many patrons?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q41513 wdt:P1962 ?obj }","paraphrases":["How many benefactors did William Blake have?"],"info":{}}
{"id":"train_15022","question":"What is the 15.0 toluene exposure limit?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q15779 p:P2407 ?s . ?s ps:P2407 ?obj . ?s pq:P2047 ?x filter ( contains ( ?x , '15.0' ) ) }","paraphrases":["What is the exposure limit for 15.0 toluene?"],"info":{}}
