{"id":"train_3907","question":"What is the conflict of J.R.R. Tolkien?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q892 wdt:P607 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3908","question":"Which is the catholic.ru ID for Santo Tomás de Aquinas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9438 wdt:P1453 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3909","question":"What is established by the party of José Orlando Cáceres?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5944403 wdt:P102 ?X . ?X wdt:P112 ?answer }","paraphrases":["What did the party of Jose Orlando Caceres establish?"],"info":{}}
{"id":"train_3910","question":"How many members are there of the International Hydrographic Organization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P463 wd:Q233611 }","paraphrases":["Give me the number of members the IHO has?"],"info":{}}
{"id":"train_3911","question":"What what is enterprise category of associated people Category:People associated with the Dutch East India Company  which that starts with letters c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6881511 . ?sbj wdt:P1792 wd:Q6369951 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is undertaking class of related individuals Category:People related with the Dutch East India Company which that begins with letters c"],"info":{}}
{"id":"train_3912","question":"What is the combustion enthalpy for acetylene?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q133145 wdt:P2117 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3915","question":"When was Shania Twain nominated for the Best Female Country Vocal Performance at the Grammys?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q131433 p:P1411 ?s . ?s ps:P1411 wd:Q5593802 . ?s pq:P585 ?value }","paraphrases":["Shania Twain nominated for the Best Female Country Vocal Performance at the Grammys when?"],"info":{}}
{"id":"train_3916","question":"When did Kliningrad split from Baranovichi?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1829 p:P190 ?s . ?s ps:P190 wd:Q237655 . ?s pq:P580 ?value }","paraphrases":["What year did Kliningrad and Baranovichi separate?"],"info":{}}
{"id":"train_3919","question":"Where did Buddenbrooks play Bendix Grunlich?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q326909 p:P674 ?s . ?s ps:P674 wd:Q42324827 . ?s pq:P3831 ?value }","paraphrases":["Where did  Buddenbrooks vs Bendix Grunlich happen?"],"info":{}}
{"id":"train_3920","question":"What's the total amount of operators employed in the London Underground?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q20075 wdt:P137 ?obj }","paraphrases":["The London Underground employs what number of operators?"],"info":{}}
{"id":"train_3921","question":"Does the takeoff roll of the G.91T equal to 4760?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q21024216 wdt:P2430 ?obj filter ( ?obj = 4760 ) }","paraphrases":["Does the takeoff roll of the G.91T rise to to 4760?"],"info":{}}
{"id":"train_3922","question":"Which taxon has the highest heart rate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3395 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Tell me the taxon with the highest heart rate?"],"info":{}}
{"id":"train_3923","question":"When did the Dakahlia Governorate have the population 6492381?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q31068 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '6492381' ) ) . ?s pq:P585 ?value }","paraphrases":["The population of 6492381 in Dakahlia Governorate happened when?"],"info":{}}
{"id":"train_3926","question":"Who was the actress in Dumb and Dumberer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1265087 wdt:P156 ?X . ?X wdt:P161 ?answer }","paraphrases":["Give me the actress's name in Dumb and Dumberer."],"info":{}}
{"id":"train_3927","question":"35.7189 is the coordinate place holder for The Great Wave off Kanagawa; what else is it the place holder for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q252485 wdt:P276 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '35.7189' ) ) }","paraphrases":["35.7189 is the facilitate put holder for The Incredible Wave off Kanagawa; what else is it the put holder for?"],"info":{}}
{"id":"train_3928","question":"What was Donald Tusk's position that was replaced by Herman Van Rompuy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q946 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q12983 }","paraphrases":["What was Donald Tusk's position before he was replaced by Herman Van Rompuy ?"],"info":{}}
{"id":"train_3931","question":"Name the district of China that contains Shanghai.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8686 wdt:P150 ?obj . ?obj wdt:P31 wd:Q1065118 }","paraphrases":["Title the locale of China that contains Shanghai."],"info":{}}
{"id":"train_3934","question":"What is a natural feature of a tributary of the Salma Dam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7405357 wdt:P706 ?X . ?X wdt:P403 ?answer }","paraphrases":["What may be a characteristic include of a tributary of the Salma Dam?"],"info":{}}
{"id":"train_3936","question":"What Japanese language television station broadcasts in English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q5287 . ?sbj wdt:P31 wd:Q1616075 }","paraphrases":["What Japanese dialect tv station broadcasts in English?"],"info":{}}
{"id":"train_3938","question":"Which is the MOOMA artist ID of Vanessa Paradis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q51023 wdt:P3733 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3939","question":"Are philosophy and dogma the same?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5891 wdt:P1889 wd:Q620749 }","paraphrases":["Is philosophy and dogma the same thing?"],"info":{}}
{"id":"train_3940","question":"Name a disease that spreads through contact and starts with letter S","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12136 . ?sbj wdt:P1060 wd:Q15304512 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a disease that spreads through contact and begins with letter S"],"info":{}}
{"id":"train_3943","question":"What is the capital of Tokugawa Shogunate","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1376 wd:Q205662 . ?sbj wdt:P31 wd:Q486972 }","paraphrases":["What's Tokugawa Shogunate's capital?"],"info":{}}
{"id":"train_3945","question":"What is the administrative body of Qingdao that started in 2009-1-1 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q170322 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["which administrative body took over in Qingday beginning in 2009-1-1?"],"info":{}}
{"id":"train_3946","question":"When was Muḥammad ibn Mūsā al-Khwārizmī born in the year 780?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9038 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( ?x , '780-1-1' ) ) . ?s pq:P1480 ?value }","paraphrases":["which was muhammad ibn musa al-khwarizmi born in the year 780?"],"info":{}}
{"id":"train_3948","question":"What is the name and date of the sequel to Iguanodon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q130980 wdt:P524 ?X . ?X wdt:P156 ?answer }","paraphrases":["what is the name of the sequel to Iguanodon and what date was it released on?"],"info":{}}
{"id":"train_3950","question":"What causes Anthrax and what drug is used for treatment?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q129104 wdt:P828 ?ans_1 . wd:Q129104 wdt:P2176 ?ans_2 }","paraphrases":["how is Anthrax produced, and how can it be treated?"],"info":{}}
{"id":"train_3952","question":"What is the genetic association of Cardiovascular disease, and what drugs are used for treatment?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q389735 wdt:P2293 ?ans_1 . wd:Q389735 wdt:P2176 ?ans_2 }","paraphrases":["What is the genetic association of Cardiovascular disease, and what drugs are used for treatment?"],"info":{}}
{"id":"train_3953","question":"What is {played by] of {computer network} that {painting of} is {network}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1301371 wdt:P1299 ?answer . ?answer wdt:P180 wd:Q1900326 }","paraphrases":["What is {played by] of {computer organize} that {portray of} is {organize}?"],"info":{}}
{"id":"train_3954","question":"Name a devil in the Hinduist pantheon that starts with letter L","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q494511 . ?sbj wdt:P1049 wd:Q9089 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a devil in the Hinduist pantheon that begins with letter L"],"info":{}}
{"id":"train_3956","question":"What are the standards and the main regulatory text of Hypertext Transfer Protocol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q8777 wdt:P1462 ?ans_1 . wd:Q8777 wdt:P92 ?ans_2 }","paraphrases":["What is the main regulatory text for HTP?"],"info":{}}
{"id":"train_3959","question":"\"Which is {Spanish name} of {Manolete}, that has {transliteration} is {Санчес} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q363911 wdt:P1950 ?answer . ?answer wdt:P2440 ?x FILTER ( contains ( ?x , 'Санчес' ) ) }","paraphrases":["\"Which is {Spanish title} of {Manolete}, that has {transliteration} is {Санчес} ?\""],"info":{}}
{"id":"train_3960","question":"Which country shared border with Nazi Germany until 1939?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7318 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1939' ) ) }","paraphrases":["Which country bordered Germany until 1939?"],"info":{}}
{"id":"train_3961","question":"What team did Somchai Subpherm play for, and where was it headquartered?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4926223 wdt:P54 ?X . ?X wdt:P159 ?answer }","paraphrases":["What was the location and the name of the association that Somchai Subpherm played for?"],"info":{}}
{"id":"train_3962","question":"To what position was Lenín Moreno elected as during the Ecuadorian general election in 2006?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q518626 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 wd:Q1285633 }","paraphrases":["Lenin Moreno was elected as what in the 2006 Ecuardorian elections?"],"info":{}}
{"id":"train_3964","question":"IS THE BASIC SALARY OF GEORGE STEHENSON LESS THAN 528?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q133614 wdt:P3618 ?obj filter ( ?obj < 528.0 ) }","paraphrases":["IS THE GEORGE STEHENSON BASIC SALARY THAN 528?"],"info":{}}
{"id":"train_3967","question":"Who is the plaintiff of Plessy v. Ferguson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q656660 wdt:P1620 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3968","question":"Is it true that the annual number of weddings of Kaprijke is less than 16.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12437 wdt:P5982 ?obj filter ( ?obj < 16.8 ) }","paraphrases":["Does Kaprijke have less than 16.8 weddings a year?"],"info":{}}
{"id":"train_3970","question":"What fictional dog is said to be the same dog as Goofy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q111135 wdt:P460 ?obj . ?obj wdt:P31 wd:Q15720625 }","paraphrases":["What anecdotal canine is said to be the same puppy as Silly?"],"info":{}}
{"id":"train_3972","question":"In what country was Juan Rodriguez Suarez executed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q598409 wdt:P157 ?X . ?X wdt:P172 ?answer }","paraphrases":["Juan Rodriguez Suarez was executed in what country?"],"info":{}}
{"id":"train_3973","question":"What is the nationality and occupation of Alice Cooper?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q332032 wdt:P27 ?ans_1 . wd:Q332032 wdt:P106 ?ans_2 }","paraphrases":["What are Alice Cooper's nationality and occupation ?"],"info":{}}
{"id":"train_3974","question":"What is Fashion Model Directory model ID for Paris Hilton ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q47899 wdt:P2266 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3977","question":"DOES THE MAXIMUM GLIDE RATIO OF DG FLUZEUGBAU L S 10 EQUALS 60.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2163977 wdt:P1470 ?obj filter ( ?obj = 60.0 ) }","paraphrases":["IS 10 EQUALS 60.0 THE MAXIMUM GLIDE RATIO OF DG FLUZEUGBAU L S?"],"info":{}}
{"id":"train_3978","question":"What is the watercourse that outflows of Walker Lake?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q679846 wdt:P201 ?X . ?X wdt:P403 ?answer }","paraphrases":["Describe the watercourse associated with the outflows of Walker Lake."],"info":{}}
{"id":"train_3980","question":"is ANZUS a signatory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q295875 wdt:P1891 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3982","question":"What colossal statue starts with the letter \"s\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1779653 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What huge statue starts with \"s\"?"],"info":{}}
{"id":"train_3983","question":"What is the sandbox-item for one?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P369 wd:Q199 }","paraphrases":[],"info":{}}
{"id":"train_3986","question":"tell me that aerospace manufacturer which contains the word zeebruges on its own name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q936518 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zeebruges' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me that aerospace manufacturer whose name includes the word zeebruges."],"info":{}}
{"id":"train_3987","question":"Who was Oracle Corporation taken over by","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1366 wd:Q19900 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Who was Prophet Organization taken over by"],"info":{}}
{"id":"train_3988","question":"When did Eugenio Montale retire from their position as senatore a vita?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q83174 p:P39 ?s . ?s ps:P39 wd:Q826589 . ?s pq:P582 ?value }","paraphrases":["When did Eurgenio Montale step down from his position as senatore a vita?"],"info":{}}
{"id":"train_3989","question":"Was Alice  Cooper's family name Cooper?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q332032 wdt:P734 wd:Q1794217 }","paraphrases":["What was ALice Cooper's family name?"],"info":{}}
{"id":"train_3990","question":"Which is the twin city of place of death of Clark Gable?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q71243 wdt:P20 ?X . ?X wdt:P190 ?answer }","paraphrases":["Name the twin city where Clark Cable died."],"info":{}}
{"id":"train_3991","question":"What is the geological locality having diopside with the total area of 11.14?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q316671 wdt:P2695 ?answer . ?answer wdt:P2046 ?x FILTER ( contains ( ?x , '11.14' ) ) }","paraphrases":["What is the topographical region having diopside with the whole range of 11.14?"],"info":{}}
{"id":"train_3992","question":"What are the salad which start with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9266 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the serving of mixed greens which begin with the letter y"],"info":{}}
{"id":"train_3993","question":"When was the end of Ptolemy I Soter's reign as pharaoh?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q168261 p:P97 ?s . ?s ps:P97 wd:Q37110 . ?s pq:P582 ?value }","paraphrases":["What year did Ptolemy I Soter's rule expire?"],"info":{}}
{"id":"train_3994","question":"Who is the {factory} for {product or material produced} of {butter}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1056 wd:Q34172 . ?sbj wdt:P31 wd:Q83405 }","paraphrases":["Who is the {production line} for {item or fabric delivered} of {butter}"],"info":{}}
{"id":"train_3995","question":"Who gave the {unit symbol} of {based upon} of {lumen} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q484092 wdt:P144 ?X . ?X wdt:P5061 ?answer }","paraphrases":["Who created the symbol for the lumen unit?"],"info":{}}
{"id":"train_3997","question":"Tell me the name of a non-metal with the most electronegativity","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19600 . ?ent wdt:P1108 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Let me know the name of a non-metal with the foremost electronegativity"],"info":{}}
{"id":"train_3998","question":"Who owns CNN is owned and who is CNN owned by?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q48340 wdt:P1830 ?ans_1 . wd:Q48340 wdt:P127 ?ans_2 }","paraphrases":["Who is CNN owned by and who owns CNN?"],"info":{}}
{"id":"train_4001","question":"What is the adjacent station for Oregon City?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q849596 wdt:P197 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4002","question":"What is Roger Bacon's PhilPapers theme?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q171677 wdt:P3235 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4004","question":"When was Polybius born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131169 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1480 wd:Q5727902 }","paraphrases":["Give the birth date of Polybius?"],"info":{}}
{"id":"train_4005","question":"Where are the Channel Islands?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q42314 wdt:P2046 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4006","question":"Which country was Medina from at the time of her inception 632-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q35484 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter ( contains ( ?x , '632-0-0' ) ) }","paraphrases":["Medina was from what country at the time of her inception in 0/0/632"],"info":{}}
{"id":"train_4008","question":"Is Chicago located in Cook County?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1297 wdt:P131 wd:Q108418 }","paraphrases":["What county is Chicago located in?"],"info":{}}
{"id":"train_4009","question":"Name a silent movie written by Thomas Dixon Jr that starts with letter B","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q226730 . ?sbj wdt:P58 wd:Q4993107 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a silent movie written through Thomas Dixon Jr that starts with letter B"],"info":{}}
{"id":"train_4010","question":"Was Angkor Wat of the Dravidian style of architecture in the Medang Kingdom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q43473 wdt:P149 wd:Q171309 . wd:Q43473 wdt:P149 wd:Q402580 }","paraphrases":["Did Angkor Wat of the Dravidian style of architecture work in the Medang Kingdom?"],"info":{}}
{"id":"train_4011","question":"What was the population of Nunavut in the year 2017?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2023 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2017' ) ) }","paraphrases":["How many people lived in Nunavut in 2017?"],"info":{}}
{"id":"train_4013","question":"Did {The_Sopranos} {cast member} are {James Gandolfini} and {Steve Schirripa} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23628 wdt:P161 wd:Q308722 . wd:Q23628 wdt:P161 wd:Q380904 }","paraphrases":["Are James Gandolfini and Steven Schirripa actors in The Sopranos?"],"info":{}}
{"id":"train_4015","question":"What position did Alexander Dubcek hold on December 12, 1989?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q150543 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1989' ) ) }","paraphrases":["On Dec 12, 1989 what was Alexander Dubcek's position?"],"info":{}}
{"id":"train_4019","question":"What what is  international parliament  office held by head of the organisation by President of the United Nations General Assembly and also which starts with letter a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6054776 . ?sbj wdt:P2388 wd:Q1161813 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is worldwide parliament office held by head of the association by President of the Joined together Countries Common Get together additionally which begins with letter a"],"info":{}}
{"id":"train_4021","question":"When was Celine Dion made an Officer of the National Order of Quebec?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5105 p:P166 ?s . ?s ps:P166 wd:Q15464524 . ?s pq:P585 ?value }","paraphrases":["On what date did Celine dion become  an Officer of the National Order of Quebec?"],"info":{}}
{"id":"train_4022","question":"Where did Marina Abramovic graduate from in 1970?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q47496 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1970' ) ) }","paraphrases":["Name the school Marina Abramovic graduated from in 1970."],"info":{}}
{"id":"train_4023","question":"Did Absinthe come from Switzerland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q170210 wdt:P495 wd:Q39 }","paraphrases":["Was Switzerland the home of Absinthe?"],"info":{}}
{"id":"train_4024","question":"Who has the country seat of Taipei, who also has diplomatic relations with the country of Mali?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1867 wdt:P1376 ?answer . ?answer wdt:P530 wd:Q912 }","paraphrases":["Who has the nation situate of Taipei, who too has discretionary relations with the nation of Mali?"],"info":{}}
{"id":"train_4026","question":"Who are the sons starring in H. Con-172","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5628146 wdt:P161 ?X . ?X wdt:P40 ?answer }","paraphrases":["What sons star in H. Con-172?"],"info":{}}
{"id":"train_4027","question":"What is the town of Capua with cities called Tora e Piccilli?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q58477 wdt:P131 ?answer . ?answer wdt:P150 wd:Q58909 }","paraphrases":["What are the cities of Capua called Tora and Piccilli?"],"info":{}}
{"id":"train_4030","question":"What sport and position does Dwayne Johnson play?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q10738 wdt:P1038 ?ans_1 . wd:Q10738 wdt:P413 ?ans_2 }","paraphrases":["What wear and position does Dwayne Johnson play?"],"info":{}}
{"id":"train_4031","question":"Does the collection or exhibition size of the Central Classified Flies equal 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q59927275 wdt:P1436 ?obj filter ( ?obj = 0 ) }","paraphrases":["Does the collection or show estimate of the Central Classified Flies rise to 0?"],"info":{}}
