{"id":"train_15878","question":"What is the language of the Cantonese?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9186 wdt:P4913 ?obj . ?obj wdt:P31 wd:Q34770 }","paraphrases":["The Cantonese speak what language?"],"info":{}}
{"id":"train_15879","question":"When did Pearl S. Buck receive an award in the National Women's Hall of Fame?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q80900 p:P166 ?s . ?s ps:P166 wd:Q1967852 . ?s pq:P585 ?value }","paraphrases":["What year did  Pearl S. Buck receive the National Women's Hall of Fame award?"],"info":{}}
{"id":"train_15880","question":"Which census population method was used to determine the Region of Valparaiso?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q219458 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["What was the census population method used to determine the Region of Valparaiso?"],"info":{}}
{"id":"train_15881","question":"What is the geography of Chicago like?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1093829 . ?sbj wdt:P2633 wd:Q3123272 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'chicago' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What's Chicago's geography like?"],"info":{}}
{"id":"train_15882","question":"Tell me business whose name has the word vodafone in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4830453 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vodafone' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me business whose name includes the word vodafone."],"info":{}}
{"id":"train_15884","question":"Does the port of the Remote Desktop Protocol equal to 3389","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q49150 wdt:P1641 ?obj filter ( ?obj = 3389 ) }","paraphrases":["What does the port of the Remote Desktop Protocol equal?"],"info":{}}
{"id":"train_15887","question":"Which is the category for people born in Dubai?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q612 wdt:P1464 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15888","question":"What is the controversy surrounding the defendant of Hillary Clinton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1591 wd:Q6294 . ?sbj wdt:P31 wd:Q1255828 }","paraphrases":["What is the discussion encompassing the respondent of Hillary Clinton?"],"info":{}}
{"id":"train_15890","question":"What position did George Reid hold starting on 1/11/1916?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23352 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1916' ) ) }","paraphrases":["What position did George Reid begin on 1/11/1916?"],"info":{}}
{"id":"train_15896","question":"What is the education of Christopher Reeve, who is located at 60 Lincoln Center Plaza, New York, NY, 10023-6588?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q174311 wdt:P69 ?answer . ?answer wdt:P969 ?x FILTER ( contains ( ?x , '60 Lincoln Center Plaza, New York, NY, 10023-6588' ) ) }","paraphrases":["What is the schooling of Christopher Reeve, who is placed at 60 Lincoln Center Plaza, New York, NY, 10023-6588?"],"info":{}}
{"id":"train_15898","question":"What is the apoapsis of Amalthea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3257 wdt:P2243 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15901","question":"When was Uber's total revenue equal to 6.5e+09?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q780442 p:P2139 ?s . ?s ps:P2139 ?x filter ( contains ( ?x , '6.5e+09' ) ) . ?s pq:P585 ?value }","paraphrases":["6.5e+09 was total revenue of Uber during what time?"],"info":{}}
{"id":"train_15904","question":"Who is the spouse of the bride?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20443574 wdt:P170 ?X . ?X wdt:P451 ?answer }","paraphrases":["Who is the life partner of the bride?"],"info":{}}
{"id":"train_15906","question":"tell me procedural programming language starts with v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28922885 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know procedural programming dialect begins with v"],"info":{}}
{"id":"train_15907","question":"\"Which is {hometown} of {Alan Arkin}, whose {partner city} is {Podgorica} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q108283 wdt:P551 ?answer . ?answer wdt:P190 wd:Q23564 }","paraphrases":["\"Which is {hometown} of {Alan Arkin}, whose {accomplice city} is {Podgorica} ?\""],"info":{}}
{"id":"train_15909","question":"What award did Douglas Engelbart receive in 1992?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q92614 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1992' ) ) }","paraphrases":["What was the award Douglas Engelbart won in 1992?"],"info":{}}
{"id":"train_15910","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q315913 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , '♂' ) ) }","paraphrases":["What it is?"],"info":{}}
{"id":"train_15911","question":"What is an annual event that contains the word tasu in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18574946 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tasu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is an yearly occasion that contains the word tasu in its name?"],"info":{}}
{"id":"train_15912","question":"Name the book that includes the character of Anna Karenina and that starts with letter A","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7725634 . ?sbj wdt:P1881 wd:Q4435775 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the book that includes the character of Anna Karenina and that starts offevolved with letter A"],"info":{}}
{"id":"train_15913","question":"When did \"In Search of Lost Time\" begin in 1906?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q464928 p:P571 ?s . ?s ps:P571 ?x filter ( contains ( YEAR ( ?x ) , '1906' ) ) . ?s pq:P580 ?value }","paraphrases":["When did \"In Search of Lost Time\" start in 1906"],"info":{}}
{"id":"train_15914","question":"who member o of land of bicol region ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13662 wdt:P17 ?X . ?X wdt:P463 ?answer }","paraphrases":["who part o of arrive of bicol locale ?"],"info":{}}
{"id":"train_15915","question":"Are the drugs used for the treatment of Attention Deficit Hyperactivity Disorder amitriptyline and dexmethylphenidate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q181923 wdt:P2176 wd:Q58397 . wd:Q181923 wdt:P2176 wd:Q1207210 }","paraphrases":["Are dexmethylphenidate and amitriptyline used to treat ADHD?"],"info":{}}
{"id":"train_15917","question":"What are the American football team which start with the letter vikings","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17156793 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vikings' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the American football group which begin with the letter vikings"],"info":{}}
{"id":"train_15918","question":"At what point in time did Western Asia have 8.5million children out of school?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q27293 p:P2573 ?s . ?s ps:P2573 ?x filter ( contains ( ?x , '8.46034e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["When did Western Asia have 8.5 million children who weren't in school?"],"info":{}}
{"id":"train_15919","question":"Is the{age of majority} on  {Monaco} {equals} {21}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q235 wdt:P2997 ?obj filter ( ?obj = 21 ) }","paraphrases":["Is the{age of lion's share} on {Monaco} {rises to} {21}"],"info":{}}
{"id":"train_15920","question":"IS THE BOILER PRESSURE OF LNWR 18 INCH TANK CLASS EQUALS TO 120.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q60791023 wdt:P5071 ?obj filter ( ?obj = 120.0 ) }","paraphrases":["Is 120.0 the boiler pressure of LNWR 18 inch tank class?"],"info":{}}
{"id":"train_15925","question":"WHO IS THE FIRST PRIME MINISTER MEDIATISED TO THE PRESIDENCY OF SALVADOR ALLENDE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5881961 wdt:P1366 ?X . ?X wdt:P6 ?answer }","paraphrases":["WHO IS THE FIRST PRIME MINISTER MEDIATISED TO THE PRESIDENCY OF SALVADOR ALLENDE"],"info":{}}
{"id":"train_15930","question":"What branch of theology was studied by the Old Testament?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q19786 wdt:P2579 ?obj . ?obj wdt:P31 wd:Q60310061 }","paraphrases":["What department of religious philosophy was considered by the Ancient Confirmation?"],"info":{}}
{"id":"train_15931","question":"What is the name of the burial site of John D. Rockerfeller?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q160278 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P625 ?x filter ( contains ( ?x , '41.511 -81.591' ) ) }","paraphrases":["Name the site at which John D. Rockerfeller is buried."],"info":{}}
{"id":"train_15934","question":"What is Cucumis melo plant world online  ID ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q81602 wdt:P5037 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15935","question":"Who did Nicole Kidman divorce on January 1, 2001?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q37459 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["Nicole Kidman divorced who on Jan, 1 2001?"],"info":{}}
{"id":"train_15936","question":"What mountain is the highest point in Chongqing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11725 wdt:P610 ?obj . ?obj wdt:P31 wd:Q8502 }","paraphrases":["The highest point in Chongqin is what mountain?"],"info":{}}
{"id":"train_15937","question":"Mention the industry segment to which James Watt belongs to.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9041 wdt:P101 ?obj . ?obj wdt:P31 wd:Q8148 }","paraphrases":["Specify the industry section to which James Watt has a place to."],"info":{}}
{"id":"train_15938","question":"What is the parent company of Viktor Yanukovych's  political party?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1459658 wdt:P102 ?X . ?X wdt:P355 ?answer }","paraphrases":["What is the parent company of Viktor Yanukovych's political party?"],"info":{}}
{"id":"train_15940","question":"What is an exclave in Alaska?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q797 wdt:P500 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15943","question":"How has Albania's diplomacy blossomed to 1.359?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q222 wdt:P530 ?answer . ?answer wdt:P4841 ?x FILTER ( contains ( ?x , '1.359' ) ) }","paraphrases":["How has Albania's strategy bloomed to 1.359?"],"info":{}}
{"id":"train_15944","question":"What is the home port of Kuala Lumpur","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P504 wd:Q1865 }","paraphrases":[],"info":{}}
{"id":"train_15946","question":"Is cattle a source of beef and cowpox?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q830 wdt:P1672 wd:Q192628 . wd:Q830 wdt:P1672 wd:Q1066011 }","paraphrases":["Does cattle act as a source of beef and cowpox?"],"info":{}}
{"id":"train_15947","question":"How many narrative locaation are by Tampa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P840 wd:Q49255 }","paraphrases":["How many narrative locations are found near Tampa Bay?"],"info":{}}
{"id":"train_15948","question":"Was P. T. Barnum's place of birth Bethel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q223766 wdt:P19 wd:Q263912 }","paraphrases":["Was P.T. Barnum born in Bethel?"],"info":{}}
{"id":"train_15949","question":"For what role did Jeremy Irons receive an Academy Award for Best Actor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q171745 p:P166 ?s . ?s ps:P166 wd:Q103916 . ?s pq:P805 ?value }","paraphrases":["Which role earned Jeremy Irons an Academy Award for Best Actor?"],"info":{}}
{"id":"train_15951","question":"What title was given to the ruler of the Ottoman Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12560 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q355567 }","paraphrases":["Name the title given to the Ottoman Empire's ruler."],"info":{}}
{"id":"train_15952","question":"Is the salinity of Don Juan Pond more than 0.376?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q384811 wdt:P4350 ?obj filter ( ?obj > 0.376 ) }","paraphrases":["What is the salinity of Don Juan Pond?"],"info":{}}
{"id":"train_15953","question":"What is the official website for Alan Ayckbourn at Leeds University Library?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q712848 p:P485 ?s . ?s ps:P485 wd:Q24568958 . ?s pq:P856 ?value }","paraphrases":["At Leeds University Library, what is the address of the official website for Alan Ayckbourn?"],"info":{}}
{"id":"train_15954","question":"What county in England shares a border with Hampshire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q23204 . ?sbj wdt:P31 wd:Q180673 }","paraphrases":["What district in Britain offers a border with Hampshire?"],"info":{}}
{"id":"train_15959","question":"who is co-founder for moveable object location of Justice of Brutus ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28798249 wdt:P276 ?X . ?X wdt:P112 ?answer }","paraphrases":["who is co-founder for portable object location of Justice of Brutus ?"],"info":{}}
{"id":"train_15960","question":"What is The Lady Penelope's most representative work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2517298 wdt:P50 ?X . ?X wdt:P800 ?answer }","paraphrases":["Which work of Lady Penelope's is most representative of her?"],"info":{}}
{"id":"train_15961","question":"How many active ingredients make up epinephrine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3781 wd:Q132621 }","paraphrases":["What number of ingredients does it take to make epinephrine?"],"info":{}}
{"id":"train_15962","question":"What time period and religions associated with satrap?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170305 wdt:P1264 ?X . ?X wdt:P3075 ?answer }","paraphrases":["Which religions are associated with the era of Satrap?"],"info":{}}
{"id":"train_15963","question":"What position was Arthur Henderson elected in and what was the position was he held?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q208665 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What position was Arthur Henderson chosen in and what was the position was he held?"],"info":{}}
{"id":"train_15965","question":"What is the date commenced  developed by ICQ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q58166 wdt:P178 ?X . ?X wdt:P571 ?answer }","paraphrases":["What is the date commenced created by ICQ?"],"info":{}}
{"id":"train_15966","question":"\"Which is {facet of a polytope} of {24-cell}, that has {three-dimensional model} is {Octahedron.stl} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q539008 wdt:P1312 ?answer . ?answer wdt:P4896 ?x FILTER ( contains ( ?x , 'Octahedron.stl' ) ) }","paraphrases":["\"Which is {facet of a polytope} of {24-cell}, that has {three-dimensional model} is {Octahedron.stl} ?\""],"info":{}}
{"id":"train_15967","question":"IS THE ORBITAL PERIOD OF APOLLO 11 EQUAL TO 2.4","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q43653 wdt:P2146 ?obj filter ( ?obj = 2.4 ) }","paraphrases":["What is the orbital period of Apollo 11?"],"info":{}}
{"id":"train_15968","question":"What are the vehicle families which starts with the word vehicle.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22999537 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vehicle' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the vehicle families which begins with the word vehicle."],"info":{}}
{"id":"train_15969","question":"Is it true that the median lethal dose of arsenic equals to 13.39?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q871 wdt:P2240 ?obj filter ( ?obj = 13.39 ) }","paraphrases":["Is 13.39 the median lethal dose of arsenic?"],"info":{}}
{"id":"train_15970","question":"What is Charity Navigator ID for Metropolitan Museum of Art ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q160236 wdt:P4861 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15972","question":"What coalition is Auburn University a member of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q540672 wdt:P463 ?obj . ?obj wdt:P31 wd:Q124964 }","paraphrases":["What fusion is Reddish-brown College a part of?"],"info":{}}
{"id":"train_15974","question":"tell me girl group contains the word virtue in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q641066 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'virtue' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know young lady bunch contains the word ideals in their name"],"info":{}}
{"id":"train_15975","question":"id code mil-std-2525 tanker","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q14970 wdt:P4297 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15978","question":"Tell me the programming paradigm which starts with letter p!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188267 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the programming worldview which begins with letter p!"],"info":{}}
{"id":"train_15979","question":"In what year was Ice-T nominated for the MTV Video Music Award for Best Video from a Film?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q309941 p:P1411 ?s . ?s ps:P1411 wd:Q1161109 . ?s pq:P585 ?value }","paraphrases":["Ice-T was nominated for MTV's Video Music Award for Best Video from a Film in which year?"],"info":{}}
{"id":"train_15982","question":"Who signed the Mayflower Compact and has a grave in Connecticut?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q868502 wdt:P1891 ?answer . ?answer wdt:P119 wd:Q779 }","paraphrases":["Who signed the Mayflower Compact and has a grave in Connecticut?"],"info":{}}
{"id":"train_15983","question":"What is the UEFA player id for Cristiano Ronaldo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11571 wdt:P2276 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15984","question":"What is the common name with the loudest maximum frequency of audible sound that is a subclass of a domesticated animal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q502895 . ?ent wdt:P3465 ?obj . ?ent wdt:P279 wd:Q622852 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the common name of the subclass of a the domesticated animal that makes an audible noise with the loudest maximum frequency?"],"info":{}}
{"id":"train_15985","question":"WHAI IS THE UNITED STATES SUPREME COURT DECISION THAT APPLIES TO JURISDICTION IN UNITED STATES IF AMERICA AND WHICH STARTS  WITH U","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19692072 . ?sbj wdt:P1001 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAI IS THE UNITED STATES SUPREME COURT DECISION THAT APPLIES TO JURISDICTION IN UNITED STATES IF AMERICA AND WHICH STARTS WITH U"],"info":{}}
{"id":"train_15986","question":"Was Jane Austen's notable work \"Lady Susan\" and \"Persuasion\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q36322 wdt:P800 wd:Q581180 . wd:Q36322 wdt:P800 wd:Q333179 }","paraphrases":["Were \"Lady Susan\" and \"Persuasion\" notable works by Jane Austen?"],"info":{}}
{"id":"train_15988","question":"When was Philip II of France's child Louis VIII of France born, and when did he die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q34428 p:P40 ?s . ?s ps:P40 wd:Q165284 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["When was once Philip II of France's toddler Louis VIII of France born, and when did he die?"],"info":{}}
{"id":"train_15989","question":"What legislative body is parliament in the Kingdom of Great Britain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q161885 wdt:P194 ?obj . ?obj wdt:P31 wd:Q35749 }","paraphrases":["What authoritative body is parliament within the Kingdom of Awesome Britain?"],"info":{}}
{"id":"train_15990","question":"Ser Singh is the founder of what life stance?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7494639 wdt:P140 ?X . ?X wdt:P112 ?answer }","paraphrases":["What life stance is Ser Singh the founder of?"],"info":{}}
{"id":"train_15991","question":"How many publishers are there for Wolfenstein?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q4357563 wdt:P123 ?obj }","paraphrases":["How many publishers does Wolfenstein Have?"],"info":{}}
{"id":"train_15993","question":"What are the barycenter which start with the letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q809690 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the barycenter which begin with the letter c"],"info":{}}
{"id":"train_15994","question":"Is the number of pages of ruins of modernity politics,history and culture equal to 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q55726001 wdt:P1104 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is the number of pages of ruins of advancement politics,history and culture rise to to 1?"],"info":{}}
{"id":"train_15996","question":"What is the total revenue for Nissan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q20165 wdt:P2139 ?obj }","paraphrases":["Nissans total revenue is?"],"info":{}}
{"id":"train_15997","question":"Who was the copyright owner for Felix the Cat in the year 1985?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q692603 p:P3931 ?s . ?s ps:P3931 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1985' ) ) }","paraphrases":["in 1985 who owned the copyright for felix the cat?"],"info":{}}
{"id":"train_15998","question":"\"Which theme from Pascal, has a unit symbol of 公尺?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44395 wdt:P144 ?answer . ?answer wdt:P5061 ?x FILTER ( contains ( ?x , '公尺' ) ) }","paraphrases":["\"Which subject from Pascal, features a unit image of 公尺?\""],"info":{}}
{"id":"train_16000","question":"Is the spin quantum number of xenon-136 equal to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1851814 wdt:P1122 ?obj filter ( ?obj = 0 ) }","paraphrases":["Does the spin quantum number of xenon-136 equal zero?"],"info":{}}
{"id":"train_16001","question":"What is the language official of Luhansk, whose Linguasphere code is 53-AAA-ea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q134279 wdt:P37 ?answer . ?answer wdt:P1396 ?x FILTER ( contains ( ?x , '53-AAA-ea' ) ) }","paraphrases":["What is the language reliable of Luhansk, whose Linguasphere code is 53-AAA-ea?"],"info":{}}
