{"id":"train_9650","question":"Were Turkic languages official language of Uyghur people in Mongol Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12557 wdt:P37 wd:Q34090 . wd:Q12557 wdt:P37 wd:Q46118 }","paraphrases":["In the Mongol Empire, were the Turkic languages the official languages spoken by the Uyghur people?"],"info":{}}
{"id":"train_9651","question":"What platform did whistleblower Julian Assange use?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P178 wd:Q360 . ?sbj wdt:P31 wd:Q1344897 }","paraphrases":["What stage did whistleblower Julian Assange utilize?"],"info":{}}
{"id":"train_9654","question":"Tell me aspect of music whose name has the word phrase  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15198957 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'phrase' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know perspective of music whose title has the word state in it."],"info":{}}
{"id":"train_9655","question":"Christmas occurs on which day every year and by what is it then followed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q19809 wdt:P155 ?ans_1 . wd:Q19809 wdt:P837 ?ans_2 }","paraphrases":["Christmas takes place on which day every year and by way of what is it then followed?"],"info":{}}
{"id":"train_9656","question":"tell me intensive quantityfacet of electricity starts with v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3387041 . ?sbj wdt:P1269 wd:Q12725 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tell me intensive quantityfacet of electricitybegins with v"],"info":{}}
{"id":"train_9658","question":"What is the tributary of the bay of Santo Domingo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34820 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["What is a tributary of the Santo Domingo bay?"],"info":{}}
{"id":"train_9659","question":"What was the last year that Charlemagne and Desiderata of the Lombards were married?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3044 p:P26 ?s . ?s ps:P26 wd:Q263474 . ?s pq:P582 ?value }","paraphrases":["Which year was the last year of marriage between Charlemagne and Desiderata of the Lombards ?"],"info":{}}
{"id":"train_9661","question":"What is the treatment and result of hepatitis ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131742 wdt:P1542 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What is the treatment and result of hepatitis ?"],"info":{}}
{"id":"train_9665","question":"When did Theodor Mommsen was awarded by obel Prize in Literature.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q25351 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P585 ?value1 . ?s pq:P2121 ?value2 }","paraphrases":["When did Theodor Mommsen was awarded by way of obel Prize in Literature."],"info":{}}
{"id":"train_9666","question":"What is the woman in Ernst Wilimowski whose acronym is чол?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q559779 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'чол' ) ) }","paraphrases":["What is the lady in Ernst Wilimowski whose acronym is чол?"],"info":{}}
{"id":"train_9667","question":"Which metropolis did Aung San Suu Kyi live in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q36740 wdt:P551 ?obj . ?obj wdt:P31 wd:Q200250 }","paraphrases":[],"info":{}}
{"id":"train_9670","question":"what is Colorado Sports Hall of Fame ID forJack Dempsey","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q313686 wdt:P4642 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9672","question":"What did Ghent Altarpiece create in 1432?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q734834 p:P571 ?s . ?s ps:P571 ?x filter ( contains ( YEAR ( ?x ) , '1432' ) ) . ?s pq:P31 ?value }","paraphrases":["What did Ghent Altarpiece invent in 1432?"],"info":{}}
{"id":"train_9673","question":"What is the chef-lieu of Xia dynasty whose post code is 452470?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q169705 wdt:P36 ?answer . ?answer wdt:P281 ?x FILTER ( contains ( ?x , '452470' ) ) }","paraphrases":["What is the chef-lieu of Xia line whose post code is 452470?"],"info":{}}
{"id":"train_9677","question":"Who created Batman ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2695156 wdt:P170 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Batman was created by whom?"],"info":{}}
{"id":"train_9678","question":"Who gave the {type of taxon} of {higher taxon} of {×Triticale} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q380329 wdt:P171 ?X . ?X wdt:P105 ?answer }","paraphrases":["Who gave the { higher taxon } { Triticale } { type of taxon }?"],"info":{}}
{"id":"train_9679","question":"Tell me me a ethnic group whose name consist of the word \"sioux\" and whose language used Sioux","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41710 . ?sbj wdt:P2936 wd:Q13268 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sioux' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me me a ethnic group whose name consist of the phrase \"sioux\" and whose language used Sioux"],"info":{}}
{"id":"train_9680","question":"What award was bestowed upon Peter Scholze as a fellow?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q98034 p:P166 ?s . ?s ps:P166 wd:Q1404101 . ?s pq:P1027 ?value }","paraphrases":["Which award was bestowed upon Peter Scholze as a fellow?"],"info":{}}
{"id":"train_9681","question":"Is the total liabilities of the Dalmoreprodukt equal to 1477000000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4154217 wdt:P2138 ?obj filter ( ?obj = 1477000000 ) }","paraphrases":["Is Dalmoreprodukt's total liabilities equal to 1477000000?"],"info":{}}
{"id":"train_9683","question":"What were Vladimir Nabokov's degree and major from Trinity College?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q36591 p:P69 ?s . ?s ps:P69 wd:Q332342 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What have been Vladimir Nabokov's degree and important from Trinity College?"],"info":{}}
{"id":"train_9684","question":"What is sports season of league or competition for college football ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3450 wd:Q1109032 }","paraphrases":[],"info":{}}
{"id":"train_9687","question":"What is the geographic region with the highest number of out of school children whose part of is Asia ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q82794 . ?ent wdt:P2573 ?obj . ?ent wdt:P361 wd:Q48 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Asian geographic region has the highest number of children who are out of school?"],"info":{}}
{"id":"train_9689","question":"What is the inverse of pleasure whose treatment is topiramate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q208195 wdt:P461 ?answer . ?answer wdt:P2176 wd:Q221174 }","paraphrases":["When did award received of Octavio Paz and area of work?"],"info":{}}
{"id":"train_9692","question":"What is the position held by David Packard born at 1969-1-24?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q380484 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1969' ) ) }","paraphrases":["Tell me the position held by David Packard, who was born 1-24-1969."],"info":{}}
{"id":"train_9693","question":"Who was the winner of the Arlene Raven Award that was bestowed by the Women's Caucus for Art?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4792169 wdt:P166 ?answer . ?answer wdt:P1027 wd:Q8030842 }","paraphrases":["Who was the Arlene Raven Award winner that was awarded for art by the Women's Caucus?"],"info":{}}
{"id":"train_9696","question":"who archipelago for official language of norwegian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q9043 . ?sbj wdt:P31 wd:Q33837 }","paraphrases":["who archipelago for official dialect of norwegian?"],"info":{}}
{"id":"train_9699","question":"What are the signs of the afflictions of phosphine exposure?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21175052 wdt:P780 ?X . ?X wdt:P689 ?answer }","paraphrases":["What are the side effects of exposure to phosphine?"],"info":{}}
{"id":"train_9700","question":"What are the  railroad line which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q728937 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the railway line starting with the letter s"],"info":{}}
{"id":"train_9701","question":"Name an free application written in PHP.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P277 wd:Q59 . ?sbj wdt:P31 wd:Q341 }","paraphrases":[],"info":{}}
{"id":"train_9702","question":"Where did Lionel Trilling reside on 11/5/1975?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1827287 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1975' ) ) }","paraphrases":["On 11/5/1975, where was Lionel Trilling living?"],"info":{}}
{"id":"train_9703","question":"Which is the hymenium type of Shiitake mushroom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q320999 wdt:P783 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9706","question":"What is the sporting event for high - jump competition?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2094 wd:Q165704 . ?sbj wdt:P31 wd:Q16510064 }","paraphrases":["What is the wearing occasion for tall - hop competition?"],"info":{}}
{"id":"train_9707","question":"What is Arminius' middle name in Latin script?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q68880 wdt:P735 ?answer . ?answer wdt:P282 wd:Q8229 }","paraphrases":["What is the middle name of Arminius in the Latin script?"],"info":{}}
{"id":"train_9708","question":"What circumstances caused Henry II of England to step down as monarch of England?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q102140 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P1534 ?value }","paraphrases":["Why did Henry II of England abdicate the right to be King of England?"],"info":{}}
{"id":"train_9709","question":"Which minor locality is the largest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q14839548 . ?ent wdt:P2046 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which minor territory is the largest?"],"info":{}}
{"id":"train_9711","question":"Are there 2 parts to the work of art, \"Schwanda the Bagpiper\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q80934 wdt:P2635 ?obj filter ( ?obj = 2 ) }","paraphrases":["Is \"Schwanda the Bagpiper\" a 2 part work?"],"info":{}}
{"id":"train_9712","question":"Septuagint is an edition of which literary work ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P747 wd:Q29334 . ?sbj wdt:P31 wd:Q7725634 }","paraphrases":[],"info":{}}
{"id":"train_9714","question":"When did member of sports team of Andriy Shevchenko and number of matches played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q41244 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["When did part of sports group of Andriy Shevchenko and number of matches played?"],"info":{}}
{"id":"train_9716","question":"Mention the language spoken and understood by L. Ron Hubbard","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q216896 wdt:P1412 ?X . ?X wdt:P1098 ?answer }","paraphrases":["Mention the language spoken and understood by means of L. Ron Hubbard"],"info":{}}
{"id":"train_9717","question":"How many patron saints are with the {Gabriel} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P417 wd:Q81989 }","paraphrases":["With Gabriel, how many patron saints are there?"],"info":{}}
{"id":"train_9720","question":"What was Scott Rudin nominated for for his role on The Social Network?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q185888 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q461529 }","paraphrases":["What was Scott Rudin designated for for his part on The Social Network?"],"info":{}}
{"id":"train_9723","question":"Which is the radius of Earth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2 wdt:P2120 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9724","question":"Tell me hypothesis whose name has the word substratum in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41719 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'substratum' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the hypothesis in which the word substratum has its name."],"info":{}}
{"id":"train_9725","question":"What is the {medical treatment} and the {symptoms} of {Ebola_virus_disease} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q51993 wdt:P924 ?ans_1 . wd:Q51993 wdt:P780 ?ans_2 }","paraphrases":["What are the symptoms and medical treatments for the Ebola virus disease?"],"info":{}}
{"id":"train_9726","question":"Which stratovolcano has the most topographic prominence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q169358 . ?ent wdt:P2660 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which stratovolcano has the foremost topographic prominence?"],"info":{}}
{"id":"train_9727","question":"What are the notable books of Francis Ford Coppola that has received nomination in Academy Award for Best Writing, Adapted Screenplay?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q56094 wdt:P800 ?answer . ?answer wdt:P1411 wd:Q107258 }","paraphrases":["What are the eminent books of Francis Portage Coppola that has gotten assignment in Institute Grant for Best Composing, Adjusted Screenplay?"],"info":{}}
{"id":"train_9729","question":"Name the inventor of deuterium who worked at Columbia University.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q102296 wdt:P61 ?answer . ?answer wdt:P108 wd:Q49088 }","paraphrases":["Title the innovator of deuterium who worked at Columbia University."],"info":{}}
{"id":"train_9730","question":"What are the flim production company which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1762059 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the flim generation company which begin with the letter t"],"info":{}}
{"id":"train_9732","question":"How many publications are published in The Economist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1433 wd:Q180089 }","paraphrases":["How many articles are in The Economist?"],"info":{}}
{"id":"train_9733","question":"When was Frederick Sanger awarded a Nobel Proze in Chemistry?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q151564 p:P166 ?s . ?s ps:P166 wd:Q44585 . ?s pq:P585 ?value1 . ?s pq:P1706 ?value2 }","paraphrases":["When did Frederick Sanger get a Nobel Prize?"],"info":{}}
{"id":"train_9734","question":"What is the county seat of Naypyidaw, which has a CPI inflation rate of 8.9?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37400 wdt:P1376 ?answer . ?answer wdt:P1279 ?x FILTER ( contains ( ?x , '8.9' ) ) }","paraphrases":["What is the county seat of Naypyidaw, which has a CPI inflation charge of 8.9?"],"info":{}}
{"id":"train_9737","question":"How many will be replaced by the Fatimid caliphate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1366 wd:Q160307 }","paraphrases":["How many will the Fatimid caliphate replace?"],"info":{}}
{"id":"train_9739","question":"What professional sport does Kristi Yamaguchi participate in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q237651 wdt:P1327 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What proficient don does Kristi Yamaguchi take an interest in?"],"info":{}}
{"id":"train_9743","question":"Who is the co-driver for Sébastien Ogier?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q368793 wdt:P2095 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9744","question":"Which chemical compound has the highest global-warming potential?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2565 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["what chemical has the highest global warming potential?"],"info":{}}
{"id":"train_9746","question":"Mention the predecessor and the successor of Star Wars Episode VI: Return of the Jedi in Star Wars series","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q181803 p:P179 ?s . ?s ps:P179 wd:Q22092344 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["What came before and after Star Wars Episode VI?"],"info":{}}
{"id":"train_9747","question":"Who was the executive power of Munich ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1726 wdt:P6 ?X . ?X wdt:P1399 ?answer }","paraphrases":["Who was the official control of Munich ?"],"info":{}}
{"id":"train_9748","question":"Which is the unity of energy that contains the word zettajoule in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2916980 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zettajoule' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the solidarity of vitality that contains the word zettajoule in it's title?"],"info":{}}
{"id":"train_9749","question":"Is the refractive index of silver chloride equal to 2.0224?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q216918 wdt:P1109 ?obj filter ( ?obj = 2.0224 ) }","paraphrases":["Is the silver chloride refractive index equal to 2.0224?"],"info":{}}
{"id":"train_9752","question":"The vici.org ID of Palmyra is?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5747 wdt:P1481 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9755","question":"What award did Lise Meitner receive in 1960 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q56189 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1960' ) ) }","paraphrases":["What award did Lise Meitner get in 1960 ?"],"info":{}}
{"id":"train_9756","question":"Which London District Line staion has the least number of passengers","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q14562709 . ?ent wdt:P3872 ?obj . ?ent wdt:P81 wd:Q211265 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which London District Line staion has the least quantity of passengers"],"info":{}}
{"id":"train_9759","question":"Mention the number of the goals and the number of the matches played by Clarence Seedorf while playing for Inter Milan.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q484909 p:P54 ?s . ?s ps:P54 wd:Q631 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["What was Clarence Seedorf playing record at Inter Milan?"],"info":{}}
{"id":"train_9760","question":"who was the administrative body of the of the Osaka Prefecture in July of 1987","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q122723 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1987' ) ) }","paraphrases":["Osaka's administrative body was what in July 1987?"],"info":{}}
{"id":"train_9762","question":"tell me cattle breed which name has the word wagtu in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12045585 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wagyu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know cattle breed which title has the word wagtu in it"],"info":{}}
{"id":"train_9763","question":"What is USATF athlete ID for Ashton Eaton ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1789 wdt:P3926 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9764","question":"Where is the burial place of Anthony of Padua?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q167477 wdt:P119 ?obj . ?obj wdt:P31 wd:Q120560 }","paraphrases":["Where is the burial put of Anthony of Padua?"],"info":{}}
{"id":"train_9766","question":"When did Gerard Reve receive the Prijs der Nederlandse Letteren?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q364153 p:P166 ?s . ?s ps:P166 wd:Q2063896 . ?s pq:P585 ?value }","paraphrases":["Prijs der Nederlandse Letteren received the Prijs in what year?"],"info":{}}
{"id":"train_9767","question":"What is the administrative centre of the Kingdom of Pontus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7380487 wdt:P36 ?X . ?X wdt:P1376 ?answer }","paraphrases":["What is the Pontus Kingdom's administrative center?"],"info":{}}
{"id":"train_9768","question":"Tell me the name of armed forces which starts with \"w\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q772547 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the name of the military that begins with \"w\""],"info":{}}
{"id":"train_9769","question":"Which constellation includes the star NGC 6723 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q612606 wdt:P397 ?X . ?X wdt:P59 ?answer }","paraphrases":["Which group of stars incorporates the star NGC 6723 ?"],"info":{}}
{"id":"train_9771","question":"Landon Donovan belongs to which sports team and how many matches did he play for them?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q202237 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["What team does Landon Donovan play for and how many matches did he play for them?"],"info":{}}
{"id":"train_9772","question":"What disease was treated with niacin that was used for treatment of cerivastatin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q134658 wdt:P2175 ?answer . ?answer wdt:P2176 wd:Q423439 }","paraphrases":["What disease was once handled with niacin that was used for treatment of cerivastatin?"],"info":{}}
{"id":"train_9773","question":"What premier of Ontario was born on 1953-5-21?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1904 wdt:P6 ?answer . ?answer wdt:P569 ?x FILTER ( contains ( YEAR ( ?x ) , '1953' ) ) }","paraphrases":["What chief of Ontario was born on 1953-5-21?"],"info":{}}
{"id":"train_9774","question":"When was Vladimir Vasilyev appointed as head of government in the Republic of Dagestan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5118 p:P6 ?s . ?s ps:P6 wd:Q4104566 . ?s pq:P580 ?value }","paraphrases":["The Rep. of Dagestan appointed Vladimir Vasilyev as head of government on what date?"],"info":{}}
{"id":"train_9779","question":"Tell me the version, edition or translation that starts with \"K\".","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3331189 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'к' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me the version, edition or translation that begins with \"K\"."],"info":{}}
