{"id":"train_1833","question":"What position did Louis X of France hold starting on 11/29/1314?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8384 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1314' ) ) }","paraphrases":["On November 29 1314 what position did Louis X of France hold?"],"info":{}}
{"id":"train_1834","question":"who sculpted the drawing hands?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2390890 wdt:P170 ?X . ?X wdt:P106 ?answer }","paraphrases":["who etched the drawing hands?"],"info":{}}
{"id":"train_1840","question":"To which musical movement did John Cage belong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q180727 wdt:P135 ?obj . ?obj wdt:P31 wd:Q12020884 }","paraphrases":["To which melodic development did John Cage have a place?"],"info":{}}
{"id":"train_1841","question":"Tell me Original Public Ivy whose name has the word university in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20971972 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'university' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know Unique Open Ivy whose title has the word college in it."],"info":{}}
{"id":"train_1844","question":"What { end time } has { commander of } as { Kriegsmarine } for { Karl Dönitz }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q76437 p:P598 ?s . ?s ps:P598 wd:Q151701 . ?s pq:P582 ?value }","paraphrases":["What is Karl Donitz's end time?"],"info":{}}
{"id":"train_1845","question":"What is associated with the Umayyad conquest of Hispania?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1455917 wdt:P276 ?X . ?X wdt:P2789 ?answer }","paraphrases":["What is related with the Umayyad success of Hispania?"],"info":{}}
{"id":"train_1846","question":"who is the writer of Julius Caesar who has a sister named Joan Shakespeare?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q215750 wdt:P50 ?answer . ?answer wdt:P3373 wd:Q6205446 }","paraphrases":["who is the author of Julius Caesar who includes a sister named Joan Shakespeare?"],"info":{}}
{"id":"train_1847","question":"Which is the language of work or name of Appetite for Destruction?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q270690 wdt:P407 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1851","question":"Which flammable liquid has the highest ionization energy ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5457310 . ?ent wdt:P2260 ?obj . ?ent wdt:P31 wd:Q21073026 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the combustable fluid with the most ionization work."],"info":{}}
{"id":"train_1856","question":"On June 24th of 1948 what award did Kliment Voroshilov received?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q186185 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1948' ) ) }","paraphrases":["Name the award received by Kliment Voroshilov on June 24, 1948."],"info":{}}
{"id":"train_1857","question":"Who is informed by Friedrich Schiller, that has a father-in-law named Peter Im Baumgarten?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q22670 wdt:P737 ?answer . ?answer wdt:P1038 wd:Q2079256 }","paraphrases":["Who is informed about a father - in - law named Peter I m Baumgarten by Friedrich Schiller?"],"info":{}}
{"id":"train_1858","question":"What gelatin item in the collection has the shortest width?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q18593264 . ?ent wdt:P2049 ?obj . ?ent wdt:P186 wd:Q179254 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What gelatin thing within the collection has the most limited width?"],"info":{}}
{"id":"train_1859","question":"What operating system component starts with the letter \"f\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q30059018 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What working framework component begins with the letter \"f\"?"],"info":{}}
{"id":"train_1862","question":"Which is the filmography for Orange Is the New Black?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1283 wd:Q7099650 }","paraphrases":[],"info":{}}
{"id":"train_1863","question":"\"What is {name after} of {Carnot heat engine}, which has {Christian name} is {Nicolas} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1335241 wdt:P138 ?answer . ?answer wdt:P735 wd:Q7029481 }","paraphrases":["\"What is {title after} of {Carnot warm motor}, which has {Christian title} is {Nicolas} ?\""],"info":{}}
{"id":"train_1864","question":"With a local government area of Zhenjiang, where was Gong Qiuxia born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1139517 wdt:P19 ?answer . ?answer wdt:P150 wd:Q57958 }","paraphrases":["With a nearby government region of Zhenjiang, where used to be Gong Qiuxia born?"],"info":{}}
{"id":"train_1866","question":"What award did Thomas Hunt Morgan receive and when did he receive it?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q177681 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What award was receive by Thomas Hunt Morgan and on which date he receiced it."],"info":{}}
{"id":"train_1869","question":"Where did Zelda Fitzgerald and F. Scott Fitzgerald marry?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q187324 p:P26 ?s . ?s ps:P26 wd:Q93354 . ?s pq:P2842 ?value }","paraphrases":["What was the location of Zelda Fitzgerald and F. Scott Fitzgerald's wedding?"],"info":{}}
{"id":"train_1870","question":"Tell me art movement whose name has the word yamato in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q968159 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yamato' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know craftsmanship development whose title has the word yamato in it."],"info":{}}
{"id":"train_1871","question":"Which is the DSM-5 of attention deficit hyperactivity disorder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q181923 wdt:P1930 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1872","question":"Was Maureen Connolly victorious?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q53390 wdt:P2522 ?obj }","paraphrases":["Tell me if Maureen Connolly was victorious?"],"info":{}}
{"id":"train_1875","question":"When was Cicely Tyson granted the Candace Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q238081 p:P166 ?s . ?s ps:P166 wd:Q27851929 . ?s pq:P585 ?value }","paraphrases":["Give me the date that Cicely Tyson was granted the Candace Award."],"info":{}}
{"id":"train_1876","question":"Is it true that the cost of Primer equals to 7000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1434995 wdt:P2130 ?obj filter ( ?obj = 7000 ) }","paraphrases":["Is the Primer worth 7000?"],"info":{}}
{"id":"train_1877","question":"When did Phil Taylor win the BDO World Darts Championship?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q550313 p:P1346 ?s . ?s ps:P1346 wd:Q2629008 . ?s pq:P585 ?value }","paraphrases":["the date Phil Taylor on the BDO world darts championship?"],"info":{}}
{"id":"train_1878","question":"Which is the Italian Senate ID for Giosuè Carducci?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q43440 wdt:P3954 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1879","question":"Is the horizontal depth of the High-necked spheroid vase (DP 0212 equal to 28.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q59417224 wdt:P5524 ?obj filter ( ?obj = 28.8 ) }","paraphrases":["Is the even profundity of the High-necked spheroid vase (DP 0212 break even with to 28.8?"],"info":{}}
{"id":"train_1880","question":"Did Carole King work with the record labels Epic Records and Avatar Records?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q217787 wdt:P264 wd:Q216364 . wd:Q217787 wdt:P264 wd:Q4827811 }","paraphrases":["Is it true that Carole King worked with the record labels Epic Records and Avatar Records?"],"info":{}}
{"id":"train_1881","question":"What is the antonym of painting of Samson and the Philistines?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20355202 wdt:P180 ?X . ?X wdt:P461 ?answer }","paraphrases":["Tell me the opposite painting of Samson and the Philistines."],"info":{}}
{"id":"train_1882","question":"What is the capital city twinned to Kiel that contains the word \"tallinn \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5119 . ?sbj wdt:P190 wd:Q1707 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tallinn' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the chemical reaction that begins with the letter s"],"info":{}}
{"id":"train_1883","question":"What is the name of film studio that starts with letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q375336 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is the name of film studio that begins with the letter s"],"info":{}}
{"id":"train_1884","question":"What type of Pentium M microprocessor has the smallest number of processor cores?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5297 . ?ent wdt:P1141 ?obj . ?ent wdt:P155 wd:Q856732 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which Pentium M microprocessor has the lowest number of processor cores?"],"info":{}}
{"id":"train_1885","question":"Who gave the  {summit} of {system of mountains} of {Stevens Pass} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3494853 wdt:P4552 ?X . ?X wdt:P610 ?answer }","paraphrases":["Who gave the {summit} of {system of mountains} of {Stevens Pass} ?"],"info":{}}
{"id":"train_1887","question":"Did Chris Pratt perform good as an actor in Guardians of the Galaxy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q503706 wdt:P800 wd:Q5887360 }","paraphrases":["How was Chris Pratt's performance in Guardians of the Galaxy?"],"info":{}}
{"id":"train_1888","question":"On which series Teg Hughes named as James?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q272194 p:P735 ?s . ?s ps:P735 wd:Q677191 . ?s pq:P1545 ?value }","paraphrases":["Which series is Teg Hughes named as James?"],"info":{}}
{"id":"train_1890","question":"Which is the mass excess of helium-4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1151346 wdt:P2160 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1891","question":"Where did Willem de Kooning work on 7-18-1926?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q132305 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1926' ) ) }","paraphrases":["At what place worked Willem de Kooning in 1926?"],"info":{}}
{"id":"train_1892","question":"Who wrote the sequel to The Glory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7736826 wdt:P155 ?X . ?X wdt:P50 ?answer }","paraphrases":["Who composed the spin-off to The Glory?"],"info":{}}
{"id":"train_1893","question":"What is won by the honorary titles of The Settlers of Catan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17271 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What is won by the privileged titles of The Pioneers of Catan?"],"info":{}}
{"id":"train_1895","question":"Which city was twinned with Nagoya on 21st December, 1978?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11751 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1978' ) ) }","paraphrases":["Give me the name of the city that was twinned with Nagoya on 21st December, 1978"],"info":{}}
{"id":"train_1899","question":"TELL ME HUMAN SETTLEMENT WHOSE NAME HAS THE WORD ZANZIBAR IN  IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q486972 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zanzibar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME HUMAN SETTLEMENT WHOSE NAME HAS THE WORD ZANZIBAR IN IT."],"info":{}}
{"id":"train_1902","question":"Where Clement I dired at Bosporan Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q42887 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q321371 }","paraphrases":["Give the location in Bosporan Kingdom that Clement I dired."],"info":{}}
{"id":"train_1903","question":"Who was the presenter for Meet the Press starting on September 16, 1984?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1543066 p:P371 ?s . ?s ps:P371 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["Who served as the moderator for Meet the Press beginning September 16, 1984?"],"info":{}}
{"id":"train_1905","question":"What award did Mel Brooks receive in 2003?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q104266 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2003' ) ) }","paraphrases":["In 2003, what award was presented to Mel Brooks?"],"info":{}}
{"id":"train_1907","question":"Ruth Benedict lives in what administrative location?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q228822 wdt:P551 ?X . ?X wdt:P131 ?answer }","paraphrases":["Give me the administrative location of where Ruth Benedict is currently living in."],"info":{}}
{"id":"train_1910","question":"Is it true that the payload mass of the Vale Beijing equals to 404389?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3553528 wdt:P4519 ?obj filter ( ?obj = 404389 ) }","paraphrases":["Is 404389 the payload mass of the Vale Beijing?"],"info":{}}
{"id":"train_1911","question":"Please tell me Alistair Brownlee's IAT triathlete ID.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q716308 wdt:P2778 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1912","question":"Is Malum depicted in the audio of \"The Son of Man.\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1151384 wdt:P180 ?answer . ?answer wdt:P443 ?x FILTER ( contains ( ?x , 'La-cls-malum.ogg' ) ) }","paraphrases":["Is Malum delineated within the sound of \"The Child of Man.\""],"info":{}}
{"id":"train_1913","question":"What is the pole vault height record held by Igor Potapovich and where was the event?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q2330636 . ?s pq:P2048 ?value1 . ?s pq:P276 ?value2 }","paraphrases":["What is the pole vault height record held by way of Igor Potapovich and where used to be the event?"],"info":{}}
{"id":"train_1915","question":"Who was the operator of the Airbus A320?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6475 wdt:P137 ?X . ?X wdt:P121 ?answer }","paraphrases":["The operator of the Airbus A320 is whom?"],"info":{}}
{"id":"train_1916","question":"When was Len Brown's last year as the mayor of Auckland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q37100 p:P6 ?s . ?s ps:P6 wd:Q4116955 . ?s pq:P582 ?value }","paraphrases":["What was the year that Len Brown left as mayor of Auckland?"],"info":{}}
{"id":"train_1917","question":"Tell me chemical substance whose name has the word zeolite in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q79529 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zeolite' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know chemical substance whose title has the word zeolite in it."],"info":{}}
{"id":"train_1920","question":"Where were Catharine, Duchess of Cambridge and Prince William, Duke of Cambridge married?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q10479 p:P26 ?s . ?s ps:P26 wd:Q36812 . ?s pq:P2842 ?value }","paraphrases":["Where were Catharine, Duchess of Cambridge and Prince William, Duke of Cambridge wedded?"],"info":{}}
{"id":"train_1921","question":"Which position does Justin Trudeau hold?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3099714 wdt:P39 ?obj . ?obj wdt:P31 wd:Q895526 }","paraphrases":["Which position does Justin Trudeau hold?"],"info":{}}
{"id":"train_1922","question":"What instrument does Darrell Pace play?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1166597 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["Darrell Pace plays what instrument?"],"info":{}}
{"id":"train_1923","question":"Is it true that the face value of the United States two-dollar bill equals to 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1189454 wdt:P3934 ?obj filter ( ?obj = 2 ) }","paraphrases":["Is a United States two-dollar bill truly equivalent to a face value of 2?"],"info":{}}
{"id":"train_1925","question":"Name a former municipality of the Netherlands that shares a border with Rotterdam","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q34370 . ?sbj wdt:P31 wd:Q7265977 }","paraphrases":["Title a previous district of the Netherlands that offers a border with Rotterdam"],"info":{}}
{"id":"train_1926","question":"Was Venice administratively intertwinned with Sarajevo and Tallinn?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q641 wdt:P190 wd:Q11194 . wd:Q641 wdt:P190 wd:Q1770 }","paraphrases":["Is it true that Venice was administratively intertwinned with both Tallinn and Sarajevo?"],"info":{}}
{"id":"train_1929","question":"In the birth place of Gerard Reve, what is the earliest record of 1275-0-0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q364153 wdt:P19 ?answer . ?answer wdt:P1249 ?x FILTER ( contains ( YEAR ( ?x ) , '1275' ) ) }","paraphrases":["In the start region of Gerard Reve, what is the earliest document of 1275-0-0?"],"info":{}}
{"id":"train_1930","question":"For what reason D.T. suzuku was in nomination in the year 1963?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q44847 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1963' ) ) }","paraphrases":["Why was D.T. Suzuku nominated in 1963?"],"info":{}}
{"id":"train_1934","question":"Who is the developer of Stirling engine whose died in Galston","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q186212 wdt:P61 ?answer . ?answer wdt:P20 wd:Q3997296 }","paraphrases":["Who is the developer of Stirling engine whose died in Galston"],"info":{}}
{"id":"train_1935","question":"How many people visited Yellowstone National Park in 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q351 p:P1174 ?s . ?s ps:P1174 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["In 2015 what was the attendance at Yellowstone National Park?"],"info":{}}
{"id":"train_1936","question":"Is it true that the term length of office of Captain Regent of San Marino equals to 0.5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q258045 wdt:P2097 ?obj filter ( ?obj = 0.5 ) }","paraphrases":["Is 0.5 equal to the term length of office of Captain Regent of San Marino?"],"info":{}}
{"id":"train_1937","question":"Tell me universal library whose name has the word library in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2495568 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'library' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know widespread library whose title has the word library in it."],"info":{}}
{"id":"train_1938","question":"Give me the most effected wrench model ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23811265 . ?ent wdt:P2791 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Tell me the most effected wrench model."],"info":{}}
{"id":"train_1939","question":"Who is {favorite player} of {The Rolling Stones}, that has {found guilty of} is {tax evasion}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11036 wdt:P737 ?answer . ?answer wdt:P1399 wd:Q6502151 }","paraphrases":["Who is {favorite player} of {The Rolling Stones}, that has {found blameworthy of} is {charge evasion}"],"info":{}}
{"id":"train_1940","question":"What is the density of water?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q283 wdt:P2054 ?obj }","paraphrases":["Water has a density of what?"],"info":{}}
{"id":"train_1941","question":"What is award received of Richard M. Karp that is point in time is 1985-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q92612 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1985' ) ) }","paraphrases":["Which was the award received by Richard M. Karp in 1985?"],"info":{}}
{"id":"train_1943","question":"Is the slope rating of the Crosswater Club equal to 145?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5188884 wdt:P3840 ?obj filter ( ?obj = 145 ) }","paraphrases":["Is 145 equal to the rating of the Crosswater club?"],"info":{}}
{"id":"train_1944","question":"Mention the date and the reason of elimination of Oswald Mosley from the Member of the 35th Parliament of the United Kingdom.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q332400 p:P39 ?s . ?s ps:P39 wd:Q41582588 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }","paraphrases":["When and why was Oswald Mosley eliminated from the Member of the 35th Parliament of the UK?"],"info":{}}
{"id":"train_1945","question":"Using the following specifications--wgs 84, 39.992--find the burial location of Deniz Gezmis.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q982419 wdt:P119 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '39.992' ) ) }","paraphrases":["Utilizing the taking after specifications--wgs 84, 39.992--find the burial area of Deniz Gezmis."],"info":{}}
{"id":"train_1948","question":"what is the facet of a polytope shape of six-side die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17639282 wdt:P1419 ?X . ?X wdt:P1312 ?answer }","paraphrases":["Explain what the facet is of a polytope shape of six-side die."],"info":{}}
{"id":"train_1949","question":"which sport in a geographic region has maximum number of clubs in Australia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q29791211 . ?ent wdt:P4999 ?obj . ?ent wdt:P276 wd:Q408 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What sport has the most clubs in Australia?"],"info":{}}
{"id":"train_1950","question":"What is the trunk prefix of the shooting location Seven Samurai?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q189540 wdt:P915 ?X . ?X wdt:P3238 ?answer }","paraphrases":["What is the trunk prefix of the shooting area Seven Samurai?"],"info":{}}
{"id":"train_1953","question":"What business is the organization of the American Broadcasting Company in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P749 wd:Q169889 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["What is the American Broadcasting Company's organization in?"],"info":{}}
{"id":"train_1954","question":"When did Charlie Rose receive the James Madison Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q715515 p:P166 ?s . ?s ps:P166 wd:Q16987872 . ?s pq:P585 ?value }","paraphrases":["on what did charlie rose receive the james madison award?"],"info":{}}
