{"id":"train_849","question":"Who is the {municipal archive} for {archives at} of {Aachen}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1017 wdt:P485 ?obj . ?obj wdt:P31 wd:Q604177 }","paraphrases":["Where are the archives of Aachen?"],"info":{}}
{"id":"train_851","question":"How many out of school children are there in Eritrea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q986 wdt:P30 ?X . ?X wdt:P2573 ?answer }","paraphrases":["How numerous out of school children are there in Eritrea?"],"info":{}}
{"id":"train_852","question":"Tell me physical quantity whose name has the word work in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q107715 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'work' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me physical quantity whose name has the word work in it."],"info":{}}
{"id":"train_853","question":"What power plant and manufacturer is responsible for the Rockwell B-1 Lancer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q218636 wdt:P516 ?ans_1 . wd:Q218636 wdt:P176 ?ans_2 }","paraphrases":["What control plant and producer is capable for the Rockwell B-1 Lancer?"],"info":{}}
{"id":"train_855","question":"Tell me superhero that contains the word wolfsbane in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188784 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wolfsbane' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know superhero that contains the word wolfsbane in their title"],"info":{}}
{"id":"train_856","question":"Which is the subject in Sunyata having science,that studies about Buddhist studies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q546054 wdt:P1269 ?answer . ?answer wdt:P2579 wd:Q1000976 }","paraphrases":["Which is the subject in Sunyata having science,that thinks about around Buddhist thinks about?"],"info":{}}
{"id":"train_857","question":"What drives the subject of the language change statement","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q524648 wdt:P805 ?X . ?X wdt:P3095 ?answer }","paraphrases":["What drives the subject of the dialect alter statement"],"info":{}}
{"id":"train_859","question":"What state is the University of Iowa located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q182973 wdt:P17 ?X . ?X wdt:P530 ?answer }","paraphrases":["What state is the College of Iowa found?"],"info":{}}
{"id":"train_861","question":"Who is the contestant of Descendants of the Sun?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18652415 wdt:P161 ?X . ?X wdt:P1399 ?answer }","paraphrases":["Who is the hopeful of Relatives of the Sun?"],"info":{}}
{"id":"train_862","question":"What are the state church which start with the letter M","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2325038 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the state church which begin with the letter M"],"info":{}}
{"id":"train_863","question":"Which is the {eye color} of the {hair color} of {Xi_Jinping} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q15031 wdt:P1340 ?ans_1 . wd:Q15031 wdt:P1884 ?ans_2 }","paraphrases":["Of {Xi_Jinping} what was the {eye color} of the {hair color}?"],"info":{}}
{"id":"train_867","question":"What specimen type does Piper nigrum belong to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P427 wd:Q43084 . ?sbj wdt:P31 wd:Q16521 }","paraphrases":["What specimen does Piper Nigrum belong?"],"info":{}}
{"id":"train_868","question":"Who became the head of the government of Vaduz on 2017-1-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1844 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2007' ) ) }","paraphrases":["Name the person who took over as  the head of the government of Vaduz on 2017-1-0."],"info":{}}
{"id":"train_871","question":"What is the twin town of Port Vila, with the license plate code 沪A?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37806 wdt:P190 ?answer . ?answer wdt:P395 ?x FILTER ( contains ( ?x , '沪A' ) ) }","paraphrases":["What is the twin town of Port Vila, with the license plate code 沪A?"],"info":{}}
{"id":"train_873","question":"What is the period of time of the  {Hellenistic period} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2348 wd:Q428995 }","paraphrases":["The Hellenistic period is from what time period?"],"info":{}}
{"id":"train_875","question":"Which is {official language} of {basin countries} of {White Sea} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44133 wdt:P205 ?X . ?X wdt:P37 ?answer }","paraphrases":["Which is {official language} of {basin countries} of {White Sea} ?"],"info":{}}
{"id":"train_876","question":"Name a brand owned by SpaceX.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P176 wd:Q193701 . ?sbj wdt:P31 wd:Q431289 }","paraphrases":[],"info":{}}
{"id":"train_877","question":"When did Betty White win the Daytime Emmy Award for Outstanding Game Show Host?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q373895 p:P166 ?s . ?s ps:P166 wd:Q5243447 . ?s pq:P585 ?value }","paraphrases":["Betty White won the Daytime Emmy Award for Outstanding Game Show Host, but when was it?"],"info":{}}
{"id":"train_878","question":"\"Which birthplace of Chris Rock, has a Geotag of 33.45?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4109 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '33.45' ) ) }","paraphrases":["\"Which origin of Chris Shake, contains a Geotag of 33.45?\""],"info":{}}
{"id":"train_881","question":"What is the document published by the National Constituent Assembly that contains the word \"citizen\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49848 . ?sbj wdt:P98 wd:Q876424 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'citizen' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the record distributed by the National Constituent Get together that contains the word \"citizen\" in its name"],"info":{}}
{"id":"train_883","question":"Who replaced Charles Evans Hughes as the Chief Justice of The United States?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q313252 p:P39 ?s . ?s ps:P39 wd:Q11147 . ?s pq:P1365 ?value }","paraphrases":["Give the name of the Chief Justice of the United States who replaced Charles Evans Hughes."],"info":{}}
{"id":"train_884","question":"what is the key incident in the provenance of Glencore?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q169339 wdt:P127 ?X . ?X wdt:P793 ?answer }","paraphrases":["what is the key occurrence within the provenance of Glencore?"],"info":{}}
{"id":"train_885","question":"Tell me written work whose name has the word war in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47461344 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'war' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which written body of work contains the term \"war\" in its name?"],"info":{}}
{"id":"train_887","question":"Name the eponym of volt, who is professor by profession.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q25250 wdt:P138 ?answer . ?answer wdt:P106 wd:Q121594 }","paraphrases":["Name the eponym of volt, who is professor by way of profession."],"info":{}}
{"id":"train_891","question":"Where can you land on the moon with a mass of 73.477?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q495307 wdt:P276 ?answer . ?answer wdt:P2067 ?x FILTER ( contains ( ?x , '73.477' ) ) }","paraphrases":["Where can you arrive on the moon with a mass of 73.477?"],"info":{}}
{"id":"train_892","question":"How many members of the crew are there for John Jellicoe , 1st Earl Jellicoe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q335028 wdt:P5096 ?obj }","paraphrases":["John Jellicoe has how many crew members?"],"info":{}}
{"id":"train_894","question":"Who is the writer of \"The Murder of Roger Ackroyd\", which has been active since 1920-0-0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q224078 wdt:P50 ?answer . ?answer wdt:P2031 ?x FILTER ( contains ( YEAR ( ?x ) , '1920' ) ) }","paraphrases":["Who is the writer of \"The Murder of Roger Ackroyd\", which has been energetic when you consider that 1920-0-0?"],"info":{}}
{"id":"train_895","question":"Which is the sector of the software publisher for Horticultural classification of tulip cultivars?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18402072 wdt:P123 ?X . ?X wdt:P452 ?answer }","paraphrases":["Which is the division of the program distributer for Agricultural classification of tulip cultivars?"],"info":{}}
{"id":"train_896","question":"Who is the candidacy in election for United States Congress?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3602 wd:Q11268 }","paraphrases":[],"info":{}}
{"id":"train_897","question":"What are the linguistic typology and grammatical gender of Spanish language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1321 wdt:P4132 ?ans_1 . wd:Q1321 wdt:P5109 ?ans_2 }","paraphrases":["The Spanish language has what linguistic typology and grammatical gender?"],"info":{}}
{"id":"train_898","question":"Is The New York Times published in Manhattan, New York City?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9684 wdt:P291 wd:Q60 . wd:Q9684 wdt:P291 wd:Q11299 }","paraphrases":["The New York Times is an American newspaper based in New York City with worldwide .... On April 21, 1861, The New York Times began publishing a Sunday edition to offer daily coverage of the Civil War. ... being forced to flee by the Brooklyn City Police, who had crossed the East River to help the Manhattan authorities."],"info":{}}
{"id":"train_899","question":"Who is the child of William Jennings Bryan that has the biological sex of male?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q205282 wdt:P22 ?answer . ?answer wdt:P21 wd:Q6581097 }","paraphrases":["Who is the baby of William Jennings Bryan that has the biological intercourse of male?"],"info":{}}
{"id":"train_902","question":"What kind of instrument is made with foil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q471447 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["What kind of tool is made of foil?"],"info":{}}
{"id":"train_903","question":"What is the reservoir of Lake Winnebago?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1801110 wdt:P201 ?answer }","paraphrases":[],"info":{}}
{"id":"train_904","question":"Which fruit type is the higher taxon of Philodendron edmundoi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15313826 wdt:P171 ?X . ?X wdt:P4000 ?answer }","paraphrases":["What is the fruit type of the higher taxon of Philodendron edmundoi?"],"info":{}}
{"id":"train_907","question":"What is the language official in Federated States of Micronesia having a shortened name of","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q702 wdt:P37 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'инглизсә' ) ) }","paraphrases":["What is the language authentic in Federated States of Micronesia having a shortened title of"],"info":{}}
{"id":"train_908","question":"This sentence makes no sense.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q462132 wdt:P241 ?answer . ?answer wdt:P607 wd:Q768496 }","paraphrases":["This sentence makes no sense."],"info":{}}
{"id":"train_910","question":"What killed John F. Kennedy and who caused him ballistic trauma?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q9696 p:P509 ?s . ?s ps:P509 wd:Q2140674 . ?s pq:P157 ?value1 . ?s pq:P1542 ?value2 }","paraphrases":["How was JFK assassinated and who killed him?"],"info":{}}
{"id":"train_913","question":"Who owns Disneyland and who is it named after?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q181185 wdt:P127 ?ans_1 . wd:Q181185 wdt:P138 ?ans_2 }","paraphrases":["Where did Disneyland get its name and who is the current owner?"],"info":{}}
{"id":"train_914","question":"What are the treaty which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131569 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the arrangement which begin with the letter t"],"info":{}}
{"id":"train_915","question":"Is it true that the caliber of Ehrhardt 7.5 cm Model 1901 equals to 60?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q259036 wdt:P4403 ?obj filter ( ?obj = 60.0 ) }","paraphrases":["Is the Ehrhardt 7.5 cm Model 1901 a 60 caliber?"],"info":{}}
{"id":"train_916","question":"What is the item operated of a B-29 Superfortress?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P121 wd:Q184870 }","paraphrases":[],"info":{}}
{"id":"train_917","question":"Which is the instance of Puduhepa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q268887 wdt:P31 ?answer }","paraphrases":[],"info":{}}
{"id":"train_918","question":"Which is the process function of the measured physical quantity of joule?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q25269 wdt:P111 ?obj . ?obj wdt:P31 wd:Q900800 }","paraphrases":["What is the process function of the quantity of joule measured physically?"],"info":{}}
{"id":"train_919","question":"Is Alex Ferguson is the member of sports team which was started in 1-1-1973?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q44980 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1973' ) ) }","paraphrases":["Is it correct that Alex Ferguson is the member of sports team which was started in 1-1-1973?"],"info":{}}
{"id":"train_921","question":"How many Crusade conflicts were there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P607 wd:Q12546 }","paraphrases":["What is the number of Crusade conflicts?"],"info":{}}
{"id":"train_922","question":"Tell me dyed whose name has the word yan in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29431432 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know colored whose title has the word yan in it."],"info":{}}
{"id":"train_923","question":"Was Helen Keller a member of the Transport Workers Union of America?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q38203 wdt:P463 wd:Q3537776 }","paraphrases":["Did the Transport Workers Union of America have Helen Keller as a member?"],"info":{}}
{"id":"train_924","question":"What game is played by backgammon players and contains the word backgammon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131436 . ?sbj wdt:P3095 wd:Q23929009 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'backgammon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What amusement is played by backgammon players and contains the word backgammon?"],"info":{}}
{"id":"train_925","question":"What is the first described of the ideology of Progressive Party?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7248784 wdt:P1142 ?X . ?X wdt:P61 ?answer }","paraphrases":["What is the primary depicted of the philosophy of Dynamic Party?"],"info":{}}
{"id":"train_926","question":"Which is the HQ location in The Economic Times having Indian reservation in Bombay State?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1954757 wdt:P159 ?answer . ?answer wdt:P131 wd:Q2627082 }","paraphrases":["Which is the HQ area within The Financial Times having Indian reservation in Bombay State?"],"info":{}}
{"id":"train_927","question":"Joseph belongs to what family?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q128267 wdt:P53 ?obj . ?obj wdt:P31 wd:Q8436 }","paraphrases":["Whose family does Joseph belong to?"],"info":{}}
{"id":"train_930","question":"Is Spain's unemployment rate 25?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q29 wdt:P1198 ?obj filter ( ?obj = 25 ) }","paraphrases":["Is Spain's unemployment rate 25?"],"info":{}}
{"id":"train_931","question":"What award did Zadie Smith receive in 2006?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q140052 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2006' ) ) }","paraphrases":["Name the award received by Zadie Smith in 2006."],"info":{}}
{"id":"train_932","question":"What is the language of the people indigenous to chupenme la pija giles ndeahhre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2341 wd:Q36747 . ?sbj wdt:P31 wd:Q25295 }","paraphrases":["What is the indigenous language of the ndeahhre chupenme la pija giles?"],"info":{}}
{"id":"train_934","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1365 wd:Q12560 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["N/A"],"info":{}}
{"id":"train_936","question":"which time of the day contains the word morning in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1260524 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'morning' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which time of the day contains the word morning in their title"],"info":{}}
{"id":"train_937","question":"When Atacama Region has its population 230873.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2120 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '230873.0' ) ) . ?s pq:P585 ?value }","paraphrases":["When did the Atacama region have a population of 23,0873?"],"info":{}}
{"id":"train_938","question":"What are the political philosophy which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179805 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the political logic which begin with the letter w"],"info":{}}
{"id":"train_939","question":"When did Aurangabad become part of the Hyderabad State?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q200713 p:P131 ?s . ?s ps:P131 wd:Q1240096 . ?s pq:P580 ?value }","paraphrases":["When did the Hyderabad State incorporate Aurangabad?"],"info":{}}
{"id":"train_941","question":"what are the mathematical notation which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1140046 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the numerical documentation which begin with the letter s"],"info":{}}
{"id":"train_942","question":"When and where did Victor Hugo marry his spouse, Adele Foucher?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q535 p:P26 ?s . ?s ps:P26 wd:Q2825429 . ?s pq:P580 ?value1 . ?s pq:P2842 ?value2 }","paraphrases":["When and the place did Victor Hugo marry his spouse, Adele Foucher?"],"info":{}}
{"id":"train_943","question":"Tell me about member of sports team of Rinus Michels and number of points/goals/set scored?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q2154479 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }","paraphrases":["Tell me about member of sports crew of Rinus Michels and range of points/goals/set scored?"],"info":{}}
{"id":"train_944","question":"Who is the winner of Friends who has received Primetime Emmy award for Outstanding comedy series?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q79784 p:P166 ?s . ?s ps:P166 wd:Q2110156 . ?s pq:P1346 ?value }","paraphrases":["Which Friends cast member won a Primetime Emmy for Outstanding comedy series?"],"info":{}}
{"id":"train_945","question":"Which is the NLP ID for Georgias?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q179785 wdt:P1695 ?answer }","paraphrases":[],"info":{}}
{"id":"train_946","question":"IS THE SERVICE LIFE OF THE AMBATOVY MINE EQUALS 29","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q16002794 wdt:P5069 ?obj filter ( ?obj = 29 ) }","paraphrases":["Does the service life of the ambatovy mine equal to 29?"],"info":{}}
{"id":"train_947","question":"Is Mary I of England a sibling of Edward VI of England?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q82674 wdt:P3373 wd:Q83229 }","paraphrases":["Is it true that Mary I of England is a sibling of Edward VI of England"],"info":{}}
{"id":"train_948","question":"How many street addresses are located in the {FIFA} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q253414 wdt:P969 ?obj }","paraphrases":["What is the number of street addresses that FIFA contains?"],"info":{}}
{"id":"train_951","question":"Is Scientology the same as Church of Scientology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q131036 wdt:P460 wd:Q1820380 }","paraphrases":["Is Scientology synonymous with Church of Scientology?"],"info":{}}
{"id":"train_952","question":"Who is the nominee for Nevermind, that was produced on 1991-0-0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17444 wdt:P1411 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1991' ) ) }","paraphrases":["Who is the nominee for Nevermind, that was once produced on 1991-0-0?"],"info":{}}
{"id":"train_953","question":"Which videogame studio developped Pong ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1056 wd:Q216293 . ?sbj wdt:P31 wd:Q210167 }","paraphrases":["Which videogame studio developped Pong ?"],"info":{}}
{"id":"train_954","question":"\"Who is {rector} of {Moscow State University}, which {alumna of} is {Saint Petersburg State University} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13164 wdt:P1075 ?answer . ?answer wdt:P69 wd:Q27621 }","paraphrases":["\"Who is {minister} of {Moscow State College}, which {alumna of} is {Holy person Petersburg State College} ?\""],"info":{}}
{"id":"train_956","question":"What is the death location, whose partner city is Jakarta, of Samuel Butler?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q258766 wdt:P20 ?answer . ?answer wdt:P190 wd:Q3630 }","paraphrases":["What is the demise location, whose partner metropolis is Jakarta, of Samuel Butler?"],"info":{}}
{"id":"train_957","question":"TELL ME THE PRECEEDS THAT IMPLIES VAPORIZATION?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6452502 wdt:P1542 ?X . ?X wdt:P156 ?answer }","paraphrases":["TELL ME THE PRECEEDS OF THE VAPORIZATION IMPLIES?"],"info":{}}
{"id":"train_959","question":"What kind of steam engine was invented by james Watt","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P61 wd:Q9041 . ?sbj wdt:P31 wd:Q12760 }","paraphrases":["James Watt invented what kind of steam engine?"],"info":{}}
{"id":"train_960","question":"What is the member of a sports team of Iker Casillas that starts January 1st, 1991?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11584 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1999' ) ) }","paraphrases":["Who became a member of the sports team Iker Casillas on January 1st, 1991?"],"info":{}}
