{"id":"train_5270","question":"Does the total valid votes of the Catalan reqional election of 2015 in Montseny equal to 231?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44874612 wdt:P1697 ?obj filter ( ?obj = 231 ) }","paraphrases":["Is 231 the number of votes of the 2015 Catalan regional election in Montseny?"],"info":{}}
{"id":"train_5272","question":"What is Russia's national anthem?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q34266 wdt:P85 ?obj . ?obj wdt:P31 wd:Q23691 }","paraphrases":["Which is Russia's national anthem?"],"info":{}}
{"id":"train_5273","question":"What did Dwayne Johnson major in at University of Miami and what was his degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q10738 p:P69 ?s . ?s ps:P69 wd:Q738258 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["What was the degree Dwayne Johnson obtained at the University of Miami?"],"info":{}}
{"id":"train_5274","question":"Where is the {filming location} and the {narrative location} of {Reservoir_Dogs} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q72962 wdt:P915 ?ans_1 . wd:Q72962 wdt:P840 ?ans_2 }","paraphrases":["Where was Reservoir Dogs filmed?"],"info":{}}
{"id":"train_5276","question":"Who is the {gene} for {genetic association} of {allergic rhinitis}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2293 wd:Q272436 . ?sbj wdt:P31 wd:Q7187 }","paraphrases":["Who is the {quality} for {hereditary affiliation} of {unfavorably susceptible rhinitis}"],"info":{}}
{"id":"train_5277","question":"WHAT IS THE POSITION OF VEHICLE NORMALLY USED IN POPEMOBILE THAT CONTAINS THE WORD POPE IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4164871 . ?sbj wdt:P3438 wd:Q739445 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pope' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT IS THE POSITION OF VEHICLE NORMALLY USED IN POPEMOBILE THAT CONTAINS THE WORD POPE IN THEIR NAME"],"info":{}}
{"id":"train_5278","question":"What is copy of products for Arcadia Machine & Tool ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4034274 wdt:P1056 ?X . ?X wdt:P144 ?answer }","paraphrases":["What is duplicate of items for Utopia Machine & Device ?"],"info":{}}
{"id":"train_5279","question":"What part of the stomach is the venous return connected to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1029907 wdt:P2789 ?X . ?X wdt:P2289 ?answer }","paraphrases":["What portion of the stomach is the venous return associated to?"],"info":{}}
{"id":"train_5280","question":"What is the Wylie transliteration for Abhidharma, that is labelled as མཛོད་ཕུག?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q612405 p:P1705 ?s . ?s ps:P1705 ?x filter ( contains ( ?x , 'མཛོད་ཕུག' ) ) . ?s pq:P4187 ?value }","paraphrases":["Labelled as མཛོད་ཕུག, what is the Wylie transliteration for Abhidharma?"],"info":{}}
{"id":"train_5281","question":"Name a port city that contains the word \"zuwetina \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2264924 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zuwetina' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which port city in its name containing the word \"zuwetina\""],"info":{}}
{"id":"train_5282","question":"Which is the FootballDatabase.eu ID of Abedi Pele?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q336916 wdt:P3537 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5283","question":"What sports team Adam Gilchist was the member in the year 2008?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q349516 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2008' ) ) }","paraphrases":["In 2008 which sports team was Adam Gilchist a member of?"],"info":{}}
{"id":"train_5284","question":"\"Where is the border of Schaerbeek, and what happens in the Arrondissement of Brussel Capital?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12887 wdt:P47 ?answer . ?answer wdt:P131 wd:Q90870 }","paraphrases":["\"Where is the border of Schaerbeek, and what happens within the Arrondissement of Brussel Capital?\""],"info":{}}
{"id":"train_5286","question":"What are the binary operation which start with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q164307 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which are the binary operations that starts with letter u?"],"info":{}}
{"id":"train_5288","question":"How long was George VI ruled as a monarch?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q280856 p:P39 ?s . ?s ps:P39 wd:Q116 . ?s pq:P1001 ?value }","paraphrases":["How long was the reign of George VI?"],"info":{}}
{"id":"train_5289","question":"What is the diplomatic relation between Tunisia and its official language Tuvan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q948 wdt:P530 ?answer . ?answer wdt:P37 wd:Q34119 }","paraphrases":["What is the diplomatic relation between Tunisia and its professional language Tuvan?"],"info":{}}
{"id":"train_5290","question":"Who started serving as the Zambia head of state on 10-24-1964?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q953 p:P35 ?s . ?s ps:P35 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1964' ) ) }","paraphrases":["Give me the name of the person who has been serving as Zambia head of state since October 1964?"],"info":{}}
{"id":"train_5292","question":"Which UCI ProTeam has the highest budget?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q20638319 . ?ent wdt:P2769 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Give me the UCI ProTeam with the biggest budget."],"info":{}}
{"id":"train_5293","question":"Who is the follower of Charles the Fat who has a noble title as king of Franks?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q150712 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Who is Charles the Fat's follower with a noble title as king of Franks."],"info":{}}
{"id":"train_5294","question":"How many orbits completed by the Sputnik 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q80811 wdt:P1418 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5295","question":"Where is the X-files filming and narrative location?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q2744 wdt:P915 ?ans_1 . wd:Q2744 wdt:P840 ?ans_2 }","paraphrases":["What is the filming and narrative location for the X-files?"],"info":{}}
{"id":"train_5297","question":"Name the currency issued by the Reserve Bank of Australia  that starts with letter A","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28795800 . ?sbj wdt:P562 wd:Q1506724 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the currency issued by the Reserve Bank of Australia that begins with letter A"],"info":{}}
{"id":"train_5300","question":"WHO IS THE HUSBAND OF EDWARD THE CONFESSOR DAUGHTER?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q130005 wdt:P25 ?X . ?X wdt:P26 ?answer }","paraphrases":["WHO IS THE Spouse OF EDWARD THE CONFESSOR DAUGHTER?"],"info":{}}
{"id":"train_5301","question":"What is Dewey Decimal Classification for Canton of Fribourg ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12640 wdt:P1036 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5302","question":"Who created this painting of Charles I of England?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q81506 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q3305213 }","paraphrases":["Who made this portray of Charles I of England?"],"info":{}}
{"id":"train_5306","question":"Who is the perpetrator of the battle of Armin Thiede?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4793536 wdt:P607 ?X . ?X wdt:P710 ?answer }","paraphrases":["Who perpetrated the battle of Armin Thiede?"],"info":{}}
{"id":"train_5308","question":"How to use correct grammar when studying the Hungarian language","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2578 wd:Q9067 . ?sbj wdt:P31 wd:Q8091 }","paraphrases":["When studying the Hungarian language, show how to use the correct grammar."],"info":{}}
{"id":"train_5310","question":"What is the diet that is opposite and named after veganism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q181138 wdt:P461 ?ans_1 . wd:Q181138 wdt:P138 ?ans_2 }","paraphrases":["What is the slim down that's inverse and named after veganism?"],"info":{}}
{"id":"train_5311","question":"Is it true that the magnetic moment of the triton equals 0.000000000000000000000000015046094?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q488424 wdt:P2069 ?obj filter ( ?obj = 0.000000000000000000000000015046094 ) }","paraphrases":["Is Triton's magnetic moment really 0.000000000000000000000000015046094?"],"info":{}}
{"id":"train_5316","question":"What is the DVN id for Anne Frank?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q4583 wdt:P1788 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5317","question":"Who gave the {ideology} of {party} of {Elisenda Alamany} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42963597 wdt:P102 ?X . ?X wdt:P1142 ?answer }","paraphrases":["Who gave { Party } { Elisenda Alamany }'s { ideology }?"],"info":{}}
{"id":"train_5320","question":"What is the native language and also the languages spoken, written or signed by Iggy Pop?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q182665 wdt:P103 ?ans_1 . wd:Q182665 wdt:P1412 ?ans_2 }","paraphrases":["What is Iggy Pop's native language, and what other languages did he speak, write, or sign?"],"info":{}}
{"id":"train_5321","question":"When did Uppsala University start the Gregorian Calendar, was it earlier than 1584","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q185246 p:P571 ?s . ?s ps:P571 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["About the Gregorian Calendar in the Uppsala University, did it start earlier than 1584?"],"info":{}}
{"id":"train_5322","question":"WHAT COLOR IS THE HOUSE","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q464782 p:P180 ?s . ?s ps:P180 wd:Q3947 . ?s pq:P462 ?value1 . ?s pq:P149 ?value2 }","paraphrases":["QUESTION IS THE HOUSE"],"info":{}}
{"id":"train_5325","question":"In what location was Xu Fu born that has the logitude of 118.3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q700302 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '118.3' ) ) }","paraphrases":["In what area was Xu Fu born that has the logitude of 118.3?"],"info":{}}
{"id":"train_5326","question":"What is the interaction of down quark, that has Q48460 of 539.7544?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6745 wdt:P517 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '539.7544' ) ) }","paraphrases":["What is the interaction of down quark, that has Q48460 of 539.7544?"],"info":{}}
{"id":"train_5327","question":"which inner planet has the highest orbital eccentricity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3504248 . ?ent wdt:P1096 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What planet has the highest orbital eccentricity?"],"info":{}}
{"id":"train_5330","question":"who is the member of  Colin Meads sports team and how much matches did they play?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q642380 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["who is the part of Colin Meads sports group and how much matches did they play?"],"info":{}}
{"id":"train_5331","question":"How many awards are given by the Académie française?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1027 wd:Q161806 }","paraphrases":["What are the awards that are given by the Académie française?"],"info":{}}
{"id":"train_5332","question":"Which is the architectural style of postmodernism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P149 wd:Q47783 }","paraphrases":[],"info":{}}
{"id":"train_5335","question":"Who was the designer of the Golden Gate Bridge ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44440 wdt:P287 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was the originator of the Brilliant Door Bridge ?"],"info":{}}
{"id":"train_5337","question":"Is it true that the speed of sound through water is less than 1197.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q283 wdt:P2075 ?obj filter ( ?obj < 1197.6 ) }","paraphrases":["Is the speed of sound in water under 1197.6?"],"info":{}}
{"id":"train_5338","question":"Which is the end and start time of Barnaul which is located in the administrative territorial entity as West Siberian Krai?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q6014 p:P131 ?s . ?s ps:P131 wd:Q4186485 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["Which is the conclusion and begin time of Barnaul which is found within the regulatory regional substance as West Siberian Krai?"],"info":{}}
{"id":"train_5340","question":"Which award did Mike Trout receive and to which league does he belong?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q3090378 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P118 ?value1 . }","paraphrases":["Which award did Mike Trout get hold of and to which league does he belong?"],"info":{}}
{"id":"train_5341","question":"What painting is exhibited at Brown University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P608 wd:Q49114 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["What portray is displayed at Brown University?"],"info":{}}
{"id":"train_5342","question":"When was Pier Luigi Bersani first elected head of the government of Emilia-Romagna?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1263 p:P6 ?s . ?s ps:P6 wd:Q47556 . ?s pq:P580 ?value }","paraphrases":["In which year Pier Luigi Bersani headed the first profile for the government of Emilia-Romagna?"],"info":{}}
{"id":"train_5343","question":"What are the medical examinations for blood sugar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q275157 wdt:P923 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5344","question":"Which is the Argentine deputy votations ID of Cristina Kirchner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q40649 wdt:P4693 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5346","question":"Name an art genre that starts with letter B","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1792379 . ?sbj wdt:P2579 wd:Q4076591 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title an craftsmanship sort that begins with letter B"],"info":{}}
{"id":"train_5348","question":"What borders with Sao Goncalo whose start date is 11-22-1573?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83114 wdt:P47 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1573' ) ) }","paraphrases":["What borders with Sao Goncalo whose begin date is 11-22-1573?"],"info":{}}
{"id":"train_5349","question":"How many films are edited by David Lynch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1040 wd:Q2071 }","paraphrases":["What is the number of films that David Lynch edited?"],"info":{}}
{"id":"train_5350","question":"Which is the medical attribute for the produced sound of the respiratory system?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7891 wdt:P4733 ?obj . ?obj wdt:P31 wd:Q44476427 }","paraphrases":["Which is the therapeutic quality for the delivered sound of the respiratory system?"],"info":{}}
{"id":"train_5354","question":"What is the largest group of species?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P2143 ?obj . ?ent wdt:P105 wd:Q7432 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Give me the largest group of species"],"info":{}}
{"id":"train_5355","question":"John Ford was nominated for the Academy Award for Best Picture for which movie?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q51114 p:P1411 ?s . ?s ps:P1411 wd:Q102427 . ?s pq:P805 ?value }","paraphrases":["The Academy Award for Best Picture went to John Ford for what film?"],"info":{}}
{"id":"train_5356","question":"What country did John Barrymore die in if the city was Los Angeles?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q95034 p:P20 ?s . ?s ps:P20 wd:Q65 . ?s pq:P17 ?value }","paraphrases":["If John Barrymore died in Los Angeles, what country did he die in?"],"info":{}}
{"id":"train_5357","question":"Who is the {cricket field} for {owned by} of {Australian Football League}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P127 wd:Q50783 . ?sbj wdt:P31 wd:Q682943 }","paraphrases":["Who is the {cricket field} for {claimed by} of {Australian Football League}"],"info":{}}
{"id":"train_5359","question":"who is partner of Tyler Perry that has start time is 2009-1-1 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q686301 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["Tyler Perry's partner at the start of 2009-1-1?"],"info":{}}
{"id":"train_5360","question":"\"What is the result of the first aid response to move to fresh air, with regard to talc?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q134583 wdt:P1542 ?answer . ?answer wdt:P2239 wd:Q21010971 }","paraphrases":["\"What is the result, in terms of talks, of the first aid response to move to fresh air?\""],"info":{}}
{"id":"train_5361","question":"For how long was Abram L. Sachar the chairperson for Brandeis University.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q49119 p:P488 ?s . ?s ps:P488 wd:Q4669370 . ?s pq:P582 ?value }","paraphrases":["Abram L Sachar served as Brandeis University for how long?"],"info":{}}
{"id":"train_5362","question":"Where is the next crossing downstream of the London Bridge.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q130206 wdt:P2674 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5364","question":"who next to lake of  the principal area  of university of medical Sciences and technology ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7895723 wdt:P131 ?X . ?X wdt:P206 ?answer }","paraphrases":["who following to lake of the vital range of college of restorative Sciences and innovation ?"],"info":{}}
{"id":"train_5365","question":"What are the diplomatic relations between Brunei and Canada?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q921 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q15949089 }","paraphrases":["Do Brunei and Canada have official political associations?"],"info":{}}
{"id":"train_5367","question":"What is sex or gender for Mick Jagger ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q128121 wdt:P21 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5368","question":"What is work period start for Corín Tellado ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1813126 wdt:P2031 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5369","question":"What is the reference for Louis-Nicolas Davout who was burried in the Pere Lachaise Cemetery?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q158778 p:P119 ?s . ?s ps:P119 wd:Q311 . ?s pq:P965 ?value }","paraphrases":["What are the supporting documents for Louis-Nicolas Davout who was buried in the Pere Lachaise Cemetery?"],"info":{}}
{"id":"train_5370","question":"What is the name of the skyscraper that has an architectural style of neo-futurism and that starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11303 . ?sbj wdt:P149 wd:Q17012219 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the identify of the skyscraper that has an architectural style of neo-futurism and that begins with the letter \"t\"?"],"info":{}}
{"id":"train_5371","question":"The conjugate base of ammonia is what chemical compound?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q4087 wdt:P4149 ?obj . ?obj wdt:P31 wd:Q11173 }","paraphrases":["What chemical compound is the ammonia conjugate base?"],"info":{}}
{"id":"train_5372","question":"Who is the film editor and director of Reservoir Dogs?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q72962 wdt:P1040 ?ans_1 . wd:Q72962 wdt:P57 ?ans_2 }","paraphrases":["Which director also edited Reservoir Dogs?"],"info":{}}
{"id":"train_5373","question":"What is the female version of Józef Piłsudski with the acronym чол?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q885 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'чол' ) ) }","paraphrases":["What is the girl model of Józef Piłsudski with the acronym чол?"],"info":{}}
{"id":"train_5376","question":"Which is the Power of 10 athlete ID for Paula Radcliffe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q233672 wdt:P2090 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5379","question":"What is the sister city of Tirana, that has the county seat for the 4th of August Regime?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19689 wdt:P190 ?answer . ?answer wdt:P1376 wd:Q1358836 }","paraphrases":["What is Tirana's sister city, with the county seat for the August 4th regime?"],"info":{}}
{"id":"train_5380","question":"Which is Tilastopaja female athlete ID for Irena Szewińska?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q229424 wdt:P3882 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5382","question":"Which is the Olympic sport that is an authority of International Biathlon Union and contains the word biathlon in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212434 . ?sbj wdt:P797 wd:Q866910 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'biathlon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the Olympic wear that's an specialist of Universal Biathlon Union and contains the word biathlon in it's name?"],"info":{}}
{"id":"train_5383","question":"who is played by next of Perfect Day ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3503874 wdt:P156 ?X . ?X wdt:P175 ?answer }","paraphrases":["Which was played next to Perfect Day?"],"info":{}}
{"id":"train_5384","question":"What is the start time for Auguste Comte and his spouse Caroline Massin","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q12718 p:P26 ?s . ?s ps:P26 wd:Q1044529 . ?s pq:P580 ?value }","paraphrases":["When was Auguste Comte married to Caroline Massin?"],"info":{}}
{"id":"train_5385","question":"Who was the U.S. Secretary of State after William H. Seward?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q297308 p:P39 ?s . ?s ps:P39 wd:Q14213 . ?s pq:P1365 ?value }","paraphrases":["Who followed William H. Seward as United States Secretary of State?"],"info":{}}
