{"id":"train_22086","question":"Name the binary star with the least parallax whose child astronomical body is Tellar Prime.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q50053 . ?ent wdt:P2214 ?obj . ?ent wdt:P398 wd:Q3983044 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Give the name of the binary star with the least parallax with Tellar Prime as child astronomic body"],"info":{}}
{"id":"train_22087","question":"Tell me physical theory  whose name has the word theory in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9357058 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'theory' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know physical hypothesis whose title has the word hypothesis in it."],"info":{}}
{"id":"train_22088","question":"Name a conglomerate located at the Tokyo Stock Exchange that starts with letter H","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q778575 . ?sbj wdt:P414 wd:Q217475 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an aggregate situated at the Tokyo Stock Exchange that begins with letter H"],"info":{}}
{"id":"train_22093","question":"which  public holiday that starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1197685 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which open occasion that begins with s"],"info":{}}
{"id":"train_22110","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7184 wdt:P3975 ?answer . ?answer wdt:P166 wd:Q20879970 }","paraphrases":["What is it?"],"info":{}}
{"id":"train_22112","question":"Tell me about the phenomenon of spacetime in physics.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1557 wd:Q133327 . ?sbj wdt:P31 wd:Q33104303 }","paraphrases":["Let me know around the wonder of spacetime in physics."],"info":{}}
{"id":"train_22113","question":"Which is the Thésaurus de la désignation des objets mobiliers ID for agricultural machinery?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q16000047 wdt:P4979 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22116","question":"Is it true that the parity of the bromine-74=-1.2","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q18844806 wdt:P1123 ?obj filter ( ?obj = -1.2 ) }","paraphrases":["Is bromine's parity-74 equal to -1.2?"],"info":{}}
{"id":"train_22122","question":"What are the dialect which start with the letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33384 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the dialect that begins with the letter W"],"info":{}}
{"id":"train_22123","question":"What what is excipient has effect by celluslose exposure and which it starts with letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902638 . ?sbj wdt:P1542 wd:Q21173544 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is excipient has effect by celluslose exposure and which it begins with letter c"],"info":{}}
{"id":"train_22124","question":"WHICH IS THE TEMPLE THAT WORLD HERITAGE CRITERIA I AND WHICH CONTAINS THE WORD TEMPLE IN THER NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q44539 . ?sbj wdt:P2614 wd:Q23038972 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'temple' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE TEMPLE THAT WORLD HERITAGE CRITERIA I AND WHICH CONTAINS THE WORD TEMPLE IN THER NAME"],"info":{}}
{"id":"train_22132","question":"Tell me London borough whose name has the word london in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q211690 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'london' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know London borough whose title has the word london in it."],"info":{}}
{"id":"train_22139","question":"What is the inscription in the grave of Maurice de Vlaminck means \"Je n'ai jamais rien demandé La vie m'a tout donné J'ai fait ce que j'ai pu J'ai peint ce que j'ai vu Vlaminck\"?","sparql":"SELECT ?obj WHERE { wd:Q241098 p:P1442 ?s . ?s ps:P1442 ?obj . ?s pq:P1684 ?x filter(contains(?x,'«Je n'ai jamais rien demandé La vie m'a tout donné J'ai fait ce que j'ai pu J'ai peint ce que j'ai vu Vlaminck»')) }","paraphrases":["What is the engraving within the grave of Maurice de Vlaminck implies \"Je n'ai jamais rien demandé La compete m'a tout donné J'ai fait ce que j'ai pu J'ai peint ce que j'ai vu Vlaminck\"?"],"info":{}}
{"id":"train_22147","question":"Tell me building material whose name has the word zuschlagsoff in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q206615 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zuschlagstoff' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me about building material whose name contains the word add - on."],"info":{}}
{"id":"train_22151","question":"What are the operating system which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9135 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the working framework which begin with the letter w"],"info":{}}
{"id":"train_22157","question":"What work has Melchizedek done on the book of the Bible","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q219395 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q29154430 }","paraphrases":["Which parts of this book of the Bible has Melchizedek worked on?"],"info":{}}
{"id":"train_22175","question":"Explain the forsterite of the crystal system.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q415037 wdt:P556 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22189","question":"Tell me structural class of chemical compounds  whose name has the word urate in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47154513 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'urate' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the structural class of chemical compounds in which the word urate is named."],"info":{}}
{"id":"train_22191","question":"Name a file system that contain the word \"zfs \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q174989 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zfs' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a file system in its name containing the word \"zfs\""],"info":{}}
{"id":"train_22195","question":"What is the name of the woman, Luciana Aymar, who has the nickname женский?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q271360 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'женский' ) ) }","paraphrases":["What is the title of the lady, Luciana Aymar, who has the moniker женский?"],"info":{}}
{"id":"train_22196","question":"What are the soil type which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10926413 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the type of soil which start with the letter v"],"info":{}}
{"id":"train_22216","question":"Wanna know what winners of award won beyoncé are?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36153 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Wanna know what victors of grant won beyoncé are?"],"info":{}}
{"id":"train_22217","question":"What are the lunisolar calendar which start with the letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q194235 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the lunisolar calendar which begin with the letter c"],"info":{}}
{"id":"train_22222","question":"What is the Congee spelling of the IPA transcription sʰàmbjoʊʔ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q878624 p:P1705 ?s . ?s ps:P1705 ?obj . ?s pq:P898 ?x filter ( contains ( ?x , 'sʰàmbjoʊʔ' ) ) }","paraphrases":["What is the Congee spelling of the IPA translation sʰàmbjoʊʔ? What did Jackie Stewart win in 1969?"],"info":{}}
{"id":"train_22229","question":"Name a party organized by Vorwärts that starts with letter  D","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6738353 . ?sbj wdt:P2813 wd:Q467800 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a party organized by Vorwärts that begins with letter D"],"info":{}}
{"id":"train_22230","question":"what are the food additive which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q189567 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the nourishment added substance which begin with the letter w"],"info":{}}
{"id":"train_22247","question":"Tell me about meteorological studies of the atmosphere.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q25261 wdt:P2578 ?obj . ?obj wdt:P31 wd:Q8104 }","paraphrases":["Let me know almost meteorological thinks about of the air."],"info":{}}
{"id":"train_22249","question":"Tell me taxon whose name has the word trigonotarbida in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16521 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trigonotarbida' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the taxon whose name has the word trigonotarbida in it?"],"info":{}}
{"id":"train_22254","question":"What are comic book series  which start with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q14406742 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are comedian book arrangement which begin with the letter y"],"info":{}}
{"id":"train_22259","question":"Name a movie written by Akira Kurosawa","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P58 wd:Q8006 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["What's the title of a movie Akira Kurosawa wrote?"],"info":{}}
{"id":"train_22264","question":"Where is the deathplace of Dmitri Shostakovich?  It has several wards including the Perovo District.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q80135 wdt:P20 ?answer . ?answer wdt:P150 wd:Q2364993 }","paraphrases":["Where is the deathplace of Dmitri Shostakovich? It has a few wards counting the Perovo District."],"info":{}}
{"id":"train_22272","question":"tell me about magnitude which the word starts with m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2028919 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know around greatness which the word begins with m"],"info":{}}
{"id":"train_22284","question":"Tell me the channel that first aired part of the series An Adventure in Make Believe.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q38245440 wdt:P179 ?X . ?X wdt:P449 ?answer }","paraphrases":["Tell me the channel in Make Believe that first aired part of the An Adventure series."],"info":{}}
{"id":"train_22285","question":"What are the avion models that start with letter B","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13393265 . ?sbj wdt:P115 wd:Q1783634 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me the names of avion models that start with the letter 'B'"],"info":{}}
{"id":"train_22298","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P35 wd:Q162269 . ?sbj wdt:P31 wd:Q640506 }","paraphrases":["n/a"],"info":{}}
{"id":"train_22299","question":"What is the sovereign state of Lisbon","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q597 wdt:P17 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What is the paramount state of Lisbon"],"info":{}}
{"id":"train_22305","question":"What are the isolated human group which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3117863 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the disconnected human gather which begin with the letter w"],"info":{}}
{"id":"train_22322","question":"what is seven wonders of the ancient world starts with m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q489772 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What the ancient world's seven wonders start with m"],"info":{}}
{"id":"train_22324","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q360388 wdt:P20 ?answer . ?answer wdt:P1792 wd:Q6449587 }","paraphrases":["What is it?"],"info":{}}
{"id":"train_22326","question":"What type of quantum particle has the superpartner of neutrino","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2126 wdt:P2375 ?obj . ?obj wdt:P31 wd:Q22675015 }","paraphrases":["What sort of quantum molecule has the superpartner of neutrino"],"info":{}}
{"id":"train_22332","question":"Tell me the classification scheme that starts with \"t\".","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5962346 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me the classification scheme that begins with \"t\"."],"info":{}}
{"id":"train_22335","question":"What is the significance of the GPS coordinates 48.856577777778 2.3518277777778 in the life of French mathematician Siméon Denis Poisson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190772 wdt:P937 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '48.856577777778 2.3518277777778' ) ) }","paraphrases":["What is the importance of the GPS coordinates 48.856577777778 2.3518277777778 in the lifestyles of French mathematician Siméon Denis Poisson?"],"info":{}}
{"id":"train_22340","question":"Name a movie featuring Alain Delon","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P161 wd:Q106529 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Title a motion picture highlighting Alain Delon"],"info":{}}
{"id":"train_22346","question":"Who is the illustrator for \"A Journey to the Center of the Earth\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q219457 wdt:P110 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22348","question":"What are the cause of death which medical examinations are  computed tomography and which contains the word pneumonia in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1931388 . ?sbj wdt:P923 wd:Q32566 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pneumonia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the reason for death which therapeutic examinations are processed tomography and which contains the word pneumonia in their name"],"info":{}}
{"id":"train_22351","question":"What are the phenomenon which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q483247 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the wonder which begin with the letter s"],"info":{}}
{"id":"train_22355","question":"What branch of philosophy starts with the letter \"p\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22811234 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What department of reasoning begins with the letter \"p\"?"],"info":{}}
{"id":"train_22356","question":"What is the vapor pressure of acetic acid at 68.0˚?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q47512 p:P2119 ?s . ?s ps:P2119 ?obj . ?s pq:P2076 ?x filter ( contains ( ?x , '68.0' ) ) }","paraphrases":["At 68.0 degrees, what is the vapor pressure of acetic acid?"],"info":{}}
{"id":"train_22363","question":"tell me beer style name has the word triple in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1998962 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tripel' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know financial marker whose title has the word soil in it."],"info":{}}
{"id":"train_22368","question":"Tell me solstice whose name has the word solstice in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q123524 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'solstice' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know solstice whose title has the word solstice in it."],"info":{}}
{"id":"train_22369","question":"Tell me music genre whose name has the word swing in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188451 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'swing' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE MUSIC GENRE WHOSE NAME HAS THE WORD SWING IN IT"],"info":{}}
{"id":"train_22373","question":"Tell me stylistic device whose name has the word  iham in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q182545 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'īhām' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know elaborate gadget whose title has the word iham in it."],"info":{}}
{"id":"train_22382","question":"What are the disciplinary repository which start with the letter E","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5281480 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the disciplinary store which begin with the letter E"],"info":{}}
{"id":"train_22388","question":"Give the name of the four electric cars with the longest battery life and capacity.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3658098 . ?ent wdt:P4140 ?obj . ?ent wdt:P31 wd:Q1076882 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which 4 electric cars have the longest battery life and capacity?"],"info":{}}
{"id":"train_22396","question":"Where is the Boa constrictor found?`","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P703 wd:Q215388 }","paraphrases":[],"info":{}}
{"id":"train_22406","question":"What is Oracle Corporation's public company of its parent organization","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P749 wd:Q19900 . ?sbj wdt:P31 wd:Q891723 }","paraphrases":["What is the name of the public company of the parent organization that Oracle Corporation trades under?"],"info":{}}
{"id":"train_22407","question":"Tell me the activity that fabrication method is  planning and which that starts with the letter m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1914636 . ?sbj wdt:P2079 wd:Q309100 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the activity which fabrication method is planning and which starts with letter 'm'?"],"info":{}}
{"id":"train_22408","question":"Tell me a children's game that starts with the letter z.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1509934 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know a children's diversion that begins with the letter z."],"info":{}}
{"id":"train_22418","question":"What what is economic sector patron saint Isidore the Laborer  and which that starts with a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3958441 . ?sbj wdt:P417 wd:Q379685 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the patron saint of the economic sector Isidore the Laborer and that begins with a"],"info":{}}
{"id":"train_22425","question":"which video game genre that contains the word video in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q659563 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'video' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What kind of video game that contains the word video in its name"],"info":{}}
{"id":"train_22428","question":"What is the higher taxonomic class of Springtail; commonly known as \"Шасціногія?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190701 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'Шасціногія' ) ) }","paraphrases":["What is the greater taxonomic classification of Springtail; in many instances acknowledged as \"Шасціногія?\""],"info":{}}
{"id":"train_22434","question":"Give the lowest volume merchant vessel that was shipwrecked.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q848944 . ?ent wdt:P2234 ?obj . ?ent wdt:P793 wd:Q906512 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the merchant ship with the least volume which suffered a shipwreck?"],"info":{}}
{"id":"train_22436","question":"Tell me the degree Venus Williams received when studying at The Art Institute of Fort Lauderdale.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q11578 p:P69 ?s . ?s ps:P69 wd:Q7714375 . ?s pq:P512 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["Tell me the diploma Venus Williams received when analyzing at The Art Institute of Fort Lauderdale."],"info":{}}
{"id":"train_22454","question":"What are the fundamental state of matter which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15831576 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the basic state of affairs that begins with the letter s"],"info":{}}
{"id":"train_22465","question":"who list of Wikimedia list articles for publisher of forbes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P123 wd:Q55185392 . ?sbj wdt:P31 wd:Q33532284 }","paraphrases":["Give me a list of Wikimedia articles by Forbes."],"info":{}}
