{"id":"train_11873","question":"Name a group involved in programming language that starts with letter L","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16887380 . ?sbj wdt:P277 wd:Q165436 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a group worried in programming language that begins with letter L"],"info":{}}
{"id":"train_11875","question":"Where was Alonso Pérez de Guzmán, 7th Duke of Medina Sidonia born that has 67640 inhabitants?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q278954 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '67640' ) ) }","paraphrases":["Where was Alonso Pérez de Guzmán, seventh Duke of Medina Sidonia born that has 67640 inhabitants?"],"info":{}}
{"id":"train_11876","question":"What are the musical which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2743 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the musical which begin with the letter w"],"info":{}}
{"id":"train_11877","question":"Is the minimum frequency of audible sound for goldfish greater than 24?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q123141 wdt:P3387 ?obj filter ( ?obj > 24.0 ) }","paraphrases":["Can goldfish hear anything below 24 hz?"],"info":{}}
{"id":"train_11878","question":"What are the  geometric concept which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21550639 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the geometric concept which begin with the letter s"],"info":{}}
{"id":"train_11880","question":"Tell me the isotope hydrogen which follows deuterium and whose name starts with t?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q466603 . ?sbj wdt:P155 wd:Q102296 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the isotope hydrogen which follows deuterium and whose name starts with t?"],"info":{}}
{"id":"train_11881","question":"What is Irish Sites and Monuments Record ID  for Trinity College Dublin","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q258464 wdt:P4057 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11882","question":"What did Christopher Hitchens write?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P674 wd:Q49081 . ?sbj wdt:P31 wd:Q47461344 }","paraphrases":["What were Christopher Hitchens' written works?"],"info":{}}
{"id":"train_11883","question":"In what environment is the series Darius Force set?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1527988 wdt:P179 ?X . ?X wdt:P400 ?answer }","paraphrases":["In what environment is the arrangement Darius Constrain set?"],"info":{}}
{"id":"train_11885","question":"Whose deathplace was Saint Petersburg, where the tribute to Pictures at an Exhibiltion took place?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q724981 wdt:P825 ?answer . ?answer wdt:P20 wd:Q656 }","paraphrases":["Whose deathplace was Holy person Petersburg, where the tribute to Pictures at an Exhibiltion took place?"],"info":{}}
{"id":"train_11887","question":"What position in government did Franz Dobush have?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41329 p:P6 ?s . ?s ps:P6 wd:Q1446553 . ?s pq:P39 ?value }","paraphrases":["What position in government did Franz Dobush have?"],"info":{}}
{"id":"train_11888","question":"Where are the papers of Queen Victoria at that have the coordinate 52.4145 -4.086846?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9439 wdt:P485 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '52.4145 -4.06846' ) ) }","paraphrases":["Where are the papers of Queen Victoria at that have the coordinate 52.4145 -4.086846?"],"info":{}}
{"id":"train_11889","question":"Was Aileen Wuornos convicted of depraved heart murder and robbery?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q264849 wdt:P1399 wd:Q5260820 . wd:Q264849 wdt:P1399 wd:Q53706 }","paraphrases":["Are depraved heart murder and robbery the crimes that Aileen Wuornos was convicted of?"],"info":{}}
{"id":"train_11890","question":"Which is the BPS language code of Sudanese?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q34002 wdt:P2590 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11891","question":"What child of Ferdinand I died on 1109-7-1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q296863 wdt:P40 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( YEAR ( ?x ) , '1109' ) ) }","paraphrases":["What child of Ferdinand I kicked the bucket on 1109-7-1?"],"info":{}}
{"id":"train_11892","question":"Are Krillin and Son Gohan Dragon Ball Z characters?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q477916 wdt:P674 wd:Q757141 . wd:Q477916 wdt:P674 wd:Q752269 }","paraphrases":["Are Gohan and his father Krillin both Dragon Ball Z characters?"],"info":{}}
{"id":"train_11893","question":"Does the degree of relation of a great grandfather equal 3.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2500621 wdt:P4500 ?obj filter ( ?obj = 3.6 ) }","paraphrases":["Does the degree of connection of a incredible granddad break even with 3.6?"],"info":{}}
{"id":"train_11894","question":"For What Saint-John Perse was in  nomination in the year 1955?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q132684 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1955' ) ) }","paraphrases":["In 1955, what was Saint-John Perse nominated for?"],"info":{}}
{"id":"train_11895","question":"which type of quantum particle that interaction  gravity starts with q","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22675015 . ?sbj wdt:P517 wd:Q11412 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'q' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which type of quantum particle that interaction gravity begins with q"],"info":{}}
{"id":"train_11896","question":"Which is the honorific for the officeholder of Salman of Saudi Arabia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1308 wd:Q367825 . ?sbj wdt:P31 wd:Q1326966 }","paraphrases":[],"info":{}}
{"id":"train_11897","question":"What commercials advertise the menu of In-N-Out Burger?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1205312 wdt:P1056 ?X . ?X wdt:P186 ?answer }","paraphrases":["What commercials do the In - N - Out Burger menu advertise?"],"info":{}}
{"id":"train_11900","question":"Tell me who discovered the Pan  and what are the uses as an object.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q80174 p:P2283 ?s . ?s ps:P2283 wd:Q223557 . ?s pq:P575 ?value1 . ?s pq:P61 ?value2 }","paraphrases":["The pan was discovered by whom and for what uses?"],"info":{}}
{"id":"train_11901","question":"Name a nationalist  political party that contains the word \"patriots \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7278 . ?sbj wdt:P1142 wd:Q6235 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'patriots' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a nationalist political celebration that consists of the phrase \"patriots \" in its identify"],"info":{}}
{"id":"train_11903","question":"tell me  me award that conferred by {National Academy of Television Arts and Sciences  starts with letter a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q618779 . ?sbj wdt:P1027 wd:Q2822443 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["inform me me award that conferred by using {National Academy of Television Arts and Sciences begins with letter a"],"info":{}}
{"id":"train_11905","question":"Is the Bengali writing system Arabic script and Kolezhuthu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9610 wdt:P282 wd:Q1828555 . wd:Q9610 wdt:P282 wd:Q6427218 }","paraphrases":["Is Arabic script and Kolezhuthu how they write in Bengali?"],"info":{}}
{"id":"train_11910","question":"Was Ramadan followed by Eid al-adha?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41662 wdt:P156 wd:Q514400 }","paraphrases":["Was Eid al-adha preceded by Ramadan?"],"info":{}}
{"id":"train_11912","question":"What are theheavy equipment which start with the letter tractor","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q874311 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tractor' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are theheavy gear which begin with the letter tractor"],"info":{}}
{"id":"train_11913","question":"What is David Beckham's MLS player ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q10520 wdt:P2398 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11914","question":"What disease that is treated with epinephrine requires a medical specialist of infectious diseases?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132621 wdt:P2175 ?answer . ?answer wdt:P1995 wd:Q788926 }","paraphrases":["What disorder that is handled with epinephrine requires a medical specialist of infectious diseases?"],"info":{}}
{"id":"train_11916","question":"When did J. Robert Oppenheimer begin the series as Julius?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132537 p:P735 ?s . ?s ps:P735 wd:Q1102114 . ?s pq:P1545 ?value }","paraphrases":["On what date did J. Robert Oppenheimer begin as Julius in the series?"],"info":{}}
{"id":"train_11917","question":"How many teams are with the Toronto Argonauts} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P5138 wd:Q142349 }","paraphrases":["The Toronto Argonauts have how many teams?"],"info":{}}
{"id":"train_11918","question":"What is Jonny Depp's native language what language does he ust for speaking, writing and/or signing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q37175 wdt:P103 ?ans_1 . wd:Q37175 wdt:P1412 ?ans_2 }","paraphrases":["What is Jonny Depp's native language for speaking, writing and/or singing?"],"info":{}}
{"id":"train_11919","question":"Which film did Hayao Miyazaki produce?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1431 wd:Q55400 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Which film did Hayao Miyazaki produce?"],"info":{}}
{"id":"train_11920","question":"When did Lucille Ball and Gary Morton get divorced?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q209662 p:P26 ?s . ?s ps:P26 wd:Q5525629 . ?s pq:P582 ?value }","paraphrases":["What date did Gary Morton and Lucille Ball get divorced?"],"info":{}}
{"id":"train_11921","question":"Who is starring in the film Starfleet Academy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55169598 wdt:P144 ?X . ?X wdt:P161 ?answer }","paraphrases":["Who is featuring within the film Starfleet Foundation?"],"info":{}}
{"id":"train_11924","question":"What is  it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q196627 wdt:P837 ?answer . ?answer wdt:P155 wd:Q12481 }","paraphrases":["What is it?"],"info":{}}
{"id":"train_11925","question":"What is the position held by Benito Pérez Galdós whose electoral district is Guayama?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q189869 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 wd:Q1870997 }","paraphrases":["What office does Benito Perez Galdos hold in the electoral district of Guayama?"],"info":{}}
{"id":"train_11926","question":"Are Pi and its symbol the same?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q167 wdt:P1889 wd:Q168 }","paraphrases":["Is Pi the same as its symbol?"],"info":{}}
{"id":"train_11927","question":"Which is the sRGB color hex triplet for Cambrian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q79064 wdt:P465 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11928","question":"Is the patronage of the Guiuan Airport equal to 1.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q301648 wdt:P3872 ?obj filter ( ?obj = 1.2 ) }","paraphrases":["What is the patronage of the Guiuan Airport?"],"info":{}}
{"id":"train_11929","question":"What language was Hamlet translated into?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P629 wd:Q41567 . ?sbj wdt:P31 wd:Q39811647 }","paraphrases":["What language was Hamlet converted into?"],"info":{}}
{"id":"train_11930","question":"Who is the member of sports team of John Charles who started at 1950-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q312404 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1950' ) ) }","paraphrases":["Give me the name of the member of sports team of John Charles who started at 1950-1-1?"],"info":{}}
{"id":"train_11931","question":"What election has the highest ballots for Thomas Playford?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1076105 . ?ent wdt:P1868 ?obj . ?ent wdt:P991 wd:Q528382 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["When did Thomas Playford get the highest number of ballots?"],"info":{}}
{"id":"train_11932","question":"What is the position of Alain Poher held on 1974-4-3?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12950 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1974' ) ) }","paraphrases":["Of role did Alain Poher take charge on 1974-4-23?"],"info":{}}
{"id":"train_11933","question":"In which twin cities was Prince Aloys Franz de Paula Maria born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q85538 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["In which twin cities was Ruler Aloys Franz de Paula Maria born?"],"info":{}}
{"id":"train_11934","question":"Who are the daughters of Fanny Fern?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3066458 wdt:P22 ?X . ?X wdt:P40 ?answer }","paraphrases":["Did Fanny Fern have any children?"],"info":{}}
{"id":"train_11936","question":"Where was Ansel Adams born and how did he die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q60809 wdt:P509 ?ans_1 . wd:Q60809 wdt:P19 ?ans_2 }","paraphrases":["What was the birth place of Ansel Adams and what was the cause for his death?"],"info":{}}
{"id":"train_11937","question":"Which person was inspired by Arianna Huffington?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q233397 wdt:P941 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Arianna Huffington inspired whom?"],"info":{}}
{"id":"train_11938","question":"How many stock exchanges are there like the New York Stock Exchange?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P414 wd:Q13677 }","paraphrases":["What is the number of stock exchanges that are like the New York Stock Exchange?"],"info":{}}
{"id":"train_11939","question":"Which is the film that is followed by the The Texas Chain Saw Massacre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q886597 wdt:P156 ?obj . ?obj wdt:P31 wd:Q11424 }","paraphrases":["what film comes after the Texas Chain Saw Massacre?"],"info":{}}
{"id":"train_11940","question":"How many cuisines are made with borscht?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q4551 wdt:P2012 ?obj }","paraphrases":["Which is the number of cuisines that are made with borscht?"],"info":{}}
{"id":"train_11941","question":"How many people speak spanish as their first language","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1321 p:P1098 ?s . ?s ps:P1098 ?obj . ?s pq:P518 wd:Q36870 }","paraphrases":["Give me the number of people that speak Spanish as their first language."],"info":{}}
{"id":"train_11942","question":"What is the alumna of Jenny Holzer, who is in the category for employees of the organization Ohio University faculty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q270388 wdt:P69 ?answer . ?answer wdt:P4195 wd:Q6740283 }","paraphrases":["What is Jenny Holzer's alumn, who is in the Ohio University Faculty employee category?"],"info":{}}
{"id":"train_11944","question":"Who gave the{musician} of {previous is} of {Immortal} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13581045 wdt:P155 ?X . ?X wdt:P175 ?answer }","paraphrases":["Who gave { previous is } of { Immortal } to the { musician }?"],"info":{}}
{"id":"train_11945","question":"Which is the metropolitan municipality in Turkey for the twinned administrative body of Lahore?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11739 wdt:P190 ?obj . ?obj wdt:P31 wd:Q2716259 }","paraphrases":[],"info":{}}
{"id":"train_11948","question":"What are the public educational institution of the United States which start with the letter university","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23002039 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'university' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the open instructive institution of the Joined together States which begin with the letter university"],"info":{}}
{"id":"train_11949","question":"What Legal State, with diplomatic relations with Bangladesh has the highest marriage age?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4209223 . ?ent wdt:P3000 ?obj . ?ent wdt:P530 wd:Q902 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Legal State, that has diplomatic relations with Bangladesh has the highest marriage age?"],"info":{}}
{"id":"train_11951","question":"Which is the Online Books Page author ID of Molière?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q687 wdt:P4629 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11952","question":"Who is the organizer and what is location of Australian Open?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q60874 wdt:P664 ?ans_1 . wd:Q60874 wdt:P276 ?ans_2 }","paraphrases":["Which person is responsible for the Australian Open, and where was it held?"],"info":{}}
{"id":"train_11953","question":"Who is the  {art museum} for {archives at} of {Vincent van Gogh}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5582 wdt:P485 ?obj . ?obj wdt:P31 wd:Q207694 }","paraphrases":["Who is the {craftsmanship exhibition hall} for {files at} of {Vincent van Gogh}"],"info":{}}
{"id":"train_11954","question":"Which is the software engine of Team Fortress 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q382108 wdt:P408 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11957","question":"Where did Jarmila Kratochvílová set a record for the 400 metre dash?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q233683 p:P1000 ?s . ?s ps:P1000 wd:Q334734 . ?s pq:P276 ?value }","paraphrases":["When Jarmila Kratochvilova set the record for the 400 metre dash, where was she located?"],"info":{}}
{"id":"train_11958","question":"When did Aleksandr Lyapunov publish his doctoral thesis on the general problem of the stability of motion?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q310788 p:P1026 ?s . ?s ps:P1026 wd:Q55312168 . ?s pq:P577 ?value1 . ?s pq:P184 ?value2 }","paraphrases":["When did Aleksandr Lyapunov publish his PhD thesis on the general issue of motion stability?"],"info":{}}
{"id":"train_11959","question":"What event of the Air Canada occurred on March 18, 1976?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q185339 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1976' ) ) }","paraphrases":["On March 18, 1976, which Air Canada event took place?"],"info":{}}
{"id":"train_11960","question":"Was David Spade educated at Arizona State University and Estrella Mountain Community College?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q298658 wdt:P69 wd:Q670897 . wd:Q298658 wdt:P69 wd:Q5401812 }","paraphrases":["Was David Spade a student at both Arizona State University, and Estrella Mountain Community College?"],"info":{}}
{"id":"train_11961","question":"Who is {diplomatic relation) of {Germany) whose {Human Development Index} is {0.299} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q183 wdt:P530 ?answer . ?answer wdt:P1081 ?x FILTER ( contains ( ?x , '0.299' ) ) }","paraphrases":["Who is {political connection) of {Germany) whose {Human Improvement List} is {0.299} ?"],"info":{}}
{"id":"train_11963","question":"Who was cast as Rocky Horror for The Rocky Horror Picture Show?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q751921 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q13500542 }","paraphrases":["Which actor was cast as Rocky Horror for The Rocky Horror Picture Show?"],"info":{}}
{"id":"train_11969","question":"Did Indian National Congress maintain liberalism and left wing populism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q10225 wdt:P1142 wd:Q6216 . wd:Q10225 wdt:P1142 wd:Q11900614 }","paraphrases":["Were liberalism and left wing populism enacted in the Indian National Congress?"],"info":{}}
{"id":"train_11970","question":"who is the member of Roberto Baggio sports team and how many matches did they play?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q67964 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["who is the member of Roberto Baggio sports activities crew and how many fits did they play?"],"info":{}}
{"id":"train_11971","question":"Which time zone in Campania has daylight saving time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1438 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q36669 }","paraphrases":["What Campania time zone has daylight saving time?"],"info":{}}
{"id":"train_11972","question":"Which is the cardinality of the group of ext4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q283827 wdt:P1164 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11973","question":"Tell me conflict whose name has the word wars in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q180684 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wars' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know struggle whose title has the word wars in it."],"info":{}}
{"id":"train_11974","question":"What is the diplomatic relation of the main topic of the European Union's economy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q720507 wdt:P1269 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is the discretionary connection of the most point of the European Union's economy?"],"info":{}}
{"id":"train_11975","question":"Is the parity of oxygen-13  equal to  -1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1875295 wdt:P1123 ?obj filter ( ?obj = -1 ) }","paraphrases":["Is -1 the parity of oxygen-13?"],"info":{}}
{"id":"train_11976","question":"Cite the temperature along with the pressure point of water when it reaches a triple point.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q106410 . ?s pq:P2076 ?value1 . ?s pq:P2077 ?value2 }","paraphrases":["Cite the temperature along with the stress point of water when it reaches a triple point."],"info":{}}
