{"id":"train_2903","question":"When was the population of Kazan 1.19085e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q900 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '1.19085e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["On what date did the population of Kazan reach 1.19085e+06?"],"info":{}}
{"id":"train_2904","question":"Which role model of Karl Jespers wrote The Origins of Totalitarianism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1327843 wdt:P50 ?answer . ?answer wdt:P737 wd:Q76509 }","paraphrases":["Which function mannequin of Karl Jespers wrote The Origins of Totalitarianism?"],"info":{}}
{"id":"train_2905","question":"What is the domain of compact space?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1568 wd:Q381892 }","paraphrases":[],"info":{}}
{"id":"train_2907","question":"Did Robert Lewanowski play in both the 2018 FIFA World Cup and UEFA Euro 2008?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q151269 wdt:P1344 wd:Q170645 . wd:Q151269 wdt:P1344 wd:Q241864 }","paraphrases":["Was Robert Lewanowsi a player in both the UEFA Euro 2008 and 2018 FIFA World Cup?"],"info":{}}
{"id":"train_2909","question":"Who {follows} and {followed by} of {{Lothair I} has {noble title} as {monarch of Italy}}","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q150735 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Name the kings of Italy that succeeded Lothair I."],"info":{}}
{"id":"train_2910","question":"What is the {point in time} {Lodz} had a {population} of {45200.0}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q580 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '452000.0' ) ) . ?s pq:P585 ?value }","paraphrases":["At what point in time did Lodz have a population of 45,200?"],"info":{}}
{"id":"train_2912","question":"Who is computing of series of Mario Bros.II?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q886260 wdt:P179 ?X . ?X wdt:P400 ?answer }","paraphrases":["Who is computing of arrangement of Mario Bros.II?"],"info":{}}
{"id":"train_2913","question":"What are the factors of therapeutic area for the  {major depressive disorder} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P4044 wd:Q42844 }","paraphrases":["Major Depressive Disorder contains what therapeutic factors area?"],"info":{}}
{"id":"train_2915","question":"what is the Vamps shortest tour","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q14957229 . ?ent wdt:P5027 ?obj . ?ent wdt:P175 wd:Q15042553 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Name the Vamps shortest tour."],"info":{}}
{"id":"train_2919","question":"What was the depth over terrain presented by Good Morning America?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q825946 wdt:P371 ?X . ?X wdt:P2048 ?answer }","paraphrases":["Mention the depth over terrain as shown in Good Morning America."],"info":{}}
{"id":"train_2923","question":"What manga is written in Japanese?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q5287 . ?sbj wdt:P31 wd:Q8274 }","paraphrases":["What manga is Japanese written?"],"info":{}}
{"id":"train_2926","question":"Who is the Muslim ibn al-Hajjaj with a death date of 875?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q140124 p:P570 ?s . ?s ps:P570 ?x filter ( contains ( ?x , '875-5-6' ) ) . ?s pq:P31 ?value }","paraphrases":["Give the Muslim ibn al-Hajjaj who died in 875."],"info":{}}
{"id":"train_2927","question":"Al-Waleed bin Talal is the CEO of what company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P169 wd:Q293679 . ?sbj wdt:P31 wd:Q219577 }","paraphrases":["Which company is the CEO of Al - Waleed bin Talal?"],"info":{}}
{"id":"train_2930","question":"Who owns the New York Times?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9684 wdt:P123 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who possesses the Unused York Times?"],"info":{}}
{"id":"train_2931","question":"What field is Katie Tsuyuki's career?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15930800 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["What area does Katie Tsuyuki work in?"],"info":{}}
{"id":"train_2932","question":"When did the relationship between Alfonso VI of Leon and Castile and Zaida come to an end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q235080 p:P26 ?s . ?s ps:P26 wd:Q2543811 . ?s pq:P582 ?value }","paraphrases":["On what date did Alfonso VI of Leon and Castile and Zaida relationship come to an end?"],"info":{}}
{"id":"train_2934","question":"What are the meteorological phenomenon which start with the letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16332653 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the meteorological phenomenon which begin with the letter W"],"info":{}}
{"id":"train_2935","question":"\"Which streak color Calcite, has a label in sign language stating Csc-blans-spreadthesign.ogv ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q171917 wdt:P534 ?answer . ?answer wdt:P2919 ?x FILTER ( contains ( ?x , 'Csc-blanc-spreadthesign.ogv' ) ) }","paraphrases":["\"Which streak coloration Calcite, has a label in sign language declaring Csc-blans-spreadthesign.ogv ?\""],"info":{}}
{"id":"train_2937","question":"WHICH IS THE GROUP OF ORGANISMS KNOWN BY ONE PARATICULAR COMMON NAME THAT IS LOCOMOTION AND SNAKE LOCOMOTION THAT CONTAINS THE WORD SNAKE IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55983715 . ?sbj wdt:P3512 wd:Q29378923 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'snake' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE Gather OF Life forms KNOWN BY ONE PARATICULAR COMMON Title That's Movement AND Wind Movement THAT CONTAINS THE WORD Wind IN THEIR NAME"],"info":{}}
{"id":"train_2938","question":"What show was Ricky Nelson a cast member?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P161 wd:Q303207 }","paraphrases":["Which show was Ricky Nelson a cast member in?"],"info":{}}
{"id":"train_2939","question":"Which battery storage power station has the max energy storage capacity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q810924 . ?ent wdt:P4140 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What battery power station has the highest amount of energy storage capacity?"],"info":{}}
{"id":"train_2941","question":"What was the population of Bogota in 1775?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2841 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1775' ) ) }","paraphrases":["According to data from 1775, what was the population of Bogota?"],"info":{}}
{"id":"train_2942","question":"What is connecting service of AVE ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1192 wd:Q433671 }","paraphrases":[],"info":{}}
{"id":"train_2943","question":"Tell me posthumous work whose name has the word people in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17518461 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'people' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know after death work whose title has the word individuals in it."],"info":{}}
{"id":"train_2944","question":"Who is the chief esecutive offier of yahoo and when did he start?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q37093 p:P169 ?s . ?s ps:P169 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["When did the chief executive office of Yahoo start and who is he?"],"info":{}}
{"id":"train_2945","question":"WHICH IS THE SHIPWRECKING AS START POINT IN SOUTHAMPTON THAT STARTS WITH R","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q906512 . ?sbj wdt:P1427 wd:Q79848 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE SHIPWRECKING AS START POINT IN SOUTHAMPTON THAT STARTS WITH R"],"info":{}}
{"id":"train_2947","question":"What is the smartphone model with the highest maximum size or capacity whose brand is Motorola?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19723451 . ?ent wdt:P3559 ?obj . ?ent wdt:P1716 wd:Q259011 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which model of Motorola smart phone has the highest maximum size and capacity?"],"info":{}}
{"id":"train_2948","question":"Is Adam Mickiewicz a resident in the area that divides into Vyborgsky District, Saint Petersburg","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q79822 wdt:P551 ?answer . ?answer wdt:P150 wd:Q219907 }","paraphrases":["Is Adam Mickiewicz a resident in the vicinity that divides into Vyborgsky District, Saint Petersburg"],"info":{}}
{"id":"train_2949","question":"When was Shiraz female population of 842454.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6397066 p:P1539 ?s . ?s ps:P1539 ?x filter ( contains ( ?x , '842454.0' ) ) . ?s pq:P585 ?value }","paraphrases":["On which date was Shiraz female population of 842454.0?"],"info":{}}
{"id":"train_2951","question":"What award Katie Ledecky received for Simone Biles?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q137374 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P155 wd:Q7520267 }","paraphrases":["Katie Ledecky accepted which award for Simone Biles?"],"info":{}}
{"id":"train_2954","question":"What was Gregg Toland nominated for in the 14th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q166000 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q508406 }","paraphrases":["Gregg Toland was nominated for which position in the 14th Academy Awards?"],"info":{}}
{"id":"train_2955","question":"Which are the floors below ground of Taipei 101?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q83101 wdt:P1139 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2956","question":"Does Chelsea Manning live in North Bethesda?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q298423 wdt:P551 wd:Q602896 }","paraphrases":["Where does Chelsea Manning Live?"],"info":{}}
{"id":"train_2957","question":"What is the inhabitants of the arrondissement of Apulia ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1447 wdt:P131 ?X . ?X wdt:P1082 ?answer }","paraphrases":["What is the occupants of the arrondissement of Apulia ?"],"info":{}}
{"id":"train_2958","question":"Who is Matt Stone's creative partner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44410 wdt:P1327 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Matt Stone's imaginative partner?"],"info":{}}
{"id":"train_2959","question":"What sports team does Ricardo Zamora play for and how many matched has he played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q296337 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["What sports group does Ricardo Zamora play for and how numerous coordinated has he played?"],"info":{}}
{"id":"train_2960","question":"Name a recurring event happening in the Pershing County that starts with letter B","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15275719 . ?sbj wdt:P131 wd:Q484342 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a repeating occasion happening within the Pershing District that begins with letter B"],"info":{}}
{"id":"train_2961","question":"Within the Vakhsh River, where did Alp Arslan die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q200193 wdt:P20 ?answer . ?answer wdt:P974 wd:Q8526 }","paraphrases":["Inside the Vakhsh Waterway, where did High mountain Arslan die?"],"info":{}}
{"id":"train_2965","question":"What is the god of solar deity, that","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q511056 wdt:P2925 ?answer . ?answer wdt:P398 wd:Q25397719 }","paraphrases":["What is the god of sun based god, that"],"info":{}}
{"id":"train_2966","question":"On March 10, 2008 what was the twinned administrative body of Chihuahua?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q61302 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2008' ) ) }","paraphrases":["What is the Administrative Body of Chihuahua that was twinned?"],"info":{}}
{"id":"train_2967","question":"TELL ME STATE FUNCTION WHOSE NAME HAS THE WORD ZENITVERZOGERUNG IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q230937 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zenitverzögerung' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know STATE Work WHOSE Title HAS THE WORD ZENITVERZOGERUNG IN IT."],"info":{}}
{"id":"train_2971","question":"What is the Gregorian date of Kanishka's death which is possibly earlier than 1584?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q312544 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["What is the date of Kanishka's death in the Gregorian calendar?"],"info":{}}
{"id":"train_2973","question":"What national holiday references The McGuire Sisters?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q303238 wdt:P495 ?X . ?X wdt:P832 ?answer }","paraphrases":["What national occasion references The McGuire Sisters?"],"info":{}}
{"id":"train_2974","question":"When did Sophia Loren received an award as Telegatto?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43252 p:P166 ?s . ?s ps:P166 wd:Q843823 . ?s pq:P585 ?value }","paraphrases":["When did an award named Telegatto was awarded to Sophia Loren?"],"info":{}}
{"id":"train_2975","question":"Where is Glasgow nearest body of water located and where is the administrative territorial entity located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q4093 wdt:P206 ?ans_1 . wd:Q4093 wdt:P131 ?ans_2 }","paraphrases":["What body of water is nearest to Glasgow and where is the administrative territorial entity located?"],"info":{}}
{"id":"train_2976","question":"iWhat are the isotope of hydrogen that contains the word tritium in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q466603 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tritium' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["iWhat are the isotope of hydrogen that contains the word tritium in their title"],"info":{}}
{"id":"train_2978","question":"Was the official symbol of Seattle the bald eagle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5083 wdt:P2238 wd:Q127216 }","paraphrases":["Is the bald eagle the official symbol of Seattle?"],"info":{}}
{"id":"train_2981","question":"Tell me who is found guilty of the head of national government of Pitcairn Islands.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35672 wdt:P6 ?X . ?X wdt:P1399 ?answer }","paraphrases":["Tell me who is found guilty of the head of country wide authorities of Pitcairn Islands"],"info":{}}
{"id":"train_2983","question":"Name the afflicts of ibuprofen","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q186969 wdt:P2175 ?X . ?X wdt:P689 ?answer }","paraphrases":["Title the harrows of ibuprofen"],"info":{}}
{"id":"train_2984","question":"Name the operator administration accountable for RAF Ascension Island","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1968916 wdt:P137 ?X . ?X wdt:P121 ?answer }","paraphrases":["Which entity administers RAF Ascension Island?"],"info":{}}
{"id":"train_2986","question":"Does arsenic-76 half life equal to 1.0942?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2070638 wdt:P2114 ?obj filter ( ?obj = 1.0942 ) }","paraphrases":["Does arsenic-76 half life rise to to 1.0942?"],"info":{}}
{"id":"train_2988","question":"When did Callimachus die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q192417 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1480 wd:Q5727902 }","paraphrases":["When did Callimachus pass away?"],"info":{}}
{"id":"train_2991","question":"How many things were discovered by Naples?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P189 wd:Q2634 }","paraphrases":["What is the number of things discovered by Naples?"],"info":{}}
{"id":"train_2993","question":"Who is the {geography of geographic location} for {geography of topic} of {Arab League}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7172 wdt:P2633 ?obj . ?obj wdt:P31 wd:Q46865913 }","paraphrases":["Where is the Arab League?"],"info":{}}
{"id":"train_2994","question":"What recipe uses pure goat cheese unaltered from the goat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q198815 wdt:P186 ?answer . ?answer wdt:P1582 wd:Q2934 }","paraphrases":["What formula employments immaculate goat cheese unaltered from the goat?"],"info":{}}
{"id":"train_2995","question":"Tell me about this edition of Rolling Stone.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q33511 wdt:P747 ?obj . ?obj wdt:P31 wd:Q3331189 }","paraphrases":["Let me know approximately this version of Rolling Stone."],"info":{}}
{"id":"train_2996","question":"What is the Logo and statement for Eminem's record label.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5608 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2608849 }","paraphrases":["What is the Eminem record label logo and statement."],"info":{}}
{"id":"train_2997","question":"What Marjane Satrapi was nominated for at 2009-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q126633 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["What was Marjane Satrapi nominated for in 2009?"],"info":{}}
{"id":"train_2998","question":"Tell me country within the United Kingdom whose name has the word scotland in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3336843 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'scotland' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me United Kingdom country whose name includes the word scotland."],"info":{}}
{"id":"train_2999","question":"Was Joan Crawford married to Phillip Terry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q40475 wdt:P26 wd:Q1846029 }","paraphrases":["Was the actress Joan Crawford married to a man named Phillip Terry?"],"info":{}}
{"id":"train_3000","question":"What significant event occurred in The Blue Boy on 1-1-1802?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q604761 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1802' ) ) }","paraphrases":["In 1802 what event occurred in the Blue Boy"],"info":{}}
{"id":"train_3001","question":"Where is the publication place of variety that has New York City Council as its council?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q471728 wdt:P291 ?answer . ?answer wdt:P194 wd:Q645195 }","paraphrases":["Where is the ebook area of variety that has New York City Council as its council?"],"info":{}}
{"id":"train_3002","question":"Which head of state has the shortest term length of office?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4164871 . ?ent wdt:P2097 ?obj . ?ent wdt:P279 wd:Q48352 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["The shortest term for head of state is?"],"info":{}}
{"id":"train_3003","question":"Name an historical region studied by egypotology that starts with letter A","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620908 . ?sbj wdt:P2579 wd:Q145903 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an historic area studied by egypotology that starts offevolved with letter A"],"info":{}}
{"id":"train_3006","question":"Who was the perpetrator of the Battle of the Bulge whose abreviated name was ארה\"ב?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q151018 wdt:P710 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'ארה\"ב' ) ) }","paraphrases":["Who was the culprit of the Fight of the Bulge whose abreviated title was ארה\"ב?"],"info":{}}
{"id":"train_3007","question":"Who is the son of Piero the Unfortunate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q262212 wdt:P3373 ?X . ?X wdt:P22 ?answer }","paraphrases":["Who is the child of Piero the Unfortunate?"],"info":{}}
{"id":"train_3008","question":"What is the native language and languages spoken, written, or signed of Robert Plant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q428223 wdt:P103 ?ans_1 . wd:Q428223 wdt:P1412 ?ans_2 }","paraphrases":["What is Robert Plant's native language and languages that are spoken, written or signed?"],"info":{}}
{"id":"train_3011","question":"Which is the Foursquare venue ID of Sequoia National Park?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q152660 wdt:P1968 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3012","question":"WHICH IS THE MOUNTAIN STAGE WITH THE MA\nXIMUM  SPEED","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q20646668 . ?ent wdt:P2052 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What mountain stage has the highest speed?"],"info":{}}
{"id":"train_3013","question":"who role model of words by dónde estás corazón?} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2728376 wdt:P676 ?X . ?X wdt:P737 ?answer }","paraphrases":["who was the inspiration of the words of dónde estás?"],"info":{}}
{"id":"train_3014","question":"What is the name of an algorithm that starts with the letter s.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8366 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of an calculation that begins with the letter s."],"info":{}}
{"id":"train_3017","question":"tell me geological process name has  word subduction in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11827301 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'subduction' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the name of the geological process that contaons the word subduction ."],"info":{}}
{"id":"train_3021","question":"Who is the writer for Nico Robin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1190653 wdt:P1441 ?X . ?X wdt:P50 ?answer }","paraphrases":["What is the name of Nico Robin's writer?"],"info":{}}
{"id":"train_3022","question":"When is the basic commencement date?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42979 wdt:P737 ?X . ?X wdt:P571 ?answer }","paraphrases":["which of the towns has endemism of verdant seadragon?"],"info":{}}
{"id":"train_3023","question":"Is the operating temperature of TACLANE-10G less than 30.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q55236031 wdt:P5066 ?obj filter ( ?obj < 30.0 ) }","paraphrases":["Is TACLANE-10G's operating temperature lower than 30.0?"],"info":{}}
