{"id":"train_11485","question":"When did Park Geun-hye started to study at Sacred Heart Girls' High School and when did she leave?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q138048 p:P69 ?s . ?s ps:P69 wd:Q21577152 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When did Park Geun-hye started to study at Sacred Heart Girls' High School and when did she leave?"],"info":{}}
{"id":"train_11487","question":"What stepper motor has the least torque?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q235790 . ?ent wdt:P2230 ?obj . ?ent wdt:P31 wd:Q235790 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What stepper engine has the slightest torque?"],"info":{}}
{"id":"train_11490","question":"What is the FAI ID of Neil Armstong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1615 wdt:P4556 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11494","question":"Name the submarine power cable with the least throughput whose CEO is Nasos Ktorides","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4117949 . ?ent wdt:P2957 ?obj . ?ent wdt:P169 wd:Q47459088 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which of CEO NAsos Ktorides' submarine power cables has the least throughput?"],"info":{}}
{"id":"train_11495","question":"Tell me horse breed  whose name has the word zangersheide in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1160573 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zangersheide' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the breed of horses whose name includes the word zangersheide."],"info":{}}
{"id":"train_11497","question":"What is the {sexual orientation} and the {sex or gender} of {Deadpool} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1631090 wdt:P91 ?ans_1 . wd:Q1631090 wdt:P21 ?ans_2 }","paraphrases":["What is the {sexual introduction} and the {sex or sexual orientation} of {Deadpool} ?"],"info":{}}
{"id":"train_11498","question":"What is the athlete Zinedine Zidane's business","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1835 wdt:P54 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":["What's the business of athlete Zinedine Zidane?"],"info":{}}
{"id":"train_11499","question":"Tell me about talk show for presenter of Ellen DeGeneres?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P371 wd:Q483325 . ?sbj wdt:P31 wd:Q622812 }","paraphrases":[],"info":{}}
{"id":"train_11500","question":"When did George Harrison leave the Beatles?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2643 p:P361 ?s . ?s ps:P361 wd:Q1299 . ?s pq:P582 ?value }","paraphrases":["At what time did George Harrison go away from the Beatles?"],"info":{}}
{"id":"train_11504","question":"What is list of characters from narrative of Mario ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12379 wdt:P1441 ?X . ?X wdt:P1881 ?answer }","paraphrases":["What is the list of Mario's narrative characters?"],"info":{}}
{"id":"train_11505","question":"Which films did screenwriter Andrew Lloyd Webber produce?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P58 wd:Q180975 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Which movies did screenwriter Andrew Lloyd Webber produce?"],"info":{}}
{"id":"train_11506","question":"What is the Japanese word for anime?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q5287 . ?sbj wdt:P31 wd:Q1107 }","paraphrases":["What is the Japanese word for anime?"],"info":{}}
{"id":"train_11511","question":"Name an actor in Friends","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q79784 wdt:P161 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Title an performing artist in Friends"],"info":{}}
{"id":"train_11513","question":"Is the river mouth of Esperanto Island less than 802.56 miles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12349285 wdt:P2148 ?obj filter ( ?obj < 802.56 ) }","paraphrases":["Is the stream mouth of Esperanto Island less than 802.56 miles?"],"info":{}}
{"id":"train_11517","question":"Palauli forms part of the capital of Apia, give the complete place name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36260 wdt:P1376 ?answer . ?answer wdt:P150 wd:Q1147216 }","paraphrases":["Palauli shapes portion of the capital of Apia, deliver the total put name."],"info":{}}
{"id":"train_11518","question":"What is the award received by Ansel Adams followed by Lennart Nilsson?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q60809 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P155 wd:Q568506 }","paraphrases":["Ansel Adams was presented with which award before Lennart Nilsson?"],"info":{}}
{"id":"train_11519","question":"What award did Yaşar Kemal receive from Günter Grass?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q327142 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P823 wd:Q6538 }","paraphrases":["When Yasar Kemal was presented with an award from Gunter Grass, which award was it?"],"info":{}}
{"id":"train_11522","question":"WHICH IS THE SCIENCE MUSEUM WITH THE MAXIMUM VISITORS PER YEAR","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q588140 . ?ent wdt:P1174 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What science museum has the most visitors every year?"],"info":{}}
{"id":"train_11523","question":"Name the nuclear weapons test with the lowest explosive energy equivalent whose country of origin is soviet union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q210112 . ?ent wdt:P2145 ?obj . ?ent wdt:P495 wd:Q15180 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What nuclear weapons test has the lowest explosive energy equivalent in the Soviet Union?"],"info":{}}
{"id":"train_11524","question":"What employer did Gilles Deleuze work at until 1964?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q184226 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1964' ) ) }","paraphrases":["Until 1964, who was Gilles Deleuze employed by?"],"info":{}}
{"id":"train_11525","question":"What is the script directionality of Braille","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q79894 wdt:P1406 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11528","question":"Which is the retail chain that is founded by the Verizon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P112 wd:Q467752 . ?sbj wdt:P31 wd:Q507619 }","paraphrases":[],"info":{}}
{"id":"train_11532","question":"What city in New York County is the birth city of Jon Finkel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6270695 wdt:P19 ?answer . ?answer wdt:P150 wd:Q500416 }","paraphrases":["What city in Modern York Province is the birth city of Jon Finkel?"],"info":{}}
{"id":"train_11533","question":"What is the place of birth of Alvin Ailey located in the administrative territorial entity known as Rogers?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q449037 p:P19 ?s . ?s ps:P19 wd:Q978155 . ?s pq:P131 ?value }","paraphrases":["Where was Alvin Alley born at in the administrative territorial entity known as Rogers?"],"info":{}}
{"id":"train_11534","question":"What is the avionics of radar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P878 wd:Q47528 }","paraphrases":[],"info":{}}
{"id":"train_11535","question":"What are weapon studio which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q728 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the gun studio starting with the letter z"],"info":{}}
{"id":"train_11537","question":"TELL ME THE FAMOUS WORK WRITTEN BY MULE BONE?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6933876 wdt:P50 ?X . ?X wdt:P800 ?answer }","paraphrases":["Let Me know THE Celebrated WORK Composed BY Donkey BONE?"],"info":{}}
{"id":"train_11539","question":"In what {city} did {Sigmund Freud} die?  {Hint: its partner city is Zagreb.}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9215 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1435 }","paraphrases":["In what {city} did {Sigmund Freud} die? {Hint: its associate metropolis is Zagreb.}"],"info":{}}
{"id":"train_11541","question":"What country was Def_Leppard formed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q182890 wdt:P740 ?ans_1 . wd:Q182890 wdt:P495 ?ans_2 }","paraphrases":["Def_Leppard was created in what country?"],"info":{}}
{"id":"train_11542","question":"When did Havana have a twinned administrative body of Cusco?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1563 p:P190 ?s . ?s ps:P190 wd:Q5582862 . ?s pq:P580 ?value }","paraphrases":["When was Havana's partner city Cusco?"],"info":{}}
{"id":"train_11543","question":"What community of Belgium uses Dutch as its official language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q7411 . ?sbj wdt:P31 wd:Q89934 }","paraphrases":[],"info":{}}
{"id":"train_11544","question":"Which is the ISBN publisher prefix for DC Comics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2924461 wdt:P3035 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11546","question":"Who are the kids of Vsevolod the Big Nest whose location of burial is Dormition Cathedral?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q348689 wdt:P40 ?answer . ?answer wdt:P119 wd:Q775487 }","paraphrases":["Who are the kids of Vsevolod the Big Nest whose area of burial is Dormition Cathedral?"],"info":{}}
{"id":"train_11549","question":"What government of Navarre began on 9-18-1996?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4018 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1996' ) ) }","paraphrases":["Name the government of Navarre began on 9-18-1996"],"info":{}}
{"id":"train_11552","question":"What is the part applies to Paraguay River which has coordinate location as -27.290027966206 -58.60725402832?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q179396 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '-27.290027966206 -58.60725402832' ) ) . ?s pq:P518 ?value }","paraphrases":["If the coordinate location is 27.290027966206 -58.60725402832, what part applies to the Paraguay River?"],"info":{}}
{"id":"train_11554","question":"Which business enterprise has the most total liabilities?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4830453 . ?ent wdt:P2138 ?obj . ?ent wdt:P31 wd:Q4830453 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which business has the greatest total liabilities?"],"info":{}}
{"id":"train_11555","question":"In the tetrahedral group, does the cardinality of the group equal to 14.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q45034192 wdt:P1164 ?obj filter ( ?obj = 14.4 ) }","paraphrases":["Is cardinality of the tetrahedral group 14.4?"],"info":{}}
{"id":"train_11557","question":"What is the name of the stockholder who worked for Ray Kurzweil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q298341 wdt:P108 ?X . ?X wdt:P127 ?answer }","paraphrases":["Who is the name of the stockholder who worked for Ray Kurzweil?"],"info":{}}
{"id":"train_11558","question":"Was Patricia Arquette nominated for an academy award and golden raspberry award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q215976 wdt:P1411 wd:Q106301 . wd:Q215976 wdt:P1411 wd:Q641316 }","paraphrases":["Did Patricia Arquette ever receive a nomination for an academy and golden raspberry award?"],"info":{}}
{"id":"train_11559","question":"In what year did William Bateson give a Croonian Lecture?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q297302 p:P166 ?s . ?s ps:P166 wd:Q1192912 . ?s pq:P585 ?value }","paraphrases":["When was it that William Bateson gave a Croonian Lecture?"],"info":{}}
{"id":"train_11560","question":"Who's the employer's at Nissan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P108 wd:Q20165 }","paraphrases":["Give the name of the employer at Nissan."],"info":{}}
{"id":"train_11562","question":"What is the had reason of revolutions of 1917-1923 between central powers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7318933 wdt:P828 ?answer . ?answer wdt:P710 wd:Q152283 }","paraphrases":["What was the reason for the 1917 - 1923 revolutions between central powers?"],"info":{}}
{"id":"train_11564","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P118 wd:Q855988 . ?sbj wdt:P31 wd:Q14645593 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_11567","question":"Did the brother of Matilda of Habsburg have kids?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2635513 wdt:P3373 ?X . ?X wdt:P40 ?answer }","paraphrases":["How many offsprings did the brother of Matilda of Habsburg have?"],"info":{}}
{"id":"train_11568","question":"Which is the SecondHandSongs artist ID of George Harrison?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2643 wdt:P2909 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11569","question":"What are the epic poem which start with the letter tambuka","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q37484 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tambuka' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the epic sonnet which begin with the letter tambuka"],"info":{}}
{"id":"train_11570","question":"What is the sovereign state of Oslo","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P150 wd:Q585 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["What is the sovereign territory of Oslo"],"info":{}}
{"id":"train_11571","question":"Who died in the writers of Philosophical Investigations?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q772496 wdt:P50 ?X . ?X wdt:P20 ?answer }","paraphrases":["Who died before publishing his Philosophical Investigations?"],"info":{}}
{"id":"train_11573","question":"For what One Direction was in nominated for in the year of 2013?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q146027 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["One Direction was nominated for which award in 2013?"],"info":{}}
{"id":"train_11574","question":"Are the beats per minute of Dance of Deception less than 0.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q54913427 wdt:P1725 ?obj filter ( ?obj < 0.0 ) }","paraphrases":["Are the beats per diminutive of Move of Double dealing less than 0.0?"],"info":{}}
{"id":"train_11575","question":"Who is Paulo Coelho's favorite player that has a career as a lyricist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12881 wdt:P737 ?answer . ?answer wdt:P106 wd:Q822146 }","paraphrases":["Who is Paulo Coelho's favored player that has a profession as a lyricist?"],"info":{}}
{"id":"train_11578","question":"What is Christiane Amanpour's academic degree and major at University of Rhode Island?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q236939 p:P69 ?s . ?s ps:P69 wd:Q1641788 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["Identify the degree and major of Christiane Amanpour while at University of Rhode Island."],"info":{}}
{"id":"train_11579","question":"When did Bettie Page die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q61898 wdt:P20 ?X . ?X wdt:P421 ?answer }","paraphrases":["When did Bettie Page bite the dust?"],"info":{}}
{"id":"train_11581","question":"What superhero is present in Sonic the Hedgehog?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q1046812 . ?sbj wdt:P31 wd:Q188784 }","paraphrases":[],"info":{}}
{"id":"train_11583","question":"Who are the daughters of the wives of Hans Rehmann?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q118740 wdt:P26 ?X . ?X wdt:P22 ?answer }","paraphrases":["Who is the daughters of the wives of Hans Rehmann?"],"info":{}}
{"id":"train_11586","question":"WHAT IS THE BORN OF ANNE ENRIGHT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q73176 wdt:P19 ?answer . ?answer wdt:P190 wd:Q1780 }","paraphrases":["WHAT IS THE BORN OF INSTRUCTION"],"info":{}}
{"id":"train_11587","question":"How many anthems are for Bulgaria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q219 wdt:P85 ?obj }","paraphrases":["Which is the number of anthems for Bulgaria?"],"info":{}}
{"id":"train_11588","question":"What is Monica Vitti's National Portrait Gallery ID in London?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q106881 wdt:P1816 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11590","question":"In which year range did James Callaghan gained power as the Member of the 49th Parliament of the United Kingdom ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q9576 p:P39 ?s . ?s ps:P39 wd:Q41582621 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["In which year vary did James Callaghan gained strength as the Member of the forty ninth Parliament of the United Kingdom ?"],"info":{}}
{"id":"train_11591","question":"What is art work of paul klee famous books ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44007 wdt:P800 ?X . ?X wdt:P195 ?answer }","paraphrases":["What is craftsmanship work of paul klee celebrated books ?"],"info":{}}
{"id":"train_11592","question":"What time zone is the continent of Levant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q81483 wdt:P30 ?X . ?X wdt:P421 ?answer }","paraphrases":["What time zone is the landmass of Levant?"],"info":{}}
{"id":"train_11593","question":"What drug treats inflammation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2175 wd:Q101991 . ?sbj wdt:P31 wd:Q11173 }","paraphrases":["What sedate treats inflammation?"],"info":{}}
{"id":"train_11595","question":"Lactobacillus belongs to which taxon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1061596 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 }","paraphrases":["Lactobacillus has a place with which taxon?"],"info":{}}
{"id":"train_11596","question":"What is notation of Earth ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2 wdt:P913 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11601","question":"What is the concept developed by Niklas Luhman and which has the word \"society\" in their name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q151885 . ?sbj wdt:P3342 wd:Q57238 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'society' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is Niklas Luhman's concept that has the word \"society\" in its name?"],"info":{}}
{"id":"train_11602","question":"Which is the taxon for the taxon source of milk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1672 wd:Q8495 . ?sbj wdt:P31 wd:Q16521 }","paraphrases":["Give me the name of the taxon for the taxon source of milk."],"info":{}}
{"id":"train_11604","question":"Where is the {filming location} and the {narrative location} of {Forrest_Gump} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q134773 wdt:P915 ?ans_1 . wd:Q134773 wdt:P840 ?ans_2 }","paraphrases":["What are all the locations in which the filming of Forrest Gump took place?"],"info":{}}
{"id":"train_11606","question":"When did Max Müller receive the Bavarian Maximilian Order for Science and Art?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q55068911 p:P166 ?s . ?s ps:P166 wd:Q565030 . ?s pq:P585 ?value }","paraphrases":["When was the Bavarian Maximilian Order for Science and Art awarded to Max Müller?"],"info":{}}
{"id":"train_11608","question":"Which is located in or next to body of water of Saipan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q51679 wdt:P206 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11609","question":"What is the longitude and latitude of the atomic bombing that happened in Nagasaki?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q488 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P276 wd:Q38234 }","paraphrases":["Give the intersecting coordinates of the atomic bombing that happened in Nagasaki."],"info":{}}
{"id":"train_11612","question":"What is the municipal council in Finland with the lowest number of seats whose applies to jurisdiction is Lappajärvi ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q191893 . ?ent wdt:P1342 ?obj . ?ent wdt:P1001 wd:Q6020 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Of the municipal councils in Finland with jurisdiction in Lappajärvi, which has the lowest number of seats?"],"info":{}}
{"id":"train_11613","question":"What kind of horse is an example of Equus caballus?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q726 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P642 wd:Q10758650 }","paraphrases":["Which is the best comparative horse as  an example of Equus caballus?"],"info":{}}
{"id":"train_11614","question":"Which taxon has cinnamon as a component for its fabrication ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28165 wdt:P1582 ?X . ?X wdt:P171 ?answer }","paraphrases":["Which taxon has cinnamon as a component for its creation ?"],"info":{}}
{"id":"train_11617","question":"Which {applies to territorial jurisdiction} of {holds position} of {Septimius Severus} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1442 wdt:P39 ?X . ?X wdt:P1001 ?answer }","paraphrases":["Which {applies to regional ward} of {holds position} of {Septimius Severus} ?"],"info":{}}
{"id":"train_11619","question":"What is the largest County Wexford constituency?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11204 . ?ent wdt:P4253 ?obj . ?ent wdt:P1001 wd:Q184599 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["In Wexford constituency what is the largest County?"],"info":{}}
{"id":"train_11620","question":"How many people have died on Terceira Island?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P20 wd:Q215074 }","paraphrases":["What number of people passed away on Terceira Island?"],"info":{}}
{"id":"train_11623","question":"Is it true that the students count of the Protestant College of Tabor is less than 69.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1380215 wdt:P2196 ?obj filter ( ?obj < 69.6 ) }","paraphrases":["Are there really fewer than 69.6 students in the Protestant College of Tabor?"],"info":{}}
{"id":"train_11624","question":"Which is the connecting line of Stockholm metro?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P81 wd:Q272926 }","paraphrases":[],"info":{}}
{"id":"train_11626","question":"Who replaces J.J. Thompson as the President of the Royal Society?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47285 p:P39 ?s . ?s ps:P39 wd:Q55713110 . ?s pq:P1365 ?value }","paraphrases":["Tell me who took the place of J. J. Thompson as Royal society president."],"info":{}}
{"id":"train_11632","question":"Who was the inventor and what is the history of the Periodic table?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q10693 wdt:P2184 ?ans_1 . wd:Q10693 wdt:P61 ?ans_2 }","paraphrases":["What is the history and inventor's name of the Periodic table?"],"info":{}}
