{"id":"train_14278","question":"What is David Hockney responsible for","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P710 wd:Q159907 . ?sbj wdt:P31 wd:Q72823 }","paraphrases":["What is David Hockney dependable for"],"info":{}}
{"id":"train_14279","question":"Which writer was Salman Rushdie's main influence ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44306 wdt:P737 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Which writer influenced Salman Rushdie the most?"],"info":{}}
{"id":"train_14281","question":"Was Lockheed_Martin_F-22_Raptor manufacturer Boeing Defense, Space & Security and United States Air Force ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q133324 wdt:P176 wd:Q795324 . wd:Q133324 wdt:P176 wd:Q11223 }","paraphrases":["Did Boeing work with the US Air Force to manufacture the Lockheed Martin F-22?"],"info":{}}
{"id":"train_14283","question":"What type of mathematical function starts with the letter \"r\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47279819 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What sort of scientific work begins with the letter \"r\"?"],"info":{}}
{"id":"train_14284","question":"Is it true that the genome size of the Triticum aestivum equals to 16000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q161098 wdt:P2143 ?obj filter ( ?obj = 16000 ) }","paraphrases":["Does the genome sized of the Triticum aestivum equals to 16000?"],"info":{}}
{"id":"train_14285","question":"What data controller contains the word \"uber\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q59859818 . ?sbj wdt:P1056 wd:Q61058590 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'uber' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which data controller contains in its name the word \"uber?\""],"info":{}}
{"id":"train_14288","question":"What produces of made by Sansa Fuze?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7418955 wdt:P176 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What are the products made by Sansa Fuze?"],"info":{}}
{"id":"train_14289","question":"What is the Chemins de mémoire ID for the Eiffel tower?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q243 wdt:P2382 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14291","question":"What are the medical procedure which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q796194 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the medical procedure which begin with the letter v"],"info":{}}
{"id":"train_14293","question":"What is input method for Metroid Prime ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1765733 wdt:P479 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14294","question":"Name the property measured by Cattell Culture Fair III that contains the word \"intelligence\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q937228 . ?sbj wdt:P1880 wd:Q1143555 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'intelligence' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title the property measured by Cattell Culture Reasonable III that contains the word \"insights\" in its name"],"info":{}}
{"id":"train_14297","question":"What the name of a university that contains the word \"university\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3918 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'university' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What the title of a college that contains the word \"college\" in its name?"],"info":{}}
{"id":"train_14300","question":"Which is {pronunciation audio} of {victim} of {Suez Crisis} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49101 wdt:P710 ?X . ?X wdt:P443 ?answer }","paraphrases":["Which is {elocution sound} of {casualty} of {Suez Emergency} ?"],"info":{}}
{"id":"train_14301","question":"Which artist inspired the Tempest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1057313 wdt:P1877 ?X . ?X wdt:P800 ?answer }","paraphrases":["Name the artist inspired by Tempest"],"info":{}}
{"id":"train_14302","question":"Benzene has how many time-weighted average exposure limits?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q2270 wdt:P2404 ?obj }","paraphrases":["How many time-weighted average exposure limits does Benzene have?"],"info":{}}
{"id":"train_14304","question":"How many residence are by Philadelphia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P551 wd:Q1345 }","paraphrases":["What is the total number of residences in the Philadelphia area?"],"info":{}}
{"id":"train_14305","question":"What what is type of sport indigenous by Celt and also which starts with letter h","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q31629 . ?sbj wdt:P2341 wd:Q35966 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is kind of sport indigenous by way of Celt and additionally which begins with letter h"],"info":{}}
{"id":"train_14306","question":"What is the name of the husbands of Showrunner in the Walking Dead?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q232737 wdt:P1431 ?X . ?X wdt:P26 ?answer }","paraphrases":["What is the title of the spouses of Showrunner within the Strolling Dead?"],"info":{}}
{"id":"train_14307","question":"when did Zarah Leander married Nils Leander?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q46479 p:P26 ?s . ?s ps:P26 wd:Q5942327 . ?s pq:P582 ?value }","paraphrases":["Give the date Zarah Leander married Nils Leander."],"info":{}}
{"id":"train_14308","question":"What is the code for the INSEE region of Réunion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q17070 wdt:P2585 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14309","question":"Which museum has the history and rememberence of Jefferson Davis.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P547 wd:Q162269 . ?sbj wdt:P31 wd:Q33506 }","paraphrases":["The history of Jefferson Davis is kept in which museum?"],"info":{}}
{"id":"train_14311","question":"What did the pupil of Mencius die of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q188903 wdt:P1066 ?X . ?X wdt:P570 ?answer }","paraphrases":["What did the student of Mencius die of?"],"info":{}}
{"id":"train_14313","question":"Name a famous invasion that starts with letter m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q467011 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a famous invasion beginning with letter m"],"info":{}}
{"id":"train_14314","question":"How many creators are there for quantum mechanics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q944 wdt:P170 ?obj }","paraphrases":["Which is the number of creators that are there for quantum mechanics?"],"info":{}}
{"id":"train_14315","question":"What genre are the songs in Frozen, the Original Motion Picture's Soundtrack?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15530976 wdt:P658 ?X . ?X wdt:P136 ?answer }","paraphrases":["What class are the tunes in Solidified, the Initial Movement Picture's Soundtrack?"],"info":{}}
{"id":"train_14317","question":"Who, employed by Fritz Haber, has director Eberhard Umbach?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57075 wdt:P108 ?answer . ?answer wdt:P1037 wd:Q77995 }","paraphrases":["Who, utilized by Fritz Haber, has executive Eberhard Umbach?"],"info":{}}
{"id":"train_14318","question":"Who led the Piedmont government that began on 2014-5-26?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1216 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["Who was in charge of the Piedmont government that started on 2014-5-26?"],"info":{}}
{"id":"train_14319","question":"Which is the human action that starts with letter z?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q451967 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the human activity that begins with letter z?"],"info":{}}
{"id":"train_14320","question":"What is MythBusters' location narrative and outcome in the 1906 San Francisco earthquake?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q486844 wdt:P840 ?answer . ?answer wdt:P793 wd:Q211386 }","paraphrases":["What does Mythbusters have to say about the 1906 San Francisco earthquake?"],"info":{}}
{"id":"train_14328","question":"Which Stuttgart Open has the highest prize money?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q130222 . ?ent wdt:P2121 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["The Stuttgart Open with the highest price money is?"],"info":{}}
{"id":"train_14329","question":"What is the start time for Freeman Dyson award receipt for Josiah Willard Gibbs lectureship?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q153717 p:P166 ?s . ?s ps:P166 wd:Q1522873 . ?s pq:P585 ?value }","paraphrases":["What time does Freeman Dyson award receipt for Josiah Willard Gibbs lectureship start?"],"info":{}}
{"id":"train_14331","question":"What was the member of the Holy See on 1973-6-25?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q159583 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1973' ) ) }","paraphrases":["Who was the member of the Holy See on 1973-6-25?"],"info":{}}
{"id":"train_14332","question":"What award nomination did Morgan Freeman receive, that had been previously won by Walter Matthau?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q48337 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q202172 }","paraphrases":["What grant designation did Morgan Freeman get, that had been already won by Walter Matthau?"],"info":{}}
{"id":"train_14334","question":"What literary genre starts with the letter \"s\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223393 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What scholarly sort begins with the letter \"s\"?"],"info":{}}
{"id":"train_14335","question":"Which is solved by the prime number of theorem?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q386292 wdt:P1136 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14337","question":"Where are the headquarters of Yuriy Tselykh's team located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8061738 wdt:P54 ?X . ?X wdt:P159 ?answer }","paraphrases":["Where are the central station of Yuriy Tselykh's group located?"],"info":{}}
{"id":"train_14338","question":"Name a doll created by Mattel that start with letter K","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q168658 . ?sbj wdt:P176 wd:Q596139 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'k' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a doll created by Mattel that begin with letter K"],"info":{}}
{"id":"train_14341","question":"What are the psychoactive which start with the letter o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3706669 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the psychoactive which begin  with the letter o"],"info":{}}
{"id":"train_14342","question":"Who has the best personal record?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P2415 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Who has the finest individual record?"],"info":{}}
{"id":"train_14344","question":"Tell me close combat weapon whose name has the word yatagan in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q222405 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yatagan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me close combat weapon whose name has the word yatagan in it."],"info":{}}
{"id":"train_14346","question":"which position Chiang Kai-shek holds and when did he select?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q16574 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["which function Chiang Kai-shek holds and when did he select?"],"info":{}}
{"id":"train_14347","question":"What country was Oskemen a part of starting on December 16, 1991?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q162548 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1991' ) ) }","paraphrases":["What territory was Oskemen involved in establishing on December 16, 1991?"],"info":{}}
{"id":"train_14349","question":"who ideology of political party of konstantinos karamanlis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q156806 wdt:P102 ?X . ?X wdt:P1142 ?answer }","paraphrases":["What is the ideology of the political party of Konstantinos Karamanlis?"],"info":{}}
{"id":"train_14350","question":"WHO IS THE CHIEF OPERATING OFFICER OF GOLDMAN SACHS","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q193326 wdt:P1789 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14351","question":"Is the explosive energy equivalent of the Blue Peacock equal to 10?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q885837 wdt:P2145 ?obj filter ( ?obj = 10 ) }","paraphrases":["Is the Blue Peacock's explosive energy equivalent equal to 10?"],"info":{}}
{"id":"train_14353","question":"Which is the leading group unit of Guy Demel's team?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q354919 wdt:P54 ?X . ?X wdt:P118 ?answer }","paraphrases":["Which is the driving gather unit of Fellow Demel's team?"],"info":{}}
{"id":"train_14354","question":"Which international court is located in Strasbourg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q6602 . ?sbj wdt:P31 wd:Q1262438 }","paraphrases":[],"info":{}}
{"id":"train_14355","question":"What business is Verizon involved with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P156 wd:Q467752 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["What commerce is Verizon included with?"],"info":{}}
{"id":"train_14356","question":"In what country, which has diplomatic relations with Libya, was Sixto Durán Ballén born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q177182 wdt:P19 ?answer . ?answer wdt:P530 wd:Q1016 }","paraphrases":["In what nation, which has political relations with Libya, was Sixto Durán Ballén born?"],"info":{}}
{"id":"train_14359","question":"What is Nikola Karabatić's European Handball Federation player ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q157809 wdt:P3573 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14360","question":"What is connected with the artery, that has the pronunciation audio of Ru-сердце.ogg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9655 wdt:P2789 ?answer . ?answer wdt:P443 ?x FILTER ( contains ( ?x , 'Ru-сердце.ogg' ) ) }","paraphrases":["What is related with the artery, that has the pronunciation audio of Ru-сердце.ogg?"],"info":{}}
{"id":"train_14362","question":"Who is the  {banknote} for {depicts} of {Isaac Newton}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P180 wd:Q935 . ?sbj wdt:P31 wd:Q47433 }","paraphrases":["Who is the {banknote} for {portrays} of {Isaac Newton}"],"info":{}}
{"id":"train_14363","question":"In which continent is the Chinese art, with Eastern European Time zone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q756615 wdt:P30 ?answer . ?answer wdt:P421 wd:Q190252 }","paraphrases":["In which landmass is the Chinese craftsmanship, with Eastern European Time zone?"],"info":{}}
{"id":"train_14364","question":"What is the median lethal dose of ammonia for the period {1.0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4087 p:P2240 ?s . ?s ps:P2240 ?obj . ?s pq:P2047 ?x filter ( contains ( ?x , '1.0' ) ) }","paraphrases":["which is the median lethal dose of ammonia for the period {1.0} ?"],"info":{}}
{"id":"train_14365","question":"Were the administrators of Lyon Aleppo and Curitiba?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q456 wdt:P190 wd:Q41183 . wd:Q456 wdt:P190 wd:Q4361 }","paraphrases":["Were Aleppo and Curitiba in charge of Lyon?"],"info":{}}
{"id":"train_14366","question":"Is the Mohs' hardness of the graphite more than 1.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5309 wdt:P1088 ?obj filter ( ?obj > 1.8 ) }","paraphrases":["Is graphite's Mohs' hardness greater than 1.8?"],"info":{}}
{"id":"train_14368","question":"Which is the active ingredient for methadone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q179996 wdt:P3780 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14369","question":"What's the shortest time a person can be exposed to antimony?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q1099 wdt:P2407 ?obj }","paraphrases":["What is the minimum time that a person can be exposed to antimony?"],"info":{}}
{"id":"train_14370","question":"When is the time of the interment in the Trayvon Martin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13864562 wdt:P119 ?X . ?X wdt:P421 ?answer }","paraphrases":["When is the time of the interment within the Trayvon Martin?"],"info":{}}
{"id":"train_14371","question":"Name the position that Frederick North, who passed away on December 19, 1783, held.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q312593 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1783' ) ) }","paraphrases":["Frederick North held what position when he passed on December 19,1783?"],"info":{}}
{"id":"train_14372","question":"Was Arpad Busson a partner to Uma Thurman ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q125017 wdt:P451 wd:Q4795698 }","paraphrases":["Did Uma Thurman partner up with Arpad Busson?"],"info":{}}
{"id":"train_14373","question":"Name a multiple star constellation with Centaurus in it that contains the word \"hd\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q878367 . ?sbj wdt:P59 wd:Q8844 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a different star star grouping with Centaurus in it that contains the word \"hd\" in its name"],"info":{}}
{"id":"train_14374","question":"Tell me boat type whose name has the word yoal  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16103215 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yoal' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the type of boat whose name contains the word yoal."],"info":{}}
{"id":"train_14375","question":"What are the applies to part of Tigris at the coordinate location as 39.5058?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q35591 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '39.5058' ) ) . ?s pq:P518 ?value }","paraphrases":["the location name of Tigris coordinated 39.5058?"],"info":{}}
{"id":"train_14378","question":"What is the magnetic ordering for  ferromagnetism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P922 wd:Q184207 }","paraphrases":[],"info":{}}
{"id":"train_14379","question":"Was Tiger Woods nominated for Laureus World Sports Award for Sportsman of the year?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q10993 wdt:P1411 wd:Q1808301 }","paraphrases":["Did Tiger Woods get a nomination for the Laureus World Sports Award for Sportsman of the year?"],"info":{}}
{"id":"train_14380","question":"What position did Robert Mugabe hold in 1998?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q10707 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1998' ) ) }","paraphrases":["In 1998, what position did Robert Mugabe have?"],"info":{}}
{"id":"train_14384","question":"Tell me weapon family whose name has the word weapon in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15142889 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'weapon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know weapon family whose title has the word weapon in it."],"info":{}}
{"id":"train_14386","question":"Does cobalt-70 has a half-life that is more than 0.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q18844865 wdt:P2114 ?obj filter ( ?obj > 0.4 ) }","paraphrases":["What is the half-life of cobalt-70?"],"info":{}}
{"id":"train_14387","question":"When did Thomas Hunt Morgan stop being the chairperson at the American Association for the Advancement of Science?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q177681 p:P488 ?s . ?s ps:P488 wd:Q40358 . ?s pq:P582 ?value }","paraphrases":["On what date did Thomas Hunt Morgan retire as the chairperson of AAAS?"],"info":{}}
{"id":"train_14389","question":"How many consecrators are named by John Paul II?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1598 wd:Q989 }","paraphrases":["John Paul II has named how many consecrators?"],"info":{}}
{"id":"train_14390","question":"Where did William Bligh die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q294147 wdt:P20 ?X . ?X wdt:P190 ?answer }","paraphrases":["Where did William Bligh die?"],"info":{}}
{"id":"train_14391","question":"WHat kind of quantum particle is a superpartner to electrons ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2225 wdt:P2375 ?obj . ?obj wdt:P31 wd:Q22675015 }","paraphrases":["WHat kind of quantum molecule could be a superpartner to electrons ?"],"info":{}}
{"id":"train_14393","question":"What is the Mappy place ID for the Louvre Museum","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q19675 wdt:P4388 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14394","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1366 wd:Q161885 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["n/a"],"info":{}}
{"id":"train_14395","question":"What degree is achieved by Nikolay Nekrasov in 1839?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q208003 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1839' ) ) }","paraphrases":["What did Nikolay Nekrasov graduate in in 1839?"],"info":{}}
{"id":"train_14400","question":"What are the military academy which start with the letter école","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q917182 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'école' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the military academy which begin with the letter école"],"info":{}}
