{"id":"train_4662","question":"When did Goldman Sachs count 34400.0 employees?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q193326 p:P1128 ?s . ?s ps:P1128 ?x filter ( contains ( ?x , '34400.0' ) ) . ?s pq:P585 ?value }","paraphrases":["In what year did Goldman Sachs employ 34,400 people?"],"info":{}}
{"id":"train_4665","question":"tell me king in Greek mythology  name has  the word thestrus in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24434794 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'thestrus' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know lord in Greek mythology title has the word thestrus in it"],"info":{}}
{"id":"train_4666","question":"During what time period Reg Gasnier was member of Australia national rugby league team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3423313 p:P54 ?s . ?s ps:P54 wd:Q3589757 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["Amid what time period Reg Gasnier was part of Australia national rugby alliance team?"],"info":{}}
{"id":"train_4668","question":"What position did Nursultan Nazarbayev hold that ended on July 27th, 1989?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q57394 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1989' ) ) }","paraphrases":["Ended on July 27th of 1989, when did the Nursultan Nazarbayev hold ended?"],"info":{}}
{"id":"train_4669","question":"What writer is known for the work titled Montague Summers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q712220 wdt:P800 ?X . ?X wdt:P50 ?answer }","paraphrases":["What author is known for the work titled Montague Summers?"],"info":{}}
{"id":"train_4671","question":"What is the { start time } for { Chris Gayle } as { Royal Challengers Bangalore } { sports team member }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2732196 p:P54 ?s . ?s ps:P54 wd:Q1156897 . ?s pq:P580 ?value }","paraphrases":["What is Chris Gayle's official start time?"],"info":{}}
{"id":"train_4673","question":"What is the Library of Congress's collection or exhibition size?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q131454 wdt:P1436 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4674","question":"What is the official language of the Parthian Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1986139 wdt:P37 ?obj . ?obj wdt:P31 wd:Q4167410 }","paraphrases":["What is the official dialect of the Parthian Empire?"],"info":{}}
{"id":"train_4675","question":"What are the cross  which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q40843 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the cross that begins with the letter w"],"info":{}}
{"id":"train_4676","question":"Where is tributary take place in Polynesia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35942 wdt:P706 ?X . ?X wdt:P974 ?answer }","paraphrases":["What area in Polynesia does the tributary take place?"],"info":{}}
{"id":"train_4677","question":"What is SPARQL endpoint of Biblioteca Nacional de España?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q750403 wdt:P5305 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4678","question":"When did Eleanor Roosevelt divorced Franklin Delano Roosevelt?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q83396 p:P26 ?s . ?s ps:P26 wd:Q8007 . ?s pq:P582 ?value }","paraphrases":["What was the divorce date of Eleanor Roosevelt and Franklin Delano Roosevelt?"],"info":{}}
{"id":"train_4681","question":"What is the unemployment rate where the The Sugarhill Gang were up?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1413494 wdt:P495 ?X . ?X wdt:P1198 ?answer }","paraphrases":["What is the unemployment rate where the The Sugarhill Group were up?"],"info":{}}
{"id":"train_4682","question":"Who is William marwood that is very close to Guilhem","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3568818 wdt:P735 ?answer . ?answer wdt:P460 wd:Q28048558 }","paraphrases":["Who is William marwood that's exceptionally near to Guilhem"],"info":{}}
{"id":"train_4683","question":"What U.S. state or or insular area capital starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21518270 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What U.S. state or or insular area capital begins with the letter \"t\"?"],"info":{}}
{"id":"train_4684","question":"What gospel should be read for the present day work of David?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41370 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q34274 }","paraphrases":["What gospel ought to be studied for the display day work of David?"],"info":{}}
{"id":"train_4685","question":"Which is the eWRC-results.com racer ID for Sébastien Ogier?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q368793 wdt:P3927 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4686","question":"When Kassel has its population 194268.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2865 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '194268.0' ) ) . ?s pq:P585 ?value }","paraphrases":["When was Kassel's population 194268?"],"info":{}}
{"id":"train_4687","question":"What are the historic county of England which start with the letter Y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1138494 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the memorable district of Britain which begin with the letter Y"],"info":{}}
{"id":"train_4688","question":"What language translates \"B-Lactose\" into \"Sv-laktos.ogg\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q127900 p:P443 ?s . ?s ps:P443 ?x filter ( contains ( ?x , 'Sv-laktos.ogg' ) ) . ?s pq:P407 ?value }","paraphrases":["In which language is \"B-Lactose\" translated as \"Sv-laktos.ogg\"?"],"info":{}}
{"id":"train_4689","question":"What is RKD/ESD Slovenia ID for Lipizzaner ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q217671 wdt:P1715 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4692","question":"Was Jeremy_Irons educated at Sherborne School and University of the West of England, Bristol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q171745 wdt:P69 wd:Q2278254 . wd:Q171745 wdt:P69 wd:Q2002520 }","paraphrases":["Did Jeremy Irons receive his education at Sherborne School and University of the West of England in Bristol?"],"info":{}}
{"id":"train_4693","question":"Who won the prize awarded to John R. Pierce?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1340677 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who won the prize granted to John R. Pierce?"],"info":{}}
{"id":"train_4695","question":"Who was Betty White's husband ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q373895 wdt:P26 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was Betty White's spouse ?"],"info":{}}
{"id":"train_4698","question":"Does the Crab Pulsar have a galactic latitude over 18.29464?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1044623 wdt:P6261 ?obj filter ( ?obj > 18.29464 ) }","paraphrases":["Is the Crab Pulsar over 18.29464 having a galactic latitude?"],"info":{}}
{"id":"train_4699","question":"what is land-grant university starts with v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q615150 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is land-grant college begins with v"],"info":{}}
{"id":"train_4702","question":"What is the founder of region spring?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18147629 wdt:P276 ?X . ?X wdt:P112 ?answer }","paraphrases":["What is the originator of locale spring?"],"info":{}}
{"id":"train_4703","question":"Tell me computer network protocal whose name has the word widi in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15836568 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'widi' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which computer network protocal has the word widi in it?"],"info":{}}
{"id":"train_4704","question":"What Sam Kinison label has Warner Music Group stockholders?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q333505 wdt:P264 ?answer . ?answer wdt:P127 wd:Q21077 }","paraphrases":["What Sam Kinison name has Warner Music Bunch stockholders?"],"info":{}}
{"id":"train_4707","question":"What is the Nasjonalbiblioteket photographer ID for Fridtjof Nansen","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q72292 wdt:P1847 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4708","question":"What social media account is made by Xiaomi Redmi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15954223 wdt:P176 ?X . ?X wdt:P553 ?answer }","paraphrases":["What social media account is made by Xiaomi Redmi?"],"info":{}}
{"id":"train_4710","question":"Which is the measurement unit for measured physical quantity of temperature?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P111 wd:Q11466 . ?sbj wdt:P31 wd:Q47574 }","paraphrases":["The measured physical quantity of temperature is which measurement unit?"],"info":{}}
{"id":"train_4711","question":"Which gas giant in the solar system has the biggest synodic period?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q121750 . ?ent wdt:P4341 ?obj . ?ent wdt:P361 wd:Q544 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which of the planets made entirely of gas in our solar system, has the synodic period that's the largest?"],"info":{}}
{"id":"train_4715","question":"What is next to the place of work of Alfred Stieglitz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q313055 wdt:P937 ?X . ?X wdt:P47 ?answer }","paraphrases":["What is following to the put of work of Alfred Stieglitz?"],"info":{}}
{"id":"train_4716","question":"What degree did Christiane Amanpour receive at University of Rhode Island?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q236939 p:P69 ?s . ?s ps:P69 wd:Q1641788 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["What did Christiane Amanpour major in at the University of Rhode Island?"],"info":{}}
{"id":"train_4717","question":"What is the relevant qualification of project management ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q179012 wdt:P4968 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4718","question":"I want to know Andreas Vesalius' Auckland Art Gallery artist ID.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q170267 wdt:P3372 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4719","question":"What is the name of the professional sports league starting in October that contains the word \" hockey\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15991290 . ?sbj wdt:P4794 wd:Q124 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hockey' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of the proficient sports alliance beginning in October that contains the word \" hockey\" in its title ?"],"info":{}}
{"id":"train_4721","question":"Tell me female beauty pageant whose name has the word world in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58863414 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal me female beauty pageant whose name has the word world in it."],"info":{}}
{"id":"train_4722","question":"Did the twinned administrative body of Samarkand begin August 4, 1986?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5753 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1986' ) ) }","paraphrases":["About the twinned administrative body of Samarkand, did it started in August 4,1986?"],"info":{}}
{"id":"train_4723","question":"What does Commodore 64 produce?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1056 wd:Q99775 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["WHAT IS PRODUCED BY COMMODORE 64"],"info":{}}
{"id":"train_4726","question":"Which taxon has the longest generation time?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3337 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What taxon had the longest amount of time?"],"info":{}}
{"id":"train_4729","question":"What are the Greek deity which start with the letter zeus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22989102 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zeus' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the Greek deity whose name begins with zeus"],"info":{}}
{"id":"train_4730","question":"Name the place where Pete Conrad was buried as per the Section 11 and Site 113/3","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q213076 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P965 ?x filter ( contains ( ?x , 'Section 11, Site 113-3' ) ) }","paraphrases":["Where was Pete Conrad buried per Section 11, Site 113/3?"],"info":{}}
{"id":"train_4731","question":"What is the surface of the Malacca Sultanate palace?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q46652 wdt:P36 ?X . ?X wdt:P2046 ?answer }","paraphrases":["Specify the surface used in the Malacca Sultanate palace."],"info":{}}
{"id":"train_4732","question":"how many studies are needed for juriprudence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2578 wd:Q4932206 }","paraphrases":["For a jurisprudence, how many studies must be met?"],"info":{}}
{"id":"train_4733","question":"What are the gas law which start with the letter I","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q379231 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the gas law which begin with the letter I"],"info":{}}
{"id":"train_4735","question":"What is the ticker symbol for Chevron Corporation on the New York Stock Exchange?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q319642 p:P414 ?s . ?s ps:P414 wd:Q13677 . ?s pq:P249 ?value }","paraphrases":["chevron corporation use what symbol ticker on the NY stock exchange?"],"info":{}}
{"id":"train_4736","question":"Who is the daughter of Guinevere's wife?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q272054 wdt:P26 ?X . ?X wdt:P25 ?answer }","paraphrases":["What is the name of Guinevere's wife's daughter?"],"info":{}}
{"id":"train_4737","question":"Which is the Framalibre ID for Wilhelm Furtwängler?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q57285 wdt:P4107 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4738","question":"Which is the date of disappearance of Natalia Molchanova?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q59920 wdt:P746 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4742","question":"how much distribution is done by secure digital card?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P437 wd:Q466977 }","paraphrases":["What is the amount of distribution done by secure digital card?"],"info":{}}
{"id":"train_4743","question":"What are the type of business entity which start with the letter S","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1269299 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What kind of business entity does the letter S start?"],"info":{}}
{"id":"train_4744","question":"Which {telephone prefix} is {born at} {Abu Nuwas} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5670 wdt:P19 ?X . ?X wdt:P473 ?answer }","paraphrases":["what is the telephone prefix of Abu Nuwas?"],"info":{}}
{"id":"train_4745","question":"Who is noble family of has mother of Iziaslav I of Kiev ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q332516 wdt:P25 ?X . ?X wdt:P53 ?answer }","paraphrases":["Who is respectable family of has mother of Iziaslav I of Kiev ?"],"info":{}}
{"id":"train_4746","question":"What are the team which start with the letter vándormások","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q327245 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vándormások' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the group which begin with the letter vándormások"],"info":{}}
{"id":"train_4747","question":"What is the military rank of Kim Jong-un, the commander of Korean People's Army?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q56226 p:P410 ?s . ?s ps:P410 ?obj . ?s pq:P598 wd:Q240670 }","paraphrases":["Is Kim Jong-un's the commander of NKPA?"],"info":{}}
{"id":"train_4750","question":"What is internetmedicin.se ID for breast cancer ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q128581 wdt:P2074 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4753","question":"What date was Zenobia born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q189705 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( ?x , '240-0-0' ) ) . ?s pq:P31 ?value }","paraphrases":["When was Zenobia born?"],"info":{}}
{"id":"train_4755","question":"What is the country calling code for Nauru?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q697 wdt:P474 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4756","question":"Who followed Louis II of Italy as monarch?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q215204 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["After the Chrysler Building, which building was named the highest?"],"info":{}}
{"id":"train_4757","question":"What is the Fossilworks ID for pigeon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q10856 wdt:P842 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4758","question":"WHICH IS THE LAKE PLACE OF FOUNDATION OF JOHN ENGLAND & THE WESTERN SWINGERS","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6231791 wdt:P740 ?X . ?X wdt:P206 ?answer }","paraphrases":["John England and the Western Swingers had what lake place of foundation?"],"info":{}}
{"id":"train_4759","question":"How many men live in the Zlin Region?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q192536 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P1540 ?x filter ( contains ( ?x , '285855.0' ) ) }","paraphrases":["What is the number of men that reside in the Zlin Region?"],"info":{}}
{"id":"train_4761","question":"what is an experiment that starts with the letter t.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q101965 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is an explore that begins with the letter t."],"info":{}}
{"id":"train_4763","question":"What is {number of matches played} and {number of points/goals/set scored} of {{Christine Sinclair} has {member of sports team} as {Vancouver Whitecaps}}","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q262802 p:P54 ?s . ?s ps:P54 wd:Q3567798 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["When Christine Sinclair played for the Vancouver Whitecaps how many matches did she play and scored how many points/goals/sets did she have?"],"info":{}}
{"id":"train_4764","question":"What award did Halldór Laxness receive $190,214.0 for ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q80321 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter ( contains ( ?x , '190214.0' ) ) }","paraphrases":["What grant did Halldór Remissness get $190,214.0 for ?"],"info":{}}
{"id":"train_4767","question":"When the statement was declared that German is sharing its border with the Poland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q183 p:P47 ?s . ?s ps:P47 wd:Q36 . ?s pq:P805 ?value }","paraphrases":["When did Germany declare they were going to share a border with Poland?"],"info":{}}
{"id":"train_4768","question":"What is the inverse of the manufacturing method of pasteurization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q58148 wdt:P2079 ?X . ?X wdt:P461 ?answer }","paraphrases":["What is the converse of the fabricating strategy of pasteurization?"],"info":{}}
{"id":"train_4769","question":"What is the translation of the above?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21191066 wdt:P629 ?X . ?X wdt:P674 ?answer }","paraphrases":["What is the interpretation of the above?"],"info":{}}
{"id":"train_4771","question":"which is the public policy that starts with letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q546113 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which is the open approach that begins with letter r"],"info":{}}
{"id":"train_4772","question":"What is the base of a cube that differs from a triangle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q812880 wdt:P3263 ?answer . ?answer wdt:P1889 wd:Q19821 }","paraphrases":["What is the base of a 3d shape that contrasts from a triangle?"],"info":{}}
{"id":"train_4773","question":"What is the film genre and the name of the singer of Long Story Short?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6673247 wdt:P175 ?X . ?X wdt:P136 ?answer }","paraphrases":["What is the film sort and the title of the artist of Long Story Short?"],"info":{}}
{"id":"train_4774","question":"Who is the architect of the Chapultepec Castleon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1072510 wdt:P84 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4775","question":"Is it true David_Lynch educated at George Washington University  and Pennsylvania Academy of the Fine Arts ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2071 wdt:P69 wd:Q432637 . wd:Q2071 wdt:P69 wd:Q1952033 }","paraphrases":["Was David Lynch a student at George Washington University and the PA Academy of the Fine Arts?"],"info":{}}
{"id":"train_4779","question":"When did Dragan Džajić leave Yugoslavia's national footbal team","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q297357 p:P54 ?s . ?s ps:P54 wd:Q188363 . ?s pq:P582 ?value }","paraphrases":["on what date Dragan Džajić leave Yugoslavia's national footbal team"],"info":{}}
