{"id":"train_19425","question":"Name the interstellar object discovered at Haleakalā with the longest rotation period ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2441216 . ?ent wdt:P2147 ?obj . ?ent wdt:P65 wd:Q515719 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What do you call the interstellar object with the longest rotation period that was founded at Haleakala?"],"info":{}}
{"id":"train_19426","question":"What was the twinned administrative body of Patras that started in 1995?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q133123 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1995' ) ) }","paraphrases":["What was the twinned authoritative assemblage of Patras that begun in 1995?"],"info":{}}
{"id":"train_19427","question":"What is Tequila based on and where is it indigenous to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q122195 wdt:P144 ?ans_1 . wd:Q122195 wdt:P2341 ?ans_2 }","paraphrases":["What is Tequila and where did it come from?"],"info":{}}
{"id":"train_19431","question":"What is the headquarters of Carol Padden's workplace?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5044496 wdt:P108 ?X . ?X wdt:P159 ?answer }","paraphrases":["What is the central station of Carol Padden's working environment?"],"info":{}}
{"id":"train_19432","question":"How many companies have OJSC Russian Railways as a parent organization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P749 wd:Q660770 }","paraphrases":["OJSC Russia Railways is a parent organization of how many companies?"],"info":{}}
{"id":"train_19434","question":"When did Grand Canyon National Park have 4388390 visitors per year?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q220289 p:P1174 ?s . ?s ps:P1174 ?x filter ( contains ( ?x , '4.38839e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["Which year did Grand Canyon National Park receive 4388390 visitors ?"],"info":{}}
{"id":"train_19436","question":"Which position of Ogedei Khan was came to end in the year 1241?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7519 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1241' ) ) }","paraphrases":["What of Ogedei Khan's positions came to an end in 1241?"],"info":{}}
{"id":"train_19437","question":"What gene was determined through TAS to be associated with post-traumatic stress disorder?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q202387 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q23190853 }","paraphrases":["Give me the gene that was determined through TAS to be associated with PTSD."],"info":{}}
{"id":"train_19440","question":"Who is the {public limited company} for {designed by} of {ARM architecture}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q16980 wdt:P287 ?obj . ?obj wdt:P31 wd:Q5225895 }","paraphrases":["What public company does Arm architecture use to design for them?"],"info":{}}
{"id":"train_19442","question":"Name a Canadian broadcaster that starts with letter B","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15265344 . ?sbj wdt:P4195 wd:Q8338009 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a Canadian broadcaster that begins with letter B"],"info":{}}
{"id":"train_19443","question":"Is the GDP (PPP) of Canada equal to 1.26938029456e+12?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q16 wdt:P4010 ?obj filter ( ?obj = 1.26938029456e+12 ) }","paraphrases":["Is 1.26938029456e+12 the GDP (PPP) of Canada?"],"info":{}}
{"id":"train_19444","question":"Which is the literary work of the writer Cheryl Strayed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P50 wd:Q5092780 . ?sbj wdt:P31 wd:Q7725634 }","paraphrases":["What's the name of a literary piece written by Cheryl Strayed?"],"info":{}}
{"id":"train_19447","question":"Which football association club is playing for Strasbourg Headquaters?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q6602 . ?sbj wdt:P31 wd:Q476028 }","paraphrases":["Which football affiliation club is playing for Strasbourg Headquaters?"],"info":{}}
{"id":"train_19448","question":"\"Who is the {Gaussian function} named for, whose recorded religious {denomination} was {Lutheranism}?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1054475 wdt:P138 ?answer . ?answer wdt:P140 wd:Q75809 }","paraphrases":["\"Who is the {Gaussian function} named for, whose recorded spiritual {denomination} was {Lutheranism}?\""],"info":{}}
{"id":"train_19449","question":"Tell me military campaign whose name has the word operation in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q831663 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'operation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know military campaign whose title has the word operation in their name"],"info":{}}
{"id":"train_19450","question":"Who is the{film} for {cast member} of {Al Pacino}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P161 wd:Q41163 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Who is the{film} for {cast part} of {Al Pacino}"],"info":{}}
{"id":"train_19451","question":"What do the students of Ann C. Noble do?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q697977 wdt:P802 ?X . ?X wdt:P108 ?answer }","paraphrases":["What do the understudies of Ann C. Respectable do?"],"info":{}}
{"id":"train_19452","question":"Where is the death place of Stefan Yavorsky, who has the county seat for the Russian Soviet Federative Socialist Republic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2653133 wdt:P20 ?answer . ?answer wdt:P1376 wd:Q2184 }","paraphrases":["Where is the death location of Stefan Yavorsky, who has the county seat for the Russian Soviet Federative Socialist Republic?"],"info":{}}
{"id":"train_19456","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q355 wdt:P137 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":["n/a"],"info":{}}
{"id":"train_19457","question":"Which shire is the birth location of Sam Concepcion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3543715 wdt:P19 ?X . ?X wdt:P150 ?answer }","paraphrases":["Which shire is the birth area of Sam Concepcion?"],"info":{}}
{"id":"train_19458","question":"Which is the position played on team or specialty of John Elway?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q432931 wdt:P413 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19460","question":"IS THE UPPER LIMIT OF THE SET OF NEGATIVE INTEGERS EQUALS 1-2","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47379005 wdt:P5448 ?obj filter ( ?obj = -1.2 ) }","paraphrases":["Is the high limit of the negative integers about 1-2?"],"info":{}}
{"id":"train_19461","question":"What has participated in conflict with Ali ibn Abi Talib, that has a longitude of 24.503333 39.611667?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q39619 wdt:P607 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '24.503333 39.611667' ) ) }","paraphrases":["What has taken an interest in struggle with Ali ibn Abi Talib, that incorporates a longitude of 24.503333 39.611667?"],"info":{}}
{"id":"train_19463","question":"When was Bobby Fischer a Grandmaster chess player?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41314 p:P2962 ?s . ?s ps:P2962 wd:Q105269 . ?s pq:P580 ?value }","paraphrases":["On what date was Bobby Fischer a Grandmaster chess player?"],"info":{}}
{"id":"train_19464","question":"When was Matt Lauer nominated for the Daytime Emmy Award for Outstanding Morning Program?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1100609 p:P1411 ?s . ?s ps:P1411 wd:Q5243450 . ?s pq:P585 ?value }","paraphrases":["When was Matt Lauer assigned for the Daytime Emmy Grant for Extraordinary Morning Program?"],"info":{}}
{"id":"train_19466","question":"Which nuclear isomer of bismuth has the least neutrons ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q846110 . ?ent wdt:P1148 ?obj . ?ent wdt:P279 wd:Q942 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which atomic isomer of bismuth has the slightest neutrons ?"],"info":{}}
{"id":"train_19469","question":"What is the Web Gallery of Art ID of Lucas Cranach the Elder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q191748 wdt:P1882 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19471","question":"In which country is Dutch spoken?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q7411 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["Which country is spoken in the Netherlands?"],"info":{}}
{"id":"train_19473","question":"Is the acetaldehyde autoignition temperature 148.0 or greater?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q61457 wdt:P2199 ?obj filter ( ?obj > 148.0 ) }","paraphrases":["Is the temperature of acetaidehyde autoignition greater than 148.0?"],"info":{}}
{"id":"train_19475","question":"What is the name of the character present in Nineteen Eighty-Four?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q208460 . ?sbj wdt:P31 wd:Q3658341 }","paraphrases":["What is the title of the character show in Nineteen Eighty-Four?"],"info":{}}
{"id":"train_19477","question":"Name a credit that starts with letter L","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q182076 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a credit that begins with letter L"],"info":{}}
{"id":"train_19479","question":"which flammable gas with the minimal lethal dose whose has effect of arsine exposure?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21073026 . ?ent wdt:P2300 ?obj . ?ent wdt:P1542 wd:Q21167853 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which gas is flammable, and with minimal doseage has effects of arsine exposure?"],"info":{}}
{"id":"train_19483","question":"Where did Liam Neeson married Natasha Richardson and why did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q58444 p:P26 ?s . ?s ps:P26 wd:Q212545 . ?s pq:P2842 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["Liam Neeson and Natasha Richardson tied the knot where and what caused the couple to divorce?"],"info":{}}
{"id":"train_19485","question":"is it true that the polycarbonates operating temperature equals -40?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q62246 wdt:P5066 ?obj filter ( ?obj = -40 ) }","paraphrases":["is it genuine that the polycarbonates working temperature breaks even with -40?"],"info":{}}
{"id":"train_19486","question":"Was Dan Aykroyd nominated for an Academy Award for Best Actor and a Golden Raspberry Award for Worst Screenplay?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q105221 wdt:P1411 wd:Q103916 . wd:Q105221 wdt:P1411 wd:Q1421666 }","paraphrases":["Did the Academy Award for Best Actor and a Golden Raspberry Award for Worst Screenplay nominate Dan Aykroyd?"],"info":{}}
{"id":"train_19489","question":"What is Gerard way's occupation and country of citizenship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q204132 wdt:P27 ?ans_1 . wd:Q204132 wdt:P106 ?ans_2 }","paraphrases":["Gerard Way is from what country, and what is his job?"],"info":{}}
{"id":"train_19491","question":"WHICH IS THE POLICY THAT IS MANIFESTATION OF RACISM AND THAT CONTAINS THE WORD APARTHEID IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1156854 . ?sbj wdt:P1557 wd:Q8461 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'apartheid' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE Arrangement That's MANIFESTATION OF Bigotry Which CONTAINS THE WORD APARTHEID IN THEIR NAME"],"info":{}}
{"id":"train_19493","question":"What higher taxons are found in species of hearts?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1072 wdt:P703 ?X . ?X wdt:P171 ?answer }","paraphrases":["What higher taxons are determined in species of hearts?"],"info":{}}
{"id":"train_19497","question":"What is the next season of the Disney Infinity 2.0: Marvel Super Heroes series?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16971686 wdt:P155 ?X . ?X wdt:P400 ?answer }","paraphrases":["Get me the name of the  Disney Infinity 2.0: Marvel Super Heroes series, next series"],"info":{}}
{"id":"train_19499","question":"Who are the writers of the prequel to \"No Reservations: Around the World on an Empty Stomach\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16958393 wdt:P155 ?X . ?X wdt:P50 ?answer }","paraphrases":["Who's the authors of \"No Reservations: Around the World on an Empty Stomach\"?"],"info":{}}
{"id":"train_19501","question":"How many of them study history?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2578 wd:Q309 }","paraphrases":["Which is the number of them studying history?"],"info":{}}
{"id":"train_19505","question":"Which humans reside in Rotterdam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P551 wd:Q34370 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Which people dwell in Rotterdam?"],"info":{}}
{"id":"train_19508","question":"Name the underground railway station with maximum patronage?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q55491 . ?ent wdt:P3872 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which subway do the most people use?"],"info":{}}
{"id":"train_19509","question":"IS THE NUMBER OF SPOILT VOTES OF THE SANTA CRUZ DO SUL MAYORAL ELECTION 2016 EQUALS 4342.8","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q61868922 wdt:P5044 ?obj filter ( ?obj = 4342.8 ) }","paraphrases":["IS THE NUMBER OF SPOILT VOTES OF THE SANTA CRUZ DO SUL MAYORAL Decision 2016 Breaks even with 4342.8"],"info":{}}
{"id":"train_19510","question":"Who employs the astronaut Gus Grissom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q110879 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P39 wd:Q11631 }","paraphrases":["Astronaut Gus Grissom was employed by whom?"],"info":{}}
{"id":"train_19512","question":"What is award did Jean Nouvel receive in 2005?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q214317 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2005' ) ) }","paraphrases":["What is the name of the award given to Jean Nouvel in 2005?"],"info":{}}
{"id":"train_19513","question":"Who is the member of Olivier Messiaen, whose longitude is -73.9469","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q151593 wdt:P463 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-73.9469' ) ) }","paraphrases":["Who is the member of Olivier Messiaen, whose longitude is -73.9469"],"info":{}}
{"id":"train_19514","question":"Is 4 the maximum number of players of the coxless four?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q81032 wdt:P1873 ?obj filter ( ?obj = 4 ) }","paraphrases":["Does the coulees four have a maximum number of 4 players?"],"info":{}}
{"id":"train_19515","question":"Is Maharashtra in administrative territorial entity of Amravati and Chhattisgarh Division?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1191 wdt:P150 wd:Q477558 . wd:Q1191 wdt:P150 wd:Q5094827 }","paraphrases":["Is Maharashtra under Amravati and Chhattisgarh?"],"info":{}}
{"id":"train_19516","question":"Whats Denali's topographic prominence","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q130018 wdt:P2660 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19517","question":"When does the twinned administrative body Shimane Prefecture,  become known as Jilin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132751 p:P190 ?s . ?s ps:P190 wd:Q45208 . ?s pq:P580 ?value }","paraphrases":["At what time did the twinned administrative body of Shimane Prefecture become known as Jilin?"],"info":{}}
{"id":"train_19518","question":"tell me low-cost airline starts with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q190915 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the cheap airline begins with letter v"],"info":{}}
{"id":"train_19520","question":"Which chapter is it in this version of Hamlet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P629 wd:Q41567 . ?sbj wdt:P31 wd:Q1980247 }","paraphrases":["Which chapter is it in this form of Hamlet?"],"info":{}}
{"id":"train_19522","question":"What territory is Montreal the capitol of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q340 wdt:P150 ?obj . ?obj wdt:P31 wd:Q578521 }","paraphrases":["What place is Montreal the capitol of?"],"info":{}}
{"id":"train_19524","question":"What team did Rinus Michels play for that's also known as Εβραίοι?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2154479 wdt:P54 ?answer . ?answer wdt:P1449 ?x FILTER ( contains ( ?x , 'Εβραίοι' ) ) }","paraphrases":["What group did Rinus Michels play for that's additionally acknowledged as Εβραίοι?"],"info":{}}
{"id":"train_19526","question":"Tell me what is located in or next to body of water of the Kabul River.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P206 wd:Q8515 }","paraphrases":[],"info":{}}
{"id":"train_19527","question":"What venue was a part of Franco Baresi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q189984 wdt:P1344 ?X . ?X wdt:P276 ?answer }","paraphrases":["What scene was a portion of Franco Baresi?"],"info":{}}
{"id":"train_19528","question":"What are the commune of france which start with the letter e","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q484170 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'é' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the commune of france which begin with the letter e"],"info":{}}
{"id":"train_19531","question":"Where is Ismail I's deathplace that has position 38.25?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q214559 wdt:P20 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '38.25' ) ) }","paraphrases":["Where is Ismail I's deathplace that has position 38.25?"],"info":{}}
{"id":"train_19533","question":"What is the currency of Syria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q858 wdt:P38 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19535","question":"What role did Winona Ryder receive the Academy Award for Best Actress for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q101797 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value }","paraphrases":["Which role did Winona Ryder receive the Academy Award for Best Actress for?"],"info":{}}
{"id":"train_19538","question":"What is the post of Clement Attlee and when he was sworn in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q129006 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What is the publish of Clement Clement Attlee and when he was once sworn in?"],"info":{}}
{"id":"train_19539","question":"Tell me the date of birth of Epicurus.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43216 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( ?x , '-341-1-1' ) ) . ?s pq:P31 ?value }","paraphrases":["When was Epicurus born?"],"info":{}}
{"id":"train_19541","question":"What was given to Ontario on 1889-8-12?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1904 p:P1365 ?s . ?s ps:P1365 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1889' ) ) }","paraphrases":["Which thing was given to Ontario in 1889?"],"info":{}}
{"id":"train_19544","question":"What are numbers of total matches played and goals scored by Bobby Moore, while playing for Seattle Sounders?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q191492 p:P54 ?s . ?s ps:P54 wd:Q956200 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["When Bobby Moore played for the Seattle Sounders, how many goals did he score, and what is the total number of matches he played?"],"info":{}}
{"id":"train_19546","question":"Who is Microsoft's chief executive officer and chairperson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q2283 wdt:P169 ?ans_1 . wd:Q2283 wdt:P488 ?ans_2 }","paraphrases":["Who is the CEO and chairperson of Microsoft?"],"info":{}}
{"id":"train_19548","question":"What is the sovereign state of Union for the Mediterranean's total fertility rate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192177 wdt:P17 ?X . ?X wdt:P4841 ?answer }","paraphrases":["What is the majestic state of Union for the Mediterranean's add up to ripeness rate?"],"info":{}}
{"id":"train_19549","question":"What is a Class II combustible liquid has the smallest electric dipole moments?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009057 . ?ent wdt:P2201 ?obj . ?ent wdt:P31 wd:Q21009057 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Define a Class II combustible liquid which contains the littlest electric dipole moments."],"info":{}}
{"id":"train_19551","question":"What city is twinned with Sofia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q472 wdt:P190 ?obj . ?obj wdt:P31 wd:Q515 }","paraphrases":["What city is twinned with Sofia?"],"info":{}}
{"id":"train_19553","question":"Which child of Julio Iglesias won the Latin Grammy Award for Best Male Pop Vocal Album?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q122003 wdt:P40 ?answer . ?answer wdt:P166 wd:Q6496361 }","paraphrases":["Which infant of Julio Iglesias won the Latin Grammy Award for Best Male Pop Vocal Album?"],"info":{}}
{"id":"train_19554","question":"Is it true that the parity of the nickel-55 is greater than -0.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q18845091 wdt:P1123 ?obj filter ( ?obj > -0.8 ) }","paraphrases":["What is the parity of the nickel-55?"],"info":{}}
{"id":"train_19556","question":"In the region where the King James Version was published, what was the big event?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q623398 wdt:P291 ?X . ?X wdt:P793 ?answer }","paraphrases":["In the region where the King James Version was published, what was the big event?"],"info":{}}
{"id":"train_19557","question":"What is hte Google Doodle for Dorothea Mackellar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q963058 wdt:P4431 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19558","question":"What was the dysnasty of David ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41370 wdt:P53 ?obj . ?obj wdt:P31 wd:Q164950 }","paraphrases":["What was the dysnasty of David ?"],"info":{}}
{"id":"train_19560","question":"Which is the human-geographic territorial entity which starts with the letter w?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15642541 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the human-geographic regional substance which begins with the letter w?"],"info":{}}
{"id":"train_19562","question":"What are the astronomical object type  which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17444909 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the cosmic question sort which begin with the letter v"],"info":{}}
