{"id":"train_17699","question":"Tell me Devi whose name has the word vindhyavasini in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q494511 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vindhyavasini' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know Devi whose title has the word vindhyavasini in it."],"info":{}}
{"id":"train_17700","question":"Larry Flynt is editor of which magazine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P98 wd:Q223839 . ?sbj wdt:P31 wd:Q41298 }","paraphrases":["Larry Flynt is editor of which magazine?"],"info":{}}
{"id":"train_17701","question":"Dorothy Garrod replaced Grahame Clark in what position?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1542008 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q275622 }","paraphrases":["What was Dorothy Garrod's title when she replaced Grahame Clark?"],"info":{}}
{"id":"train_17702","question":"What is the farthest the Max Planck Institute for Solar System Research telescope can see?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1238291 . ?ent wdt:P2151 ?obj . ?ent wdt:P137 wd:Q470648 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["How far can the Max Planck telescope see?"],"info":{}}
{"id":"train_17703","question":"What is the audio pronounced using rotisserie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q22847 wdt:P2283 ?X . ?X wdt:P443 ?answer }","paraphrases":["What is the rotisserie audio pronounced?"],"info":{}}
{"id":"train_17705","question":"What comes after a decimal that has a radix of 9?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q81365 wdt:P155 ?answer . ?answer wdt:P3264 wd:Q19108 }","paraphrases":["What comes after a decimal that contains a radix of 9?"],"info":{}}
{"id":"train_17706","question":"Who is the CEO of Qantas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q32491 wdt:P169 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the CEO of Qantas?"],"info":{}}
{"id":"train_17707","question":"Tell me about the grand duchies located in the Weimar Republic.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q41304 . ?sbj wdt:P31 wd:Q165116 }","paraphrases":["Let me know about the terrific duchies found within the Weimar Republic."],"info":{}}
{"id":"train_17708","question":"tell me organ that lymphatic drainage hepatic lymph nodes starts with i","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q712378 . ?sbj wdt:P2288 wd:Q17077735 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["disclose to me organ that lymphatic waste hepatic lymph hubs begins with I"],"info":{}}
{"id":"train_17709","question":"Who is the husband of the author of the book Goldilocks?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5580199 wdt:P87 ?X . ?X wdt:P26 ?answer }","paraphrases":["Who did the writer of Goldilocks marry?"],"info":{}}
{"id":"train_17711","question":"Is  0 the length of the Kulin kamik?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q61870722 wdt:P2043 ?obj filter ( ?obj = 0 ) }","paraphrases":["Does the length of Kulin kamik equal 0?"],"info":{}}
{"id":"train_17712","question":"Jan Steen has what famous painting?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q205863 wdt:P800 ?X . ?X wdt:P180 ?answer }","paraphrases":["Jan Steen has what celebrated painting?"],"info":{}}
{"id":"train_17713","question":"Which is the translator for John Dryden?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P655 wd:Q213355 }","paraphrases":[],"info":{}}
{"id":"train_17714","question":"What is the sovereign state of the sign language of Jean-Francois Lyotard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q193257 wdt:P1412 ?X . ?X wdt:P17 ?answer }","paraphrases":["What is the autonomous state of the sign dialect of Jean-Francois Lyotard?"],"info":{}}
{"id":"train_17715","question":"What is in the principal area of Bouvet Island that is also a member of the Group on Earth Observations?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23408 wdt:P131 ?answer . ?answer wdt:P463 wd:Q5611262 }","paraphrases":["What is in the principal area of Bouvet Island that is also a member of the Group on Earth Observations?"],"info":{}}
{"id":"train_17717","question":"How many reward programs are there in  {Qantas} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P4446 wd:Q32491 }","paraphrases":["{Qantas} has how many reward programs?"],"info":{}}
{"id":"train_17718","question":"Which constellation is the star HD 75289 b a part of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q73307 wdt:P397 ?X . ?X wdt:P59 ?answer }","paraphrases":["Which constellation contains the star, HD 75289?"],"info":{}}
{"id":"train_17721","question":"What unit of measurement starts with the letter \"v\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47574 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What unit of estimation begins with the letter \"v\"?"],"info":{}}
{"id":"train_17722","question":"When did social movement for influenced by of Richard Dawkins?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P737 wd:Q44461 . ?sbj wdt:P31 wd:Q49773 }","paraphrases":[],"info":{}}
{"id":"train_17724","question":"What is the language typology of Mikhail Bakunin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27645 wdt:P1412 ?X . ?X wdt:P4132 ?answer }","paraphrases":["Name the language typology of Mikhail Bakunin."],"info":{}}
{"id":"train_17726","question":"What are the food additive which start with the letter wax","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q189567 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wax' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the nourishment added substance which begin with the letter wax"],"info":{}}
{"id":"train_17727","question":"What is the name of the steel bridge constructed by Irving Morrow which has the word \"bridge\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12042110 . ?sbj wdt:P631 wd:Q3154614 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'bridge' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which bridge is constructed by Irving Morrow which has the word \"bridge\" in its name?"],"info":{}}
{"id":"train_17731","question":"Who is the parent of the blue whale, whose name is Rocual?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42196 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'Rorcual' ) ) }","paraphrases":["Who is the parent of the blue whale, whose title is Rocual?"],"info":{}}
{"id":"train_17733","question":"Is it true that the mean age of Aldersgate is greater than 54.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2337831 wdt:P4442 ?obj filter ( ?obj > 54.6 ) }","paraphrases":["Is it genuine that the mean period of Aldersgate is more noteworthy than 54.6?"],"info":{}}
{"id":"train_17738","question":"What Opera did Pyotr Ilyish Tchaikovsky compose for","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P87 wd:Q7315 . ?sbj wdt:P31 wd:Q1344 }","paraphrases":["What Musical drama did Pyotr Ilyish Tchaikovsky compose for"],"info":{}}
{"id":"train_17739","question":"What is ICD-10  for skin cancer","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q192102 wdt:P494 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17740","question":"What is the strain with the lowest maximum viable temperature whose biosafety level is biosafety level 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q855769 . ?ent wdt:P3252 ?obj . ?ent wdt:P1604 wd:Q18396533 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which biological agent with the bio-safety level of 1, has the lowest maximum viable temperature?"],"info":{}}
{"id":"train_17742","question":"What award did Kathy Bates receive in the 63rd Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q544465 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q910856 }","paraphrases":["Which award did Kathy Bates win at the 63rd Academy Awards?"],"info":{}}
{"id":"train_17743","question":"What are the fairy tale which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q699 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the pixie story which begin with the letter w"],"info":{}}
{"id":"train_17745","question":"Is the isospin z-component of the triton equal to -0.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q488424 wdt:P1127 ?obj filter ( ?obj = -0.6 ) }","paraphrases":["Is the isospin z-component of the triton rise to to -0.6?"],"info":{}}
{"id":"train_17748","question":"What is the sister or brother of Xerxes whose child is Darius I of Persia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q129165 wdt:P3373 ?answer . ?answer wdt:P22 wd:Q44387 }","paraphrases":["What is the sister or brother of Xerxes whose child is Darius I of Persia?"],"info":{}}
{"id":"train_17749","question":"What is different to Symphony No. 5 whose succession is Louie, Louie Go Home?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q188709 wdt:P1889 ?answer . ?answer wdt:P156 wd:Q6686261 }","paraphrases":["What is diverse to Orchestra No. 5 whose progression is Louie, Louie Go Domestic?"],"info":{}}
{"id":"train_17751","question":"What is total fertility rate for national  of Richard Sears ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q470242 wdt:P27 ?X . ?X wdt:P4841 ?answer }","paraphrases":["What is add up to ripeness rate for national of Richard Burns ?"],"info":{}}
{"id":"train_17752","question":"What is the date of first performance of Turandot whose cast member is Miguel Burró Fleta?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q207990 p:P1191 ?s . ?s ps:P1191 ?obj . ?s pq:P161 wd:Q727853 }","paraphrases":["On what date did Miguel Burro Fleta first perform in Turandot?"],"info":{}}
{"id":"train_17755","question":"When did The Return of the Prodigal Son have significant sales?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q512755 p:P793 ?s . ?s ps:P793 wd:Q194189 . ?s pq:P585 ?value }","paraphrases":["The Return of the Prodigal Son had significant sales in what year?"],"info":{}}
{"id":"train_17757","question":"How much is the net profit earned by Alphabet Inc.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q20800404 wdt:P2295 ?obj }","paraphrases":["What is Alphabet Inc's Net profit?"],"info":{}}
{"id":"train_17758","question":"What significant event in Jeff Bezos's career started as an accident?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q312556 p:P793 ?s . ?s ps:P793 wd:Q171558 . ?s pq:P121 ?value }","paraphrases":["Which significant event in Jeff Bezo's career started as an accident?"],"info":{}}
{"id":"train_17760","question":"Which mythological Greek character was killed by Apollo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P157 wd:Q37340 . ?sbj wdt:P31 wd:Q22988604 }","paraphrases":["Which legendary Greek character was murdered by Apollo?"],"info":{}}
{"id":"train_17762","question":"What is the capital city in the village of Teknaf Upazila?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3348523 wdt:P131 ?X . ?X wdt:P36 ?answer }","paraphrases":["What is the capital city within the town of Teknaf Upazila?"],"info":{}}
{"id":"train_17763","question":"What is the Aarne-Thompson-Uther Tale Type Index number for Little Red Riding Hood?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11838 wdt:P2540 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17765","question":"Racial discrimination differs from xenophobia in some crucial ways, name another related action which differs from xenophobia.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q166005 wdt:P1889 ?answer . ?answer wdt:P460 wd:Q22126538 }","paraphrases":["Racial segregation varies from xenophobia in a few vital ways, title another related activity which contrasts from xenophobia."],"info":{}}
{"id":"train_17766","question":"What company creates Facebook?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1056 wd:Q355 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["Which company does Facebook create?"],"info":{}}
{"id":"train_17768","question":"When did Roberto Carlos start at the Brazil national football team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q429039 p:P54 ?s . ?s ps:P54 wd:Q83459 . ?s pq:P580 ?value }","paraphrases":["What date did Roberto Carlos get his start with the Brazil national football team?"],"info":{}}
{"id":"train_17770","question":"Which is the AllMusic album ID for Appetite for Destruction?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q270690 wdt:P1729 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17772","question":"Who is the {sovereign state} for {time period} of {Roman Empire}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2277 wdt:P2348 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["Who is the {imperial state} for {time period} of {Roman Empire}"],"info":{}}
{"id":"train_17774","question":"Which is the Classification of Instructional Programs code of geography?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1071 wdt:P2357 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17777","question":"For what Wilt Chamberlain was in award received in the year 1973?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q182455 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1973' ) ) }","paraphrases":["Which award did Wilt Chamberlain receive in 1973?"],"info":{}}
{"id":"train_17780","question":"When did Ernest Borgnine get married to Katy Jurado, and when did they divorce?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q102551 p:P26 ?s . ?s ps:P26 wd:Q259446 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When was Katy Jurado married to Ernest Borgnine and when did they divorce?"],"info":{}}
{"id":"train_17782","question":"How many characters are by Jacob?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P674 wd:Q289957 }","paraphrases":["Which is the number of characters by Jacob?"],"info":{}}
{"id":"train_17784","question":"What are the formulas that contain the word \"zinsstaffel\" in their name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q976981 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zinsstaffel' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which formulas carry the word \"zinsstaffel\" in their name."],"info":{}}
{"id":"train_17785","question":"Name the medication encoded by UAU that starts with letter T","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12140 . ?sbj wdt:P702 wd:Q29018237 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the medication encoded by UAU that begins with letter T"],"info":{}}
{"id":"train_17786","question":"WHICH IS THE ESTATES OF THE REALM THAT CONTAINS THE WORD PEASANT IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q657326 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'peasant' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE ESTATES OF THE REALM THAT CONTAINS THE WORD PEASANT IN THEIR NAME"],"info":{}}
{"id":"train_17790","question":"\"Who are the {creators} of {Colossus of Rhodes}, whose's {career} is {builder}?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41553 wdt:P170 ?answer . ?answer wdt:P106 wd:Q1340643 }","paraphrases":["\"Who are the {makers} of {Colossus of Rhodes}, whose's {career} is {builder}?\""],"info":{}}
{"id":"train_17793","question":"Who is Joseph Liouville's employer and what is his start time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q214549 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["Who is Joseph Liouville's boss and what is his begin time?"],"info":{}}
{"id":"train_17795","question":"Which association football club is Zinedine Zidane a member of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1835 wdt:P54 ?obj . ?obj wdt:P31 wd:Q476028 }","paraphrases":[],"info":{}}
{"id":"train_17798","question":"what is the chief executive of the label of pearl jam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q142701 wdt:P264 ?X . ?X wdt:P169 ?answer }","paraphrases":["what is the chief official of the name of pearl jam?"],"info":{}}
{"id":"train_17799","question":"Who owns F.C Porto","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P108 wd:Q128446 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who does F C Porto belong to?"],"info":{}}
{"id":"train_17800","question":"Is it true that there is only one season for the Girl from Tomorrow?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q366938 wdt:P2437 ?obj filter ( ?obj = 1 ) }","paraphrases":["Does Girl from Tomorrow only have 1 season?"],"info":{}}
{"id":"train_17801","question":"Who gave the{AWLD status} of {languages of expression} of {Patton Oswalt} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q374065 wdt:P1412 ?X . ?X wdt:P1999 ?answer }","paraphrases":["Who gave the{AWLD status} of {dialects of expression} of {Patton Oswalt} ?"],"info":{}}
{"id":"train_17802","question":"Which is the  republic of Soviet Union where Vladimir Lenin being the head of government?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q1394 . ?sbj wdt:P31 wd:Q236036 }","paraphrases":["What is the republic of Soviet Union where Vladimir Lenin being the head of government?"],"info":{}}
{"id":"train_17803","question":"What US city is the sister city of Nagasaki?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q38234 wdt:P190 ?obj . ?obj wdt:P31 wd:Q21518270 }","paraphrases":["What US city is the sister city of Nagasaki?"],"info":{}}
{"id":"train_17805","question":"How many record labels are owned by Gordon Lightfoot?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q359552 wdt:P264 ?obj }","paraphrases":["Gordon Lightfoot owns what number of record labels?"],"info":{}}
{"id":"train_17809","question":"Is Sean Connery a member of the Gaels ethnic group?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4573 wdt:P172 wd:Q692312 }","paraphrases":["Does Sean Connery belong as a member to the Gaels ethnic group?"],"info":{}}
{"id":"train_17811","question":"Is the pitting resistance equivalent number of the SAE 316L stainless steel less than 33.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28453931 wdt:P5624 ?obj filter ( ?obj < 33.6 ) }","paraphrases":["Is the setting resistance comparable number of the SAE 316L stainless steel less than 33.6?"],"info":{}}
{"id":"train_17814","question":"Name a moon of uranus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q324 wdt:P398 ?obj . ?obj wdt:P31 wd:Q2152 }","paraphrases":["Name a uranium moon"],"info":{}}
{"id":"train_17816","question":"Which is {partner town} of {Indian reservation} {Delhi Public Library} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5253788 wdt:P131 ?X . ?X wdt:P190 ?answer }","paraphrases":["Which is {accomplice town} of {Indian reservation} {Delhi Open Library} ?"],"info":{}}
{"id":"train_17820","question":"How many licence plate code does Moscow has?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q649 wdt:P395 ?obj }","paraphrases":["Give me the number of license plate numbers that Moscow has."],"info":{}}
{"id":"train_17821","question":"What award did Octavio Paz win, and how much money did he get for it?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q46739 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }","paraphrases":["What award did Octavio Paz win, and how a lot money did he get for it?"],"info":{}}
{"id":"train_17822","question":"Name the person who built Burj Khalifa","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12495 wdt:P84 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who built Burj Khalifa?"],"info":{}}
{"id":"train_17825","question":"When was Naha twinned with Fuzhou?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q181966 p:P190 ?s . ?s ps:P190 wd:Q68481 . ?s pq:P580 ?value }","paraphrases":["When were Naha and Fuzhou twinned?"],"info":{}}
{"id":"train_17826","question":"How is the population of the Cook Islands determined?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q26988 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q791801 }","paraphrases":["How is Cook Islands' population counted?"],"info":{}}
{"id":"train_17827","question":"who are sons of the actress of The Silent Enemy ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7764212 wdt:P161 ?X . ?X wdt:P40 ?answer }","paraphrases":["Who are the sons from the actress that played in The Silent Enemy?"],"info":{}}
{"id":"train_17829","question":"What exchange does the designer of x86 use?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q182933 wdt:P287 ?X . ?X wdt:P414 ?answer }","paraphrases":["What trade does the creator of x86 use?"],"info":{}}
{"id":"train_17830","question":"What is the parent taxon and the habitat of Streptococcus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q190161 wdt:P171 ?ans_1 . wd:Q190161 wdt:P2974 ?ans_2 }","paraphrases":["What is the habitat of Streptococcus and what is the parent taxon?"],"info":{}}
{"id":"train_17831","question":"When did the Isle of Wight stop being a country in the Kingdom of England?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9679 p:P17 ?s . ?s ps:P17 wd:Q179876 . ?s pq:P582 ?value }","paraphrases":["When did the Isle of Wight halt being a nation within the Kingdom of England?"],"info":{}}
{"id":"train_17832","question":"When was Wuthering Heights published and who was the publisher?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q202975 p:P747 ?s . ?s ps:P747 wd:Q16464281 . ?s pq:P123 ?value1 . ?s pq:P577 ?value2 }","paraphrases":["Who published Wuthering Heights and when?"],"info":{}}
{"id":"train_17834","question":"Was Carmelo Anthony nominated for BET Award for athlete of the year?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q129041 wdt:P1411 wd:Q4835465 }","paraphrases":["Was Carmelo Anthony nominated for the BET Award of athlete of the year?"],"info":{}}
{"id":"train_17838","question":"What is the family rank of Charles Hawker?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5078842 wdt:P1038 ?X . ?X wdt:P410 ?answer }","paraphrases":["What is the family rank of Charles Hawker?"],"info":{}}
{"id":"train_17840","question":"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P172 wd:Q5406 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["?"],"info":{}}
