{"id":"train_7789","question":"What are the health profession which start with the letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3922583 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which are the health profession which start with the letter r"],"info":{}}
{"id":"train_7790","question":"Tell me the Hindu deity that has armament in Trishula and contains the word shiva in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q979507 . ?sbj wdt:P520 wd:Q3539698 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'shiva' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the Hindu deity in Trishula who has armament and the word shiva in his name?"],"info":{}}
{"id":"train_7791","question":"When did Kiev and Kyoto become sister cities?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1899 p:P190 ?s . ?s ps:P190 wd:Q34600 . ?s pq:P580 ?value }","paraphrases":["In which year did Kiev and Kyoto became sister cities?"],"info":{}}
{"id":"train_7792","question":"What city is twinned to Los Angeles and contains the word \" Vancouver\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1549591 . ?sbj wdt:P190 wd:Q65 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vancouver' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What town is twinned to Los Angeles and contains the word \" Vancouver\" in its identify"],"info":{}}
{"id":"train_7794","question":"What is the middle name of Jim Ward that is similar to that of Yakub?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1508964 wdt:P735 ?answer . ?answer wdt:P460 wd:Q4537101 }","paraphrases":["What is the center title of Jim Ward that's comparative to that of Yakub?"],"info":{}}
{"id":"train_7798","question":"In which year did Daniel J. Boorstin receive a Bancroft prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q551252 p:P166 ?s . ?s ps:P166 wd:Q724144 . ?s pq:P585 ?value }","paraphrases":["Given the year Daniel J. Boorstin was awarded a Brancroft prize."],"info":{}}
{"id":"train_7799","question":"Who is the  {geographic envelope} for {studies} of {meteorology}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q25261 wdt:P2578 ?obj . ?obj wdt:P31 wd:Q2627400 }","paraphrases":["What is the geographic envelope for the study of meteorology?"],"info":{}}
{"id":"train_7800","question":"What is  in the  Nupill Literatura Digital - Author of Pedro II of Brazil ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q156774 wdt:P1473 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7802","question":"Using a map point of 47.0, what is the William Thomas Stead's place of death?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q288301 wdt:P20 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '47.0' ) ) }","paraphrases":["Employing a outline point of 47.0, what is the William Thomas Stead's put of death?"],"info":{}}
{"id":"train_7803","question":"Which teams did Lee Roy Selmon play for that won championships?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3228929 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Which groups did Lee Roy Selmon play for that won championships"],"info":{}}
{"id":"train_7804","question":"What is award received of E. E. Cummings that of point in time is 1944-0-0 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q298703 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1944' ) ) }","paraphrases":["What is the name of the grant of E. E. Cummings that started in 1944-0-0?"],"info":{}}
{"id":"train_7805","question":"What is {academic field for} {culture of Italy} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1992919 wdt:P2579 ?X . ?X wdt:P2578 ?answer }","paraphrases":["What is {scholarly field for} {culture of Italy} ?"],"info":{}}
{"id":"train_7807","question":"Which dependency located in Norway has the shortest coastline?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5260616 . ?ent wdt:P5141 ?obj . ?ent wdt:P131 wd:Q20 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["In Norway which dependency has the shortest coastline?"],"info":{}}
{"id":"train_7808","question":"Tell me the written work whose place of publication is France and which contains the word leagues in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47461344 . ?sbj wdt:P291 wd:Q142 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'leagues' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the work written in France, which contains the word leagues in their name"],"info":{}}
{"id":"train_7809","question":"Tell me virtue whose name has the word wisdom in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q157811 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wisdom' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the order that contains the word valentinianism in it's name?"],"info":{}}
{"id":"train_7810","question":"tell me stock market crash that contains the word market  market in the name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1020018 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'market' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know stock advertise crash that contains the word showcase advertise within the name"],"info":{}}
{"id":"train_7811","question":"which numeral system that starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q122653 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which numerical system begins with s"],"info":{}}
{"id":"train_7812","question":"Did you know the enterprise Walmart was owned by (blank)?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q483551 wdt:P127 ?obj . ?obj wdt:P31 wd:Q6881511 }","paraphrases":["Did you know that Walmart was (blank) owned by the company"],"info":{}}
{"id":"train_7813","question":"To which sovereign state and diplomatic relation does the Arab League belong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P530 wd:Q7172 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["To which sovereign state and discretionary connection does the Arab League have a place?"],"info":{}}
{"id":"train_7815","question":"How many collection are done by Museo Soumaya","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P195 wd:Q2097646 }","paraphrases":["Museo Soumaya has several collections they have worked on, what are they?"],"info":{}}
{"id":"train_7816","question":"Name the  psychoactive drug made from Papaver somniferum that starts with letter O","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3706669 . ?sbj wdt:P1582 wd:Q131584 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the psychoactive drug made from Papaver somniferum that begins with letter O"],"info":{}}
{"id":"train_7817","question":"what is in the Bashkir encyclopedia Russian version ID of encyclopedia ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5292 wdt:P4211 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7818","question":"Tell me stellar evolution whose name has the word kilonova in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6472 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'kilonova' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know stellar advancement whose title has the word kilonova in it."],"info":{}}
{"id":"train_7820","question":"What is the apparent magnitude of 486958 2014 MU69 that applies to the part of the maximum?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q18325885 p:P1215 ?s . ?s ps:P1215 ?obj . ?s pq:P518 wd:Q10578722 }","paraphrases":["486958 2014 MU69's magnitude that is part of the maximum"],"info":{}}
{"id":"train_7827","question":"WHAT STUDENTS ARE IN GRYFFINDOR IN HARRY POTTER?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8337 wdt:P674 ?obj . ?obj wdt:P31 wd:Q33179355 }","paraphrases":["WHAT STUDENTS ARE IN HARRY POTTER GRYFFINDOR?"],"info":{}}
{"id":"train_7828","question":"Which {country for sport} is the {sport} of {Mike_Tyson} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q79031 wdt:P1532 ?ans_1 . wd:Q79031 wdt:P641 ?ans_2 }","paraphrases":["Which {country for sport} is the {sport} of {Mike_Tyson} ?"],"info":{}}
{"id":"train_7829","question":"What is {language used} on {telenovela}, that has a {distribution map} of {idioma espanol en el mundo. PNG} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23745 wdt:P407 ?answer . ?answer wdt:P1846 ?x FILTER ( contains ( ?x , 'Idioma español en el mundo.PNG' ) ) }","paraphrases":["What is {dialect utilized} on {telenovela}, that features a {conveyance outline} of {idioma espanol en el mundo. PNG} ?"],"info":{}}
{"id":"train_7830","question":"What female is Rob Reiner's sister?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q287607 wdt:P3373 ?answer . ?answer wdt:P21 wd:Q6581072 }","paraphrases":["What female is Ransack Reiner's sister?"],"info":{}}
{"id":"train_7831","question":"When did the country Cluj-Napoca become the Principality of Transylvania?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q100188 p:P17 ?s . ?s ps:P17 wd:Q655621 . ?s pq:P580 ?value }","paraphrases":["When did Cluj-Napoca change to the Principality of Transylvania?"],"info":{}}
{"id":"train_7832","question":"When was The Big Bang Theory nominated for a Primetime Emmy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8539 p:P1411 ?s . ?s ps:P1411 wd:Q17010286 . ?s pq:P585 ?value }","paraphrases":["In what year did The Big Bang Theory receive it's Emmy nomination?"],"info":{}}
{"id":"train_7834","question":"For what was John Mayer in nomination in the year 2002?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q215215 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["John Mayer was nominated for what in 2002?"],"info":{}}
{"id":"train_7836","question":"What is the hometown of Thomas Pynchon and when did he live there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35155 wdt:P551 ?X . ?X wdt:P421 ?answer }","paraphrases":["What kind of instructional ride does Mieczyslaw Kobylanski have?"],"info":{}}
{"id":"train_7839","question":"Who was the wife of Rollo ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P26 wd:Q273773 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was Rollo's wife?"],"info":{}}
{"id":"train_7841","question":"What is Pepin the Hunchback's date of birth?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q302212 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["When was Pepin the Hunchback born?"],"info":{}}
{"id":"train_7843","question":"Tell me military order whose name has the word  saint in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q474717 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'saint' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know military arrange whose title has the word holy person in it."],"info":{}}
{"id":"train_7844","question":"What branch of the German army has a toponym of Beer Hall Putsch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36749 wdt:P138 ?answer . ?answer wdt:P241 wd:Q313422 }","paraphrases":["What department of the German army has a toponym of Beer Hall Putsch?"],"info":{}}
{"id":"train_7846","question":"Who is the  {group of organisms known by one particular common name} for {this taxon is source of} of {cashmere}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1672 wd:Q333631 . ?sbj wdt:P31 wd:Q55983715 }","paraphrases":["Who is the {bunch of living beings known by one specific common title} for {this taxon is source of} of {cashmere}"],"info":{}}
{"id":"train_7848","question":"When is the date of commencement of the book publish for Astronomy and Astrophysics","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q752075 wdt:P123 ?X . ?X wdt:P571 ?answer }","paraphrases":["At the point when is the date of beginning of the book distribute for Astronomy and Astrophysics"],"info":{}}
{"id":"train_7849","question":"Is the salinity of North Atlantic Deep Water equal to 28?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q921070 wdt:P4350 ?obj filter ( ?obj = 28.0 ) }","paraphrases":["Is the saltiness of North Atlantic Profound Water break even with to 28?"],"info":{}}
{"id":"train_7850","question":"The antiparticle of an elementary particle is what premium particle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2152 wd:Q43116 . ?sbj wdt:P31 wd:Q22675015 }","paraphrases":["The antiparticle of an rudimentary molecule is what premium particle?"],"info":{}}
{"id":"train_7851","question":"Which stone bridge has the longest span?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3397526 . ?ent wdt:P2787 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the stone bridge that was the longest lasting."],"info":{}}
{"id":"train_7853","question":"Is the number of viewers/listeners of The Plow That Broke the Plains less than 8000000.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2480639 wdt:P5436 ?obj filter ( ?obj < 8000000.0 ) }","paraphrases":["Is the number of viewers/listeners of The Plow That Broke the Fields less than 8000000.0?"],"info":{}}
{"id":"train_7857","question":"Who is the person as the professional or sports partner of Carole King?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1327 wd:Q217787 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is the name of Carole King's professional partner?"],"info":{}}
{"id":"train_7858","question":"Which is the city that is capital of Seville?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1376 wd:Q8717 . ?sbj wdt:P31 wd:Q515 }","paraphrases":["Which is the city that's capital of Seville?"],"info":{}}
{"id":"train_7861","question":"Tell me the dog breed that has Germany as country of origin and starts with the letter w?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q39367 . ?sbj wdt:P495 wd:Q183 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the pooch breed that has Germany as nation of root and begins with the letter w?"],"info":{}}
{"id":"train_7862","question":"What is Epguides ID for The Fresh Prince of Bel-Air","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q309063 wdt:P3121 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7863","question":"Who is the head of state of South Australia who started in the year 1952?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q35715 p:P35 ?s . ?s ps:P35 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1952' ) ) }","paraphrases":["In 1952, who was the new head of state of South Australia?"],"info":{}}
{"id":"train_7865","question":"When did the child of Pedro I, Isabel Maria de Alcântara Brasileira, die and when was she born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q3154857 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When did the infant of Pedro I, Isabel Maria de Alcântara Brasileira, die and when was she born?"],"info":{}}
{"id":"train_7866","question":"Which people contains the word wuhuan in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2472587 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wuhuan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which individuals contains the word wuhuan in their name"],"info":{}}
{"id":"train_7867","question":"Which is the literary work of the writer Dante Alighieri?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P50 wd:Q1067 . ?sbj wdt:P31 wd:Q7725634 }","paraphrases":["Which is the scholarly work of the author Dante Alighieri?"],"info":{}}
{"id":"train_7869","question":"Who is the governor for the head of state of Tasmania?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q34366 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q132050 }","paraphrases":["Who is the senator for the head of state of Tasmania?"],"info":{}}
{"id":"train_7871","question":"\"Which adjacent to Kyiv Oblast, was initiated on February 2 1932?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170036 wdt:P47 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1932' ) ) }","paraphrases":["Which adjacent was initiated to Kyiv Oblast on February 2, 1932?"],"info":{}}
{"id":"train_7872","question":"Who was the disciple and mentor of Wilhelm Grosz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5772932 wdt:P1066 ?X . ?X wdt:P802 ?answer }","paraphrases":["Who was Wilhelm Grosz's disciple and mentor?"],"info":{}}
{"id":"train_7874","question":"Who is responsible for legislating Seaview Range?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2262451 wdt:P4552 ?X . ?X wdt:P2348 ?answer }","paraphrases":["Who is assigned to legislate Seaview Range?"],"info":{}}
{"id":"train_7875","question":"how many cites are in a mathematical theory of communication?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2860 wd:Q724029 }","paraphrases":["How many cities make up a mathematical theory of communication?"],"info":{}}
{"id":"train_7879","question":"Lady Gaga wrote the lyrics for which song?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P676 wd:Q19848 . ?sbj wdt:P31 wd:Q134556 }","paraphrases":["Woman Gaga composed the verses for which tune?"],"info":{}}
{"id":"train_7881","question":"Which music by Egmont describes the disease of Crohn's disease?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1156413 wdt:P86 ?answer . ?answer wdt:P1050 wd:Q1472 }","paraphrases":["Which Egmont music describes Crohn's disease disease?"],"info":{}}
{"id":"train_7882","question":"Tell me the redshift of the planetary system called R136.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5116 wdt:P397 ?X . ?X wdt:P1090 ?answer }","paraphrases":["Let me know the redshift of the planetary framework called R136."],"info":{}}
{"id":"train_7884","question":"does ostrivets have an area that is 0.0 or greater?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4338939 wdt:P2046 ?obj filter ( ?obj > 0.0 ) }","paraphrases":["does ostrivets have an range that's 0.0 or greater?"],"info":{}}
{"id":"train_7885","question":"How many professorships are in the College de France?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P803 wd:Q202660 }","paraphrases":["College de France has how many professorships?"],"info":{}}
{"id":"train_7886","question":"What award did Paul Dirac win together with someone else?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q47480 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 ?value1 . }","paraphrases":["What award has Paul Dirac and somebody else won?"],"info":{}}
{"id":"train_7887","question":"What position did Shigeru Yoshida hold beginning on 5-22-1946?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q301804 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1946' ) ) }","paraphrases":["What position did Shigeru Yoshida hold starting on 5-22-1946?"],"info":{}}
{"id":"train_7888","question":"When did Faina Ranevskaya stop working at the Mossovet Theatre?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q470466 p:P108 ?s . ?s ps:P108 wd:Q571291 . ?s pq:P582 ?value }","paraphrases":["At what time did Faina Ranevskaya stop working at the Mossovet Theatre?"],"info":{}}
{"id":"train_7890","question":"what is for wolverine has subject has role as title character?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q186422 p:P2868 ?s . ?s ps:P2868 wd:Q3246821 . ?s pq:P642 ?value }","paraphrases":["What is the subject for the role of Wolverine as title character?"],"info":{}}
{"id":"train_7892","question":"Which has parts of the class of baryon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q159731 wdt:P2670 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7893","question":"Is the Lagangilang electorate equal to 8717?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q29020 wdt:P1831 ?obj filter ( ?obj = 8717 ) }","paraphrases":["what is the total of the lagangilang electorate?"],"info":{}}
{"id":"train_7894","question":"Name the earthquake that showed a Mercalli scale of IX but had the least magnitude on the Richter scale?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7944 . ?ent wdt:P2528 ?obj . ?ent wdt:P2784 wd:Q23925706 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What earthquake had a Mercalli scale of IX but the lowest Richter scale magnitude?"],"info":{}}
{"id":"train_7895","question":"Which is the Pleiades place type identifier for estuary?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q47053 wdt:P2938 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7896","question":"What was the last position held by Ariel Sharon on 5th August 1981?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q60206 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1981' ) ) }","paraphrases":["What position did Ariel Sharon hold on August 5th 1981?"],"info":{}}
{"id":"train_7897","question":"What is the Commonwealth realm with the highest number of children out of school?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q202686 . ?ent wdt:P2573 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Commonwealth area has the most amount of children not attending school?"],"info":{}}
{"id":"train_7900","question":"Which is the natural reservoir for Pteropodidae?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q185230 wdt:P1606 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7901","question":"Which is the Treccani ID for psychiatry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7867 wdt:P3365 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7904","question":"Which country replaced Czechoslovakia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1365 wd:Q33946 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["Which country has Czechoslovakia replaced?"],"info":{}}
{"id":"train_7905","question":"Who is the {gene} for {genetic association} of {hepatitis C}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2293 wd:Q154869 . ?sbj wdt:P31 wd:Q7187 }","paraphrases":["Who is the {quality} for {hereditary affiliation} of {hepatitis C}"],"info":{}}
{"id":"train_7906","question":"Who gave the {has grammatical person} of {used language} of {Donald Pleasence} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q314914 wdt:P1412 ?X . ?X wdt:P5110 ?answer }","paraphrases":["Who gave the {has syntactic individual} of {utilized dialect} of {Donald Pleasence} ?"],"info":{}}
