{"id":"train_7527","question":"What is the type of music of the music by of Beethoven's piano sonatas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11887907 wdt:P86 ?X . ?X wdt:P136 ?answer }","paraphrases":["What kind of music does Beethoven's piano sonata make of the music?"],"info":{}}
{"id":"train_7528","question":"What is the town with min male population located in the administrative territorial entity Tasmania?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3957 . ?ent wdt:P1540 ?obj . ?ent wdt:P131 wd:Q34366 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which town in Tasmania has the least number of males?"],"info":{}}
{"id":"train_7530","question":"Where was Satoshi Urushihara born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q549755 wdt:P19 ?X . ?X wdt:P131 ?answer }","paraphrases":["Where was Satoshi Urushihara born?"],"info":{}}
{"id":"train_7531","question":"Who was the spouse of Ridley Scott prior to their divorce in 1975?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q56005 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1975' ) ) }","paraphrases":["Which  was the spouse of Ridley Scott prior to their divorce in 1975?"],"info":{}}
{"id":"train_7533","question":"What characters are mentioned in Death: The Time of Your Life?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3704293 wdt:P674 ?X . ?X wdt:P1441 ?answer }","paraphrases":["The Time of Your Life mentions what characters in Death?"],"info":{}}
{"id":"train_7534","question":"What is the given name of Stephen Paddock in Season 1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41529365 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '1' ) ) }","paraphrases":["In Season 1, What was Stephen Paddock's given name?"],"info":{}}
{"id":"train_7535","question":"WHERE IS THE HQ LOCATION OF IZZY ASPER PARTY MEMBER?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3155643 wdt:P102 ?X . ?X wdt:P159 ?answer }","paraphrases":["WHERE IS THE HQ Area OF IZZY ASPER PARTY MEMBER?"],"info":{}}
{"id":"train_7537","question":"What NFPA-listed chemical compound has the most potential to contribute to global warming?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2565 ?obj . ?ent wdt:P4952 wd:Q51139288 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Tell me what NFPA-listed chemical compound has the most potential to contribute to global warming"],"info":{}}
{"id":"train_7541","question":"Who was the employer of Alan M. Kriegsman that ended in 1996?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2636772 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1996' ) ) }","paraphrases":["Who was employing Alan M. Kriegsman up until 1996?"],"info":{}}
{"id":"train_7544","question":"What human biblical figure starts with the letter \"z\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20643955 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What human scriptural figure begins with the letter \"z\"?"],"info":{}}
{"id":"train_7545","question":"Which board game that practiced by backgammon player and which that starts with the letter b","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131436 . ?sbj wdt:P3095 wd:Q23929009 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which board game that practiced by backgammon player and which that begins with the letter b"],"info":{}}
{"id":"train_7546","question":"Which team is Ryan Giggs a member of","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10524 wdt:P54 ?obj . ?obj wdt:P31 wd:Q6979593 }","paraphrases":["Which group is Ryan Giggs a part of"],"info":{}}
{"id":"train_7547","question":"What is the native language of the Khazars?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q173282 wdt:P103 ?obj . ?obj wdt:P31 wd:Q34770 }","paraphrases":["What is the local dialect of the Khazars?"],"info":{}}
{"id":"train_7550","question":"did nelson rockefeller end his term in 1973-12-18?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11237 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1973' ) ) }","paraphrases":["When did Nelson Rockefeller end his term?"],"info":{}}
{"id":"train_7551","question":"IS THE EULER CHARACTERISTIC OF  BARLOW SURFACE EQUALS 13.2","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4861234 wdt:P6438 ?obj filter ( ?obj = 13.2 ) }","paraphrases":["IS THE BARLOW SURFACE EQUALS 13.2 EULER CHARACTERISTIC."],"info":{}}
{"id":"train_7552","question":"Of which terrorist group is Abu Musab al-Zarqawir chairperson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P488 wd:Q181049 . ?sbj wdt:P31 wd:Q4456236 }","paraphrases":["Of which fear monger bunch is Abu Musab al-Zarqawir chairperson?"],"info":{}}
{"id":"train_7553","question":"What 24 Hours of Le Mans entry with an Englebert racing tire had the least number of laps?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q55096520 . ?ent wdt:P5349 ?obj . ?ent wdt:P121 wd:Q54988955 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["In the 24 Hours of Le Mans race, which entry with Englebert racing tires made the least amount of laps?"],"info":{}}
{"id":"train_7554","question":"Which country Paul von Hindenburg was the head of state of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P35 wd:Q2667 . ?sbj wdt:P31 wd:Q3024240 }","paraphrases":["Which nation Paul von Hindenburg was the head of state of?"],"info":{}}
{"id":"train_7555","question":"What are the painting movement which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3326867 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the portray development which begin with the letter v"],"info":{}}
{"id":"train_7559","question":"What is constructed out  of portrait of Brothel Scene ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17189254 wdt:P180 ?X . ?X wdt:P186 ?answer }","paraphrases":["The portrait of Brothel Scene constructs what?"],"info":{}}
{"id":"train_7560","question":"Where in New York did George Balanchine die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q310184 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P131 wd:Q1384 }","paraphrases":["What was the NY location of George Balanchine's passing?"],"info":{}}
{"id":"train_7561","question":"How many goals scored and matches played does Juan Alberto Schiaffino have as a member of the Uruguay national football team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q332064 p:P54 ?s . ?s ps:P54 wd:Q134916 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["How many dreams scored and suits played does Juan Alberto Schiaffino have as a member of the Uruguay country wide soccer team?"],"info":{}}
{"id":"train_7562","question":"What's the study of logic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2579 wd:Q8078 }","paraphrases":["The study of logic is for what area of learning?"],"info":{}}
{"id":"train_7563","question":"Which team did Serge Blanco start on in 1/1/1984?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1322456 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["What group did Serge Blanko form in 1984?"],"info":{}}
{"id":"train_7564","question":"DOES TH NUMBER OF SURVIVORS OF UNITED AIRLINES FLIGHT 823 IS LESS THAN 0.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7887363 wdt:P1561 ?obj filter ( ?obj < 0.0 ) }","paraphrases":["How many survived United Airlines Flight 823 crash?"],"info":{}}
{"id":"train_7565","question":"What are the hot spring which start with the letter m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3273292 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the hot spring which begin with the letter m"],"info":{}}
{"id":"train_7567","question":"What is Leopoldina member ID for Otto Hahn ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q57065 wdt:P3413 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7568","question":"What are Julie Andrews spouse's and child's names?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q161819 wdt:P40 ?ans_1 . wd:Q161819 wdt:P26 ?ans_2 }","paraphrases":["What are the names of Julie Andrews' husband and children?"],"info":{}}
{"id":"train_7569","question":"Is it true that the number of perpetrators of the 1999 Armenian parliament shooting equal 8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1975720 wdt:P3886 ?obj filter ( ?obj = 8 ) }","paraphrases":["Were there 8 perpetrators of the 1999 Armenian parliament shooting?"],"info":{}}
{"id":"train_7572","question":"Does the Independent have a publication interval that is equal to 1.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q11149 wdt:P2896 ?obj filter ( ?obj = 1.2 ) }","paraphrases":["Is 1.2 the publication interval of the Independent?"],"info":{}}
{"id":"train_7573","question":"When did Neil deGrasse Tyson recieve the Hubbard Medal award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q310903 p:P166 ?s . ?s ps:P166 wd:Q4287207 . ?s pq:P585 ?value }","paraphrases":["When Neil deGrasse was presented with the Hubbard Medal award, what was the date?"],"info":{}}
{"id":"train_7574","question":"what is less than gas","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11432 wdt:P5136 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7578","question":"what is the flag of Dominica?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q784 wdt:P163 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7580","question":"Which is the life expectancy for Cardigan Welsh Corgi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q29072 wdt:P2250 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7585","question":"What country shares a border with Northern Territory and is along the 26th parallel south?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3235 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P805 wd:Q1390493 }","paraphrases":["Which country borders with Northern Territory and runs along the 26th parallel south?"],"info":{}}
{"id":"train_7586","question":"What is the key event of the terminating connection of Britz Canal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q315302 wdt:P559 ?X . ?X wdt:P793 ?answer }","paraphrases":["What is the key occasion of the ending association of Britz Canal?"],"info":{}}
{"id":"train_7587","question":"Tell me about member of sports team of Lionel Messi and number of matches played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q615 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["Tell me about member of sports activities team of Lionel Messi and quantity of fits played?"],"info":{}}
{"id":"train_7589","question":"Was John Quincy Adams a United States Ambassador to Germany and to the Netherlands?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q11816 wdt:P39 wd:Q326552 . wd:Q11816 wdt:P39 wd:Q7889414 }","paraphrases":["Is it true that John Quincy Adams was a United States Ambassador to Germany and to the Netherlands?"],"info":{}}
{"id":"train_7590","question":"Is the frequency of the Sky Polarization Observatory equal to 25.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q511405 wdt:P2144 ?obj filter ( ?obj = 25.6 ) }","paraphrases":["Is the Sky Polarization Observatory's frequency 25.6?"],"info":{}}
{"id":"train_7591","question":"To which sports team is Roberto Carlos a member and how many matches has he played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q429039 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["Name the sports team and the number of matches Roberto Carlos has played for."],"info":{}}
{"id":"train_7592","question":"\"What is the {different than} of {waltz}, with the {movie director} of {Norbert ter Hall}?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q193434 wdt:P1889 ?answer . ?answer wdt:P57 wd:Q2110132 }","paraphrases":["\"What is the { different than } of { waltz }, with { Norbert ter Hall's { movie director }?\""],"info":{}}
{"id":"train_7593","question":"Which is the history of languages spoken, written, or signed by Umar ibn Al-Khattāb?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8467 wdt:P1412 ?X . ?X wdt:P2184 ?answer }","paraphrases":["What is the history of languages that Umar ibn Al - Khattāb has spoken, written, or signed?"],"info":{}}
{"id":"train_7597","question":"Is Toni Braxton's record label Elektra Records or Arista Records?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q155412 wdt:P264 wd:Q726251 . wd:Q155412 wdt:P264 wd:Q664167 }","paraphrases":["Is Elektra Records of Arista Records the label that Toni Braxton works with?"],"info":{}}
{"id":"train_7599","question":"What is the approximate date of birth of Eusebius of Caesarea?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q142999 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1480 wd:Q5727902 }","paraphrases":["When was Eusebius of Caesarea born, approximately?"],"info":{}}
{"id":"train_7601","question":"Who is Andre Agassi's spouse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7407 wdt:P26 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Andre Agassi's life partner?"],"info":{}}
{"id":"train_7605","question":"What is made by the Glenfiddich Distillery?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q911587 wdt:P176 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What's the Glenfiddich Distillery doing?"],"info":{}}
{"id":"train_7606","question":"What is the {health specialty} and the {genetic association} of {Dyslexia} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q132971 wdt:P1995 ?ans_1 . wd:Q132971 wdt:P2293 ?ans_2 }","paraphrases":["What is the medical association of Dyslexia?"],"info":{}}
{"id":"train_7607","question":"Name a modern language that contain the word \" russian\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1288568 . ?sbj wdt:P5110 wd:Q51929403 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'russian' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a present day dialect that contain the word \" russian\" in its title"],"info":{}}
{"id":"train_7609","question":"What is in conflict in the narrative of The Hall of Presidents?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3126038 wdt:P1441 ?X . ?X wdt:P607 ?answer }","paraphrases":["What is the conflict in the book the Hall of Presidents?"],"info":{}}
{"id":"train_7612","question":"What are the temple which start with the letter ġgantija","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q44539 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ġgantija' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the temple which begin with the letter ġgantija"],"info":{}}
{"id":"train_7615","question":"What is ARM architecture developing with an end date of 2000-11-1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16980 wdt:P178 ?answer . ?answer wdt:P576 ?x FILTER ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["What is ARM engineering creating with an conclusion date of 2000-11-1?"],"info":{}}
{"id":"train_7619","question":"What is the diplomatic relation the location in Histories?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q746583 wdt:P840 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is the location of the diplomatic relation in Histories?"],"info":{}}
{"id":"train_7620","question":"n biology, a taxon (plural taxa; back-formation from taxonomy) is a group of one or more populations of an organism or organisms seen by taxonomists to form a unit.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q54822528 wdt:P703 ?X . ?X wdt:P1672 ?answer }","paraphrases":["N Biology, a taxon (plural taxa ; taxonomy background) is a group of one or more organism populations or organisms that taxonomists see as forming a unit."],"info":{}}
{"id":"train_7622","question":"Where is the {country of origin} and the {location of formation} of {Van_Halen} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q190155 wdt:P495 ?ans_1 . wd:Q190155 wdt:P740 ?ans_2 }","paraphrases":["What city and country are Van Halen from?"],"info":{}}
{"id":"train_7625","question":"What award did Theolonious Monk receive and when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q109612 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What grant did Theolonious Minister get and when?"],"info":{}}
{"id":"train_7629","question":"Who is the voice actor for Star Wars Episode V: The Empire Stikes Back","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q181795 wdt:P725 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the voice performing artist for Star Wars Scene V: The Realm Stikes Back"],"info":{}}
{"id":"train_7631","question":"What is the discipline of the advisor of Joseph Malegue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3042797 wdt:P184 ?X . ?X wdt:P101 ?answer }","paraphrases":["Give me the name of advisor Joseph Malegue's discipline."],"info":{}}
{"id":"train_7632","question":"Who did Steve Bannon work for during the 2016 United States presidential election?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q16146870 wdt:P108 ?obj . ?obj wdt:P31 wd:Q20639925 }","paraphrases":["Who did Steve Bannon work for amid the 2016 Joined together States presidential race?"],"info":{}}
{"id":"train_7633","question":"Tell me the name of a noble family that starts with the letter ü.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13417114 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ü' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the title of a respectable family that begins with the letter ü."],"info":{}}
{"id":"train_7635","question":"When was Aldous Huxley received James Tait Black Memorial Prize award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q81447 p:P166 ?s . ?s ps:P166 wd:Q392586 . ?s pq:P585 ?value }","paraphrases":["The James Tait Black Memorial prize was awarded to Aldous Huxley in what year?"],"info":{}}
{"id":"train_7636","question":"What is the safety classification and labelling for Hydrogen Chloride which is a NFPA Special category acid?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q211086 p:P4952 ?s . ?s ps:P4952 ?obj . ?s pq:P877 ?x filter ( contains ( ?x , 'ACID' ) ) }","paraphrases":["For the NFPA Special Category acid Hydrogen Chloride, what is it's safety classification and labeling?"],"info":{}}
{"id":"train_7638","question":"Who is the {human} for {influenced by} of {J. Robert Oppenheimer}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P737 wd:Q132537 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["For { influenced by } of { J, who is the { human}. Oppenheimer Robert"],"info":{}}
{"id":"train_7639","question":"What sports team and position did Bobby Moore play for, and how did he die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q191492 wdt:P1196 ?ans_1 . wd:Q191492 wdt:P413 ?ans_2 }","paraphrases":["Who Bobby Moore play for and in what role? What was his cause of death?"],"info":{}}
{"id":"train_7640","question":"Whats the filming location of Thane?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P915 wd:Q207749 }","paraphrases":[],"info":{}}
{"id":"train_7641","question":"Lagos is located in what time zone and had what category of films shot at this location?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q8673 wdt:P1740 ?ans_1 . wd:Q8673 wdt:P421 ?ans_2 }","paraphrases":["What time zone and category of films is Lagos?"],"info":{}}
{"id":"train_7642","question":"Is the grammatical gender of Georges Cziffra male?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q254333 wdt:P1412 ?answer . ?answer wdt:P5109 wd:Q499327 }","paraphrases":["Is the syntactic sexual orientation of Georges Cziffra male?"],"info":{}}
{"id":"train_7643","question":"What are the deductive language which start with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5249852 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the deductive language that begins with letter p"],"info":{}}
{"id":"train_7645","question":"Which is people or cargo transported of people?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3437 wd:Q2472587 }","paraphrases":[],"info":{}}
{"id":"train_7651","question":"Which member of Colin Meads started in 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q642380 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["Who in Colin Meads began in 2014?"],"info":{}}
{"id":"train_7654","question":"Francisco de Mirandad held what place?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q311447 wdt:P39 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7655","question":"What was the population of Harbin in 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q42956 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["in 2016, what was the population of Harbin?"],"info":{}}
{"id":"train_7658","question":"Who was Clark Gable's father?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P22 wd:Q71243 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was Clark Gable's father"],"info":{}}
{"id":"train_7661","question":"Mention the citizenship of Czechoslovakia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P27 wd:Q33946 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Specify the citizenship of Czechoslovakia"],"info":{}}
{"id":"train_7662","question":"What time does the First Minister of Northern Ireland, David Trimble, finish?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q192556 p:P39 ?s . ?s ps:P39 wd:Q22979263 . ?s pq:P582 ?value }","paraphrases":["David Trimble, the First Minister of Northern Ireland, finishes at what time?"],"info":{}}
{"id":"train_7663","question":"\"Which is {language read} of {Inigo Jones}, that has {role model} is {French} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q295929 wdt:P1412 ?answer . ?answer wdt:P737 wd:Q150 }","paraphrases":["\"Which is {dialect studied} of {Inigo Jones}, that has {part demonstrate} is {French} ?\""],"info":{}}
{"id":"train_7664","question":"Is the units sold of the Roti Island snake-necked turtle more than 16.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q304547 wdt:P2664 ?obj filter ( ?obj > 16.0 ) }","paraphrases":["Were there more than 16.0 units sold of the Roti Island snake-necked turtle?"],"info":{}}
