{"id":"train_12438","question":"What is the position of William Archibald Dunning as a member of the American Historical Association?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8004524 p:P463 ?s . ?s ps:P463 wd:Q464915 . ?s pq:P2868 ?value }","paraphrases":["When William Archibald was a member of the American Historical Association, what was his position during that time?"],"info":{}}
{"id":"train_12440","question":"What is the method Agadir used to count its population as 254865.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q170525 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '254865.0' ) ) . ?s pq:P459 ?value }","paraphrases":["By what means did Agadir determine its population to be 254865.0?"],"info":{}}
{"id":"train_12442","question":"TELL ME SCIENTIFIC HYPOTHESIS WHOSE NAME HAS THE WORD THEORY IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q30125896 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'theory' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME SCIENTIFIC HYPOTHESIS IN THE WORD THEORY."],"info":{}}
{"id":"train_12447","question":"What are the interpreted language  that contain the word \"yorick\" in their name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1993334 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yorick' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the interpreted language that contain word \"yorick\"?"],"info":{}}
{"id":"train_12448","question":"How was Don Lafontaine murdered?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q449126 wdt:P509 ?X . ?X wdt:P1692 ?answer }","paraphrases":["How was the murder of Don Lafontaine?"],"info":{}}
{"id":"train_12449","question":"What is the pressure of helium if it has a refractive index of 1.00004?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q560 p:P1109 ?s . ?s ps:P1109 ?x filter ( contains ( ?x , '1.00004' ) ) . ?s pq:P2077 ?value }","paraphrases":["If Helium's refractive index is 1.00004, what is the pressure?"],"info":{}}
{"id":"train_12450","question":"What are the vocal group which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q120544 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the vocal gather which begin with the letter w"],"info":{}}
{"id":"train_12451","question":"Which is the village which contains the word tonbak in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q532 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tonbak' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the town which contains the word tonbak in it's name?"],"info":{}}
{"id":"train_12453","question":"What is pronunciation audio  for Disturbed that is {anguage of work or name is American English?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131366 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q7976 }","paraphrases":["How is the audio for Disturbed pronounced?"],"info":{}}
{"id":"train_12454","question":"was emike Mcgear sibling to paul_McCartney","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2599 wdt:P3373 wd:Q556941 }","paraphrases":["Was Paul McCartney's sibling Mike McGear?"],"info":{}}
{"id":"train_12455","question":"\"What is {method of murder} of {István Fekete}, which has {used for treatment} is {PLAU} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q721759 wdt:P509 ?answer . ?answer wdt:P2176 wd:Q417169 }","paraphrases":["\"What is { method of { István Fekete } murder, which is { PLAU } used for treatment?\""],"info":{}}
{"id":"train_12456","question":"what is health specialty starts name s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q44597158 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is wellbeing strength begins title s"],"info":{}}
{"id":"train_12458","question":"What was Arnold Schwarzenegger's role in The Terminator?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q162255 p:P161 ?s . ?s ps:P161 wd:Q2685 . ?s pq:P453 ?value }","paraphrases":["Which role did Arnold Schwarzenegger play in Terminator?"],"info":{}}
{"id":"train_12461","question":"Who wrote part of the Balada de un dia de Julio?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q50217830 wdt:P1433 ?X . ?X wdt:P50 ?answer }","paraphrases":["Who has written part of the Julio's Balada de un dia?"],"info":{}}
{"id":"train_12464","question":"What is the twin cities of the birth location of Betty Sun?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2547121 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the twin cities of the birth area of Betty Sun?"],"info":{}}
{"id":"train_12466","question":"When did Bill Russell receive the NBA most valuable player award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q242185 p:P166 ?s . ?s ps:P166 wd:Q222047 . ?s pq:P585 ?value }","paraphrases":["In what year did the NBA Most Valuable Player Award go to Bill Russell?"],"info":{}}
{"id":"train_12468","question":"Where is {place of death} of {Helen Keller} that is {located in the administrative territorial entity} is {Connecticut} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q38203 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P131 wd:Q779 }","paraphrases":["Where, in the territory  of Connecticut, did Helen Keller die?"],"info":{}}
{"id":"train_12469","question":"How many stars are in the same galaxy as Jupiter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P398 wd:Q319 . ?sbj wdt:P31 wd:Q3592493 }","paraphrases":["What is the total number of stars in the galaxy that contains the planet Jupiter?"],"info":{}}
{"id":"train_12470","question":"WHo was Julia Roberts mother ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P25 wd:Q40523 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["WHo was Julia Roberts mother ?"],"info":{}}
{"id":"train_12471","question":"Name the institution whose alumni is Samuel Taliaferro Rayburn who asmin HQ is in Austin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1378052 wdt:P69 ?answer . ?answer wdt:P159 wd:Q16559 }","paraphrases":["Name the institution whose alumni in Austin is Samuel Taliaferro Rayburn?"],"info":{}}
{"id":"train_12472","question":"What is Ms. Pac-Man's mame rom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2141683 wdt:P2451 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12473","question":"who is the railway bridge for next crossing upstream of London Bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q130206 wdt:P2673 ?obj . ?obj wdt:P31 wd:Q1210334 }","paraphrases":["who is the railroad bridge for another crossing upstream of London Bridge?"],"info":{}}
{"id":"train_12475","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8692 wdt:P1313 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["does not apply"],"info":{}}
{"id":"train_12477","question":"tell me ballet name starts with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15079786 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know expressive dance title begins with the letter t"],"info":{}}
{"id":"train_12478","question":"What award did Lloyd Shapely receive on Jan. 1, 2012?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q244739 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2012' ) ) }","paraphrases":["Which award did Llyod Shapely get in 2012, 1st January?"],"info":{}}
{"id":"train_12479","question":"When was Henri Cartier-Bresson married to Ratna Mohini?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q156567 p:P26 ?s . ?s ps:P26 wd:Q3892810 . ?s pq:P582 ?value }","paraphrases":["What time frame was Henri Cartier-Bresson married to Ratna Mohini?"],"info":{}}
{"id":"train_12480","question":"Who is the {human} for {professional or sports partner} of {Scott Moir}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q440940 wdt:P1327 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What is the name of Scott Moir's sports partner?"],"info":{}}
{"id":"train_12481","question":"What university, which includes the University of Michigan College of Pharmacy, did Edward Higgins White attend?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q216726 wdt:P69 ?answer . ?answer wdt:P355 wd:Q7895755 }","paraphrases":["What college, which incorporates the College of Michigan College of Drug store, did Edward Higgins White attend?"],"info":{}}
{"id":"train_12484","question":"Was the precipitation height of the January 2016 United States winter storm equal to 40.5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q22222608 wdt:P3036 ?obj filter ( ?obj = 40.5 ) }","paraphrases":["Was 40.5 the precipitation height of the January 2016 United States winter storm?"],"info":{}}
{"id":"train_12485","question":"Which is the list of historical unrecognized state for Jefferson Davis as head of government?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q162269 . ?sbj wdt:P31 wd:Q4818345 }","paraphrases":[],"info":{}}
{"id":"train_12487","question":"What is the diplomatic relation of Cambodia whose national anthem is Hatikvah?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q424 wdt:P530 ?answer . ?answer wdt:P85 wd:Q130865 }","paraphrases":["What is the diplomatic relation of Cambodia whose countrywide anthem is Hatikvah?"],"info":{}}
{"id":"train_12489","question":"Which is the city of the twinned administrative body of Hamburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1055 wdt:P190 ?obj . ?obj wdt:P31 wd:Q7930989 }","paraphrases":[],"info":{}}
{"id":"train_12490","question":"How is the output of an energy transformer measured?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40643813 wdt:P1542 ?X . ?X wdt:P1880 ?answer }","paraphrases":["How is the yield of an vitality transformer measured?"],"info":{}}
{"id":"train_12492","question":"How much acetylcholine physically interacts with an individual?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P129 wd:Q180623 }","paraphrases":["Which is the amount of acetylcholine that physically interacts with an individual?"],"info":{}}
{"id":"train_12493","question":"Who is the person for the patron saint of Rome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q220 wdt:P417 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the individual for the supporter holy person of Rome?"],"info":{}}
{"id":"train_12494","question":"What is female about Jan Karol Chodkiewicz, which is not the same as a man?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q540840 wdt:P21 ?answer . ?answer wdt:P1889 wd:Q8441 }","paraphrases":["What is lady about Jan Karol Chodkiewicz, which is not the identical as a man?"],"info":{}}
{"id":"train_12495","question":"who are the member and member of political party for Nikita_Khrushchev","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q35314 wdt:P102 ?ans_1 . wd:Q35314 wdt:P463 ?ans_2 }","paraphrases":["whos are the members of Nikita Khrushchev's political party?"],"info":{}}
{"id":"train_12496","question":"When  Artemio Franchi is retired as chairperson for Union of European Football Associations?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q35572 p:P488 ?s . ?s ps:P488 wd:Q347341 . ?s pq:P582 ?value }","paraphrases":["When did Artemio Franchi retire the position of chairperson for the Union of European Football Associations?"],"info":{}}
{"id":"train_12497","question":"What is located in the Battle of Sedan, that has a human population of 17,248?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q156681 wdt:P276 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '17248' ) ) }","paraphrases":["What is located in the Battle of Sedan, that has a human populace of 17,248?"],"info":{}}
{"id":"train_12498","question":"What monumental paintings did Michel de Montaigne create?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18180821 wdt:P170 ?X . ?X wdt:P800 ?answer }","paraphrases":["What momentous canvases did Michel de Montaigne create?"],"info":{}}
{"id":"train_12499","question":"When did Marta Suplicy become the head of government for São Paulo?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q174 p:P6 ?s . ?s ps:P6 wd:Q463614 . ?s pq:P580 ?value }","paraphrases":["When did the head of government for Sao Paulo take over?"],"info":{}}
{"id":"train_12502","question":"what time does Martin Johnson start as a member of the England national rugby union team","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2036406 p:P54 ?s . ?s ps:P54 wd:Q378628 . ?s pq:P580 ?value }","paraphrases":["When does Martin Johnson start for the England national rugby union?"],"info":{}}
{"id":"train_12503","question":"Which is the regression analysis that is used by the logistic regression analysis and contains the word logistic in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q208042 . ?sbj wdt:P1535 wd:Q30555529 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'logistic' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the regression evaluation that is used with the aid of the logistic regression analysis and carries the word logistic in it's name?"],"info":{}}
{"id":"train_12504","question":"What is the destination of Quito in 1978?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2900 p:P1435 ?s . ?s ps:P1435 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1978' ) ) }","paraphrases":["In 1978, what is Quito's destination?"],"info":{}}
{"id":"train_12506","question":"What is phosphine like?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207877 wdt:P1542 ?X . ?X wdt:P780 ?answer }","paraphrases":["Describe phosphine."],"info":{}}
{"id":"train_12510","question":"What is the architecture firm that is based in Saint Longinus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7401650 wdt:P276 ?X . ?X wdt:P84 ?answer }","paraphrases":["Name the architecture firm that is based in Saint Longinushe"],"info":{}}
{"id":"train_12511","question":"What what international association football national teams competition season starts November and also which starts with letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34542827 . ?sbj wdt:P4794 wd:Q125 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell the competition season of the international football association national teams start in November and which starts with letter c"],"info":{}}
{"id":"train_12512","question":"Is it true that the beer color of the cream ale is less than 3.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5183358 wdt:P6089 ?obj filter ( ?obj < 3.0 ) }","paraphrases":["Is the beer color of the cream ale less than 3.0?"],"info":{}}
{"id":"train_12513","question":"Where does Stephen Hillenburg work and what is his field of work?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q318750 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P101 ?value1 . }","paraphrases":["Where does Stephen Hillenburg work and what is his field of work?"],"info":{}}
{"id":"train_12515","question":"how many followers does jesus christ have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P674 wd:Q302 }","paraphrases":["How many disciples did Jesus have?"],"info":{}}
{"id":"train_12517","question":"Tell me mythical place whose name has the word youdu  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24334893 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'youdu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me mythical place whose name has the word youdu in it."],"info":{}}
{"id":"train_12518","question":"what are the alcohol which start with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q156 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the liquor which begin with the letter y"],"info":{}}
{"id":"train_12519","question":"Which is the regulatory body of the language written by James Madison?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11813 wdt:P1412 ?X . ?X wdt:P1018 ?answer }","paraphrases":["What is the regulatory body of the language written by James Madison?"],"info":{}}
{"id":"train_12520","question":"For what accolade was William Somerset Maugham nominated on 1964-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q134942 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1964' ) ) }","paraphrases":["For what award was William Somerset Maugham designated on 1964-1-1?"],"info":{}}
{"id":"train_12522","question":"What award did 12 Angry Men get at the 7th Berlin International Film Award","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2345 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q552209 }","paraphrases":["At the Berlin Film Awards, what award did 12 Angry Men get?"],"info":{}}
{"id":"train_12523","question":"What team is captained by Ryan Giggs?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P634 wd:Q10524 . ?sbj wdt:P31 wd:Q6979593 }","paraphrases":["Ryan Giggs is a team captain for whom?"],"info":{}}
{"id":"train_12524","question":"When did Motoo Kimora receive the Asahi Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q471816 p:P166 ?s . ?s ps:P166 wd:Q720434 . ?s pq:P585 ?value }","paraphrases":["On what date was the Asahi Prize presented to Motoo Kimora."],"info":{}}
{"id":"train_12526","question":"What is Kunstkamera's ID on kulturnoe-nasledie.ru?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1277585 wdt:P1483 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12527","question":"Which is the record or record progression for Strait of Gibraltar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2869 wd:Q36124 }","paraphrases":[],"info":{}}
{"id":"train_12530","question":"What is the second given name of J. D. Salinger?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q79904 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '2' ) ) }","paraphrases":["What is J. D. Salinger's second name?"],"info":{}}
{"id":"train_12531","question":"What is the name of a battle that has the word siege in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q178561 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'siege' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a fight that has the word attack in it."],"info":{}}
{"id":"train_12532","question":"What is an art genre that contains the word ōkubi in its name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1792379 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ōkubi' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is an craftsmanship class that contains the word ōkubi in its name."],"info":{}}
{"id":"train_12533","question":"An alumnus of the University of Toulouse, for whom is Fermet's principle named?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q331041 wdt:P138 ?answer . ?answer wdt:P69 wd:Q578023 }","paraphrases":["An alumnus of the University of Toulouse, for whom is Fermet's precept named?"],"info":{}}
{"id":"train_12536","question":"What position did Gregory IX hold when he was replaced by Ottaviano di Paoli?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q124831 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q1227365 }","paraphrases":["\"Pontifical coronation\" redirects here. For the expressed rite of ceremoniously crowning Catholic images by the Pope, see Canonical coronation.\nA papal coronation was the ceremony of the placing of the papal tiara on a newly elected pope. The first recorded papal coronation was that of Nicholas I in 858.[2] The last was the 1963 coronation of Paul VI, who soon afterwards abandoned the practice of wearing the tiara. None of his successors have used the tiara, and their papal inauguration celebrations have included no coronation ceremony.\n\nThe papal inauguration celebration, with or without a coronation, has only symbolic significance, as a pope assumes office immediately on giving his consent to a valid election.\n\nIn Spanish, the term Coronación Pontificia (English: \"pontifical coronation\") is sometimes used for the canonical coronation of religious images by via a formal expressed decree by a reigning Pope."],"info":{}}
{"id":"train_12537","question":"Which is the number of casualties for sinking of the RMS Titanic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2577588 wdt:P1590 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12540","question":"Is it true that the number of out-of-school children in Ireland is 4826.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q27 wdt:P2573 ?obj filter ( ?obj = 4826.4 ) }","paraphrases":["Is it true that Ireland has 4826.4 out - of - school children?"],"info":{}}
{"id":"train_12541","question":"Tell me me a  geographic location whose name consist of the word al and whose people of al-andalus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2221906 . ?sbj wdt:P1792 wd:Q9073671 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'al' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know me a geographic area whose title comprise of the word al and whose individuals of al-andalus"],"info":{}}
{"id":"train_12542","question":"In which country can you find the history of India?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2184 wd:Q133136 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["In which nation can you discover the history of India?"],"info":{}}
{"id":"train_12543","question":"When was the population of Zagreb 790017?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1435 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '790017' ) ) . ?s pq:P585 ?value }","paraphrases":["What was the date on which the population of Zagreb 790017?"],"info":{}}
{"id":"train_12548","question":"For which sports team, did Andriy Shevchenko play 117 matches?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41244 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter ( contains ( ?x , '117.0' ) ) }","paraphrases":["For which sports group, did Andriy Shevchenko play 117 matches?"],"info":{}}
