{"id":"train_19314","question":"Is the number of volunteers for the Internet Society more than 3000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q749257 wdt:P6125 ?obj filter ( ?obj > 3000.0 ) }","paraphrases":["Does the number of volunteers for the Internet Society exceed 3000?"],"info":{}}
{"id":"train_19315","question":"What is the subject in the history of Tatarstan having Wikivoyage banner of Ik River banner.jpg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q842600 wdt:P1269 ?answer . ?answer wdt:P948 ?x FILTER ( contains ( ?x , 'Ik River banner.jpg' ) ) }","paraphrases":["What is the subject within the history of Tatarstan having Wikivoyage pennant of Ik Stream banner.jpg?"],"info":{}}
{"id":"train_19317","question":"Who are two identical twins whose names start with the letter v.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2301325 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Who are two identical twins starting with the letter v."],"info":{}}
{"id":"train_19318","question":"Who is the student of George Lucas, and what are they a member of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q38222 wdt:P463 ?ans_1 . wd:Q38222 wdt:P1066 ?ans_2 }","paraphrases":["Name the student of George Lucas and what they have membership of."],"info":{}}
{"id":"train_19319","question":"Name an organization that still uses Latin as official language","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q397 wdt:P1018 ?obj . ?obj wdt:P31 wd:Q43229 }","paraphrases":["Name an organization that continues to use Latin as an official language"],"info":{}}
{"id":"train_19320","question":"For what language is March named after Betula?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q110 p:P138 ?s . ?s ps:P138 wd:Q25243 . ?s pq:P407 ?value }","paraphrases":["Which language is March named after Betula?"],"info":{}}
{"id":"train_19321","question":"What are the summit which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1072326 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the summit which begin with the letter s"],"info":{}}
{"id":"train_19323","question":"\"What is the used language of James A.Garfield,that has history in history of the English language?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34597 wdt:P1412 ?answer . ?answer wdt:P2184 wd:Q784975 }","paraphrases":["What language is used by James A. Garfield, whom has history with the English language?"],"info":{}}
{"id":"train_19326","question":"Tell me video game console model whose name has the word xgp in it name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56682555 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'xgp' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know video amusement support demonstrate whose title has the word xgp in it name"],"info":{}}
{"id":"train_19327","question":"what is port city that starts with z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2264924 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is port city that begins with z"],"info":{}}
{"id":"train_19328","question":"Who is Kylie Jenners sister?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1770624 p:P3373 ?s . ?s ps:P3373 ?obj . ?s pq:P1039 wd:Q595094 }","paraphrases":["Who is Kylie Jenners sister?"],"info":{}}
{"id":"train_19329","question":"What headquarters is located at 17 Kirova Street in the Commonwealth of Independent States?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7779 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P969 ?x filter ( contains ( ?x , '17, Kirova str.' ) ) }","paraphrases":["What is located at 17 Kirova St in the CIS?"],"info":{}}
{"id":"train_19330","question":"Who is {president} {in the commune of} of {Neuquén Province} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44800 wdt:P131 ?X . ?X wdt:P35 ?answer }","paraphrases":["Who is {president} {within the commune of} of {Neuquén Territory"],"info":{}}
{"id":"train_19332","question":"What is the alphabet of the written language of Ivan Vazov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q310630 wdt:P1412 ?X . ?X wdt:P282 ?answer }","paraphrases":["Give me the alphabet of the written language of Ivan Vazo"],"info":{}}
{"id":"train_19334","question":"Which written language by Carl Sagan has descriptive linguistics in third person masculine singular?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q410 wdt:P1412 ?answer . ?answer wdt:P5110 wd:Q52431955 }","paraphrases":["Which composed dialect by Carl Sagan has clear phonetics in third individual manly singular?"],"info":{}}
{"id":"train_19335","question":"Who is the {historical country} for {shares border with} of {Roman Empire}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2277 wdt:P47 ?obj . ?obj wdt:P31 wd:Q3024240 }","paraphrases":["Who is the {chronicled nation} for {offers border with} of {Roman Empire}"],"info":{}}
{"id":"train_19336","question":"Which manned spaceflight programme that contains the word project in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13226541 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'project' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which manned spaceflight programme that carries the word mission in their title"],"info":{}}
{"id":"train_19338","question":"Which degree did Dimitri Mendeleyev undertake and at which university?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q9106 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P69 ?value1 . }","paraphrases":["Which degree and at which university did Dimitri Mendeleyev undertake?"],"info":{}}
{"id":"train_19341","question":"What degree did Warren Buffet get at Columbia Business School?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47213 p:P69 ?s . ?s ps:P69 wd:Q907481 . ?s pq:P512 ?value }","paraphrases":["Which subject did Warren Buffet graduated for at Columbia Business School?"],"info":{}}
{"id":"train_19342","question":"Who is the video game publisher of Datang Youxia Zhuan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5227469 wdt:P156 ?X . ?X wdt:P123 ?answer }","paraphrases":["Get me the name of publisher of  Datang Youxia Zhuan"],"info":{}}
{"id":"train_19344","question":"What is DDB ID for  German National Library ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q27302 wdt:P4948 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19346","question":"What is plays of Axl Rose Fernando that has discovered is Bartolomeo Cristofori?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11885 wdt:P1303 ?answer . ?answer wdt:P61 wd:Q301597 }","paraphrases":["What is performs of Axl Rose Fernando that has observed is Bartolomeo Cristofori?"],"info":{}}
{"id":"train_19347","question":"What is the government of Lahore?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11739 wdt:P190 ?obj . ?obj wdt:P31 wd:Q1637706 }","paraphrases":["What is the government of Lahore?"],"info":{}}
{"id":"train_19349","question":"Tell me me a intergovernmental organization  whose name consist of the word \"nato\" and whosetop-level Internet domain nato","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q245065 . ?sbj wdt:P78 wd:Q753137 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'nato' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me me a intergovernmental organization whose name consist of the word \"nato\" and whosetop-level Internet domain nato"],"info":{}}
{"id":"train_19351","question":"What digital humanities project is part of Brown University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q49114 wdt:P355 ?obj . ?obj wdt:P31 wd:Q62500932 }","paraphrases":["Brown University is a part of what digital humanities project?"],"info":{}}
{"id":"train_19353","question":"WHICH IS THE CIVIC BUILDING THAT STARTS WITH H","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q52177058 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE CIVIC BUILDING THAT BEGINS WITH H"],"info":{}}
{"id":"train_19355","question":"What {material used} and the {produced by} of {Wine} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q282 wdt:P186 ?ans_1 . wd:Q282 wdt:P2849 ?ans_2 }","paraphrases":["What material are used and produced wine?"],"info":{}}
{"id":"train_19356","question":"Give me the name of  country of citizenship of Michael Redgrave that is end cause is Royal and Parliamentary Titles Act 1927 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q318263 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P1534 wd:Q7375047 }","paraphrases":["Michael Redgrave is a citizen of what country that is associated with the Royal and Parliamentary Titles Act of 1927?"],"info":{}}
{"id":"train_19357","question":"What are the isotope of hydrogen which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q466603 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the isotope of hydrogen which begin with the letter t"],"info":{}}
{"id":"train_19358","question":"Which is the month of the year for December?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2922 wd:Q126 }","paraphrases":[],"info":{}}
{"id":"train_19359","question":"WHICH IS THE COMMON NAME WITH THE MAXIMUM BITE FORCE QUOTIENT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q502895 . ?ent wdt:P3485 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the maximum bite force quotient's common name?"],"info":{}}
{"id":"train_19360","question":"Who is the spouse of Gerard Way?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P26 wd:Q204132 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the companion of Gerard Way?"],"info":{}}
{"id":"train_19361","question":"Tell me legal concept whose name has the word sanction in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2135465 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sanction' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me legal concept whose name has the word sanction in it."],"info":{}}
{"id":"train_19363","question":"which international organization that contains the word worldskills in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q484652 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'worldskills' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which worldwide organization that contains the word worldskills in their name"],"info":{}}
{"id":"train_19365","question":"What are the SUDOC editions of Tractatus Logico-Philosophicus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q655717 wdt:P1025 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19366","question":"Which is the enclosure for W. M. Keck Observatory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q210997 wdt:P3158 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19369","question":"Which is the city in the US for the twinned administrative body of Nagasaki?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q38234 wdt:P190 ?obj . ?obj wdt:P31 wd:Q1093829 }","paraphrases":[],"info":{}}
{"id":"train_19374","question":"Who is a member of the standards developing organization for geologic time scale?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43521 wdt:P1462 ?X . ?X wdt:P463 ?answer }","paraphrases":["Who is a member of the requirements creating corporation for geologic time scale?"],"info":{}}
{"id":"train_19375","question":"Who is appointed by Pius VI?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P748 wd:Q128019 }","paraphrases":[],"info":{}}
{"id":"train_19376","question":"What is the Vidhan Sabha in Odisha?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q22048 wdt:P208 ?obj . ?obj wdt:P31 wd:Q3091020 }","paraphrases":["What is the Vidhan Sabha in Odisha?"],"info":{}}
{"id":"train_19377","question":"How many bases does a square have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3263 wd:Q164 }","paraphrases":["A square has how many bases?"],"info":{}}
{"id":"train_19378","question":"Where was Stevie Wonder born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q714 wdt:P19 ?ans_1 . wd:Q714 wdt:P740 ?ans_2 }","paraphrases":["What is Stevie Wonder's birth state and city?"],"info":{}}
{"id":"train_19380","question":"Which is the RKDimages ID for Girl with a Pearl Earring?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q185372 wdt:P350 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19382","question":"What is made from medium of olive oil ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q93165 wdt:P186 ?X . ?X wdt:P1582 ?answer }","paraphrases":["What is made from medium of olive oil ?"],"info":{}}
{"id":"train_19383","question":"What what is holiday intangible cultural heritage status intangible cultural heritage and which that starts with n","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1445650 . ?sbj wdt:P3259 wd:Q59544 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is vacation intangible cultural heritage fame intangible cultural heritage and which that begins with n"],"info":{}}
{"id":"train_19384","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q151866 wdt:P108 ?answer . ?answer wdt:P1313 wd:Q835586 }","paraphrases":["What's that?"],"info":{}}
{"id":"train_19385","question":"Who is employed by John Wycliffe and lives in the Oxford neighborhood?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q173893 wdt:P108 ?answer . ?answer wdt:P276 wd:Q34217 }","paraphrases":["Who is employed by means of John Wycliffe and lives in the Oxford neighborhood?"],"info":{}}
{"id":"train_19386","question":"Which is the domain of learning the feminist theory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4810748 wdt:P2578 ?X . ?X wdt:P2579 ?answer }","paraphrases":["Learning the feminist theory is what domain?"],"info":{}}
{"id":"train_19387","question":"What's the date of death for Petrarch?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1401 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1326 ?x filter ( contains ( YEAR ( ?x ) , '1374' ) ) }","paraphrases":["When did Petrarch die?"],"info":{}}
{"id":"train_19388","question":"Who is actor in the show Born a Gamblin' Man?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49845212 wdt:P179 ?X . ?X wdt:P161 ?answer }","paraphrases":["Which actor played the main character in the show Born a Gamblin' Man?"],"info":{}}
{"id":"train_19389","question":"Which genres can Oasis be classified as?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q382890 wdt:P136 ?obj }","paraphrases":["What genres could Oasis be grouped into?"],"info":{}}
{"id":"train_19390","question":"What carbon isotope starts with the letter \"c\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q471790 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What carbon isotope begins with the letter \"c\"?"],"info":{}}
{"id":"train_19391","question":"As on 1-1-1922 what was the position held by Yitzhak HaLevi Herzog?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1391502 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1922' ) ) }","paraphrases":["What was the position of Yitzhak HaLevi Herzog on 1-1-1922?"],"info":{}}
{"id":"train_19392","question":"Is Victoria Azarenka's ranking 5.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q10118 wdt:P1352 ?obj filter ( ?obj = 5.6 ) }","paraphrases":["Is Victoria Azarenka's current ranking 5.6?"],"info":{}}
{"id":"train_19394","question":"What is persimmon's higher taxon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q29526 wdt:P1582 ?X . ?X wdt:P171 ?answer }","paraphrases":["Specify the higher taxon of persimmon."],"info":{}}
{"id":"train_19395","question":"Is it true that the speed of sound of the hydrogen iodide is less than 188.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2462 wdt:P2075 ?obj filter ( ?obj < 188.4 ) }","paraphrases":["Is it genuine that the speed of sound of the hydrogen iodide is less than 188.4?"],"info":{}}
{"id":"train_19396","question":"Was Aaliyah nominated for the MTV movie award for Best Villain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q11617 wdt:P1411 wd:Q1062026 }","paraphrases":["Did Aaliyah ever nominated for Best Villain on MTV?"],"info":{}}
{"id":"train_19397","question":"which narrative starts with v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1318295 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which story begins with v"],"info":{}}
{"id":"train_19398","question":"Which is the angular resolution for Karl G. Jansky Very Large Array?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q461382 wdt:P3439 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19399","question":"What are the associated  astronomical bodies of the Andromeda Galaxy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2469 wdt:P398 ?obj . ?obj wdt:P31 wd:Q654754 }","paraphrases":["What are the related galactic bodies of the Andromeda System?"],"info":{}}
{"id":"train_19400","question":"Name the profession of someone working with statistics","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12483 wdt:P3095 ?obj . ?obj wdt:P31 wd:Q28640 }","paraphrases":["Title the calling of somebody working with statistics"],"info":{}}
{"id":"train_19401","question":"What is FC Bayern Munich's home venue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q15789 wdt:P115 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19402","question":"Which is the country that is indigenous of the American English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7976 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q6256 }","paraphrases":["Which country is American English indigenous?"],"info":{}}
{"id":"train_19403","question":"Is the number of clubs of the rugby union in Tunisia equal to 72?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3452916 wdt:P4999 ?obj filter ( ?obj = 72 ) }","paraphrases":["Is Tunisia's rugby union number of clubs equal to 72?"],"info":{}}
{"id":"train_19404","question":"How many species of moose exist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1990 wd:Q35517 }","paraphrases":["How many moose species are there?"],"info":{}}
{"id":"train_19405","question":"Who was Edward Anthony's partner when their partnership ended in 1865?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5341576 p:P1327 ?s . ?s ps:P1327 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1865' ) ) }","paraphrases":["Who was Edward Anthony's partner until 1865?"],"info":{}}
{"id":"train_19406","question":"What are theunitary authority of England which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1136601 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is England's unitary authority that begins with the letter w"],"info":{}}
{"id":"train_19407","question":"Tell me the timezone in Kurdistan.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41470 wdt:P30 ?X . ?X wdt:P421 ?answer }","paraphrases":["Let me know the timezone in Kurdistan."],"info":{}}
{"id":"train_19408","question":"Who is the {human} for {spouse} of {Katy Perry}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P26 wd:Q42493 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the { human } of { Katy Perry }'s { spouse }"],"info":{}}
{"id":"train_19411","question":"What is autoignition temperature for acetic acid ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q47512 wdt:P2199 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19413","question":"which is the personality trait which has the word valor in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2393196 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'valor' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the characteristic of personality with the word value in its name?"],"info":{}}
{"id":"train_19414","question":"Tell the official language of Sevastopol","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7525 wdt:P156 ?X . ?X wdt:P1705 ?answer }","paraphrases":["Which is the official language of Sevastopol?"],"info":{}}
{"id":"train_19417","question":"Which is the BIU Santé person ID for Vincent van Gogh?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5582 wdt:P5375 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19419","question":"Which is the skyscraper for which William F. Baker was an architect and contains the word burj in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11303 . ?sbj wdt:P84 wd:Q834854 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'burj' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the high rise for which William F. Bread cook was a designer and contains the word burj in it's name?"],"info":{}}
{"id":"train_19421","question":"Mention the ethnic group related to the Yiddish.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8641 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q41710 }","paraphrases":["Specify the ethnic bunch related to the Yiddish."],"info":{}}
{"id":"train_19422","question":"What is the postal code for South Maravian Region that has headquarters located in Brno?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q192697 p:P159 ?s . ?s ps:P159 wd:Q14960 . ?s pq:P281 ?value }","paraphrases":["Which is the postal code for the headquarters of South Maravian Region that is located in Brno?"],"info":{}}
{"id":"train_19423","question":"What language pronounces cream as UK-bepwkm.ogg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q13228 p:P443 ?s . ?s ps:P443 ?x filter ( contains ( ?x , 'Uk-вершки.ogg' ) ) . ?s pq:P407 ?value }","paraphrases":["In which language is cream pronounced UK-bepwkm.ogg?"],"info":{}}
{"id":"train_19424","question":"How many cities are in the Archaemenid Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1376 wd:Q389688 }","paraphrases":["What is the number of cities in the Archaemenid Empire?"],"info":{}}
