{"id":"train_12104","question":"When was Charles Hermite educated at Ecole Polytechnique?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q168401 p:P69 ?s . ?s ps:P69 wd:Q273626 . ?s pq:P582 ?value }","paraphrases":["During what time was Charles Hermite educated at Ecole Polytechnique?"],"info":{}}
{"id":"train_12106","question":"Who is the child of Agamemnon and the mother of Clytemnestra?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q128176 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P25 wd:Q131157 }","paraphrases":["Who is the kid of Agamemnon and Clytemnestra's mother?"],"info":{}}
{"id":"train_12110","question":"Who is the manufacture for the Airbus A300?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q6437 wdt:P176 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12111","question":"Tell me prediction whose name has the word singularity in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q748250 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'singularity' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Neon Beginning Evangelion is based on what Manga?"],"info":{}}
{"id":"train_12117","question":"What government structure starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19944802 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What government structure begins with the letter \"t\"?"],"info":{}}
{"id":"train_12119","question":"Who is the {film} for {screenwriter} of {Ang Lee}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P58 wd:Q160726 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["What film is screenwriter Ang Lee known for?"],"info":{}}
{"id":"train_12120","question":"What nationality Go Seigen has since 1914-6-12?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q541005 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1914' ) ) }","paraphrases":["What nationality has Go Seigen had since 1914-6-12?"],"info":{}}
{"id":"train_12121","question":"Is the inflation rate of Denmark equal to 0.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q35 wdt:P1279 ?obj filter ( ?obj = 0.6 ) }","paraphrases":["Is Denmark's inflation rate approximate 0.6?"],"info":{}}
{"id":"train_12125","question":"What language is Lê Lợi, that has the Women in Red banner as a Welcome banner.jpg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1195391 wdt:P1412 ?answer . ?answer wdt:P948 ?x FILTER ( contains ( ?x , 'Welcome banner.jpg' ) ) }","paraphrases":["What language is Lê Lợi, that has the Women in Red banner as a Welcome banner.jpg?"],"info":{}}
{"id":"train_12126","question":"Did Pablo Picasso receive his education at the Royal Birmingham Conservatoire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5593 wdt:P69 wd:Q865734 }","paraphrases":["Was Pablo Picasso a student at the Royal Birmingham Conservatoire?"],"info":{}}
{"id":"train_12128","question":"What was the date when İzmir was declared Kingdom of Greece?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q35997 p:P17 ?s . ?s ps:P17 wd:Q209065 . ?s pq:P1326 ?value }","paraphrases":["When did Greece declare Izmir?"],"info":{}}
{"id":"train_12129","question":"What  flavored tea begins with the letter g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3526264 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What flavored tea starts with the letter g"],"info":{}}
{"id":"train_12130","question":"What is the example to the fisher group in general?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3117683 . ?ent wdt:P1164 ?obj . ?ent wdt:P31 wd:Q3117683 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What general example is the fisher group?"],"info":{}}
{"id":"train_12132","question":"How many significant drug interactions are there to cocaine.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P769 wd:Q41576 }","paraphrases":["How often does cocaine have significant drug interactions?"],"info":{}}
{"id":"train_12133","question":"Which is the MathWorld identifier for magic square?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q192089 wdt:P2812 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12134","question":"Who is the {inner planet} for {parent astronomical body} of {International Space Station}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q25271 wdt:P397 ?obj . ?obj wdt:P31 wd:Q3504248 }","paraphrases":["Who is the {inward planet} for {parent cosmic body} of {Worldwide Space Station}"],"info":{}}
{"id":"train_12135","question":"Which is the extensive physical quantity measured by a joule?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q25269 wdt:P111 ?obj . ?obj wdt:P31 wd:Q3386703 }","paraphrases":[],"info":{}}
{"id":"train_12137","question":"Which is the rock band that has Axl Rose as the member?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11885 wdt:P463 ?obj . ?obj wdt:P31 wd:Q5741069 }","paraphrases":["Which is the shake band that has Axl Rose as the member?"],"info":{}}
{"id":"train_12138","question":"What are the type of posthumous work which start with the letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17518461 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which type of posthumous work which start with the letter P?"],"info":{}}
{"id":"train_12140","question":"What is the name of the airline that replaces Delta Air Lines?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q188920 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q46970 }","paraphrases":["What is the title of the carrier that replaces Delta Discuss Lines?"],"info":{}}
{"id":"train_12141","question":"When did Marit Bjørgen receive an award for Olavstatuetten?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q216256 p:P166 ?s . ?s ps:P166 wd:Q11993519 . ?s pq:P585 ?value }","paraphrases":["When did Marit Bjørgen get an grant for Olavstatuetten?"],"info":{}}
{"id":"train_12142","question":"Is the redshift of Messir 90 less than -0.0009408","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q14343 wdt:P1090 ?obj filter ( ?obj < -0.0009408 ) }","paraphrases":["Is the redshift of Messir 90 less than -0.0009408"],"info":{}}
{"id":"train_12146","question":"When did the Republic of Venice become a state?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q4948 p:P31 ?s . ?s ps:P31 ?x filter ( contains ( ?x , 'http://dbpedia.org/ontology/State' ) ) . ?s pq:P582 ?value }","paraphrases":["On what date did the Republic of Venice become a state?"],"info":{}}
{"id":"train_12147","question":"Which was the faith of the office held by Leo III?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132086 wdt:P39 ?X . ?X wdt:P140 ?answer }","paraphrases":["What was Leo III's faith in the office?"],"info":{}}
{"id":"train_12148","question":"How many airline hub for AirAsia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q406643 wdt:P113 ?obj }","paraphrases":["How many airline hubs does AirAsia have?"],"info":{}}
{"id":"train_12149","question":"What are the Native American tribe in the United States which start with the letter tulalip","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7840353 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tulalip' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Local American tribe within the Joined together States which begin with the letter tulalip"],"info":{}}
{"id":"train_12150","question":"What river is in Hertforshire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P403 wd:Q3410 . ?sbj wdt:P31 wd:Q4022 }","paraphrases":["Name the river that is located in Hertforshire?"],"info":{}}
{"id":"train_12151","question":"Why did Hebe Camargo and Décio Capuano get divorced?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6105 p:P26 ?s . ?s ps:P26 wd:Q37186070 . ?s pq:P1534 ?value }","paraphrases":["In what year did Decio Capuano and Hebe Camargo divorce?"],"info":{}}
{"id":"train_12153","question":"Who is {sons} and {daughter of} {Odysseus} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q47231 wdt:P22 ?X . ?X wdt:P40 ?answer }","paraphrases":["Who is children and little girl of Odysseus ?"],"info":{}}
{"id":"train_12154","question":"Did Edward Snowden work with J. Edgar Hoover?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13424289 wdt:P106 wd:Q210435 }","paraphrases":["Did Edward Snowden and J. Edgar Hoover ever work together?"],"info":{}}
{"id":"train_12155","question":"what is the {point in time} for {Azores} that has {population} as {246746} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q25263 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '246746' ) ) . ?s pq:P585 ?value }","paraphrases":["At what time did Azores have a population of 246746?"],"info":{}}
{"id":"train_12156","question":"Where does Jean-Jacques Rousseau live","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P466 wd:Q6527 . ?sbj wdt:P31 wd:Q3947 }","paraphrases":["Where did Jean-Jacques Roussea reside?"],"info":{}}
{"id":"train_12157","question":"Which is the pathogen transmission process of fluid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1060 wd:Q102205 }","paraphrases":[],"info":{}}
{"id":"train_12158","question":"What award did Marcello Mastroianni receive in 1963?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q55469 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1963' ) ) }","paraphrases":["In 1963, Marcello Mastroianni received an award for which role?"],"info":{}}
{"id":"train_12159","question":"What company owns pornhub ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1830 wd:Q936394 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["PornHub is owned by which company?"],"info":{}}
{"id":"train_12161","question":"When did French Guiana have a population of 66977?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3769 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '66977.0' ) ) . ?s pq:P585 ?value }","paraphrases":["At what time French Guiana's population reach 66977?"],"info":{}}
{"id":"train_12162","question":"where are the residence and occupation for Jessica_Chastain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q229313 wdt:P551 ?ans_1 . wd:Q229313 wdt:P106 ?ans_2 }","paraphrases":["Where does Jessica Chastain reside?"],"info":{}}
{"id":"train_12164","question":"What are the civilizations that start with the letter V","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8432 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the civilizations that begin with the letter V"],"info":{}}
{"id":"train_12166","question":"Who is the copyright owner for RIA Novosti?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3931 wd:Q821172 }","paraphrases":[],"info":{}}
{"id":"train_12167","question":"What is the Zhihu topic ID for logarithm?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11197 wdt:P3553 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12168","question":"Which  is manner  of Sesshū Tōyō ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1777 wd:Q48514 }","paraphrases":[],"info":{}}
{"id":"train_12170","question":"Name the child of the Jiajing Emperor that has a brother or sister that is the Longqing Emperor.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10011 wdt:P40 ?answer . ?answer wdt:P3373 wd:Q10059 }","paraphrases":["Name the child of the Jiajing Emperor that has a brother or sister that is the Longqing Emperor."],"info":{}}
{"id":"train_12171","question":"When was Delhi, India founded?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1353 p:P131 ?s . ?s ps:P131 wd:Q668 . ?s pq:P580 ?value }","paraphrases":["Delhi, India was founded when?"],"info":{}}
{"id":"train_12172","question":"Name a gland in the human body that starts with letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9647 . ?sbj wdt:P2288 wd:Q7643652 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a gland in the human body that begins with letter P"],"info":{}}
{"id":"train_12173","question":"What award did Georges Cziffra receive in 1956?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q254333 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1956' ) ) }","paraphrases":["which award was short listed for Georges Cziffra in 1956"],"info":{}}
{"id":"train_12174","question":"What is highest perimeter of Fraxinus excelsior?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q156907 . ?ent wdt:P2547 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Give me the name of the highest perimeter of Fraxinus Excelsior."],"info":{}}
{"id":"train_12175","question":"Name the ice hockey team that allowed the most number of goals in the 2000-2001 season.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q27020779 . ?ent wdt:P1359 ?obj . ?ent wdt:P2348 wd:Q53385703 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which hockey team gave up the most goals to opposing teams in 2000-2001."],"info":{}}
{"id":"train_12176","question":"What altitude is adjacent to Balikpapan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14492 wdt:P47 ?X . ?X wdt:P2044 ?answer }","paraphrases":["Name the altitude that's adjacent to Balikpapan."],"info":{}}
{"id":"train_12178","question":"Which art material that produced by Anthozoa and which contains the word coral in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15303351 . ?sbj wdt:P2849 wd:Q28524 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'coral' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which art fabric that produced by way of Anthozoa and which contains the word coral in their name"],"info":{}}
{"id":"train_12181","question":"What countries are involved in the African Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P530 wd:Q7159 . ?sbj wdt:P31 wd:Q859563 }","paraphrases":["What nations are included within the African Union?"],"info":{}}
{"id":"train_12182","question":"What group did the brothers of Fabio Ochoa Vasquez belong to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q329722 wdt:P3373 ?X . ?X wdt:P463 ?answer }","paraphrases":["What bunch did the siblings of Fabio Ochoa Vasquez have a place with?"],"info":{}}
{"id":"train_12183","question":"What is {end time} and {start time} of {{Tbilisi} which is {located in the administrative territorial entity} as {Georgian Soviet Socialist Republic}}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q994 p:P131 ?s . ?s ps:P131 wd:Q130229 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When is Tbilisi?"],"info":{}}
{"id":"train_12184","question":"What is the { end time } for { James Comey } as an { independent politician }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q167607 p:P102 ?s . ?s ps:P102 wd:Q327591 . ?s pq:P582 ?value }","paraphrases":["When year did James Comey's service end?"],"info":{}}
{"id":"train_12185","question":"WHAT ARE THE SPACE CENTER WHICH START WITH THE LETTER S","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1192221 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE SPACE CENTER WHICH BEGIN  WITH THE LETTER S"],"info":{}}
{"id":"train_12186","question":"how many electorates does manila have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q1461 wdt:P1831 ?obj }","paraphrases":["In regards to Manila, how many electorates does it have?"],"info":{}}
{"id":"train_12187","question":"which  is subsidiary entities of service branch of Godfrey Weitzel ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q875820 wdt:P241 ?X . ?X wdt:P355 ?answer }","paraphrases":["Which is Godfrey Weitzel's subsidiary service branch?"],"info":{}}
{"id":"train_12188","question":"At which university was Jeff Bezos educated and what was his academic major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q312556 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["At which college was Jeff Bezos taught and what was his scholastic major?"],"info":{}}
{"id":"train_12189","question":"When was Buffy Sainte-Marie awarded an honorary doctorate?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q467027 p:P166 ?s . ?s ps:P166 wd:Q11415564 . ?s pq:P585 ?value }","paraphrases":["On what date was Buffy Sainte-Marie awarded an honorary doctorate?"],"info":{}}
{"id":"train_12190","question":"Who is the club manager for the team member known as Colin McDonald?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5145359 wdt:P54 ?X . ?X wdt:P286 ?answer }","paraphrases":["What's the name of Colin McDonald's club manager?"],"info":{}}
{"id":"train_12193","question":"Which sport tour has the highest number of losses?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q50846468 . ?ent wdt:P1356 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which sport tour faces the most losses?"],"info":{}}
{"id":"train_12194","question":"Name the cause and effect of Hepatitis.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q131742 wdt:P828 ?ans_1 . wd:Q131742 wdt:P1542 ?ans_2 }","paraphrases":["What causes Hepatitis and the symptoms?"],"info":{}}
{"id":"train_12196","question":"Is it true that the distance from Earth of the Messier 13 equals to 23150?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q11312 wdt:P2583 ?obj filter ( ?obj = 23150 ) }","paraphrases":["Is 23150 the distance from Earth of the Messier 13?"],"info":{}}
{"id":"train_12197","question":"where is administrative headquarters for perpetrator of Battle of Ankara ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q209387 wdt:P710 ?X . ?X wdt:P36 ?answer }","paraphrases":["where is authoritative central command for culprit of Fight of Ankara ?"],"info":{}}
{"id":"train_12198","question":"What is the maximum magniture of 4 Vesta?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3030 p:P1215 ?s . ?s ps:P1215 ?obj . ?s pq:P518 wd:Q10578722 }","paraphrases":["Tell me 4 Vesta's maximum magniture."],"info":{}}
{"id":"train_12199","question":"Who is the head of government for Otto von Bismarck?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P6 wd:Q8442 }","paraphrases":[],"info":{}}
{"id":"train_12200","question":"When did educated at of Josef Mengele and academic degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q57109 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["when did Josef Mengele graduate with his degree?"],"info":{}}
{"id":"train_12201","question":"Who is the role model of language written by Robert Conquest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q379628 wdt:P1412 ?X . ?X wdt:P737 ?answer }","paraphrases":["Who is the part demonstrate of dialect composed by Robert Success?"],"info":{}}
{"id":"train_12202","question":"How many positions has Napoleon III held?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q7721 wdt:P39 ?obj }","paraphrases":["Napoleon III held how many different positions?"],"info":{}}
{"id":"train_12203","question":"What was the topic of Ferdinand de Saussure's doctoral thesis, and what degree did he acheive at Leipzig University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q13230 p:P69 ?s . ?s ps:P69 wd:Q154804 . ?s pq:P1026 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What was the topic of the doctoral thesis of Ferdinand de Saussure and what degree did he take at the University of Leipzig?"],"info":{}}
{"id":"train_12205","question":"What is the Serbian Academy member ID for Roman Jakobson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q156201 wdt:P3475 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12206","question":"Is the nominal GDP of Ethiopia equal to 80561496133.9172?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q115 wdt:P2131 ?obj filter ( ?obj = 80561496133.9172 ) }","paraphrases":["Is it true that the nominal GDP of Ethiopia is 80561496133.9172?"],"info":{}}
{"id":"train_12207","question":"WHAT ARE THE WORD THAT  ROOT WHICH CONTAINS TYPE OF MATHEMATICAL FUNCTION","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47279819 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'root' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a survival ability that begins with letter C"],"info":{}}
{"id":"train_12208","question":"Who was the head of the Lisbon government beginning in April 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q597 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["Who became the head of the Lisbon government in April 2015?"],"info":{}}
{"id":"train_12209","question":"What tennis awards has Billie Jean King won?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q54527 wdt:P2522 ?obj . ?obj wdt:P31 wd:Q46190676 }","paraphrases":["What have Billie Jean King won tennis awards?"],"info":{}}
{"id":"train_12210","question":"What is the largest lake in Canada?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23397 . ?ent wdt:P3020 ?obj . ?ent wdt:P205 wd:Q16 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the biggest lake in Canada?"],"info":{}}
{"id":"train_12211","question":"Which is the magazine with place of publication in New York City and that contains the word vibe in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41298 . ?sbj wdt:P291 wd:Q60 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vibe' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the magazine with region of book in New York City and that incorporates the word vibe in it's name?"],"info":{}}
{"id":"train_12213","question":"The Book of Mormon is the published literature for which religion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q459842 wdt:P1433 ?obj . ?obj wdt:P31 wd:Q6912675 }","paraphrases":["From what religion is The Book of Mormon?"],"info":{}}
