{"id":"train_4521","question":"What is a Biblical place that starts with the letter z.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12404340 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a Biblical place that begins with the letter z."],"info":{}}
{"id":"train_4523","question":"What is the death date of Peter, Count of Perche and Alençon, the son of Louis IX of France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q346 p:P40 ?s . ?s ps:P40 wd:Q739327 . ?s pq:P570 ?value }","paraphrases":["When did Peter, Count of Perche and Alencon, son of Louis IX of France, die?"],"info":{}}
{"id":"train_4524","question":"Tell me the sect that contains the word valentinianism in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19097 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'valentinianism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the faction that contains the word valentinianism in it's name?"],"info":{}}
{"id":"train_4528","question":"What sovereign states have a diplomatic relationship with the Russian Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q34266 wdt:P530 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What autonomous states have a conciliatory relationship with the Russian Realm?"],"info":{}}
{"id":"train_4531","question":"Who is the filmographer for Cecil B.DeMille","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P175 wd:Q72267 . ?sbj wdt:P31 wd:Q1371849 }","paraphrases":["Who is the filmographer for Cecil B.DeMille"],"info":{}}
{"id":"train_4532","question":"In what country does Mother's Day take place on March 8th?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47502 p:P837 ?s . ?s ps:P837 wd:Q2395 . ?s pq:P17 ?value }","paraphrases":["Give the name of the country in which Mother's Day take place on March 8th."],"info":{}}
{"id":"train_4533","question":"Who is the founder of Hezbollah whose personal name is Muhammed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41053 wdt:P112 ?answer . ?answer wdt:P735 wd:Q5837762 }","paraphrases":["Who is the originator of Hezbollah whose individual title is Muhammed?"],"info":{}}
{"id":"train_4534","question":"What military branch of the air force did Yuri Gagarin work for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7327 wdt:P241 ?obj . ?obj wdt:P31 wd:Q61883 }","paraphrases":["What military department of the discuss drive did Yuri Gagarin work for?"],"info":{}}
{"id":"train_4535","question":"Who is the{road bridge} for {structure replaced by} of {London Bridge}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P167 wd:Q130206 . ?sbj wdt:P31 wd:Q537127 }","paraphrases":["Who is the{road bridge} for {structure supplanted by} of {London Bridge}"],"info":{}}
{"id":"train_4536","question":"What is the ammonia conjugate acid monocation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q4087 wdt:P4147 ?obj . ?obj wdt:P31 wd:Q55523831 }","paraphrases":["What is the acid monocation of ammonia conjugate?"],"info":{}}
{"id":"train_4537","question":"Which is the track gauge for Trans-Australian Railway?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1361233 wdt:P1064 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4539","question":"When did Herta Müller receive the Ehrengabe der Heinrich-Heine-Gesellscahft?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q38049 p:P166 ?s . ?s ps:P166 wd:Q15096434 . ?s pq:P585 ?value }","paraphrases":["Herta Muller received the Ehrengabe der Heinrich-Heine-Gesellscahft when?"],"info":{}}
{"id":"train_4540","question":"What position did John Foster Dulles hold and when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q223677 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What position did John Cultivate Dulles hold and when?"],"info":{}}
{"id":"train_4541","question":"What is Moscow State University's elibrary.ru organisation ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q13164 wdt:P2463 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4542","question":"when did Serge Gainsbourg and Caroline von Paulus divorce?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1698 p:P26 ?s . ?s ps:P26 wd:Q581225 . ?s pq:P582 ?value }","paraphrases":["what year did Serge Gainsbourg and Caroline von Paulus split up?"],"info":{}}
{"id":"train_4543","question":"What is the urban district of Norfolk","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q23109 wdt:P150 ?obj . ?obj wdt:P31 wd:Q1187580 }","paraphrases":["What is the urban area of Norfolk"],"info":{}}
{"id":"train_4547","question":"What was Liège's twin city in 1955?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3992 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1955' ) ) }","paraphrases":["In 1955, what was Liege's twin city?"],"info":{}}
{"id":"train_4549","question":"What is the profession of Guillermo Lasso that is different from a bank teller","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4414537 wdt:P106 ?answer . ?answer wdt:P1889 wd:Q806805 }","paraphrases":["What is the occupation of Guillermo Lasso that is exclusive from a financial institution teller"],"info":{}}
{"id":"train_4550","question":"Give me a female idol group that starts with the letter z.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11446438 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Deliver me a female icon gather that begins with the letter z."],"info":{}}
{"id":"train_4551","question":"What pizza comes from the head of government?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q177 wdt:P495 ?X . ?X wdt:P6 ?answer }","paraphrases":["What pizza comes from the head of government?"],"info":{}}
{"id":"train_4553","question":"Which {play} {participated in} {Micronesia at the 2011 World Aquatics Championships} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1177107 wdt:P1344 ?X . ?X wdt:P641 ?answer }","paraphrases":["Who was a player who participated for Micronesia in the 2011 World Aquatics Championships?"],"info":{}}
{"id":"train_4555","question":"Which is the language of work or name for Old Church Slavonic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P407 wd:Q35499 }","paraphrases":[],"info":{}}
{"id":"train_4556","question":"Is the par of the Royal St George's Golf Club equal to 56.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1586134 wdt:P3530 ?obj filter ( ?obj = 56.0 ) }","paraphrases":["Is the standard of the Illustrious St George's Golf Club break even with to 56.0?"],"info":{}}
{"id":"train_4557","question":"What is the news site of Air Canada?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q185339 wdt:P2813 ?obj . ?obj wdt:P31 wd:Q1002697 }","paraphrases":["What's Air Canada's news site?"],"info":{}}
{"id":"train_4558","question":"Which is the valid in period of Easter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1264 wd:Q21196 }","paraphrases":[],"info":{}}
{"id":"train_4559","question":"What field of work did Vannevar Bush win the National Medal of Science for and when did he win the award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q299595 p:P166 ?s . ?s ps:P166 wd:Q737051 . ?s pq:P585 ?value1 . ?s pq:P101 ?value2 }","paraphrases":["What subject of work did Vannevar Bush win the National Medal of Science for and when did he win the award?"],"info":{}}
{"id":"train_4560","question":"What is the {manner of death} and the {place of death} of {Lee_Harvey_Oswald} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q48745 wdt:P1196 ?ans_1 . wd:Q48745 wdt:P20 ?ans_2 }","paraphrases":["How and where did Lee Harvey Oswald die?"],"info":{}}
{"id":"train_4562","question":"When was did Bursa cease being the capital of the Ottoman Empire?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q12560 p:P36 ?s . ?s ps:P36 wd:Q40738 . ?s pq:P582 ?value }","paraphrases":["When was Bursa no longer the capital of the Ottoman Empire?"],"info":{}}
{"id":"train_4563","question":"Is the conversion to SI unit of the base pair equal 4.08e-10?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q145911 wdt:P2370 ?obj filter ( ?obj = 4.08e-10 ) }","paraphrases":["Is the transformation to SI unit of the base match rise to 4.08e-10?"],"info":{}}
{"id":"train_4566","question":"What is Oscar Schmidt's acb.com ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1797248 wdt:P3525 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4567","question":"tell  me area of mathematic  practiced by algebraist  starts with a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1936384 . ?sbj wdt:P3095 wd:Q23900107 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":[],"info":{}}
{"id":"train_4569","question":"Which is the item used in the plays of Graham Thorpe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3527096 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["Which is the thing utilized within the plays of Graham Thorpe?"],"info":{}}
{"id":"train_4570","question":"During the conflict of the Mexican-American War, which branch was Nate Dogg in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q47159 wdt:P241 ?answer . ?answer wdt:P607 wd:Q6683 }","paraphrases":["During the fighting of the Mexican-American War, which department was once Nate Dogg in?"],"info":{}}
{"id":"train_4571","question":"Who replaces eodoro Obiang Nguema Mbasogo for the position of the chairperson of the African Union?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q57385 p:P39 ?s . ?s ps:P39 wd:Q946339 . ?s pq:P1365 ?value }","paraphrases":["Who will take over as chairperson of the African Union for eodoro Obiang Nguema Mbasogo?"],"info":{}}
{"id":"train_4572","question":"\"Which is {facet of a polytope} of {pyramid}, whose {next is} is {quadrilateral} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3358290 wdt:P1312 ?answer . ?answer wdt:P156 wd:Q36810 }","paraphrases":["\"Which is {feature of a polytope} of {pyramid}, whose {following is} is {quadrilateral} ?\""],"info":{}}
{"id":"train_4575","question":"TELL ME INTERNATIONAL SPORT GOVERNING BODY WHOSE NAME HAS THE WORD WORLD IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11422536 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know Universal Don Overseeing BODY WHOSE Title HAS THE WORD WORLD IN IT."],"info":{}}
{"id":"train_4576","question":"Which free video game has the highest amount of players?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21125433 . ?ent wdt:P1873 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What free game has the most players?"],"info":{}}
{"id":"train_4577","question":"Name the death location of Derek Walcott, which has a human population of 90913.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132701 wdt:P20 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '90913.0' ) ) }","paraphrases":["Title the death area of Derek Walcott, which encompasses a human populace of 90913."],"info":{}}
{"id":"train_4579","question":"What award did Liam Neeson receive on December 31, 1999?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q58444 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1999' ) ) }","paraphrases":["Which award did Liam Neeson receive on December 31, 1999?"],"info":{}}
{"id":"train_4580","question":"Is drinking waters electrical resistivity equal to 20?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7892 wdt:P5679 ?obj filter ( ?obj = 20 ) }","paraphrases":["Is drinking waters electrical resistivity break even with to 20?"],"info":{}}
{"id":"train_4586","question":"What is the highest point by Mount Ararat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P610 wd:Q72303 }","paraphrases":["For Mount Ararat, what is the highest point?"],"info":{}}
{"id":"train_4587","question":"Who is the {child} and the {position played on team / speciality} of {Hakeem_Olajuwon} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q273256 wdt:P40 ?ans_1 . wd:Q273256 wdt:P413 ?ans_2 }","paraphrases":["What is Hakeem Olajuwon's profession, and what is the name of his child?"],"info":{}}
{"id":"train_4590","question":"When did Cindy Crawford's marriage with Richard Gere end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q199801 p:P26 ?s . ?s ps:P26 wd:Q48410 . ?s pq:P582 ?value }","paraphrases":["Oct 11, 2018"],"info":{}}
{"id":"train_4591","question":"What are the crew members of the International Space Station called?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q25271 wdt:P1029 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What do you call the crew members of the International Space Station?"],"info":{}}
{"id":"train_4592","question":"What is the national anthem the topic of in the history of Dagestan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2024068 wdt:P1269 ?X . ?X wdt:P85 ?answer }","paraphrases":["What is the national song of praise the point of in the historical backdrop of Dagestan?"],"info":{}}
{"id":"train_4594","question":"TELL ME ECONOMIC INDICATOR WHICH START WITH THE LETTER S","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1167393 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME ECONOMIC INDICATION OF THE LETTER S"],"info":{}}
{"id":"train_4595","question":"What is Family Guy's country of origin and the language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q5930 wdt:P495 ?ans_1 . wd:Q5930 wdt:P407 ?ans_2 }","paraphrases":["where is Family Guys from and what is their language?"],"info":{}}
{"id":"train_4596","question":"Where is the list of episodes for \"Lassie\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q289537 wdt:P1811 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4599","question":"262570000000 is the market capitalization of the Nokia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1418 wdt:P2226 ?obj filter ( ?obj = 26257000000 ) }","paraphrases":["Is the market capitalization value of Nokia 262570000000?"],"info":{}}
{"id":"train_4607","question":"What award did Jean Tirole receive in 1998?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q173994 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1998' ) ) }","paraphrases":["Name the award received by Jean Tirole in 1998."],"info":{}}
{"id":"train_4609","question":"What's the genre and publisher of the noteable book Hitch-22 by Christopher Hitchens?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 wd:Q3138625 . ?s pq:P136 ?value1 . ?s pq:P123 ?value2 }","paraphrases":["What's the sort and distributer of the noteable book Hitch-22 by Christopher Hitchens?"],"info":{}}
{"id":"train_4611","question":"Who is the head of government of Auckland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q37100 wdt:P6 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the head of government of Auckland?"],"info":{}}
{"id":"train_4612","question":"What is the vapor pressure of fluorine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q650 wdt:P2119 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4613","question":"What is gene is associated with Asperger syndrome","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q161790 wdt:P2293 ?obj . ?obj wdt:P31 wd:Q7187 }","paraphrases":["Asperger's syndrome is linked with which genetic markers?"],"info":{}}
{"id":"train_4615","question":"How many creators are with the Pokémon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q239937 wdt:P170 ?obj }","paraphrases":["Pokemon has how many creators?"],"info":{}}
{"id":"train_4616","question":"How many protocol in the Internet Protocol version 4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2700 wd:Q11103 }","paraphrases":["How many steps are in the Internet Protocol v.4?"],"info":{}}
{"id":"train_4618","question":"Is the points for the Hermann Pernsteiner more than 9.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q25713100 wdt:P1358 ?obj filter ( ?obj > 9.6 ) }","paraphrases":["Did Hermann Pernsteiner earn more than 9.6 points?"],"info":{}}
{"id":"train_4619","question":"Bohemian Rhapsody's Tab4u song ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q187745 wdt:P3838 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4620","question":"How long was Henry Campbell-Bannerman a member of the 20th Parliament of the UK?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q106618 p:P39 ?s . ?s ps:P39 wd:Q41582560 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["How long was UK 20th Parliament member Henry Campbell - Bannerman?"],"info":{}}
{"id":"train_4622","question":"What church celebrates the patron saint Ignatius of Loyola?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P417 wd:Q44281 . ?sbj wdt:P31 wd:Q56395672 }","paraphrases":["What church praises the benefactor holy person Ignatius of Loyola?"],"info":{}}
{"id":"train_4623","question":"Does the GDP (PPP) of North Macedonia equal to 29257308598.29?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q221 wdt:P4010 ?obj filter ( ?obj = 29257308598.29 ) }","paraphrases":["Does the GDP (PPP) of North Macedonia rise to to 29257308598.29?"],"info":{}}
{"id":"train_4624","question":"when is the {start time} for {Wales} thathas {located in the administrative territorial entity} as {Kingdom of England} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q25 p:P131 ?s . ?s ps:P131 wd:Q179876 . ?s pq:P580 ?value }","paraphrases":["When is the {begin time} for {Grains} thathas {found within the authoritative regional substance} as {Kingdom of Britain} ?"],"info":{}}
{"id":"train_4625","question":"What is distinct from the 111.212 carillon of Hornbostel-Sachs?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q505174 wdt:P1889 ?answer . ?answer wdt:P1762 ?x FILTER ( contains ( ?x , '111.212' ) ) }","paraphrases":["What is unmistakable from the 111.212 carillon of Hornbostel-Sachs?"],"info":{}}
{"id":"train_4627","question":"When did Lili Darvas become the spouse of Ferenc Molnár ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q296809 p:P26 ?s . ?s ps:P26 wd:Q762952 . ?s pq:P580 ?value }","paraphrases":["When did Lili Darvas and Ferenc Molnar get married?"],"info":{}}
{"id":"train_4630","question":"How many encode for L-Threonine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q186521 wdt:P702 ?obj }","paraphrases":["For L-Threonine, how many encodes are there?"],"info":{}}
{"id":"train_4633","question":"What's the Carnegie Classification of Institutions of Higher Education that Ben Affleck graduated from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q483118 wdt:P69 ?X . ?X wdt:P2643 ?answer }","paraphrases":["What's the Carnegie Classification of Teach of Higher Instruction that Ben Affleck graduated from?"],"info":{}}
{"id":"train_4636","question":"Who was Enrico Fermi's student?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8753 wdt:P802 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was Enrico Fermi's understudy?"],"info":{}}
{"id":"train_4641","question":"What is the alma mater of Andrew Marvell, which is also the alma mater of director Martin Rees?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q365935 wdt:P69 ?answer . ?answer wdt:P1037 wd:Q335213 }","paraphrases":["What is the alma mater of Andrew Marvell, which is additionally the alma mater of chief Martin Rees?"],"info":{}}
{"id":"train_4644","question":"Who are the members of sports team Dixie Dean in the year 1931?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q316323 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '9311' ) ) }","paraphrases":["Give me the names of the members of sports team Dixie Dean in 1931!"],"info":{}}
{"id":"train_4646","question":"Which is {award received} of {Michael Ende} where {point in time} is {1986-1-1} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q76498 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1986' ) ) }","paraphrases":["Which award did Michael Ende receive on January 1, 1986."],"info":{}}
{"id":"train_4647","question":"What award was Top Gun nominated for in the 59th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q110138 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917235 }","paraphrases":["What grant was Top Gun selected for in the 59th Academy Awards?"],"info":{}}
{"id":"train_4648","question":"Tell me contract whose name has the word zeitausgleich in it name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q93288 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zeitausgleich' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know contract whose title has the word zeitausgleich in it title"],"info":{}}
{"id":"train_4654","question":"In what field was Romy Schneider nominated for the César Award for Best Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q78469 p:P1411 ?s . ?s ps:P1411 wd:Q24241 . ?s pq:P1686 ?value }","paraphrases":["Tell the the field Romy Schneider received a César Award nomination for Best Actress."],"info":{}}
{"id":"train_4655","question":"What is the common name used for Laozi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9333 wdt:P1782 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4656","question":"What is the attendee Korean War in southernmost point located at 35.80859081 36.15096331","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8663 wdt:P710 ?answer . ?answer wdt:P1333 ?x FILTER ( contains ( ?x , '35.80859081 36.15096331' ) ) }","paraphrases":["What is the Korean War at 35.80859081 36.15096331 in the southernmost point?"],"info":{}}
{"id":"train_4658","question":"What is the version of the Old Testament that contains the word \"septuagint \" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3331189 . ?sbj wdt:P629 wd:Q19786 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'septuagint' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the form of the Ancient Confirmation that contains the word \"septuagint \" in its title ?"],"info":{}}
{"id":"train_4660","question":"Which is the statement supported by Al-Qaeda?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3680 wd:Q34490 }","paraphrases":[],"info":{}}
