{"id":"train_13644","question":"What is the newspaper circulation of La Vanguardia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3919 wd:Q511533 }","paraphrases":["How many newspapers are circulated in La Vanguardia?"],"info":{}}
{"id":"train_13646","question":"Name the programming language used to describe the dialect of Fortran.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4913 wd:Q83303 . ?sbj wdt:P31 wd:Q9143 }","paraphrases":["Name the language used to describe Fortran's dialect."],"info":{}}
{"id":"train_13647","question":"What is the  Commonwealth realm  of Australian history for the history of topic","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2184 wd:Q174825 . ?sbj wdt:P31 wd:Q202686 }","paraphrases":[],"info":{}}
{"id":"train_13648","question":"Japanese is the language of which federal state?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q5287 . ?sbj wdt:P31 wd:Q43702 }","paraphrases":[],"info":{}}
{"id":"train_13649","question":"What is the political party of Albert Camus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q34670 wdt:P102 ?ans_1 . wd:Q34670 wdt:P463 ?ans_2 }","paraphrases":["Name Albert Camus political party?"],"info":{}}
{"id":"train_13654","question":"What is the hub and who is the owner of Shandong Airlines?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1153602 wdt:P127 ?X . ?X wdt:P113 ?answer }","paraphrases":["What is the hub and who is Shandong Airlines ' owner?"],"info":{}}
{"id":"train_13655","question":"How many people represented the {Sol LeWitt} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q168587 wdt:P1875 ?obj }","paraphrases":["Who was Sol LeWitt represented by?"],"info":{}}
{"id":"train_13658","question":"What is NILF author id for  Hector Berlioz ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1151 wdt:P2191 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13659","question":"tell me sovereign state which name has the word yugoslavia in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3624078 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yugoslavia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a state of sovereignty whose name is Yugoslavia"],"info":{}}
{"id":"train_13660","question":"What is the fiscal and tax revenue of Taguig?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1643 wdt:P3087 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13661","question":"Is it true that the draft of Storebro SB90E equals to 0.7?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7619971 wdt:P2262 ?obj filter ( ?obj = 0.7 ) }","paraphrases":["Is the draft of Storebro SB90E actually equal to 0.7?"],"info":{}}
{"id":"train_13664","question":"Which is the construction material of the plays of John Paul Jones?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190243 wdt:P1303 ?X . ?X wdt:P186 ?answer }","paraphrases":["What material is used for construction in the plays of John Paul Jones?"],"info":{}}
{"id":"train_13666","question":"What radio station does Stanford University own?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41506 wdt:P1830 ?obj . ?obj wdt:P31 wd:Q14350 }","paraphrases":["What radio station does Stanford College own?"],"info":{}}
{"id":"train_13667","question":"Name a sidekick of Batman","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2546 wd:Q2695156 . ?sbj wdt:P31 wd:Q188784 }","paraphrases":["What is Batman's sidekick's name?"],"info":{}}
{"id":"train_13668","question":"Which is the transmitted signal type of bipedalism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1170 wd:Q372949 }","paraphrases":[],"info":{}}
{"id":"train_13670","question":"What is the game mode and method for playing Pac-Man?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q173626 wdt:P404 ?ans_1 . wd:Q173626 wdt:P479 ?ans_2 }","paraphrases":["Name the game mode and method for playing Pac-Man."],"info":{}}
{"id":"train_13671","question":"When and what did Thomas Cranmer do?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q199894 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["When and what did Thomas Cranmer do for?"],"info":{}}
{"id":"train_13672","question":"At what point in time, and in which league did Mike Trout receive his award as MVP?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3090378 p:P166 ?s . ?s ps:P166 wd:Q1514249 . ?s pq:P585 ?value1 . ?s pq:P118 ?value2 }","paraphrases":["When did Mike Trout win his MVP award and in what league was he in?"],"info":{}}
{"id":"train_13673","question":"Who is responsible for the Russian economy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q461731 wdt:P1269 ?X . ?X wdt:P530 ?answer }","paraphrases":["Who is in charge of the Russian economy?"],"info":{}}
{"id":"train_13674","question":"What is the first name of William Wilkerson, that is the same as Will?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15485276 wdt:P735 ?answer . ?answer wdt:P460 wd:Q15729029 }","paraphrases":["What is the first identify of William Wilkerson, that is the identical as Will?"],"info":{}}
{"id":"train_13676","question":"What is the proximate result of using pickling?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1503967 wdt:P2283 ?X . ?X wdt:P1478 ?answer }","paraphrases":["What is the proximate result of utilizing pickling?"],"info":{}}
{"id":"train_13677","question":"Which is the Ciné-Ressources person ID of Charles Laughton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q55264 wdt:P3204 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13678","question":"When did educated at of C. Vann Woodward and academic major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q612410 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["When did taught at of C. Vann Woodward and scholastic major?"],"info":{}}
{"id":"train_13679","question":"Which bridge was Zaha Hadid an architect for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P84 wd:Q47780 . ?sbj wdt:P31 wd:Q12280 }","paraphrases":[],"info":{}}
{"id":"train_13680","question":"What is Fidel Castro's communist party for the member of the political party.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11256 wdt:P102 ?obj . ?obj wdt:P31 wd:Q233591 }","paraphrases":["What is Fidel Castro's communist party for the part of the political party."],"info":{}}
{"id":"train_13682","question":"Name an European sport governing body that starts with letter E","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11422536 . ?sbj wdt:P1001 wd:Q46 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an European recreation governing physique that starts offevolved with letter E"],"info":{}}
{"id":"train_13683","question":"Is the number of parts of the Christmas song Chestnuts Roasting on an Open Fire 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q10381267 wdt:P2635 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is 1 the correct number of parts of the Christmas song Chestnuts Roasting on an Open Fire?"],"info":{}}
{"id":"train_13684","question":"Is it true that the density of water equals to 1.18284?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q283 wdt:P2054 ?obj filter ( ?obj = 1.18284 ) }","paraphrases":["Does water have a density of 1.18284?"],"info":{}}
{"id":"train_13685","question":"When did Nikephoros II Phokas end his time as Byzantine emperoror?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41625 p:P39 ?s . ?s ps:P39 wd:Q18577504 . ?s pq:P582 ?value }","paraphrases":["What year did Nikephoros II Phokas step down as Byzantine emperor?"],"info":{}}
{"id":"train_13686","question":"Is John Cena place of birth West Newbury?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44437 wdt:P19 wd:Q576891 }","paraphrases":["The Grammy Award for Best Rap Performance is an honor presented to recording artists for quality rap performances. It was first presented at the 31st Annual Grammy Awards in 1989 and again at the 32nd Annual Grammy Awards in 1990, after which point the award was split into two categories: Best Rap Solo Performance and Best Rap Performance by a Duo or Group. These two categories were combined again in 2012 as a result of a restructure of Grammy categories, and the reinstated Award for Best Rap Performance was presented at the 54th Grammy Awards in 2012."],"info":{}}
{"id":"train_13687","question":"How many people are nominated for the {Jacqueline Wilson} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q240647 wdt:P1411 ?obj }","paraphrases":["The Jacqueline Wilson award has what number of people nominated for it?"],"info":{}}
{"id":"train_13688","question":"\"Which is {birth location} of {Anne Perry}, which has {office of head of government} is {Mayor of London} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q288627 wdt:P19 ?answer . ?answer wdt:P1313 wd:Q38931 }","paraphrases":["\"Which is {birth location} of {Anne Perry}, which has {office of head of government} is {Mayor of London} ?\""],"info":{}}
{"id":"train_13689","question":"Is the standard molar entropy of silver equal to 34.08?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1090 wdt:P3071 ?obj filter ( ?obj = 34.08 ) }","paraphrases":["Does the standard molar entropy of silver equal 34.08?"],"info":{}}
{"id":"train_13691","question":"Who is the {human} for {mother} of {Francisco Franco}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q29179 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {mother} of {Francisco Franco}"],"info":{}}
{"id":"train_13693","question":"What employment is portrayed by Alonso Quijano?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q944201 wdt:P175 ?X . ?X wdt:P106 ?answer }","paraphrases":["Alonso Quilano portrayed what employment?"],"info":{}}
{"id":"train_13694","question":"What is the award received by Theodoros Angelopoulos and who were the winners?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q55168 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 ?value1 . }","paraphrases":["What is the grant gotten by Theodoros Angelopoulos and who were the champs?"],"info":{}}
{"id":"train_13695","question":"Who is the actress of \"Once Upon a Time in the West\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q168154 wdt:P161 ?X . ?X wdt:P106 ?answer }","paraphrases":["Who is the on-screen character of \"Once Upon a Time within the West\"?"],"info":{}}
{"id":"train_13696","question":"When did position held of Charles Stewart Parnell and elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q317436 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["When did position held of Charles Stewart Parnell and chosen in?"],"info":{}}
{"id":"train_13698","question":"What Christian holy day commemorates the resurrection of Jesus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P547 wd:Q51624 . ?sbj wdt:P31 wd:Q60075825 }","paraphrases":[],"info":{}}
{"id":"train_13702","question":"Name a biblical character that contain the word \" yael\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20643955 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yael' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a scriptural character that contain the word \" yael\" in its name"],"info":{}}
{"id":"train_13703","question":"What is technetium and how was it discovered?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1054 wdt:P189 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is technetium and how was it discovered?"],"info":{}}
{"id":"train_13704","question":"What was Jenny Thompson received participating in 1996 Summer Olympics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q231011 p:P1344 ?s . ?s ps:P1344 wd:Q8531 . ?s pq:P166 ?value }","paraphrases":["Jenny Thompson won what award in the 1996 Summer Olympics?"],"info":{}}
{"id":"train_13707","question":"Who is the record producer of Duck Hunt that died in Komatsu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q764069 wdt:P162 ?answer . ?answer wdt:P20 wd:Q646898 }","paraphrases":["Who is the file producer of Duck Hunt that died in Komatsu?"],"info":{}}
{"id":"train_13709","question":"Where is the death location of Amon Goth, which has twin cities named Milan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q84152 wdt:P20 ?answer . ?answer wdt:P190 wd:Q490 }","paraphrases":["Where is the demise place of Amon Goth, which has twin cities named Milan?"],"info":{}}
{"id":"train_13710","question":"When did Alcatraz Island become a heritage designation  place listed on the National Register of Historic Places?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q131354 p:P1435 ?s . ?s ps:P1435 wd:Q19558910 . ?s pq:P580 ?value }","paraphrases":["The year ALcatraz became a heritage designation place on the National Register of Historic Places?"],"info":{}}
{"id":"train_13711","question":"What's the Betelgeuse constellation constellation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12124 wdt:P59 ?obj . ?obj wdt:P31 wd:Q8928 }","paraphrases":["What's the Betelgeuse star grouping constellation?"],"info":{}}
{"id":"train_13712","question":"Were the points for the 2013 National Women's Soccer League less than or more than 290.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41479097 wdt:P1358 ?obj filter ( ?obj < 290.4 ) }","paraphrases":["In 2013, did the National Women's Soccer League score more than 290.4 points?"],"info":{}}
{"id":"train_13713","question":"Is the People's Republic of China's real GDP growth rate equal to 6.7?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q148 wdt:P2219 ?obj filter ( ?obj = 6.7 ) }","paraphrases":["what is the gdp growth of the people's republic of china?"],"info":{}}
{"id":"train_13714","question":"What is the ticker symbol for HSBC Holdings on the Hong Kong Stock Exchange?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q190464 p:P414 ?s . ?s ps:P414 wd:Q496672 . ?s pq:P249 ?value }","paraphrases":["On the Hong Kong Stock Exchange, what is the HSBC Holdings ticker symbol?"],"info":{}}
{"id":"train_13715","question":"When was Martin McGuinness, Member of the 52nd Parliament of the United Kingdom, elected, and when did he serve till?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q57689 p:P39 ?s . ?s ps:P39 wd:Q36634044 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["When did Martin McGuinness get chosen as a Member of the 52nd Parliament of the UK, and how long did he serve after that?"],"info":{}}
{"id":"train_13716","question":"When was the population of Cape Verde recorded as 302133.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1011 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '302133.0' ) ) . ?s pq:P585 ?value }","paraphrases":["ABout the Nation of Cape Verde: What was its population on 302133.0?"],"info":{}}
{"id":"train_13717","question":"What player conflict did the 61st Infantry Division have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2817951 wdt:P607 ?X . ?X wdt:P710 ?answer }","paraphrases":["Name the player conflict of  61st Infantry Division"],"info":{}}
{"id":"train_13718","question":"Which {antiparticle} in a{photon} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2152 wd:Q3198 }","paraphrases":[],"info":{}}
{"id":"train_13719","question":"What is the leaf of this taxon source of Spinacia oleracea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q81464 wdt:P1672 ?obj . ?obj wdt:P31 wd:Q33971 }","paraphrases":["What is the leaf of this taxon source of Spinacia oleracea?"],"info":{}}
{"id":"train_13722","question":"Which is the birth city of Mamoru Miyano , that have indigenous council namely Saitama Prefectural Assembly?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q519821 wdt:P19 ?answer . ?answer wdt:P194 wd:Q11426811 }","paraphrases":["Which is the beginning city of Mamoru Miyano , that have indigenous council specifically Saitama Prefectural Assembly?"],"info":{}}
{"id":"train_13723","question":"What is the record label tent?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P264 wd:Q170544 }","paraphrases":["Which tent is used for record labels?"],"info":{}}
{"id":"train_13724","question":"What was the ultimate goal of the 1953 British Expedition to Mount Everest?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q513 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P805 wd:Q4567715 }","paraphrases":["Explain the ultimate goal of the 1953 British Mount Everest expedition?"],"info":{}}
{"id":"train_13725","question":"What was discovered at Astatine that is in the country of Lesotho?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q999 wdt:P189 ?answer . ?answer wdt:P530 wd:Q1013 }","paraphrases":["What was found at Astatine that's within the nation of Lesotho?"],"info":{}}
{"id":"train_13726","question":"What is the Arabic organization of diplomacy, for the Kingdom of Arabia.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P530 wd:Q7172 . ?sbj wdt:P31 wd:Q4120211 }","paraphrases":["For the Kingdom of Arabia, what is the Arab diplomacy organization."],"info":{}}
{"id":"train_13729","question":"Was Alec Baldwin a student of Wray Carlton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q170572 wdt:P1066 wd:Q8037644 }","paraphrases":["Did Wray Carlton have as a student Alec Baldwin?"],"info":{}}
{"id":"train_13730","question":"What criteria was used for the world junior records in athletics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q542 p:P2869 ?s . ?s ps:P2869 wd:Q592883 . ?s pq:P1013 ?value }","paraphrases":["What scoring methods were used in regards to the world junior records for athletics?"],"info":{}}
{"id":"train_13732","question":"Tell me cross whose name has the word war in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q40843 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'war' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me cross that has the name \"war\" in it."],"info":{}}
{"id":"train_13733","question":"How was the population of Krefeld determined to be 226,812?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2805 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '226812' ) ) . ?s pq:P459 ?value }","paraphrases":["What method was used to determine Krefeld's population of 226,812?"],"info":{}}
{"id":"train_13735","question":"what is the grammatcal mood of turkish","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q256 wdt:P3161 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13736","question":"Who are the people who publish Forbes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P123 wd:Q55185392 . ?sbj wdt:P31 wd:Q845648 }","paraphrases":["Who are the individuals who distribute Forbes?"],"info":{}}
{"id":"train_13737","question":"Which star has the most points?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q50053 . ?ent wdt:P2214 ?obj . ?ent wdt:P31 wd:Q878367 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the star with the most points."],"info":{}}
{"id":"train_13738","question":"WHAT IS THE LABEL IN ORIGINAL LANGUAGE OF ALTERY OF UTERUS","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9612 wdt:P2286 ?X . ?X wdt:P1705 ?answer }","paraphrases":["IN ORIGINAL LANGUAGE OF CHANGING OF UTERUS, WHAT IS THE LABEL?"],"info":{}}
{"id":"train_13739","question":"What is the administrative territorial entity of Hidalgo that has a total fertility rate of 2.447?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q80903 wdt:P131 ?answer . ?answer wdt:P4841 ?x FILTER ( contains ( ?x , '2.447' ) ) }","paraphrases":["Explain the administrative territorial entity of Hidalgo that's fertility rate is 2.446."],"info":{}}
{"id":"train_13740","question":"Where is the road bridge for next crossing upstream of London Bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2673 wd:Q130206 . ?sbj wdt:P31 wd:Q537127 }","paraphrases":["Where is the street bridge for following crossing upstream of London Bridge?"],"info":{}}
{"id":"train_13741","question":"What is the written history of Juan Antonio Samaranch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q171166 wdt:P937 ?X . ?X wdt:P1249 ?answer }","paraphrases":["What is the composed history of Juan Antonio Samaranch?"],"info":{}}
{"id":"train_13743","question":"what are the fantastique genre which contains the word sorcery in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20076756 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sorcery' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the fantastique class which contains the word divination in their name"],"info":{}}
{"id":"train_13744","question":"When did Luigi Cherubini start holding the position as directors of higher national conservatories of music, dance and drama in France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q20721 p:P39 ?s . ?s ps:P39 wd:Q3248992 . ?s pq:P580 ?value }","paraphrases":["On what date(s) did Luigi Cherubini become the director of the French higher national conservatories of music, dance, and drama?"],"info":{}}
{"id":"train_13746","question":"What is the Australian National University's Australian Government Organisations Register ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q127990 wdt:P3534 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13748","question":"What is the CoA image order of Johann Tetzel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q76873 wdt:P611 ?X . ?X wdt:P94 ?answer }","paraphrases":["What is the CoA picture arrange of Johann Tetzel?"],"info":{}}
{"id":"train_13749","question":"What is BG EKATTE place ID for Sofia ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q472 wdt:P3990 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13750","question":"what is the statement is subject for turkey has diplomatic relation as morocco?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43 p:P530 ?s . ?s ps:P530 wd:Q1028 . ?s pq:P805 ?value }","paraphrases":["What is the diplomatic relationship between Turkey and Morocco?"],"info":{}}
{"id":"train_13752","question":"Which is the tributary of the outflow of Minho River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14554 wdt:P403 ?X . ?X wdt:P974 ?answer }","paraphrases":["Tell me Tributary flow of Minho River"],"info":{}}
{"id":"train_13753","question":"What was the population of the Bio Bio Region in 1992?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2170 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1992' ) ) }","paraphrases":["In 1992, how large was the population in the Bio Bio Region?"],"info":{}}
{"id":"train_13754","question":"Name a subsidiary of the company Sears","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P355 wd:Q6499202 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Title a auxiliary of the company Sears"],"info":{}}
