{"id":"train_1231","question":"What is located in the landscape of The Scream?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q471379 wdt:P180 ?X . ?X wdt:P131 ?answer }","paraphrases":["What is found within the scene of The Shout?"],"info":{}}
{"id":"train_1232","question":"Who is the airline alliance of Singapore Airlines?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q32245 wdt:P114 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1233","question":"Who are Sandrart.net artwork ID of Laocoön and His Sons?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q465762 wdt:P4380 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1236","question":"When did the Indiana Film Journalists Association give George Cloooney the award for Best Actor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23844 p:P166 ?s . ?s ps:P166 wd:Q16058281 . ?s pq:P585 ?value }","paraphrases":["In what year, did George Clooney receive the Best Actor award from the Indiana Film journalists?"],"info":{}}
{"id":"train_1241","question":"Who got the noble title of monarch of Italy before and after Lothair I.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q150735 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Who got the respectable title of ruler of Italy some time recently and after Lothair I."],"info":{}}
{"id":"train_1242","question":"When was Bangalore part of the Mysore State?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1355 p:P131 ?s . ?s ps:P131 wd:Q3374892 . ?s pq:P580 ?value }","paraphrases":["When was Bangalore in the Mysore State?"],"info":{}}
{"id":"train_1243","question":"When is {date of death} of {Luca Pacioli} whose {earliest date} is {1517-4-0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q87620 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1319 ?x filter ( contains ( YEAR ( ?x ) , '1517' ) ) }","paraphrases":["What year did Luca Pacioli died between 1517-4-0"],"info":{}}
{"id":"train_1244","question":"What is tutor Andreas Vesalius' career?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170267 wdt:P1066 ?X . ?X wdt:P106 ?answer }","paraphrases":["Who is the tutor of Andreas Vesalius?"],"info":{}}
{"id":"train_1245","question":"When did Wuppertal have a population of 345,425?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2107 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '345425.0' ) ) . ?s pq:P585 ?value }","paraphrases":["What year was Wuppertal's population reach 345,425?"],"info":{}}
{"id":"train_1251","question":"Name a country related to Israel that starts with letter H","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17544377 . ?sbj wdt:P1269 wd:Q801 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a Israel - related country starting with letter H"],"info":{}}
{"id":"train_1252","question":"Name an ancient monument that starts with letter G","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3395377 . ?sbj wdt:P2614 wd:Q23038977 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title an antiquated landmark that begins with letter G"],"info":{}}
{"id":"train_1254","question":"Who is the {gene} for {genetic association} of {allergic rhinitis}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q272436 wdt:P2293 ?obj . ?obj wdt:P31 wd:Q7187 }","paraphrases":["What genetic association of gene is responsible for allergic rhinitis?"],"info":{}}
{"id":"train_1256","question":"What was the population of Bermuda on 0-0-1988?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23635 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1988' ) ) }","paraphrases":["What was the population of Bermuda in 1988?"],"info":{}}
{"id":"train_1257","question":"What muncipality of Norway starts with the letter \"ø\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q755707 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ø' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What muncipality of Norway begins with the letter \"ø\"?"],"info":{}}
{"id":"train_1258","question":"Mention the fictional human character murdered by Luke Skywalker","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q51746 wdt:P157 ?obj . ?obj wdt:P31 wd:Q15632617 }","paraphrases":["What character was killed by Luke Skywalker?"],"info":{}}
{"id":"train_1260","question":"Is the global-warming potential of octafluorocyclobutane greater than 10440?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q413079 wdt:P2565 ?obj filter ( ?obj > 10440.0 ) }","paraphrases":["Is 10440 the global-warming potential of octafluorocyclobutane?"],"info":{}}
{"id":"train_1262","question":"Which is the GS1 Manufacturer code for Google?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q95 wdt:P3193 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1263","question":"What are the political system which start with the letter totalitarianism","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28108 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'totalitarianism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the political system which begin with the letter totalitarianism"],"info":{}}
{"id":"train_1266","question":"What is designed and influenced by JavaScript?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q2005 wdt:P287 ?ans_1 . wd:Q2005 wdt:P737 ?ans_2 }","paraphrases":["What does JavaScript design and influence?"],"info":{}}
{"id":"train_1267","question":"Who created Esperanto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q143 wdt:P170 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who made Esperanto?"],"info":{}}
{"id":"train_1269","question":"Who is the {island nation} for {participant} of {North African Campaign}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q218678 wdt:P710 ?obj . ?obj wdt:P31 wd:Q112099 }","paraphrases":["Which island nation participated in the North African Campaign?"],"info":{}}
{"id":"train_1271","question":"What college did Virgil Thomson attend?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q544485 wdt:P69 ?X . ?X wdt:P355 ?answer }","paraphrases":["Where did Virgil Thomson attend college?"],"info":{}}
{"id":"train_1272","question":"What award was Dianne Wiest nominated for at the 67th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q217573 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q857001 }","paraphrases":["Dianne Wiest was nominated in which category at the 67th Academy Awards?"],"info":{}}
{"id":"train_1273","question":": Does Zhigulevskoye has alcohol by volume equal to 4.8","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q134899 wdt:P2665 ?obj filter ( ?obj = 4.8 ) }","paraphrases":[": Does Zhigulevskoye has liquor by volume rise to to 4.8"],"info":{}}
{"id":"train_1274","question":"What was the {manner of death} and the {cause of death} of {Paul_Allen} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q162005 wdt:P1196 ?ans_1 . wd:Q162005 wdt:P509 ?ans_2 }","paraphrases":["How and why did Paul Allen die?"],"info":{}}
{"id":"train_1275","question":"Tell me me a municipality whose name consist of the word \"barcelona\" and whose patron saint Virgin Mary","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15284 . ?sbj wdt:P417 wd:Q345 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'barcelona' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me me a municipality whose name consist of the word \"barcelona\" and whose patron saint Virgin Mary"],"info":{}}
{"id":"train_1276","question":"Who publishes the book \" Examining the race specific prevelance of hidradenitis suppurativa at a large academic center, results from a retrospective chart review\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q38716727 wdt:P1433 ?X . ?X wdt:P123 ?answer }","paraphrases":["Get me the name of publisher of  \"Examining the race specific prevelance of hidradenitis suppurativa at a large academic center, results from a retrospective chart review\""],"info":{}}
{"id":"train_1277","question":"Who is the operator and builder of the Bombardier Dash 8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q736765 wdt:P137 ?ans_1 . wd:Q736765 wdt:P176 ?ans_2 }","paraphrases":["Who built and operated the Bombardier Dash 8?"],"info":{}}
{"id":"train_1278","question":"How many position held are by the lieutenant general?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P39 wd:Q152951 }","paraphrases":["What is the total number of ranks that the Lieutenant General has accomplished?"],"info":{}}
{"id":"train_1279","question":"What is the opposite of a superhero","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P461 wd:Q188784 . ?sbj wdt:P31 wd:Q17305127 }","paraphrases":["Who works against a superhero?"],"info":{}}
{"id":"train_1280","question":"Which is the two-part episode for the series The X-Files?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P179 wd:Q2744 . ?sbj wdt:P31 wd:Q21664088 }","paraphrases":[],"info":{}}
{"id":"train_1281","question":"What is the subsidiary of which is owned by of Laserdisc ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q273309 wdt:P127 ?X . ?X wdt:P199 ?answer }","paraphrases":["what subsidiary is owned by Laserdisc?"],"info":{}}
{"id":"train_1282","question":"On what day were the children of Teodoro Obiang Nguema Mbasogo born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57385 wdt:P40 ?X . ?X wdt:P569 ?answer }","paraphrases":["When are the birth dates of the kids of Teoforo Obiang Nguema Mbasogo?"],"info":{}}
{"id":"train_1283","question":"Which is part of the ecology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7150 wdt:P361 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1287","question":"Which is the male given name for the language of work in Russian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q7737 . ?sbj wdt:P31 wd:Q12308941 }","paraphrases":[],"info":{}}
{"id":"train_1288","question":"When and what was the award received by John Galsworthy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q82248 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["When and what was the honor gotten by John Galsworthy?"],"info":{}}
{"id":"train_1289","question":"What are the Luther city which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1547289 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Luther city which begin with the letter w"],"info":{}}
{"id":"train_1290","question":"Who is the  {Turkish bath} for {named after} of {Suleiman the Magnificent}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P138 wd:Q8474 . ?sbj wdt:P31 wd:Q28077 }","paraphrases":["Who is the {Turkish shower} for {named after} of {Suleiman the Magnificent}"],"info":{}}
{"id":"train_1291","question":"Waht actors are in \"Romance Revisited: The Songs of Jose Mari Chan\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12508854 wdt:P155 ?X . ?X wdt:P175 ?answer }","paraphrases":["Waht on-screen characters are in \"Sentiment Returned to: The Tunes of Jose Mari Chan\"?"],"info":{}}
{"id":"train_1292","question":"What award did Andre Gide win that had a prize of $146,115?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q47484 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter ( contains ( ?x , '146115.0' ) ) }","paraphrases":["Andrew Gide won which award with prize money totaling $146, 115?"],"info":{}}
{"id":"train_1295","question":"Which business division does The Walt Disney Company belong to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7414 wdt:P199 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":["Which commerce division does The Walt Disney Company have a place to?"],"info":{}}
{"id":"train_1296","question":"how many honors does dame have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P511 wd:Q901407 }","paraphrases":["How many honors has Madame received?"],"info":{}}
{"id":"train_1299","question":"At which university does Linus Pauling work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q48983 wdt:P108 ?obj . ?obj wdt:P31 wd:Q3918 }","paraphrases":["At which college does Linus Pauling work?"],"info":{}}
{"id":"train_1300","question":"Which means {World Golf Hall of Fame player ID} for{Tom Watson} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q532111 wdt:P4461 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1301","question":"When did Henry Steele Commager receive his education from the University of Chicago ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3785004 p:P69 ?s . ?s ps:P69 wd:Q131252 . ?s pq:P580 ?value }","paraphrases":["Henry Steele Commager went to the University of Chicago when?"],"info":{}}
{"id":"train_1302","question":"What is the gender of Kartikeya whose symbol is also ♂?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q380817 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , '♂' ) ) }","paraphrases":["What is the sexual orientation of Kartikeya whose image is additionally ♂?"],"info":{}}
{"id":"train_1303","question":"Which Chinese character has the tallest stroke count?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q53764738 . ?ent wdt:P5205 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Chinese personality has the tallest stroke count?"],"info":{}}
{"id":"train_1309","question":"What what is animated film  city of the United States chicago","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10689397 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tv' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is enlivened film city of the Joined together States chicago"],"info":{}}
{"id":"train_1310","question":"What award Angela Lansbury has received at Tony Award for Best Actress in a Musical ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q206856 p:P166 ?s . ?s ps:P166 wd:Q1537996 . ?s pq:P805 ?value }","paraphrases":["Has Angela Lansbury received the 'Best Actress in a Musical\" at the Tony Awards?"],"info":{}}
{"id":"train_1311","question":"What is the higher taxon of Mammut, whose vernacular name is Mastodonty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192272 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'Mastodonty' ) ) }","paraphrases":["What is the higher taxon of Mammut, whose vernacular title is Mastodonty?"],"info":{}}
{"id":"train_1313","question":"What hockey team in the NHL contains Ottawa in their name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4498974 . ?sbj wdt:P118 wd:Q1215892 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ottawa' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What hockey group in the NHL contains Ottawa in their name?"],"info":{}}
{"id":"train_1314","question":"Tell me national cuisine whose name has the word mex in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1968435 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'mex' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which national cuisine includes the term \"mex\" in its name?"],"info":{}}
{"id":"train_1315","question":"Which referendum in Ireland, following the Eighth Amendment of the Constitution of Ireland, has the least amount of spoiled votes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q54086790 . ?ent wdt:P5044 ?obj . ?ent wdt:P155 wd:Q4126745 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which poll in Ireland has the fewest number of invalid votes, following the Eighth Amendment of the Irish Constitution."],"info":{}}
{"id":"train_1316","question":"What is the {studied by} and the {partially coincident with} of {Human_body} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q23852 wdt:P2579 ?ans_1 . wd:Q23852 wdt:P1382 ?ans_2 }","paraphrases":["What is the {studied} and the {partly coincident} of {Human body}?"],"info":{}}
{"id":"train_1318","question":"What is the wikipedia article for the Autobahn?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P360 wd:Q313301 . ?sbj wdt:P31 wd:Q13406463 }","paraphrases":["What is the wikipedia article for the Autobahn?"],"info":{}}
{"id":"train_1323","question":"Was Aristotle a student of Heraclitus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q868 wdt:P1066 wd:Q41155 }","paraphrases":["Heraclitus of Ephesus (/ˌhɛrəˈklaɪtəs/;[1] Greek: Ἡράκλειτος ὁ Ἐφέσιος, translit. Hērákleitos ho Ephésios; (c. 535 – c. 475 BCE) was a pre-Socratic Greek philosopher, and a native of the city of Ephesus,[2] then part of the Persian Empire. He was of distinguished parentage. Little is known about his early life and education, but he regarded himself as self-taught and a pioneer of wisdom. From the lonely life he led, and still more from the apparently riddled[3] and allegedly paradoxical[4] nature of his philosophy and his stress upon the heedless unconsciousness of humankind,[5] he was called \"The Obscure\" and the \"Weeping Philosopher\"."],"info":{}}
{"id":"train_1324","question":"Of what sports team is Kenny Dalglish a member and how many matches has he played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q187198 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["Of what sports group is Kenny Dalglish a part and how numerous matches has he played?"],"info":{}}
{"id":"train_1327","question":"Which is FAO 2007 genetic resource ID for Hereford?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q737173 wdt:P3380 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1331","question":"Tell me numeric writing system whose name has the word numerals in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q140774 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'numerals' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the number writing system which contains the word numerals in their name"],"info":{}}
{"id":"train_1333","question":"What is the birth place of Annie Oakley, is it correct that it has 52501.0 inhabitants?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q230935 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '52501.0' ) ) }","paraphrases":["What is the birth put of Annie Oakley, is it rectify that it has 52501.0 inhabitants?"],"info":{}}
{"id":"train_1335","question":"What is the supplementary intercardinal direction with the highest angle opposite of east-northeast?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22809326 . ?ent wdt:P2211 ?obj . ?ent wdt:P461 wd:Q12593409 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is supplementary intercardinal direction has the highest angle opposite east-northeast?"],"info":{}}
{"id":"train_1336","question":"Which port has the highest production rate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q44782 . ?ent wdt:P2197 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which harbour has the most elevated generation rate?"],"info":{}}
{"id":"train_1337","question":"Tell me sport discipline whose name has the word  wheelchair in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2312410 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wheelchair' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal me sport discipline whose name has the word wheelchair in it."],"info":{}}
{"id":"train_1338","question":"Name the listed Salzburg town monuments containing the word Salzburg in their name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13539802 . ?sbj wdt:P1456 wd:Q1188436 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'salzburg' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the recorded Salzburg town landmarks containing the word Salzburg in their name."],"info":{}}
{"id":"train_1339","question":"Did Mark David Chapman undergo detention at Attica Correctional Facility and Wende Correctional Facility ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q80462 wdt:P2632 wd:Q758034 . wd:Q80462 wdt:P2632 wd:Q7982352 }","paraphrases":["Was Mark David Champan detained at Attica and Wende Correctional Facility?"],"info":{}}
{"id":"train_1340","question":"What member of the Ranjitsinhji sports team joined in 1893 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2757835 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1893' ) ) }","paraphrases":["which member of sports joined Ranjitsinhji joined in 1893?"],"info":{}}
{"id":"train_1341","question":"Who is the composer of All We Know?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2315956 wdt:P155 ?X . ?X wdt:P86 ?answer }","paraphrases":["Who composed the song 'All We Know'?"],"info":{}}
{"id":"train_1342","question":"Name the record label behind the surge of Suge Knight","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q455880 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 }","paraphrases":["Title the record name behind the surge of Suge Knight"],"info":{}}
{"id":"train_1345","question":"When Rowan Atkinson attended Queen's College, what was his academic major and degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q23760 p:P69 ?s . ?s ps:P69 wd:Q73094 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What degree did Rowan Atkinson get at Queen's College and when?"],"info":{}}
{"id":"train_1346","question":"Name a {subsidiary company} that {manager/director} {Daniel Schwartz} that starts with the letter {'b'}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q658255 . ?sbj wdt:P1037 wd:Q28229358 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a {subsidiary company} that {manager/director} {Daniel Schwartz} that begins with the letter {'b'}"],"info":{}}
{"id":"train_1347","question":"Which is the Florentine musea catalogue ID for Primavera?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q549847 wdt:P2242 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1349","question":"Which school did Mao Zedong attend starting January 1, 1912?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5816 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1912' ) ) }","paraphrases":["Which school did Mao Zedong go to beginning January 1, 1912?"],"info":{}}
{"id":"train_1351","question":"What is the Sister City of the final resting place of Hafsa bint Umar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q263791 wdt:P20 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the Sister City of the last resting spot of Hafsa bint Umar?"],"info":{}}
