{"id":"train_3373","question":"who is the participant and member Pope_Benedict_XVI?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q2494 wdt:P1344 ?ans_1 . wd:Q2494 wdt:P463 ?ans_2 }","paraphrases":["Name the participant and member that Pope_Benedict_XVI refers to."],"info":{}}
{"id":"train_3376","question":"When was A.C. Milan retired from Head coach post?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1543 p:P286 ?s . ?s ps:P286 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["When did A.C. Milan retire as head coach?"],"info":{}}
{"id":"train_3377","question":"What time zone is Aix-en-Provence located?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47465 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value }","paraphrases":["In what time zone is Aix-en-Provence located?"],"info":{}}
{"id":"train_3379","question":"What are the historical event which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13418847 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the verifiable occasion which begin with the letter w"],"info":{}}
{"id":"train_3383","question":"When was Gian Maria Volonté awarded the Silver Bear?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q317110 p:P166 ?s . ?s ps:P166 wd:Q708135 . ?s pq:P585 ?value }","paraphrases":["Give me the date Gian Maria Volonte was awarded the Silver Bear."],"info":{}}
{"id":"train_3384","question":"What is  translation for originating source of Lê dynasty ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10800789 wdt:P248 ?X . ?X wdt:P747 ?answer }","paraphrases":["What is interpretation for beginning source of Lê tradition ?"],"info":{}}
{"id":"train_3386","question":"When did Nebraska adopt the motto \"Equality Before the Law\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1553 p:P1451 ?s . ?s ps:P1451 ?x filter ( contains ( ?x , 'Equality before the law' ) ) . ?s pq:P580 ?value }","paraphrases":["Nebraska adopted the motto \" Equality Before the Law\" when?"],"info":{}}
{"id":"train_3387","question":"Which bridge is maintained by Amtrak?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P126 wd:Q23239 . ?sbj wdt:P31 wd:Q12280 }","paraphrases":["Which bridge is kept up by Amtrak?"],"info":{}}
{"id":"train_3389","question":"what is job holder is previous mangalesa of dynasty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12444610 wdt:P53 ?X . ?X wdt:P1365 ?answer }","paraphrases":["what is work holder is past mangalesa of tradition?"],"info":{}}
{"id":"train_3394","question":"What language is most used y humans ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1535 wd:Q5 . ?sbj wdt:P31 wd:Q20829075 }","paraphrases":["What language is most frequently used by people?"],"info":{}}
{"id":"train_3396","question":"Does the brother of Fatimah have a Christian name of Abdullah?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q180123 wdt:P3373 ?answer . ?answer wdt:P735 wd:Q307578 }","paraphrases":["Does the brother of Fatimah have a Christian name of Abdullah?"],"info":{}}
{"id":"train_3397","question":"What is printed by Johannes Gutenberg ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P872 wd:Q8958 }","paraphrases":[],"info":{}}
{"id":"train_3398","question":"To which genre does Twenty Thousand leagues Under the Sea belong?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q183565 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["To which class does Twenty Thousand alliances Beneath the Ocean belong?"],"info":{}}
{"id":"train_3400","question":"Where does Heinrich Schliemann work which is also a sister city to Amsterdam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57106 wdt:P937 ?answer . ?answer wdt:P190 wd:Q9899 }","paraphrases":["Where does Heinrich Schliemann work which is additionally a sister city to Amsterdam?"],"info":{}}
{"id":"train_3401","question":"What caused the end of Harold Macmillan's position as Member of the 39th Parliament?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q128985 p:P39 ?s . ?s ps:P39 wd:Q41582600 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["Why did Harold Macmillan leave Parliament?"],"info":{}}
{"id":"train_3403","question":"Where is the place of death of Harry Mazer's wife?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5670943 wdt:P26 ?X . ?X wdt:P20 ?answer }","paraphrases":["Where is the put of passing of Harry Mazer's wife?"],"info":{}}
{"id":"train_3408","question":"Tell me ethnolect whose name has the word perkerdansk in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q951873 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'perkerdansk' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know ethnolect whose title has the word perkerdansk in it."],"info":{}}
{"id":"train_3409","question":"What was King Arthur's given name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q45792 wdt:P735 ?obj . ?obj wdt:P31 wd:Q12308941 }","paraphrases":["What was the name given to King Arthur?"],"info":{}}
{"id":"train_3410","question":"Is it true that the slope of El Dorado Speedway equals to 14?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q16559802 wdt:P4184 ?obj filter ( ?obj = 14 ) }","paraphrases":["Is the El Dorado Speedway slope actually equal to 14?"],"info":{}}
{"id":"train_3411","question":"Do the number of cylinders of the Prussian S 6 equal 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q316791 wdt:P1100 ?obj filter ( ?obj = 2 ) }","paraphrases":["Does the Prussian S6 have two cylinders?"],"info":{}}
{"id":"train_3412","question":"which language that starts with u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34770 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which dialect that begins with u"],"info":{}}
{"id":"train_3413","question":"What character role did cast member Burt Ward play in Batman?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1247201 p:P161 ?s . ?s ps:P161 wd:Q537747 . ?s pq:P453 ?value }","paraphrases":["What character did Burt Ward play in Batman?"],"info":{}}
{"id":"train_3416","question":"What is JSTOR journal code for Foreign Affairs ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1135577 wdt:P1230 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3417","question":"WHAT ARE ECONOMIC SECTOR WHICH START WITH THE LETTER N.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3958441 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE Financial Segment WHICH Begin WITH THE LETTER N."],"info":{}}
{"id":"train_3418","question":"When did member of sports team of John Charles and number of matches played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q312404 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["When played John Charles ' sports team member and number of matches?"],"info":{}}
{"id":"train_3419","question":"Which acid anhydride with the lowest electrical conductivity whose has a part of carbon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q423118 . ?ent wdt:P2055 ?obj . ?ent wdt:P527 wd:Q623 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Name the acid anhydride that has the smallest electrical conductivity, and also has a pert of carbon."],"info":{}}
{"id":"train_3422","question":"who state headed by  the town of caraga ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13704 wdt:P131 ?X . ?X wdt:P35 ?answer }","paraphrases":["who state headed by the town of caraga ?"],"info":{}}
{"id":"train_3427","question":"how many points did David Campese win for the Australia national rugby union team as a player of the team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1173922 p:P54 ?s . ?s ps:P54 wd:Q622443 . ?s pq:P1351 ?value }","paraphrases":["When David Campese played for Australia's National Rugby Union Team how many points did he score?"],"info":{}}
{"id":"train_3429","question":"Is influenza genetically associated with SLC15A1 and COL28A1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2840 wdt:P2293 wd:Q18031564 . wd:Q2840 wdt:P2293 wd:Q18055395 }","paraphrases":["Are SLC15A1 and COL28A1? associated with the flu?"],"info":{}}
{"id":"train_3432","question":"Tell me logographic writing system whose name has the word script in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3953107 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'script' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which logographic writing system has the word script in it?"],"info":{}}
{"id":"train_3433","question":"What are the medications by which mental disorder is treated?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12135 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q12140 }","paraphrases":["What medications treat mental disorder?"],"info":{}}
{"id":"train_3434","question":"Which planets in the Ring Nebula have moons?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13969 wdt:P397 ?X . ?X wdt:P398 ?answer }","paraphrases":["Which planets have moons in the Ring Nebula?"],"info":{}}
{"id":"train_3435","question":"Who is the sister of Charles de Valois, Duke of Angoulême's other child?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1066613 wdt:P22 ?X . ?X wdt:P3373 ?answer }","paraphrases":["Who is the sister of Charles de Valois, Duke of Angoulême's other child?"],"info":{}}
{"id":"train_3436","question":"Name the sister city of the place where Lisa Nowak was born.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49264 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["Title the sister city of the put where Lisa Nowak was born."],"info":{}}
{"id":"train_3437","question":"WHICH IS THE GENETIC ASSOCIATION OF MURDER METHOD OF ALEXANDER WOOLLCOTT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q361859 wdt:P509 ?X . ?X wdt:P2293 ?answer }","paraphrases":["WHICH IS THE Hereditary Affiliation OF Kill Strategy OF ALEXANDER WOOLLCOTT"],"info":{}}
{"id":"train_3439","question":"Which family member of Luca Signorelli is a writer by profession? \n\nName the family member of Luca Signorelli who is a writer by profession. \n\nWhich of Luca Signorelli's relatives has a career in writing? \n\nWho is the relative of Luca Signorelli who has a career in writing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7031 wdt:P1038 ?answer . ?answer wdt:P106 wd:Q36180 }","paraphrases":["Which family member of Luca Signorelli is a creator via profession? Name the household member of Luca Signorelli who is a creator by using profession. Which of Luca Signorelli's household has a career in writing? Who is the relative of Luca Signorelli who has a profession in writing?"],"info":{}}
{"id":"train_3440","question":"For which ER's character was Noah Wyle cast?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q207375 p:P161 ?s . ?s ps:P161 wd:Q315208 . ?s pq:P453 ?value }","paraphrases":["Noah Wyle played who in ER"],"info":{}}
{"id":"train_3441","question":"How many distributions are there of a printed circuit board?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P437 wd:Q173350 }","paraphrases":["A printed circuit board has how many distributions?"],"info":{}}
{"id":"train_3444","question":"What is the abjad that is the language of work or name of Hebrew and contains the word alphabet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185087 . ?sbj wdt:P407 wd:Q9288 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'alphabet' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the abjad that is the language of work or identify of Hebrew and includes the phrase alphabet?"],"info":{}}
{"id":"train_3453","question":"How many goals and matches did Kevin Keegan score under Newcastle United F.C.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q152832 p:P54 ?s . ?s ps:P54 wd:Q18716 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["Kevin Keegan scored how many goals and matches under the Newcastle United F.C."],"info":{}}
{"id":"train_3454","question":"'o'","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16513881 . ?sbj wdt:P263 wd:Q178182 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["' O ': ' O '"],"info":{}}
{"id":"train_3455","question":"What is { nominated for } of { Peter Matthiessen } that is { point in time } is { 2002 - 0 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q892108 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["What 2002 work did Peter Matthiessen receive a nomination for?"],"info":{}}
{"id":"train_3457","question":"What ethnic group do the Indigenous people of the United States belong to","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P172 wd:Q49297 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What ethnic gather do the Innate individuals of the Joined together States have a place to"],"info":{}}
{"id":"train_3458","question":"What Éric Rohmer is nominated for his work The Marquise of O?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q50764 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q553649 }","paraphrases":["Given his work in The Marquise of O, which award was Éric Rohmer short-listed for?"],"info":{}}
{"id":"train_3459","question":"What is the trend of sculptors of Physichromie 48","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28036714 wdt:P170 ?X . ?X wdt:P135 ?answer }","paraphrases":["What is the slant of stone carvers of Physichromie 48"],"info":{}}
{"id":"train_3460","question":"Did Marilyn Monroe speak Romance languages?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4616 wdt:P1412 wd:Q19814 }","paraphrases":["Was Marilyn Monroe a speaker of any of the Romance languages?"],"info":{}}
{"id":"train_3461","question":"When did Karrie Webb receive an Australian Sports Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q271024 p:P166 ?s . ?s ps:P166 wd:Q1649458 . ?s pq:P585 ?value }","paraphrases":["In what year did Karrie Webb earn her Australian Sports Medal?"],"info":{}}
{"id":"train_3462","question":"Where is Jacob W. Davis' place of death that is adjacent to Daly City?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1488960 wdt:P20 ?answer . ?answer wdt:P47 wd:Q370925 }","paraphrases":["Where is the death place of Jacob W. Davis next to Daly City?"],"info":{}}
{"id":"train_3463","question":"What number of theft convictions exist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1399 wd:Q2727213 }","paraphrases":["What is the approximate number of theft convictions that exist?"],"info":{}}
{"id":"train_3464","question":"What are the mantra which start with the letter M","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131510 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What mantra starts with \"m\"?"],"info":{}}
{"id":"train_3465","question":"Which is the MusicBrainz work ID for Adagio in G minor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q346741 wdt:P435 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3468","question":"How are called the people living around Baghdad?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1530 wdt:P1376 ?X . ?X wdt:P1082 ?answer }","paraphrases":["What do you call people living in Baghdad?"],"info":{}}
{"id":"train_3469","question":"Which is the rigid airship named after Paul von Hindenburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P138 wd:Q2667 . ?sbj wdt:P31 wd:Q738584 }","paraphrases":[],"info":{}}
{"id":"train_3471","question":"Who owns this CD?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q321259 wdt:P127 ?X . ?X wdt:P1056 ?answer }","paraphrases":["Give me the name of the person that owns this CD."],"info":{}}
{"id":"train_3472","question":"When did spouse of Aleksandr Solzhenitsyn and end time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q34474 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["When did life partner of Aleksandr Solzhenitsyn and conclusion time?"],"info":{}}
{"id":"train_3475","question":"What are the Christian movement which start with the letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q995347 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Christian development which begin with the letter P"],"info":{}}
{"id":"train_3476","question":"What work was Federico Fellini nominated for at the 22nd Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7371 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q521644 }","paraphrases":["Federico Fellini was nominated for what work at the 22nd Academy Awards?"],"info":{}}
{"id":"train_3477","question":"What is ISU figure skater ID for Ilia Kulik ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1325882 wdt:P2694 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3479","question":"What is the human being for Steven Pinker's sibling?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3373 wd:Q212730 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is the human being for Steven Pinker's sibling?"],"info":{}}
{"id":"train_3480","question":"What are the natural number which start with the letter g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21199 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the characteristic number which begin with the letter g"],"info":{}}
{"id":"train_3481","question":"Which is the cast member for King Kong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q309048 wdt:P161 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3482","question":"Did Kanye West write metal gangsta rap?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q15935 wdt:P136 wd:Q753679 }","paraphrases":["Was metal gangsta rap written by Kanye West?"],"info":{}}
{"id":"train_3484","question":"Name a kind a family that rules a land through absolute monarchy and that starts with letter D","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13417114 . ?sbj wdt:P122 wd:Q184558 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a kind a household that rules a land through absolute monarchy and that begins with letter D"],"info":{}}
{"id":"train_3486","question":"Name someone who graduated from McGill University","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1416 wd:Q201492 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who has graduated from McGill University?"],"info":{}}
{"id":"train_3488","question":"What is Hockey-reference ID for Bobby Hull ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q456688 wdt:P3598 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3489","question":"What is the Strait of Juan de Fuca's geographical ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q867627 wdt:P2099 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3490","question":"Name the biggest galaxy discovered by James Dunlop.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q168845 . ?ent wdt:P1215 ?obj . ?ent wdt:P61 wd:Q375158 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the biggest galaxy discovered by James Dunlop?"],"info":{}}
{"id":"train_3493","question":"What is the motif, whose symbol is the Earth symbol, of The Blue Marble?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q202014 wdt:P180 ?answer . ?answer wdt:P913 wd:Q426529 }","paraphrases":["What is the theme, whose image is the Soil image, of The Blue Marble?"],"info":{}}
{"id":"train_3494","question":"What military order starts with the letter \"s\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q474717 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What military order begins with the letter \"s\"?"],"info":{}}
{"id":"train_3495","question":"Where did Doris Ulmann die, with 391114 inhabitants?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q388471 wdt:P20 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '391114.0' ) ) }","paraphrases":["Where did Doris Ulmann pass on, with 391114 inhabitants?"],"info":{}}
{"id":"train_3496","question":"When John Dueholm ended as manager/director at Scandinavian Airlines?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q187854 p:P1037 ?s . ?s ps:P1037 wd:Q24175767 . ?s pq:P582 ?value }","paraphrases":["When did Scandinavian Airline's John Dueholm end his position of manager/director?"],"info":{}}
{"id":"train_3497","question":"When did Menachem Mendel Schneerson do his work for Likkutei Sichos?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q381397 p:P800 ?s . ?s ps:P800 wd:Q2907320 . ?s pq:P582 ?value }","paraphrases":["At what time did Mendel Schneerson do his work for Likkutei Sichos?"],"info":{}}
{"id":"train_3498","question":"What is wikibase:geoLatitude ?min that comes from Cornbread","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1108866 wdt:P495 ?X . ?X wdt:P1333 ?answer }","paraphrases":["Min that come from Cornbread, would that be geo Latitude in wikibase?"],"info":{}}
{"id":"train_3500","question":"What is the cuisine of Israeli cuisine","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2012 wd:Q62458 }","paraphrases":[],"info":{}}
{"id":"train_3501","question":"When did the partnership between Francois Holland and Valerie Trierweiler end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q157 p:P451 ?s . ?s ps:P451 wd:Q230539 . ?s pq:P582 ?value }","paraphrases":["On what date did Francois Holland and Valerie Trierweiler end their partnership?"],"info":{}}
{"id":"train_3504","question":"When did the Ottoman Empire lose control over Nazareth?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q430776 p:P17 ?s . ?s ps:P17 wd:Q12560 . ?s pq:P582 ?value }","paraphrases":["When did Nazareth break away from the Ottoman Empire?"],"info":{}}
