{"id":"train_18188","question":"What position does Axel Oxenstierna hold and when did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q155127 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["What position does Axel Oxenstierna hold and when did it conclusion?"],"info":{}}
{"id":"train_18189","question":"what is federal holidays in the united states that starts with t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5440534 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is government occasions within the joined together states that begins with t"],"info":{}}
{"id":"train_18191","question":"Do Prussia and Europe practice the same form of government?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q38872 wdt:P122 wd:Q46 }","paraphrases":["Tell me whether Prussia and Europe practice the same form of government"],"info":{}}
{"id":"train_18193","question":"Which is the Swiss municipality code of Zürich?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q72 wdt:P771 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18194","question":"When did Clyde Walcott started playing on the Guyana national cricket team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q462487 p:P54 ?s . ?s ps:P54 wd:Q5622770 . ?s pq:P580 ?value }","paraphrases":["When did the Guyana national cricket team start Clyde Walcott?"],"info":{}}
{"id":"train_18195","question":"Who did Ingmar Bergman marry and when did the marriage end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q7546 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who did Ingmar Bergman wed and when did the marriage conclusion?"],"info":{}}
{"id":"train_18198","question":"What is Norman Mailer nominated for who's  point in time is 1994-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q180962 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["What award did Norman Mailer receive for who's point in time in 1994?"],"info":{}}
{"id":"train_18199","question":"who concept for studied by of materials science?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2579 wd:Q228736 . ?sbj wdt:P31 wd:Q151885 }","paraphrases":["What topics does material science cover?"],"info":{}}
{"id":"train_18200","question":"Is it true that the retirement age in Germany equals to 65.25?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q183 wdt:P3001 ?obj filter ( ?obj = 65.25 ) }","paraphrases":["Is the retirement age in Germany 65.25?"],"info":{}}
{"id":"train_18202","question":"Which awards did Maroon 5 receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q182223 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["Which grants did Maroon 5 receive?"],"info":{}}
{"id":"train_18203","question":"When was the inflation rate 10.7 in Tonga?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q678 p:P1279 ?s . ?s ps:P1279 ?x filter ( contains ( ?x , '10.7' ) ) . ?s pq:P585 ?value }","paraphrases":["What year what the inflation rate in Tonga 10.7?"],"info":{}}
{"id":"train_18204","question":"How many songs are by Hal David?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P676 wd:Q449030 }","paraphrases":["What songs has Hal David written?"],"info":{}}
{"id":"train_18205","question":"What quality does the programming language have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9143 wdt:P1552 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18206","question":"Which is the LesBiographies.com ID of the Valéry Giscard d'Estaing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2124 wdt:P4434 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18208","question":"What is a source of information for Andrea Palladio (1508-11-29) ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q177692 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( YEAR ( ?x ) , '1508' ) ) . ?s pq:P1480 ?value }","paraphrases":["Can you share information on Andrea Palladio from November 29, 1508?"],"info":{}}
{"id":"train_18209","question":"Who is the mother, and what is her date of birth, of Charles the Younger, son of Charlemagne?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q283107 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["Who is the mother, and what is her date of birth, of Charles the Younger, son of Charlemagne?"],"info":{}}
{"id":"train_18210","question":"What award or awards were Fight Club awarded and also who were the nominees?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q190050 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2453 ?value1 . }","paraphrases":["What grant or grants were Battle Club granted additionally who were the nominees?"],"info":{}}
{"id":"train_18212","question":"is it true that psychopathy is measured by psychopathic personality inventory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q366886 wdt:P1880 wd:Q7256463 }","paraphrases":["Is psychopathy measured by psychopathic personality inventory?"],"info":{}}
{"id":"train_18213","question":"Chris Froome won which mountain stage with minimum speed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q20646668 . ?ent wdt:P2052 ?obj . ?ent wdt:P1346 wd:Q319591 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["While at minimum speed, Chris Froome was victorious at which mountain stage?"],"info":{}}
{"id":"train_18214","question":"Who was killed by Alexander II of Russia as the manner of death as homicide?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q83171 p:P1196 ?s . ?s ps:P1196 wd:Q149086 . ?s pq:P157 ?value }","paraphrases":["Who was murdered by Alexander II of Russia?"],"info":{}}
{"id":"train_18215","question":"Was Chess uses chessboard  and  game clock ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q718 wdt:P2283 wd:Q110079 . wd:Q718 wdt:P2283 wd:Q831765 }","paraphrases":["Has Chess always used a chessboard and game clock?"],"info":{}}
{"id":"train_18216","question":"who river source of tributary of yangtze ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5413 wdt:P974 ?X . ?X wdt:P885 ?answer }","paraphrases":["What is the source river for the tributary of yangtze?"],"info":{}}
{"id":"train_18218","question":"Oprah Winfrey founded what television channel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P112 wd:Q55800 . ?sbj wdt:P31 wd:Q2001305 }","paraphrases":["Oprah Winfrey established what tv channel?"],"info":{}}
{"id":"train_18220","question":"What route of administration for aluminum oxide has a median lethal dose of 3600.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q177342 p:P2240 ?s . ?s ps:P2240 ?x filter ( contains ( ?x , '3600.0' ) ) . ?s pq:P636 ?value }","paraphrases":["Which method of ingestion for aluminum oxide has a median lethal does of 3600.0?"],"info":{}}
{"id":"train_18223","question":"How is the Dutch word for apricot pronounced?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3733836 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q7411 }","paraphrases":["Tell me how to pronounce the Dutch word for apricot."],"info":{}}
{"id":"train_18224","question":"Tell meacademic major whose name has the word theory in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4671286 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'theory' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell meacademic major whose title has the word hypothesis in it."],"info":{}}
{"id":"train_18225","question":"Where is the member of citizenship for Raphael Lemkin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q505586 wdt:P27 ?X . ?X wdt:P463 ?answer }","paraphrases":["Where is the part of citizenship for Raphael Lemkin?"],"info":{}}
{"id":"train_18226","question":"Which statuette is the thickest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16738862 . ?ent wdt:P2610 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["With geography as the subject, which subject inside the history of Maine depicts the geography of Maine?"],"info":{}}
{"id":"train_18227","question":"What are the aerospace manufacturer which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q936518 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What aerospace manufacturer starts with Z?"],"info":{}}
{"id":"train_18229","question":"What did Jean Racine become a member of on 1672-12-5?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q742 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1672' ) ) }","paraphrases":["For which Jean Racine become a member of on 1672-12-5?."],"info":{}}
{"id":"train_18230","question":"who served as a doctoral advisor for Srinivasa Ramanujan ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q83163 wdt:P184 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["who served as a doctoral advisor for Srinivasa Ramanujan ?"],"info":{}}
{"id":"train_18231","question":"WHAT IS THE NATIONALITY OF DEWITT WALLACE MEMBER?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5244201 wdt:P27 ?X . ?X wdt:P463 ?answer }","paraphrases":["WHAT IS THE NATIONALITY OF DEWITT WALLACE MEMBER?"],"info":{}}
{"id":"train_18232","question":"Linear algebra has how many parts?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P361 wd:Q82571 }","paraphrases":["How many parts make up linear algebra?"],"info":{}}
{"id":"train_18233","question":"WHICH IS THE VEHICLE RANGE OF AIRBUS A340","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q6481 wdt:P2073 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18236","question":"Name a proxy war that contains the word \" war\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q864113 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'war' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a intermediary war that contains the word \" war\" in its name"],"info":{}}
{"id":"train_18237","question":"\"Who is {born at} of {Tim Berners-Lee}, which has {PIN Code} is {UB} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q80 wdt:P19 ?answer . ?answer wdt:P281 ?x FILTER ( contains ( ?x , 'UB' ) ) }","paraphrases":["\"Who is {born at} of {Tim Berners-Lee}, which has {PIN Code} is {UB} ?\""],"info":{}}
{"id":"train_18238","question":"What is African Plant Database ID of Carica papaya?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q34887 wdt:P2036 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18239","question":"Who is the  {human} for {member of} of {Beastie Boys}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P463 wd:Q214039 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {part of} of {Beastie Boys}"],"info":{}}
{"id":"train_18242","question":"What area did Styria contain in its administrative territorial entity as of 2013-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41358 p:P150 ?s . ?s ps:P150 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["What is the total space occupied by Styria in its administrative territorial entity from 2013-1-1?"],"info":{}}
{"id":"train_18243","question":"Which is ESPNscrum player ID for Sébastien Chabal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q465470 wdt:P858 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18244","question":"What is Impressionism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P135 wd:Q40415 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["What are some of the important characteristics of Impressionism?"],"info":{}}
{"id":"train_18245","question":"From what country did Atlas Shrugged originate, and in what language was the work written?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q374098 wdt:P495 ?ans_1 . wd:Q374098 wdt:P407 ?ans_2 }","paraphrases":["In what language was Atlas Shrugged written and from what country did it originate?"],"info":{}}
{"id":"train_18246","question":"who is the publisher and developer of Dota_2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q771541 wdt:P123 ?ans_1 . wd:Q771541 wdt:P178 ?ans_2 }","paraphrases":["Who published and developed the video game Dota 2?"],"info":{}}
{"id":"train_18247","question":"Which  member of party of Klaus Gärtner ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1745154 wdt:P102 ?X . ?X wdt:P463 ?answer }","paraphrases":["Which Klaus Gärtner party member?"],"info":{}}
{"id":"train_18249","question":"Give me the rank position for John Gielgud as John?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q204685 p:P735 ?s . ?s ps:P735 wd:Q4925477 . ?s pq:P1545 ?value }","paraphrases":["What was John Gielgud's rank position as John ?"],"info":{}}
{"id":"train_18250","question":"Tell me the deductive language that contains the word prologue in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5249852 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'prolog' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the deductive dialect that contains the word preamble in their name"],"info":{}}
{"id":"train_18252","question":"Which is the academic degree and academic major of Antonin Scalia who was educated at Georgetown University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q11156 p:P69 ?s . ?s ps:P69 wd:Q333886 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["What degree, and for what subject, did Antonin Scalia receive from Georgetown University?"],"info":{}}
{"id":"train_18253","question":"What international non-governmental organization is responsible for the development of SQL?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q47607 wdt:P178 ?obj . ?obj wdt:P31 wd:Q1194093 }","paraphrases":["The development of SQL is handled by which international non-governmental organization?"],"info":{}}
{"id":"train_18255","question":"As a Catholic Church, what religious order did they give Boston College?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q49118 p:P140 ?s . ?s ps:P140 wd:Q9592 . ?s pq:P611 ?value }","paraphrases":["What religious order did they give to Boston College as a Catholic Church?"],"info":{}}
{"id":"train_18256","question":"hat is the source of energy for this heat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P618 wd:Q44432 }","paraphrases":[],"info":{}}
{"id":"train_18257","question":"Which Flavored tea is the country of origin England and which that starts with the letter g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3526264 . ?sbj wdt:P495 wd:Q21 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which Flavored tea is the usa of foundation England and which that begins with the letter g"],"info":{}}
{"id":"train_18258","question":"What is this cake made of","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13276 wdt:P186 ?answer . ?answer wdt:P443 ?x FILTER ( contains ( ?x , 'It-latte.ogg' ) ) }","paraphrases":["What ingredients are used to make cake?"],"info":{}}
{"id":"train_18259","question":"who is the member of Ellyse Perry sports team and how many matches did they play?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q600090 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["who is the individual from Ellyse Perry sports crew and what number of matches did they play?"],"info":{}}
{"id":"train_18260","question":"What is the world record held by David Rudisha for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1659 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P1013 wd:Q688615 }","paraphrases":["David Rudisha hold what world record?"],"info":{}}
{"id":"train_18263","question":"What award did Darya Domracheve receive as a participant in the 2018 Winter Olympic - Women's Relay Biathlon?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q209193 p:P1344 ?s . ?s ps:P1344 wd:Q47155505 . ?s pq:P166 ?value }","paraphrases":["Darya Domracheve received what in the 2018 Winter Olympics Women's Relay Biathlon ?"],"info":{}}
{"id":"train_18264","question":"When was the 284 episode of South Park released?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16538 p:P1113 ?s . ?s ps:P1113 ?x filter ( contains ( ?x , '284.0' ) ) . ?s pq:P585 ?value }","paraphrases":["At what time did the 284 episode of South Park release?"],"info":{}}
{"id":"train_18265","question":"What is the Commons category for Stéphane Grappelli who was buried in the Crématorium-columbarium du Père-Lachaise?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q206244 p:P119 ?s . ?s ps:P119 wd:Q3006253 . ?s pq:P373 ?value }","paraphrases":["In which Commons category is Stéphane Grappelli who was buried in the Crématorium-columbarium du Père-Lachaise?"],"info":{}}
{"id":"train_18267","question":"who  is titleholder of nomination received of Friendly Persuasion ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1621402 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["who is titleholder of assignment gotten of Neighborly Influence ?"],"info":{}}
{"id":"train_18268","question":"What are the manned spaceflight programme which start with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13226541 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the manned spaceflight program which begin with the letter p"],"info":{}}
{"id":"train_18271","question":"When did Yale University have a student count of 6,859?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q49112 p:P2196 ?s . ?s ps:P2196 ?x filter ( contains ( ?x , '6859.0' ) ) . ?s pq:P585 ?value }","paraphrases":["In which year were there 6,859 students attending Yale University?"],"info":{}}
{"id":"train_18273","question":"What is the name of a private not for profit educational institution that starts with the letter u.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23002054 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a private not for benefit instructive institution that begins with the letter u."],"info":{}}
{"id":"train_18274","question":"When did Park Geun-hye receive an award, and what was it?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q138048 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["When did Stop Geun-hye get an grant, and what was it?"],"info":{}}
{"id":"train_18276","question":"Which is {award received} of {Pat Spillane} whose {point in time} is {1981-0-0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3368598 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1981' ) ) }","paraphrases":["What award did Pat Spillane receive in 1981?"],"info":{}}
{"id":"train_18277","question":"Tell me mechanical property of materials whose name has the word yield in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5725005 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yield' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know mechanical property of materials whose title has the word surrender in it."],"info":{}}
{"id":"train_18278","question":"What was the award Guglielmo Marconi recieved on January 1, 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q36488 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1920' ) ) }","paraphrases":["Which award was received by Guglielmo Marconi on January1, 2016?"],"info":{}}
{"id":"train_18280","question":"Which solid flammable chemical compound has the lowest explosive velocity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2231 ?obj . ?ent wdt:P31 wd:Q21073024 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Out of all solid flammable chemical compounds, which has the lowest explosive velocity?"],"info":{}}
{"id":"train_18283","question":"What field is associated with soil science and is considered to be equivalent to pedology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9161265 wdt:P3095 ?answer . ?answer wdt:P460 wd:Q28378128 }","paraphrases":["What discipline is associated with soil science and is regarded to be equivalent to pedology?"],"info":{}}
{"id":"train_18284","question":"What kind of music did Antonio Aguilar form?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1958523 wdt:P136 ?X . ?X wdt:P571 ?answer }","paraphrases":["What kind of music did Antonio Aguilar form?"],"info":{}}
{"id":"train_18286","question":"What is {practiced by} for {studies} of {Sociology} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q21201 wdt:P3095 ?ans_1 . wd:Q21201 wdt:P2578 ?ans_2 }","paraphrases":["What does the study of Sociology involve?"],"info":{}}
{"id":"train_18287","question":"Tell me the number of goals and games played by Dino Zoff who played for Udinese Calcio.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q180661 p:P54 ?s . ?s ps:P54 wd:Q2798 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["How many goals did Dino Zoff from Undinese Calcio make, and how many games did he play?"],"info":{}}
{"id":"train_18288","question":"Did George_Carlin study atheism and religion at De La Salle University ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q150651 wdt:P140 wd:Q7066 . wd:Q150651 wdt:P140 wd:Q1815710 }","paraphrases":["Was it at De La Salle University that George Carlin studied atheism and religion?"],"info":{}}
{"id":"train_18289","question":"What is the country of citizenship of Salman of Saudi Arabia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q367825 wdt:P27 ?obj . ?obj wdt:P31 wd:Q6256 }","paraphrases":["What is the nation of citizenship of Salman of Saudi Arabia"],"info":{}}
{"id":"train_18291","question":"What is the rural district name in the Germany which has more male population?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q106658 . ?ent wdt:P1540 ?obj . ?ent wdt:P31 wd:Q106658 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What rural district in Germany has the highest male population?"],"info":{}}
