{"id":"train_15523","question":"which uniformed search that contains the word first in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4443425 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'first' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which formally dressed look that contains the word to begin with in their name"],"info":{}}
{"id":"train_15524","question":"Who is Sean Hannity's employer and who is his spouse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q557730 wdt:P108 ?ans_1 . wd:Q557730 wdt:P26 ?ans_2 }","paraphrases":["Who is Sean Hannity married to and where does he work?"],"info":{}}
{"id":"train_15525","question":"which was the academic  major  and degree of emma  watson  who has educated  at brown university?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q39476 p:P69 ?s . ?s ps:P69 wd:Q49114 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["which was the scholastic major and degree of emma watson who has taught at brown university?"],"info":{}}
{"id":"train_15526","question":"UNICEF is founded by what international parliament?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q740308 wdt:P112 ?obj . ?obj wdt:P31 wd:Q6054776 }","paraphrases":["What body founded UNICEF?"],"info":{}}
{"id":"train_15528","question":"Which Rigid belt sander model consumes the most electricity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23811260 . ?ent wdt:P2791 ?obj . ?ent wdt:P1716 wd:Q7276772 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What rigid belt sander uses the most electricity?"],"info":{}}
{"id":"train_15529","question":"Which geographic region is located in a terrain feature of East Asia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P706 wd:Q27231 . ?sbj wdt:P31 wd:Q82794 }","paraphrases":[],"info":{}}
{"id":"train_15532","question":"Who composed 'The Virginian, Season 2'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16552411 wdt:P179 ?X . ?X wdt:P86 ?answer }","paraphrases":["Who was the author of 'The Virginian, Season 2'?"],"info":{}}
{"id":"train_15534","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P161 wd:Q212002 . ?sbj wdt:P31 wd:Q5398426 }","paraphrases":["does not apply"],"info":{}}
{"id":"train_15535","question":"When did Susilo Bambang Yudhoyono's term as President of Indonesia end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q57405 p:P39 ?s . ?s ps:P39 wd:Q11755916 . ?s pq:P582 ?value }","paraphrases":["Susilo Bamban Yudhoyono was President of Indonesia until when?"],"info":{}}
{"id":"train_15537","question":"Who is the {landmark} for {official residence} of {Parthian Empire}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1986139 wdt:P263 ?obj . ?obj wdt:P31 wd:Q2319498 }","paraphrases":["Who is the {point of interest} for {official home} of {Parthian Domain}"],"info":{}}
{"id":"train_15539","question":"What is {based on} and the {named after} of {Watt} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q25236 wdt:P144 ?ans_1 . wd:Q25236 wdt:P138 ?ans_2 }","paraphrases":["What unit of power is named after James Watt, and what is it based on?"],"info":{}}
{"id":"train_15541","question":"Name a newscast program that contains the word \" weather\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1358344 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'weather' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a report program that contains the word \" climate\" in its name"],"info":{}}
{"id":"train_15542","question":"Which is the Webb-site person ID for Sheldon Adelson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q319137 wdt:P5298 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15544","question":"What continent is Melanesia located on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q37394 wdt:P706 ?obj . ?obj wdt:P31 wd:Q5107 }","paraphrases":["What landmass is Melanesia found on?"],"info":{}}
{"id":"train_15546","question":"What is Howrah female population of 1077075?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q205697 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '1077075' ) ) . ?s pq:P1539 ?value }","paraphrases":["How much is Howrah female population of 1077075?"],"info":{}}
{"id":"train_15547","question":"What are the grants for the {Master of Business Administration} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P5460 wd:Q191701 }","paraphrases":["What grants are there for Master of Business Administration"],"info":{}}
{"id":"train_15548","question":"tell me island starts with z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23442 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know island begins with z"],"info":{}}
{"id":"train_15549","question":"When did Futurama receive the Primetime Emmy Award for Outstanding Animated Program?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q73622 p:P166 ?s . ?s ps:P166 wd:Q337926 . ?s pq:P585 ?value }","paraphrases":["In which year's Primetime Emmy Awards did Futurama win the award of Outstanding Animated Program?"],"info":{}}
{"id":"train_15552","question":"Where is Kura River as river source?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q156557 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }","paraphrases":["where is the source of the kaura river?"],"info":{}}
{"id":"train_15554","question":"Name a type of territory that has replaced domains and starts with letter J","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15617994 . ?sbj wdt:P1365 wd:Q841985 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'j' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know quantifiable strategy whose title has the word dnain it."],"info":{}}
{"id":"train_15555","question":"What is the result of malathion, that a first aid response would be prompt washing with soap?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q423005 wdt:P1542 ?answer . ?answer wdt:P2239 wd:Q21010964 }","paraphrases":["What is the result of malathion, that a to begin with help reaction would be incite washing with soap?"],"info":{}}
{"id":"train_15558","question":"Which television show did Ellen DeGeneres create?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P170 wd:Q483325 . ?sbj wdt:P31 wd:Q5398426 }","paraphrases":["What t.v show did Ellen DeGeneres create?"],"info":{}}
{"id":"train_15560","question":"What was the death place of Max Miedinger, which was divided into District 7?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q118270 wdt:P20 ?answer . ?answer wdt:P150 wd:Q456149 }","paraphrases":["What was once the demise region of Max Miedinger, which was divided into District 7?"],"info":{}}
{"id":"train_15561","question":"What Jacques Kallis sports team member started in 1997?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q982650 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1997' ) ) }","paraphrases":["which Jacques Kallis sports team member started in the year1997?"],"info":{}}
{"id":"train_15562","question":"What are the system of units which start with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q932268 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the framework of units which begin with the letter u"],"info":{}}
{"id":"train_15563","question":"What is the Human Development Index of Afghanistan in the year 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q889 p:P1081 ?s . ?s ps:P1081 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["What is 2015's Human Development Index of Afghanistan?"],"info":{}}
{"id":"train_15564","question":"Billy Connolly (Voice actor)  has how many voices?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P725 wd:Q298838 }","paraphrases":["How many voices to Billy Connolly have?"],"info":{}}
{"id":"train_15565","question":"Which twin city of San Francisco has the district Songjiang?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q62 wdt:P190 ?answer . ?answer wdt:P150 wd:Q662380 }","paraphrases":["What is San Francisco's twin city containing the district Songjiang?"],"info":{}}
{"id":"train_15567","question":"What football team does Clarence Seedorf play for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q484909 wdt:P54 ?obj . ?obj wdt:P31 wd:Q476028 }","paraphrases":["What football group does Clarence Seedorf play for?"],"info":{}}
{"id":"train_15568","question":"Which is {county seat of} {workplace} of {Hans Bellmer} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q213703 wdt:P937 ?X . ?X wdt:P1376 ?answer }","paraphrases":["Which is area seat of working environment of Hans Bellmer?"],"info":{}}
{"id":"train_15569","question":"Who is the person for the veganism lifestyle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1576 wd:Q181138 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["The veganism lifestyle is for which type person?"],"info":{}}
{"id":"train_15570","question":"What is residence of Sun Yat-sen that is start time is 1896-10-1 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8573 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1896' ) ) }","paraphrases":["Where did Sun Yat-sen live 1896-10-1?"],"info":{}}
{"id":"train_15571","question":"Which is WIPO ST.3 for South Korea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q884 wdt:P3068 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15572","question":"which internet standard starts with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q290378 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which web standard begins with the letter u"],"info":{}}
{"id":"train_15574","question":"What is the death cause of the characters of Troades ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3999195 wdt:P674 ?X . ?X wdt:P509 ?answer }","paraphrases":["What is the passing cause of the characters of Troades ?"],"info":{}}
{"id":"train_15579","question":"DOES THE ELECTRICAL CONDUCTIVITY OF BERYLLIUM EQUALS 30000000.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q569 wdt:P2055 ?obj filter ( ?obj = 30000000.0 ) }","paraphrases":["Give beryllium's electrical conductivity."],"info":{}}
{"id":"train_15581","question":"Tell me civil parish  whose name has the word winmarleigh  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1115575 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'winmarleigh' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know respectful ward whose title has the word winmarleigh in it."],"info":{}}
{"id":"train_15587","question":"Where is the headquarters located for the Hong Kong publisher?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q8646 . ?sbj wdt:P31 wd:Q2085381 }","paraphrases":[],"info":{}}
{"id":"train_15588","question":"Does the GDP (PPP) of japan equal to 5175259447160.43?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q17 wdt:P4010 ?obj filter ( ?obj = 5175259447160.43 ) }","paraphrases":["Is Japan's GDP (PPP) 5175259447160.43?"],"info":{}}
{"id":"train_15589","question":"Which anthem is William Blake known for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41513 wdt:P800 ?obj . ?obj wdt:P31 wd:Q541947 }","paraphrases":["Which song of devotion is William Blake known for?"],"info":{}}
{"id":"train_15590","question":"Name the stratovolcano of highest topographic prominence in the South American continent.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q169358 . ?ent wdt:P2660 ?obj . ?ent wdt:P30 wd:Q18 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the name of the stratovolcano which has the highest topographic prominence in the South American continent?"],"info":{}}
{"id":"train_15591","question":"Name a survival skill that starts with letter C","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891382 . ?sbj wdt:P156 wd:Q213449 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a survival ability that begins with letter C"],"info":{}}
{"id":"train_15592","question":"tell me literary character first appearance Action Comics #1 starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3658341 . ?sbj wdt:P4584 wd:Q5229132 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know scholarly character to begin with appearance Activity Comics #1 begins with s"],"info":{}}
{"id":"train_15595","question":"Which is the country for sport of Windward Islands?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1532 wd:Q183416 }","paraphrases":[],"info":{}}
{"id":"train_15597","question":"For what reason Imran Khan was elected as chancellor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q155164 p:P39 ?s . ?s ps:P39 wd:Q373085 . ?s pq:P642 ?value }","paraphrases":["Why was Imran Khan voted in as chancellor?"],"info":{}}
{"id":"train_15598","question":"What are the internetworking  which start with the letter I","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1067099 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the internetworking which begin with the letter I"],"info":{}}
{"id":"train_15600","question":"Tell me taxation whose name has the word sam in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1964442 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tithe' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know tax assessment whose title has the word sam in it."],"info":{}}
{"id":"train_15602","question":"Was Vanessa Paradis ever romantically involved with either Benjamin Biolay or Samuel Benchetrit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q51023 wdt:P451 wd:Q182991 . wd:Q51023 wdt:P451 wd:Q970408 }","paraphrases":["Did Benjamin Biolay or Samuel Benchetrit or both have a romantic involvement with Vanessa Paradis?"],"info":{}}
{"id":"train_15603","question":"Oprah Winfrey is the host of which television series?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P371 wd:Q55800 . ?sbj wdt:P31 wd:Q5398426 }","paraphrases":[],"info":{}}
{"id":"train_15606","question":"Tell me alternative medical treatment whose name has the word therapy in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q31338769 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'therapy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me alternative medical treatment whose name has the word therapy in it."],"info":{}}
{"id":"train_15608","question":"Is Major depressive disorder a genetic association SCN1B and ENOX1","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q42844 wdt:P2293 wd:Q18031392 . wd:Q42844 wdt:P2293 wd:Q18041520 }","paraphrases":["Are SCN1B and ENOX1 associated genetically with major depressive disorder?"],"info":{}}
{"id":"train_15609","question":"What are the state of Mexico which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15149663 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the state of Mexico that begins with letter z?"],"info":{}}
{"id":"train_15611","question":"when is the {end time} for {Johnny Hallyday} who has {spouse} as {Babeth Étienne} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q212015 p:P26 ?s . ?s ps:P26 wd:Q2877830 . ?s pq:P582 ?value }","paraphrases":["At what did Johny Hallyday broke off from his spouse Babeth Étienne?"],"info":{}}
{"id":"train_15612","question":"How many molecular functions are done by reverse transcriptase?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P680 wd:Q28774 }","paraphrases":["Did you know the reverse transcriptase molecular functions efficient details?"],"info":{}}
{"id":"train_15613","question":"what is legal case that starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2334719 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is legal case that begins with w"],"info":{}}
{"id":"train_15614","question":"How is silk fabricated?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q37681 wdt:P2079 ?obj . ?obj wdt:P31 wd:Q29028649 }","paraphrases":["Describe silk fabrication process."],"info":{}}
{"id":"train_15615","question":"Where did Osama Bin Laden live in the year 1991?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1317 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1991' ) ) }","paraphrases":["In 1991, where did Osama Bin Laden live?"],"info":{}}
{"id":"train_15618","question":"Who replaced Max Aitken of 1st Baron Beaverbrook as the Chancellor of the Duchy of Lancaster?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q332454 p:P39 ?s . ?s ps:P39 wd:Q162754 . ?s pq:P1365 ?value }","paraphrases":["Who was Max Aitken's replacement as the Chancellor of the Duch of Lancaster?"],"info":{}}
{"id":"train_15619","question":"Who are the alumni of Robert Peel that earn wages higher than -1.81?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q181875 wdt:P69 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-1.8132' ) ) }","paraphrases":["Who are Robert Peel's alumni earning higher wages than -1.81?"],"info":{}}
{"id":"train_15620","question":"How many basin country in Iceland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P205 wd:Q189 }","paraphrases":["Which is the number of basin country in Iceland?"],"info":{}}
{"id":"train_15621","question":"What award was received by Desmond Tutu in the year 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43033 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["Name the award that was received Desmond Tutu in 2014?"],"info":{}}
{"id":"train_15623","question":"What is Édouard Baldus' Kunstindeks Danmark Artist ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q71244 wdt:P1138 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15625","question":"What is the cable-stayed bridge with the lowest clearance whose country is France?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q158555 . ?ent wdt:P2793 ?obj . ?ent wdt:P17 wd:Q142 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["In France, which cable-stayed bridge has the lowest clearance?"],"info":{}}
{"id":"train_15626","question":"Who is the inventor/ discoverer of paper bag and have death place as Framingham ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q379754 wdt:P61 ?answer . ?answer wdt:P20 wd:Q988568 }","paraphrases":["Who is the inventor/ discoverer of paper bag and have demise region as Framingham ?"],"info":{}}
{"id":"train_15627","question":"What language does David Seymour speak?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q375282 wdt:P1412 ?X . ?X wdt:P1098 ?answer }","paraphrases":["What dialect does David Seymour talk?"],"info":{}}
{"id":"train_15632","question":"What is significant of songwriter of My Way ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q925657 wdt:P86 ?X . ?X wdt:P451 ?answer }","paraphrases":["What voice is on-screen characters from work of Passing the Kid ?What is critical of musician of My Way ?"],"info":{}}
{"id":"train_15633","question":"\"What's not the same as rolling, but is also manufactured from metal?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q452648 wdt:P1889 ?answer . ?answer wdt:P186 wd:Q11426 }","paraphrases":["\"What's not the same as rolling, but is additionally fabricated from metal?\""],"info":{}}
{"id":"train_15634","question":"What is Wine AppDB-Identification gateway.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q274897 wdt:P600 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15635","question":"WHOSE POTRAIT WAS SUCCEEDED BY JUAN GABRIEL CON MARIACHI II","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6299841 wdt:P156 ?X . ?X wdt:P175 ?answer }","paraphrases":["WHOSE POTRAIT WAS SUCCEEDED BY JUAN GABRIEL CON MARIACHI II"],"info":{}}
{"id":"train_15638","question":"Where did Martin Luther live in the year 1501?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9554 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1501' ) ) }","paraphrases":["What was Martin Luther's residence in 1501?"],"info":{}}
{"id":"train_15639","question":"What is the executive branch of the citizens of Zhang Ziyi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q180852 wdt:P27 ?X . ?X wdt:P208 ?answer }","paraphrases":["What is the official department of the citizens of Zhang Ziyi?"],"info":{}}
{"id":"train_15640","question":"Who signed the Declaration of Independence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q127912 wdt:P1891 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Give me the names of those who signed the Declaration of Independence."],"info":{}}
{"id":"train_15641","question":"What is Peter Gabriel's record label imprint?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q175195 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2608849 }","paraphrases":["What is Diminish Gabriel's record name engrave?"],"info":{}}
{"id":"train_15643","question":"Tell me, Tokyo Marui, who was the marker that played sports?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q607621 wdt:P1056 ?X . ?X wdt:P641 ?answer }","paraphrases":["Let me, know Tokyo Marui, who was the marker that played sports?"],"info":{}}
{"id":"train_15645","question":"What is the significant landmark in the capital of the Achaemenid Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q389688 wdt:P36 ?obj . ?obj wdt:P31 wd:Q2319498 }","paraphrases":["What is the critical point of interest within the capital of the Achaemenid Realm?"],"info":{}}
{"id":"train_15646","question":"What is the title of American Airlines' in-flight magazine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q32396 wdt:P2813 ?obj . ?obj wdt:P31 wd:Q41298 }","paraphrases":["What is the name of the in-flight magazine on American Airlines?"],"info":{}}
