{"id":"train_17951","question":"What is George Blanda's speciality as a member of the sports team, Oakland Raiders","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q980691 p:P54 ?s . ?s ps:P54 wd:Q324523 . ?s pq:P413 ?value }","paraphrases":["which one is the speciality for George Blanda's as a member of the sports team, Oakland Raiders"],"info":{}}
{"id":"train_17953","question":"What is the same saying and the participant of the Pacific War?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q184425 wdt:P460 ?ans_1 . wd:Q184425 wdt:P710 ?ans_2 }","paraphrases":["What is the same saying as the pacific war and who is the participants?"],"info":{}}
{"id":"train_17954","question":"How many deepest point to Indian Ocean?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1589 wd:Q1239 }","paraphrases":["What is the deepest point of the Indian Ocean?"],"info":{}}
{"id":"train_17955","question":"What are the triple star system which start with the letter polaris","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2088753 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'polaris' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the triple star framework which begin with the letter polaris"],"info":{}}
{"id":"train_17956","question":"\"Which is {language of work} of {Million Dollar Extreme}, that has {AWLD status} is {1 safe} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23020116 wdt:P407 ?answer . ?answer wdt:P1999 wd:Q20672086 }","paraphrases":["\"Which is {dialect of work} of {Million Dollar Extraordinary}, that has {AWLD status} is {1 secure} ?\""],"info":{}}
{"id":"train_17957","question":"Which stock exchange is the NASDAQ on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P414 wd:Q82059 }","paraphrases":[],"info":{}}
{"id":"train_17958","question":"which is place of birth of fatimah that is located in the administrative territorial entity is hejaz?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q180123 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q169977 }","paraphrases":["Where in Hejaz was Fatimah born?"],"info":{}}
{"id":"train_17959","question":"What is the parent taxon of Canidae and where is it's habitat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q25324 wdt:P171 ?ans_1 . wd:Q25324 wdt:P2974 ?ans_2 }","paraphrases":["What is the parent taxon of Canidae and where is it's habitat?"],"info":{}}
{"id":"train_17961","question":"When did the Walt Disney Company win the Public Eye Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7414 p:P166 ?s . ?s ps:P166 wd:Q54862960 . ?s pq:P585 ?value }","paraphrases":["In what year did the Walt Disney Company win the Public Eye Award?"],"info":{}}
{"id":"train_17962","question":"What is the outcome of painting of the lord Cochrane ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55007610 wdt:P180 ?X . ?X wdt:P1542 ?answer }","paraphrases":["How did the painting of lord Cochrane turn out?"],"info":{}}
{"id":"train_17963","question":"What diseases are treated with chlorhexidine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15646788 wdt:P2175 ?X . ?X wdt:P689 ?answer }","paraphrases":["What infections are treated with chlorhexidine?"],"info":{}}
{"id":"train_17964","question":"What is the Enciclopedia Itau Cultural ID of Rainer Werner Fassbinder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q44426 wdt:P4399 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17965","question":"What is a feild of study that starts with the letter t.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2267705 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a feild of think about that begins with the letter t."],"info":{}}
{"id":"train_17966","question":"What Academy Award was Javier Bardem nominated for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q134895 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q19020 }","paraphrases":["What Institute Grant was Javier Bardem assigned for?"],"info":{}}
{"id":"train_17967","question":"Who did William Holden marry in Las Vegas?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q95002 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P2842 wd:Q23768 }","paraphrases":["William Holden marrid who in Vegas?"],"info":{}}
{"id":"train_17968","question":"Which is the Hall of Valor ID of Douglas MacArthur?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q127417 wdt:P1869 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17970","question":"Does George Lucas net worth equal to 5000000000","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q38222 wdt:P2218 ?obj filter ( ?obj = 5000000000 ) }","paraphrases":["Is George Lucas worth $5000000000?"],"info":{}}
{"id":"train_17971","question":"Which is the metallicity for Messier 13?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11312 wdt:P2227 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17972","question":"Which position held by Vittorio Emanuele III ended on September 8, 1943?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q150642 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1943' ) ) }","paraphrases":["Give me the position held by Vittorio Emanuele III that ended on September 8, 1943."],"info":{}}
{"id":"train_17973","question":"Is the number of matches played/races/starts by Sean McMorrow equal to 0.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3476755 wdt:P1350 ?obj filter ( ?obj = 0.8 ) }","paraphrases":["Has Sean McMorrow played/raced/started in 0.8 matches?"],"info":{}}
{"id":"train_17976","question":"What is BBC programme ID of Béla Bartók?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q83326 wdt:P827 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17977","question":"What is the biological sex of Aten whose acronym is чол?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q130227 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'чол' ) ) }","paraphrases":["What is Aten's biological sex, the acronym of which is ąl?"],"info":{}}
{"id":"train_17978","question":"How many encoded are done by L-Alanine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P688 wd:Q218642 }","paraphrases":["Which is the number of the encodings done by L-Alanine?"],"info":{}}
{"id":"train_17981","question":"Is the metallicity of the Messier 107 equal to -1.04?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4755 wdt:P2227 ?obj filter ( ?obj = -1.04 ) }","paraphrases":["Does the Messier 107 have a metallicity of -1.04?"],"info":{}}
{"id":"train_17982","question":"What is the field of craft of Richard Ayoade?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1333118 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["Name the field of craft of Richard Ayoade?"],"info":{}}
{"id":"train_17983","question":"Is the box office of The Room equal to 1800?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q533383 wdt:P2142 ?obj filter ( ?obj = 1800 ) }","paraphrases":["Is The Room's box office equivalent to 1800?"],"info":{}}
{"id":"train_17987","question":"IS THE NUMBER OF ELEVATORS OF THE HOTEL UKRAYINA GREATER THAN 4.8","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q633737 wdt:P1301 ?obj filter ( ?obj > 4.8 ) }","paraphrases":["Are there more than 4 elevators in the Hotel Ukrayina?"],"info":{}}
{"id":"train_17988","question":"What is the named after and the child astronomical body of Andromeda_Galaxy ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q2469 wdt:P138 ?ans_1 . wd:Q2469 wdt:P398 ?ans_2 }","paraphrases":["Who is the child astronomical body of Andromeda_Galaxy named after?"],"info":{}}
{"id":"train_17990","question":"Who was the nominee for Dr. Strangelove's nomination for the Academy Award for Best Writing of an Adapted Screenplay?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q105702 p:P1411 ?s . ?s ps:P1411 wd:Q107258 . ?s pq:P2453 ?value }","paraphrases":["Who was the nominee for the nomination of Dr. Strangelove for Best Writing of an Adapted Screenplay for the Academy Award?"],"info":{}}
{"id":"train_17991","question":"How many voice types are classified as death growls?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P412 wd:Q335499 }","paraphrases":["What are the voice types classified as death growls?"],"info":{}}
{"id":"train_17992","question":"What kid of Francis I of Austria was born in Vienna?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q130834 wdt:P40 ?answer . ?answer wdt:P19 wd:Q1741 }","paraphrases":["What kid of Francis I of Austria was born in Vienna?"],"info":{}}
{"id":"train_17993","question":"What was the nominal GDP of the United States of America on January 1, 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q30 p:P2131 ?s . ?s ps:P2131 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["On January 1, 2014 the nominal GDP of the United States was what?"],"info":{}}
{"id":"train_17994","question":"Who is the person that was the mother of Giacomo Casanova?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q83321 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the individual that was the mother of Giacomo Casanova?"],"info":{}}
{"id":"train_17996","question":"What was Cambodia number of out of school children in 2003-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q424 p:P2573 ?s . ?s ps:P2573 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2003' ) ) }","paraphrases":["How many children were out of school on 1/1/03 in Cambodia?"],"info":{}}
{"id":"train_17997","question":"What is the language of work of The Dong-a Ilbo whose distribution map is Map of Korean language.png?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q486086 wdt:P407 ?answer . ?answer wdt:P1846 ?x FILTER ( contains ( ?x , 'Map of Korean language.png' ) ) }","paraphrases":["What is the dialect of work of The Dong-a Ilbo whose dispersion outline is Outline of Korean language.png?"],"info":{}}
{"id":"train_17998","question":"Who was the Hartsfield-Jackson Atlanta International Airport named after?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q214861 wdt:P138 ?obj }","paraphrases":["Identify the person after which Hartsfield-Jackson Atlanta International Airport was named."],"info":{}}
{"id":"train_17999","question":"When was Margaret of France, daughter of Louis IX of France born and when did she die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q346 p:P40 ?s . ?s ps:P40 wd:Q457111 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["Tell me when Margaret of france, daughter of Louis IX of France born and when she died."],"info":{}}
{"id":"train_18001","question":"What award did Francis Crick receive which was worth 85740.0 in money?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q123280 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter ( contains ( ?x , '85740.0' ) ) }","paraphrases":["Give the name of the award which Francis Crick was awarded along with 85,740 in cash."],"info":{}}
{"id":"train_18002","question":"What award did Bjørn Dæhlie recieve in 1992?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q217505 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1992' ) ) }","paraphrases":["What was the award that Bjørn Dæhlie received in 1992?"],"info":{}}
{"id":"train_18003","question":"What is the official recorded song used during the British Rule in Burma?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2376315 wdt:P85 ?X . ?X wdt:P51 ?answer }","paraphrases":["What is the official recorded melody utilized amid the British Run the show in Burma?"],"info":{}}
{"id":"train_18004","question":"What is the federal holidays in the the United States of America that starts with the letter T","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5440534 . ?sbj wdt:P276 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the federal vacation trips in the the United States of America that starts with the letter T"],"info":{}}
{"id":"train_18007","question":"What are the cable channel which start with the letter o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5009242 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ó' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the cable channel which begin with the letter o"],"info":{}}
{"id":"train_18008","question":"Where is the operating area of the Midlands?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2541 wd:Q850235 }","paraphrases":[],"info":{}}
{"id":"train_18010","question":"who academic discipline for field of work of noam chomsky?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9049 wdt:P101 ?obj . ?obj wdt:P31 wd:Q11862829 }","paraphrases":["Which academic discipline did Noam Chomsky study for his field of work?"],"info":{}}
{"id":"train_18011","question":"What is the Class IC flammable liquid with the highest no-observed-adverse-effect level whose instance of is Class IC flammable liquid ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009056 . ?ent wdt:P2717 ?obj . ?ent wdt:P31 wd:Q21009056 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the IC Class flammable liquid with the least observed adverse effects?"],"info":{}}
{"id":"train_18013","question":"What is the name of the road maintained by the city of Las Vegas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P126 wd:Q23768 . ?sbj wdt:P31 wd:Q34442 }","paraphrases":["What road does the city of Las Vegas maintain?"],"info":{}}
{"id":"train_18014","question":"What twinned administrative body of Murmansk started on 10-14-1994?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1763 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["The date 10-14-1994 was the beginning of what twinned administrative body of Murmansk?"],"info":{}}
{"id":"train_18015","question":"How many visitors per year are there to the Field Museum of Natural History?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1122595 wdt:P1174 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18016","question":"When does the position of Jordan Peterson as postdoctoral researcher end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6276882 p:P39 ?s . ?s ps:P39 wd:Q1125292 . ?s pq:P582 ?value }","paraphrases":["How long will Jordan Peterson hold the position of postdoctoral researcher?"],"info":{}}
{"id":"train_18019","question":"Which is the medical condition of Ernest Hemingway?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q23434 wdt:P1050 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18020","question":"What is the time difference between the US and North Korea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22676729 . ?ent wdt:P2907 ?obj . ?ent wdt:P131 wd:Q423 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the time distinction between the US and North Korea?"],"info":{}}
{"id":"train_18025","question":"How many director of photography by Man Ray?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P344 wd:Q46139 }","paraphrases":["How many directors of photography are there by Man Ray?"],"info":{}}
{"id":"train_18028","question":"Who is the {human} for {relative} of {Julius Caesar}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1038 wd:Q1048 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What was the name of Julius Caesar's relative?"],"info":{}}
{"id":"train_18029","question":"When did award received of Matt Lauer and point in time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q1100609 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What award did Matt Lauer receive and when did he receive it?"],"info":{}}
{"id":"train_18030","question":"Tell me disease  whose name has the word wart in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12136 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wart' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know illness whose title has the word wart in it."],"info":{}}
{"id":"train_18031","question":"Tell me the start and end time of John Steinbeck and wife Carol Henning.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q39212 p:P26 ?s . ?s ps:P26 wd:Q22273837 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["Let me know the begin and conclusion time of John Steinbeck and spouse Carol Henning."],"info":{}}
{"id":"train_18034","question":"Who is the designer of the theme Tupolev Tu-80?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1890237 wdt:P144 ?X . ?X wdt:P287 ?answer }","paraphrases":["Who is the clothier of the theme Tupolev Tu-80?"],"info":{}}
{"id":"train_18036","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1049 wd:Q5043 . ?sbj wdt:P31 wd:Q190 }","paraphrases":["n/a"],"info":{}}
{"id":"train_18039","question":"What is the ALPG golfer ID for Karrie Webb?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q271024 wdt:P3953 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18041","question":"Tell me Robert Fisk's degree that he received from Trinity College Dublin.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q310900 p:P69 ?s . ?s ps:P69 wd:Q258464 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["Which degree was received by Robert Fisk's by Trinity College Dublin"],"info":{}}
{"id":"train_18042","question":"What is the subject of a mathematical problem that has a list values union as qualifiers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1166625 wdt:P1269 ?answer . ?answer wdt:P2737 wd:Q23766486 }","paraphrases":["What is the subject of a numerical issue that includes a list values union as qualifiers?"],"info":{}}
{"id":"train_18043","question":"\"What is the eponym of Visegrád Group, whose border by is Dömös?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q244323 wdt:P138 ?answer . ?answer wdt:P47 wd:Q946405 }","paraphrases":["\"What is the eponym of Visegrád Group, whose border by way of is Dömös?\""],"info":{}}
{"id":"train_18044","question":"How many industries are textile manufacturing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P452 wd:Q1505660 }","paraphrases":["There are how many textile manufacturing industries?"],"info":{}}
{"id":"train_18046","question":"Which is the profession for the field of occupation of Rugby?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P425 wd:Q5378 . ?sbj wdt:P31 wd:Q28640 }","paraphrases":["Which is the calling for the field of occupation of Rugby?"],"info":{}}
{"id":"train_18047","question":"What position did James Matheson hold as a Member of the 15th Parliament of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q4870843 p:P39 ?s . ?s ps:P39 wd:Q41582555 . ?s pq:P1534 ?value }","paraphrases":["In the 15th Parliament of the Untied Kingdom, James Matheson held what position?"],"info":{}}
{"id":"train_18051","question":"What is {end time} and {start time} of {{Boeing 747} has {operator} as {Air Algérie}} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1251693 wdt:P27 ?X . ?X wdt:P1082 ?answer }","paraphrases":["What is {conclusion time} and {begin time} of {{Boeing 747} has {administrator} as {Discuss Algérie}} ?"],"info":{}}
{"id":"train_18054","question":"which is the start time for Gomel has twinned administrative body as Solomianka Raion?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2678 p:P190 ?s . ?s ps:P190 wd:Q528868 . ?s pq:P580 ?value }","paraphrases":["When did Gormel first become a twinned administrative body with Solomianka Raion?"],"info":{}}
{"id":"train_18055","question":"Which is the sport that is used by 2011 Junior World Orienteering Championships?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12038151 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["Which is the wear that's utilized by 2011 Junior World Orienteering Championships?"],"info":{}}
{"id":"train_18056","question":"What is theaviation accident with the lowest number of injured whose instance of is aviation accident ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q744913 . ?ent wdt:P1339 ?obj . ?ent wdt:P31 wd:Q744913 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which aviation accident resulted in the fewest injuries?"],"info":{}}
{"id":"train_18057","question":"How many head official positions are held by the mayor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2388 wd:Q30185 }","paraphrases":["What are the official positions headed by the Mayor?"],"info":{}}
{"id":"train_18058","question":"Does Tomi Pettinen have zero career assists?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q114705 wdt:P6545 ?obj filter ( ?obj = 0.0 ) }","paraphrases":["Did Tomi Pettinen ever get an assist?"],"info":{}}
{"id":"train_18060","question":"What is the absolute lowest point that is in Doggerland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1138308 wdt:P706 ?X . ?X wdt:P1589 ?answer }","paraphrases":["In Doggerland, what is the absolute lowest point?"],"info":{}}
{"id":"train_18062","question":"What company took over the Garrick Theatre, Southport?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26659915 wdt:P1365 ?X . ?X wdt:P84 ?answer }","paraphrases":["What company took over the Garrick Theater, Southport?"],"info":{}}
{"id":"train_18064","question":"What award did David Ireland receive in 1976?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q978089 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1976' ) ) }","paraphrases":["Give me the name of award given to David Ireland in 1976?"],"info":{}}
{"id":"train_18065","question":"What is the lowest profit automobile marque whose stock exchange is NASDAQ.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q17412622 . ?ent wdt:P2295 ?obj . ?ent wdt:P414 wd:Q82059 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What automobile marque has the lowest profit on the NASDAQ stock exchange?"],"info":{}}
{"id":"train_18066","question":"What is the country whose leader is Donald Trump ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P35 wd:Q22686 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["What is the nation whose pioneer is Donald Trump ?"],"info":{}}
{"id":"train_18067","question":"What is Allbreedpedigree ID forNorthern Dancer ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1969034 wdt:P3167 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18068","question":"Name the person who killed highest number of people?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1345 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the individual who killed easiest wide variety of people?"],"info":{}}
