{"id":"train_19206","question":"Do {Queen_Victoria} {received award} in {Order of Saint John}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9439 wdt:P166 wd:Q1465984 }","paraphrases":["Did Queen Victoria receive the award of the Order of Saint John?"],"info":{}}
{"id":"train_19208","question":"In what former Soviet country was Ramzan Kadyrov Ebonat born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q217115 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q15180 }","paraphrases":["Ramzan Kadyrov Ebonat was born in what country, that used to be part of the Soviet Union?"],"info":{}}
{"id":"train_19209","question":"na","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184839 wdt:P176 ?X . ?X wdt:P199 ?answer }","paraphrases":["na"],"info":{}}
{"id":"train_19210","question":"What are the works of influence of Immanuel Kant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9312 wdt:P737 ?X . ?X wdt:P800 ?answer }","paraphrases":["What are the works of impact of Immanuel Kant?"],"info":{}}
{"id":"train_19211","question":"What was the population of the Vysočina Region on 1st January 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q190930 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["How many people lived in the Vysočina region as of the beginning of 2016?"],"info":{}}
{"id":"train_19212","question":"tell  me instruction set architecture that designed by Intel  that starts with x","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q272683 . ?sbj wdt:P287 wd:Q248 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know instruction set design that planned by Intel that begins with x"],"info":{}}
{"id":"train_19215","question":"Which is the alphabet which contains the word thuluth in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9779 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'thuluth' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the letter set which contains the word thuluth in it's name?"],"info":{}}
{"id":"train_19216","question":"What films has Ellen DeGeneres produced?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P162 wd:Q483325 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Ellen DeGeneres is the producer of which films?"],"info":{}}
{"id":"train_19218","question":"When is the genetic association of the orthologs of leprosy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36956 wdt:P2293 ?X . ?X wdt:P684 ?answer }","paraphrases":["Mention the period of the genetic association of the orthologs of leprosy."],"info":{}}
{"id":"train_19219","question":"When was Michael Jordan nominated for Laureus World Sports Award for Comeback of the Year?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41421 p:P1411 ?s . ?s ps:P1411 wd:Q918534 . ?s pq:P585 ?value }","paraphrases":["What year was Michael Jordan short-listed for Laureus World Sports Award for Comeback of the Year?"],"info":{}}
{"id":"train_19220","question":"What are the task which start with the letter q","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q759676 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'q' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the task which begins with the letter q"],"info":{}}
{"id":"train_19223","question":"What is the original language of The Price Is Right, where there is a \"neuter\" grammatical gender?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q459720 wdt:P364 ?answer . ?answer wdt:P5109 wd:Q1775461 }","paraphrases":["What is the original language of The Price Is Right, where there is a \"neuter\" grammatical gender?"],"info":{}}
{"id":"train_19224","question":"Name an ancient monument that posesses the World Heritage and that contains the word \"group\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3395377 . ?sbj wdt:P2614 wd:Q23038972 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'group' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an historic monument that posesses the World Heritage and that carries the phrase \"group\" in its name"],"info":{}}
{"id":"train_19225","question":"How many matches played and goals scored did Abby Wambach achieve as a member of the Washington Freedom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q233112 p:P54 ?s . ?s ps:P54 wd:Q2151803 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How many suits played and desires scored did Abby Wambach obtain as a member of the Washington Freedom?"],"info":{}}
{"id":"train_19227","question":"WHICH IS THE UNITED WORLD WRESTLING IS FOR MIJAIN LOPEZ","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q462790 wdt:P2727 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19228","question":"What river has the strongest and largest flow at the mouth of Kattegat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3529419 . ?ent wdt:P2225 ?obj . ?ent wdt:P403 wd:Q131716 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["At the mouth of Kattegat what river flows the strongest?"],"info":{}}
{"id":"train_19229","question":"WHICH IS THE PUBLIC RESEARCH UNIVERSITY OF SUBSIDIARY CANADIAN INSTITUTE FOR INTERNATIONAL PEACE AND SECURITY THAT CONTAINS THE WORD MCGILL IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q62078547 . ?sbj wdt:P355 wd:Q30264321 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'mcgill' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE PUBLIC RESEARCH UNIVERSITY OF SUBSIDIARY CANADIAN INSTITUTE FOR INTERNATIONAL PEACE AND SECURITY THAT CONTAINS THE WORD MCGILL IN THEIR NAME"],"info":{}}
{"id":"train_19234","question":"Who is parent company of workplace of Madeleine Mathiot ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28366437 wdt:P108 ?X . ?X wdt:P749 ?answer }","paraphrases":["What is the name of the company that Madeleine Mathiot works for"],"info":{}}
{"id":"train_19236","question":"Is the number of volunteers of the Dorset Police equal to 236?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5298864 wdt:P6125 ?obj filter ( ?obj = 236.0 ) }","paraphrases":["Is the quantity of volunteers of the Dorset Police equivalent to 236?"],"info":{}}
{"id":"train_19237","question":"What is nominated for  Chinatown that is nominee is Robert Evans ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q644987 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q1826885 }","paraphrases":["What is Robert Evans nominated for in Chinatown?"],"info":{}}
{"id":"train_19239","question":"When did military airbase for place served by transport hub of Belgrade?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P931 wd:Q3711 . ?sbj wdt:P31 wd:Q695850 }","paraphrases":[],"info":{}}
{"id":"train_19240","question":"Ennio Morricone composed music for which films?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P86 wd:Q23848 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Ennio Morricone composed music for which movies?"],"info":{}}
{"id":"train_19241","question":"What has gps co-ordinates of 33.9867 and is the disambiguation of drum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11404 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '33.9867' ) ) }","paraphrases":["What has gps co-ordinates of 33.9867 and is the disambiguation of drum?"],"info":{}}
{"id":"train_19242","question":"Was Willie Nelson part of the ethnic group Choctaw?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q206112 wdt:P172 wd:Q324516 }","paraphrases":["Did Willie Nelson belong to the ethnic group of Choctaw?"],"info":{}}
{"id":"train_19243","question":"Tell me the art movement that starts with alphabet y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q968159 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the craftsmanship development that begins with letter set y"],"info":{}}
{"id":"train_19244","question":"Name an art piece reated by Anthozoa that starts with letter C","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15303351 . ?sbj wdt:P2849 wd:Q28524 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT IS THE ART PIECE RELATED TO ANTHOZOA THAT STARTS WITH LETTER C"],"info":{}}
{"id":"train_19245","question":"Name the test that measures the intelligence","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q83500 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q12021385 }","paraphrases":["Title the test that measures the intelligence"],"info":{}}
{"id":"train_19247","question":"what were the responsibilities of Numa Denis Fustel de Coulanges as director","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q462597 p:P39 ?s . ?s ps:P39 wd:Q1162163 . ?s pq:P642 ?value }","paraphrases":["Give the responsibilities of Numa Denis Fustel de Coulanges as director."],"info":{}}
{"id":"train_19248","question":"What was Yasunari Kawabata nominated for the first of January, 1963?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43736 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1963' ) ) }","paraphrases":["On January 1, 1963, Yasunari Kawabata was nominated for which award?"],"info":{}}
{"id":"train_19250","question":"What is the facet of reincarnation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q128593 wdt:P1269 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19255","question":"Donald Trump recieved and followed what award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q22686 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What is the award that Donald Trump followed and also received?"],"info":{}}
{"id":"train_19256","question":"Is the perimeter of the Georgenthalweiher equal to .25?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23787792 wdt:P2547 ?obj filter ( ?obj = 0.25 ) }","paraphrases":["Is 0.25 the perimeter of the Georgenthalweiher?"],"info":{}}
{"id":"train_19258","question":"Who is the biblical figure that is the patron saint of Rome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q220 wdt:P417 ?obj . ?obj wdt:P31 wd:Q20643955 }","paraphrases":["Who is Rome's patron saint's biblical figure?"],"info":{}}
{"id":"train_19260","question":"What country signed the North Atlantic Treaty that has a spoken language of Portuguese?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q877399 wdt:P1891 ?answer . ?answer wdt:P1412 wd:Q5146 }","paraphrases":["What us of a signed the North Atlantic Treaty that has a spoken language of Portuguese?"],"info":{}}
{"id":"train_19261","question":"When will Selma Lagerlöf start their membership in the Free-minded National Association?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q44519 p:P102 ?s . ?s ps:P102 wd:Q10499215 . ?s pq:P580 ?value }","paraphrases":["what will selma lagerlof start their membership in the free-minded national association?"],"info":{}}
{"id":"train_19263","question":"How long was Joseph Lyons a member of the Australian Labor Party?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q370966 p:P102 ?s . ?s ps:P102 wd:Q216082 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["How long was Joseph Lyons a part of the Australian Labor Party?"],"info":{}}
{"id":"train_19265","question":"When did Sarah Michelle Gellar win the Teen Choice Award for Best Villain?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q180665 p:P166 ?s . ?s ps:P166 wd:Q17011060 . ?s pq:P585 ?value }","paraphrases":["In what year did Sarah Michelle Gellar win the Teen Choice Award for Best Villain?"],"info":{}}
{"id":"train_19267","question":"What is the higher taxon rank in Fringillidae?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q160835 wdt:P171 ?X . ?X wdt:P105 ?answer }","paraphrases":["What taxonomical rank is higher than the family Fringillidae?"],"info":{}}
{"id":"train_19268","question":"What association football league's name starts with \"S\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15991303 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What affiliation football league's title begins with \"S\"?"],"info":{}}
{"id":"train_19269","question":"What award did Thomas Keneally receive in the year 1982?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q298334 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1982' ) ) }","paraphrases":["Which award did Thomas Keneally win in 1982?"],"info":{}}
{"id":"train_19270","question":"WHAT IS THE TRIBUTARY CONFLUENCES OF RIO DE LA PLATA ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35827 wdt:P403 ?X . ?X wdt:P974 ?answer }","paraphrases":["WHAT ARE RIO DE LA PLATA TRIBUTARY CONFLUENCES?"],"info":{}}
{"id":"train_19271","question":"What death place of Sigismund III Vasa is associated with people from Warsaw.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q52940 wdt:P20 ?answer . ?answer wdt:P1792 wd:Q6892108 }","paraphrases":["What passing put of Sigismund III Vasa is related with individuals from Warsaw."],"info":{}}
{"id":"train_19272","question":"WHICH IS THE PLANETARY SYSTMEN OF PLANET ON TROLD SINUS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q25909186 wdt:P376 ?X . ?X wdt:P397 ?answer }","paraphrases":["WHICH IS THE PLANETARY SYSTMEN OF PLANET ON TROLD SINUS?"],"info":{}}
{"id":"train_19273","question":"What is the location and the present in work of Noah?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q81422 wdt:P937 ?ans_1 . wd:Q81422 wdt:P1441 ?ans_2 }","paraphrases":["Where is Noah and his work located?"],"info":{}}
{"id":"train_19274","question":"What is the name of the unicameral legislative body in Azad Kashmir?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q200130 wdt:P194 ?obj . ?obj wdt:P31 wd:Q37002670 }","paraphrases":["What is the unicameral legislative body in Azad Kashmir called?"],"info":{}}
{"id":"train_19275","question":"What are the unit of measurement which start with the letter visus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q630830 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the unit of estimation which begin with the letter visus"],"info":{}}
{"id":"train_19276","question":"Tell me phase change whose name has the word sublimation in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185357 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sublimation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which phase change includes the term \"sublimation\" in its name?"],"info":{}}
{"id":"train_19277","question":"Who was the head of government in North Sumatra Province that ended in 2015-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2140 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["which the head of government  north sumatra province ended in 2015-0-0?"],"info":{}}
{"id":"train_19278","question":"Is the average gradient of the artificial luge track less than 0.08?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q50080181 wdt:P2198 ?obj filter ( ?obj < 0.08 ) }","paraphrases":["Is the normal angle of the manufactured luge track less than 0.08?"],"info":{}}
{"id":"train_19279","question":"Who is the film editor of Back to the future?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q91540 wdt:P1040 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19280","question":"At what {point in time} was {Billy Ray Cyrus} {nominated for} the {Grammy Award for Best Male Country Vocal Performance}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q231259 p:P1411 ?s . ?s ps:P1411 wd:Q5593832 . ?s pq:P585 ?value }","paraphrases":["When was  Billy Ray Cyrus nominated for Grammy Award for Best Male Country Vocal Performance?"],"info":{}}
{"id":"train_19282","question":"Does 100 equal 100?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q37413 wdt:P1181 ?obj filter ( ?obj = 100 ) }","paraphrases":["Is 100 the same as 100?"],"info":{}}
{"id":"train_19284","question":"Who formed the Rammstein brand","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q25177 wdt:P264 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who shaped the Rammstein brand"],"info":{}}
{"id":"train_19285","question":"who  is the Giants for killed by of apollo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P157 wd:Q37340 . ?sbj wdt:P31 wd:Q191192 }","paraphrases":["What is the name of the giant Apollo killed?"],"info":{}}
{"id":"train_19287","question":"Who was Michael Faraday's teacher ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P802 wd:Q8750 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was Michael Faraday's educator ?"],"info":{}}
{"id":"train_19288","question":"What is Peter Cosgrove's given name in the series ordinal 2?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q976974 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '2' ) ) }","paraphrases":["Give me Peter Cosgrove's given name in the series ordinal 2."],"info":{}}
{"id":"train_19289","question":"What award did Umberto Nobile receive on December 27, 2966?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q291200 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1966' ) ) }","paraphrases":["Name the award received by Umberto Nobile on December 27, 2966."],"info":{}}
{"id":"train_19290","question":"Is it true that the horizontal depth of High-necked bottle DP 0104 equals to 35?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q59390556 wdt:P5524 ?obj filter ( ?obj = 35 ) }","paraphrases":["Is it true that High - necked bottle DP 0104's horizontal depth is equal to 35?"],"info":{}}
{"id":"train_19291","question":"What are these people with  specific demographic profiles that contain the word \" baby\" in their names","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5932254 . ?sbj wdt:P1366 wd:Q3377398 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'baby' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are these people with specific demographic profiles in their names that contain the word \"baby?\""],"info":{}}
{"id":"train_19292","question":"What is the Tungsten's has effect and location of discovery?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q743 wdt:P1542 ?ans_1 . wd:Q743 wdt:P189 ?ans_2 }","paraphrases":["Explain the Tungsten's has effect and state its location of discovery."],"info":{}}
{"id":"train_19293","question":"What was Gregory VII's date of birth in the year 1020?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q133063 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( YEAR ( ?x ) , '1020' ) ) . ?s pq:P1326 ?value }","paraphrases":["Is it true that Gregory VII was born in 1020?"],"info":{}}
{"id":"train_19295","question":"The death of Laocoön was famously depicted in a much-admired marble Laocoön and His Sons, attributed by Pliny the Elder to the Rhodian sculptors Agesander, Athenodoros, and Polydorus, which stands in the Vatican Museums, Rome. ... song \"Laughing\" references Laocoön, rendering him female (\"Laocoön and her two sons\").","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q465762 wdt:P186 ?X . ?X wdt:P2404 ?answer }","paraphrases":["Laocoön's death was famously depicted in a much - admired Laocoön and His Sons marble attributed by Pliny the Elder to the Rhodian sculptors Agesander, Athenodoros, and Polydorus in the Vatican Museums in Rome."],"info":{}}
{"id":"train_19296","question":"Is it true that the target interest rate of the Central Bank of Egypt equals 10.75?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q920699 wdt:P2661 ?obj filter ( ?obj = 10.75 ) }","paraphrases":["Is it genuine that the target intrigued rate of the Central Bank of Egypt breaks even with 10.75?"],"info":{}}
{"id":"train_19303","question":"How many people live on Earth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2974 wd:Q2 }","paraphrases":["What is the World's population?"],"info":{}}
{"id":"train_19305","question":"Who gave the{signs} of {implies} of {marble} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40861 wdt:P1542 ?X . ?X wdt:P780 ?answer }","paraphrases":["who gave the marble signs?"],"info":{}}
{"id":"train_19306","question":"which is located in the administrative territorial entity of Babruysk that is start time is 1944?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q207294 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1944' ) ) }","paraphrases":["which is found within the authoritative regional substance of Babruysk that's begin time is 1944?"],"info":{}}
{"id":"train_19307","question":"What is the show hosted by Steve Kroft that has \"60\" in the title?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1358344 . ?sbj wdt:P371 wd:Q541068 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , '60' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the appear facilitated by Steve Kroft that has \"60\" within the title?"],"info":{}}
{"id":"train_19310","question":"What is the findspot of dysprosium, which was divides into the 1st arrondissement of Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1843 wdt:P189 ?answer . ?answer wdt:P150 wd:Q161741 }","paraphrases":["What is the findspot of dysprosium, which was once divides into the 1st arrondissement of Paris?"],"info":{}}
{"id":"train_19311","question":"what is reserve currency that contains the word dollar in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q756202 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dollar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the reserve currency in the name of the word dollar?"],"info":{}}
{"id":"train_19312","question":"Which administrative territorial entity did Maya Deren die in if her death took place in New York City?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q450382 p:P20 ?s . ?s ps:P20 wd:Q60 . ?s pq:P131 ?value }","paraphrases":["If Maya Deren's death was in New York City, which administrative territorial entity did it take place in?"],"info":{}}
{"id":"train_19313","question":"What is Bermuda's diplomatic relation, that has the same time zone as Alaska?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23635 wdt:P530 ?answer . ?answer wdt:P421 wd:Q3238805 }","paraphrases":["What is the diplomatic relationship between Bermuda, which has the same time zone as Alaska?"],"info":{}}
