{"id":"train_13755","question":"Which inferior planet has the longest synodic period?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3901935 . ?ent wdt:P4341 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["The longest synodic period is possessed by which inferior planet?"],"info":{}}
{"id":"train_13756","question":"What award did Bono receive and when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q834621 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What grant did Bono get and when?"],"info":{}}
{"id":"train_13757","question":"What is the Australian Women's Register ID of Cate Blanchett?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q80966 wdt:P4186 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13759","question":"What position did Jacques Charles Dupont de l'Eure leave on May 9, 1848?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2309694 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1848' ) ) }","paraphrases":["On May 9, 1848, what position did Jacques Charles Dupont de l'Eure leave?"],"info":{}}
{"id":"train_13760","question":"How many applies to jurisdiction for Australian dollar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q259502 wdt:P1001 ?obj }","paraphrases":["Give the numbers of applies in regard to the jurisdiction for australian dollar."],"info":{}}
{"id":"train_13762","question":"What is the birth place of Syrian Darley Arabian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1166352 wdt:P19 ?answer . ?answer wdt:P2633 wd:Q862111 }","paraphrases":["What is the birth put of Syrian Darley Arabian?"],"info":{}}
{"id":"train_13765","question":"What award did Julia Roberts receive in the year 2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q40523 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["What grant did Julia Roberts get in the year 2000?"],"info":{}}
{"id":"train_13766","question":"Which is the US Congress Bio ID for Alexander Hamilton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q178903 wdt:P1157 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13770","question":"Which is the operating area for Democracy Now! ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1185824 wdt:P2541 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13774","question":"What administrative territorial entity of Russia starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q192287 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What authoritative regional substance of Russia begins with the letter \"t\"?"],"info":{}}
{"id":"train_13775","question":"Did the UK and Prussia participate in the Battle of Waterloo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q48314 wdt:P710 wd:Q145 . wd:Q48314 wdt:P710 wd:Q38872 }","paraphrases":["Were Prussia and the UK participants in the Battle of Waterloo?"],"info":{}}
{"id":"train_13776","question":"What is the current edition of Hamlet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41567 wdt:P747 ?obj . ?obj wdt:P31 wd:Q3331189 }","paraphrases":["What is the current version of Hamlet?"],"info":{}}
{"id":"train_13777","question":"Who follows the emir of Damascus Saladin and who does he follow?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q8581 p:P97 ?s . ?s ps:P97 wd:Q54493575 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Who follows the emir of Damascus Saladin and who does he follow?\nwho is the follower of the emir of Damascus and who is followed by him?"],"info":{}}
{"id":"train_13781","question":"Which Amendments to the Constitution of Ireland have the largest number of spoiled votes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q467578 . ?ent wdt:P5044 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Revisions to the Structure of Ireland have the biggest number of ruined votes?"],"info":{}}
{"id":"train_13783","question":"Who is the father of Errol Flynn?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P22 wd:Q93188 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the father of Errol Flynn?"],"info":{}}
{"id":"train_13784","question":"Who is the {art movement} for {discoverer or inventor} of {Claude Monet}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P61 wd:Q296 . ?sbj wdt:P31 wd:Q968159 }","paraphrases":["Which art movement did the inventor of Claude Monet start?"],"info":{}}
{"id":"train_13786","question":"What is the TV program created by Ellen DeGeneres ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P170 wd:Q483325 . ?sbj wdt:P31 wd:Q15416 }","paraphrases":["What tv station does Oprah Winfrey work for?"],"info":{}}
{"id":"train_13787","question":"Which is the sovereign state for the currency pound sterling?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P38 wd:Q25224 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_13788","question":"Who is the composer of Die Walküre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q324319 wdt:P86 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13789","question":"Tell me which diatomic nonmetal oxidises fastest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19753344 . ?ent wdt:P1121 ?obj . ?ent wdt:P31 wd:Q19753344 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the quickest diatomic nonmetal oxidizing agent?"],"info":{}}
{"id":"train_13792","question":"Can the isobutyl alcohol auto ignition temperature be greater than 498.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q151797 wdt:P2199 ?obj filter ( ?obj > 498.0 ) }","paraphrases":["Can the temperature of isobutyl alcohol auto ignition be greater than 498.0?"],"info":{}}
{"id":"train_13794","question":"What is the prize received by Anne Baxter that has winners like Wendy Hiller?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q228906 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q230626 }","paraphrases":["What is Anne Baxter's award that has winners such as Wendy Hiller?"],"info":{}}
{"id":"train_13795","question":"what is twinned administrative body of tainan is statrt time is 1980-8-16?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q140631 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["What is the administrative body of Tainan that started in 1980?"],"info":{}}
{"id":"train_13796","question":"\"Which is {alumna of} of {Ellen Swallow Richards}, where {located at street address} is {77 Massachusetts Avenue, Cambridge, MA, 02139-4307} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7273 wdt:P69 ?answer . ?answer wdt:P969 ?x FILTER ( contains ( ?x , '77 Massachusetts Avenue, Cambridge, MA, 02139-4307' ) ) }","paraphrases":["\"Which is {alumna of} of {Ellen Swallow Richards}, where {located at street address} is {77 Massachusetts Avenue, Cambridge, MA, 02139-4307} ?\""],"info":{}}
{"id":"train_13797","question":"How many cre members are there in the  {Chris Hadfield} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1029 wd:Q1076962 }","paraphrases":["Which is the number of crew members that there are in Chris Hadfield?"],"info":{}}
{"id":"train_13801","question":"how many member active in for Lysander Spooner ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q538091 wdt:P937 ?X . ?X wdt:P463 ?answer }","paraphrases":["HOW MANY MEMBER ACTIVE FOR LYSANDER SPOONER"],"info":{}}
{"id":"train_13802","question":"Is the drag coefficient of the Hyundai Ioniq equal to 0.24?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q22672404 wdt:P6497 ?obj filter ( ?obj = 0.24 ) }","paraphrases":["What is the drag coefficient of the Hyundai Ionig?"],"info":{}}
{"id":"train_13805","question":"What are the academic discipline which start with the letter transplantology","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11862829 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'transplantology' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the tutorial self-discipline which start with the letter transplantology"],"info":{}}
{"id":"train_13806","question":"What ideology do the members of Patrick Harrington follow?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7146663 wdt:P102 ?X . ?X wdt:P1142 ?answer }","paraphrases":["Patrick Harrington follow what type of ideology?"],"info":{}}
{"id":"train_13808","question":"When does Rakesh Kumar compete?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16935077 wdt:P1344 ?X . ?X wdt:P585 ?answer }","paraphrases":["When does Rakesh Kumar compete?"],"info":{}}
{"id":"train_13809","question":"What does electronvolt measure?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q83327 wdt:P111 ?obj . ?obj wdt:P31 wd:Q47461344 }","paraphrases":["What does electronvolt measure?"],"info":{}}
{"id":"train_13810","question":"Who are the inhabitants of Benue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q204806 wdt:P17 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Who are the tenants of Benue?"],"info":{}}
{"id":"train_13812","question":"What is named after November in Czech?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q125 p:P138 ?s . ?s ps:P138 ?obj . ?s pq:P407 wd:Q9056 }","paraphrases":["November has what namesakes in Czech?"],"info":{}}
{"id":"train_13815","question":"What instrument did the producer of Primal Scream use?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q432413 wdt:P162 ?X . ?X wdt:P1303 ?answer }","paraphrases":["The producer of Primal Scream used what instrument?"],"info":{}}
{"id":"train_13816","question":"Which is the constitutional republic of the country of origin of American English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7976 wdt:P495 ?obj . ?obj wdt:P31 wd:Q1520223 }","paraphrases":["Which is the protected republic of the nation of beginning of American English?"],"info":{}}
{"id":"train_13825","question":"Calvin Coolidge held what position until 1923-8-2?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q36023 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1923' ) ) }","paraphrases":["What job did Calvin Coolidge have until August 2, 1923?"],"info":{}}
{"id":"train_13827","question":"When did Jane Goodall and Hugo van Lawick divorce?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q184746 p:P26 ?s . ?s ps:P26 wd:Q1281022 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When was the divorce between Jane Goodall and Hugo van Lawick?"],"info":{}}
{"id":"train_13828","question":"Which is the diagnostic test of the health specialty of anatomical pathology that starts with the letter p?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1762591 . ?sbj wdt:P1995 wd:Q683455 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the diagnostic test of health specialty in anatomical pathology which begins with the alphabet P"],"info":{}}
{"id":"train_13830","question":"What is the termination date for Hillary Clinton's time as senator?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6294 p:P39 ?s . ?s ps:P39 wd:Q13217683 . ?s pq:P582 ?value }","paraphrases":["When did Hillary Clinton leave her Position as a Senator ?"],"info":{}}
{"id":"train_13831","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q182531 wdt:P138 ?answer . ?answer wdt:P150 wd:Q502047 }","paraphrases":["What is it?"],"info":{}}
{"id":"train_13833","question":"What are the religion and the sex of Steve Wozniak?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q483382 wdt:P140 ?ans_1 . wd:Q483382 wdt:P21 ?ans_2 }","paraphrases":["Which gender and religion are Steve Wozniak?"],"info":{}}
{"id":"train_13834","question":"Who became the head of China Railways Corporation in 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1073489 p:P505 ?s . ?s ps:P505 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["In 2016, who was appointed as the leader of China Railways Corporation?"],"info":{}}
{"id":"train_13836","question":"What is Aleksandr Lyapunov's doctoral thesis and who is his doctoral advisor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q310788 p:P1026 ?s . ?s ps:P1026 ?obj . ?s pq:P184 ?value1 . }","paraphrases":["What is Aleksandr Lyapunov's doctoral proposal and who is his doctoral advisor?"],"info":{}}
{"id":"train_13837","question":"What is the Telegram username for Cristina Kirchner","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q40649 wdt:P3789 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13838","question":"which sculpturewith the maximum horizontal depth whose instance of is sculpture?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q860861 . ?ent wdt:P5524 ?obj . ?ent wdt:P31 wd:Q860861 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["which sculpturewith the maximum horizontal depth whose occasion of is sculpture?"],"info":{}}
{"id":"train_13840","question":"What is Mao Zedong's Chinese Political Elites Database ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5816 wdt:P5142 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13842","question":"What country is Benghazi located in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q40816 wdt:P131 ?obj . ?obj wdt:P31 wd:Q6256 }","paraphrases":["What nation is Benghazi found in?"],"info":{}}
{"id":"train_13843","question":"Was Lindsay Lohan born in The Bronx?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44903 wdt:P19 wd:Q18426 }","paraphrases":["Is the Bronx the birthplace of Lindsay Lohan?"],"info":{}}
{"id":"train_13844","question":"When did Euclid develop his theory of geometry?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q178377 p:P61 ?s . ?s ps:P61 wd:Q8747 . ?s pq:P575 ?value }","paraphrases":["Euclid developed his theory of geometry in what year?"],"info":{}}
{"id":"train_13847","question":"When did Katharine Hepburn marry Ludlow Ogden Smith and when did they divorce","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q56016 p:P26 ?s . ?s ps:P26 wd:Q22326909 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["In what year was Katharine Hepburn married to Ludlow Ogden Smith and what year were they divorced?"],"info":{}}
{"id":"train_13848","question":"Who gave the{parent company of} of {regulatory body} of {Armenian} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8785 wdt:P1018 ?X . ?X wdt:P355 ?answer }","paraphrases":["Who gave the{parent company of} of {administrative body} of {Armenian} ?"],"info":{}}
{"id":"train_13850","question":"Which country of Brest ended on March 17th, 1921?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q140147 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1921' ) ) }","paraphrases":["ended on brest on Match 17th, 1921, what country was it?"],"info":{}}
{"id":"train_13851","question":"Who is the founder of Tamara Ecclestone working for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2465450 wdt:P108 ?X . ?X wdt:P112 ?answer }","paraphrases":["The founder of Tamara Eccletone is working for whom?"],"info":{}}
{"id":"train_13853","question":"Tell me the dimensionless quantity that begins with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q126818 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the dimensionless amount that starts with the letter s"],"info":{}}
{"id":"train_13855","question":"What is the location of narrative of the Tropic of Cancer that has towns in the 11th arrondissement of Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1501700 wdt:P840 ?answer . ?answer wdt:P150 wd:Q169293 }","paraphrases":["What is the region of narrative of the Tropic of Cancer that has cities in the 11th arrondissement of Paris?"],"info":{}}
{"id":"train_13856","question":"Who did John Richard Hicks receive the Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Nobel, and when did it happen?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q184862 p:P166 ?s . ?s ps:P166 wd:Q47170 . ?s pq:P1706 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["In which year did John Richard Hicks receive the Sveriges Riksbank Prize in Economic Sciences in Memory of Alfred Noble, and who presented the award?"],"info":{}}
{"id":"train_13857","question":"Tell me legendary figure whose name has the word etain in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13002315 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'étaín' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know incredible figure whose title has the word etain in it"],"info":{}}
{"id":"train_13859","question":"Which is the college attended by the developer of pasteurization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q58148 wdt:P61 ?X . ?X wdt:P69 ?answer }","paraphrases":["Where did the developer of pasteurization attend college?"],"info":{}}
{"id":"train_13860","question":"Which is the maximum frequency of audible sound for house cat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q146 wdt:P3465 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13861","question":"What in Bavaria ended at 1945-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q980 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1945' ) ) }","paraphrases":["none"],"info":{}}
{"id":"train_13862","question":"How was the population of Carson City as 55274.0 determined?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q40881 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '55274.0' ) ) . ?s pq:P459 ?value }","paraphrases":["How did they determine the population of Carson City?"],"info":{}}
{"id":"train_13865","question":"What is the { academic major } for { Alexey Navalny } as { UCA (Sin embargo no terminó el primer semestre) }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q155979 p:P69 ?s . ?s ps:P69 wd:Q839669 . ?s pq:P812 ?value }","paraphrases":["Give me the name of Alexey Navalny's academic major as UCA (Sin embargo no termino el primer semestre)."],"info":{}}
{"id":"train_13867","question":"Which is the child body part of the constellation of HD 152079?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2087410 wdt:P398 ?X . ?X wdt:P59 ?answer }","paraphrases":["Which is the child body portion of the star grouping of HD 152079?"],"info":{}}
{"id":"train_13869","question":"Which {is son} who {has brother} of {Victoria Cary} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28059797 wdt:P3373 ?X . ?X wdt:P25 ?answer }","paraphrases":["Which son of Victoria Cary has a brother?"],"info":{}}
{"id":"train_13870","question":"What nominations did Silence of the Lambs receive for the 64th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q133654 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q857047 }","paraphrases":["What work by Silence of the Lambs was nominated for 64th Academy award?"],"info":{}}
{"id":"train_13871","question":"What are the peace treaty which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q625298 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the peace arrangement which begin with the letter t"],"info":{}}
{"id":"train_13872","question":"How many species are endemic to Arkansas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P183 wd:Q1612 }","paraphrases":["What number of species are endemic to Arkansas?"],"info":{}}
{"id":"train_13874","question":"What is the legally established name of extortion,  with the acronym of StGB?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6452087 wdt:P92 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'StGB' ) ) }","paraphrases":["What is the legally established identify of extortion, with the acronym of StGB?"],"info":{}}
{"id":"train_13876","question":"Is it true Influenza drug used for treatment oseltamivir and zanamivir?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2840 wdt:P2176 wd:Q211509 . wd:Q2840 wdt:P2176 wd:Q146075 }","paraphrases":["Are oseltamivir and zanamivir used to treat the flu?"],"info":{}}
{"id":"train_13877","question":"Give me the end time for Vicente Fox has position held as Governor of Guanajuato?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q190572 p:P39 ?s . ?s ps:P39 wd:Q5589657 . ?s pq:P582 ?value }","paraphrases":["When was Vicente Fox's position end as Governor of Guanajuato?"],"info":{}}
{"id":"train_13879","question":"Is it true that the stroke of the DRG Class 03 is less than 528?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q201801 wdt:P2557 ?obj filter ( ?obj < 528.0 ) }","paraphrases":["Is it genuine that the stroke of the DRG Lesson 03 is less than 528?"],"info":{}}
{"id":"train_13881","question":"The parallax of Polaris is?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12980 wdt:P2214 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13882","question":"Is the female population of Bommadasanahalli less than 0.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q10740586 wdt:P1539 ?obj filter ( ?obj < 0.0 ) }","paraphrases":["Are there less than 0.0 females in the population of Bommadasanahalli?"],"info":{}}
{"id":"train_13885","question":"How many continents are in Antarctica ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P30 wd:Q51 }","paraphrases":["Antarctica has how many continents?"],"info":{}}
{"id":"train_13886","question":"How many directors are placed in the {Scandinavian Airlines} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q187854 wdt:P1037 ?obj }","paraphrases":["Which is the number of the directors that are placed in the Scandinavian Airlines?"],"info":{}}
{"id":"train_13888","question":"What are the disciplinary repository which start with the letter engrxiv","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5281480 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'engrxiv' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which disciplinary repository starts with the ENGRXIV letter?"],"info":{}}
{"id":"train_13890","question":"Who are the characters from the narrative of Sigurd?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q537554 wdt:P1441 ?X . ?X wdt:P674 ?answer }","paraphrases":["From Sigurd. who are the characters?"],"info":{}}
