{"id":"train_1713","question":"State the mathematical concept behind the Spacetime manifestation.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1557 wd:Q133327 . ?sbj wdt:P31 wd:Q21550639 }","paraphrases":["State the scientific concept behind the Spacetime sign."],"info":{}}
{"id":"train_1714","question":"Which central bank has the highest target interest rate ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4830453 . ?ent wdt:P2661 ?obj . ?ent wdt:P31 wd:Q66344 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which main bank has the highest interest rate?"],"info":{}}
{"id":"train_1717","question":"Name a mutant in X-MEN that starts with letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1094617 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a mutant in X-MEN that begins with letter W"],"info":{}}
{"id":"train_1718","question":"What is the original Robin Hood about?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P674 wd:Q122634 . ?sbj wdt:P31 wd:Q7832362 }","paraphrases":["What is the first Robin Hood about?"],"info":{}}
{"id":"train_1719","question":"When did Reinhard Heydrich stop being the President of Interpol?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q60039 p:P39 ?s . ?s ps:P39 wd:Q19698214 . ?s pq:P582 ?value }","paraphrases":["In what year did Reinhard Heydrich step down as the President of Interpol?"],"info":{}}
{"id":"train_1720","question":"what is the human population from the originates of Mind?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1936338 wdt:P495 ?X . ?X wdt:P1082 ?answer }","paraphrases":["what is the human populace from the begins of Mind?"],"info":{}}
{"id":"train_1723","question":"Mention the qualifying degree and the major specialization course in which Jeff Bezos graduated from the Princeton University","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q312556 p:P69 ?s . ?s ps:P69 wd:Q21578 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What course did Jeff Bezos take while attending Princeton University?"],"info":{}}
{"id":"train_1726","question":"Who is guilty for Paris Hilton's My New BFF being presented?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1513736 wdt:P371 ?X . ?X wdt:P1399 ?answer }","paraphrases":["Who is blameworthy for Paris Hilton's My Unused BFF being presented?"],"info":{}}
{"id":"train_1727","question":"Which is the date of baptism in early childhood of Diego Velázquez?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q297 wdt:P1636 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1729","question":"What separation process did Zosimos of Panopolis invent with the word \"distillation\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q898987 . ?sbj wdt:P61 wd:Q226868 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'distillation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What separation process did Zosimos of Panopolis invent with the word \"distillation\" in its name?"],"info":{}}
{"id":"train_1730","question":"\"Name the birth city of Skepta in the country of Nairobi that has been subdivided\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q164446 wdt:P19 ?answer . ?answer wdt:P150 wd:Q1061480 }","paraphrases":["\"Title the birth city of Skepta within the nation of Nairobi that has been subdivided\""],"info":{}}
{"id":"train_1731","question":"Tell me the association football stadium of the structural engineer Sinclair Knight Merz which starts with the letter s?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1154710 . ?sbj wdt:P631 wd:Q3459673 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the association football stadium of the structural engineer Sinclair Knight Merz which starts offevolved with the letter s?"],"info":{}}
{"id":"train_1733","question":"WHICH IS THE MONTORY AUTHORITY WITH THE MOST TARGETINTEREST RATE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q6899005 . ?ent wdt:P2661 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What monetary authority has the most targeted interest rate?"],"info":{}}
{"id":"train_1734","question":"What was the population of Guinea in 1961?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1006 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1961' ) ) }","paraphrases":["In 1961, what was the population of Guinea?"],"info":{}}
{"id":"train_1735","question":"Who is Calvinism named for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q101849 wdt:P138 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Calvinism named for?"],"info":{}}
{"id":"train_1736","question":"Is the periapsis 15817 Lucianotesi less than 1.40172756?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q141068 wdt:P2244 ?obj filter ( ?obj < 1.40172756 ) }","paraphrases":["Does the periapsis 15817 Lucianotesi have a value less than 1.40172756?"],"info":{}}
{"id":"train_1737","question":"When is Naruto Uzumaki's birthday?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q931 wdt:P3150 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1739","question":"What is inflation rate of consumer price index aspect  of History of Trinidad and Tobago ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2562971 wdt:P1269 ?X . ?X wdt:P1279 ?answer }","paraphrases":["What is inflation rate of consumer price index aspect of History of Trinidad and Tobago ?"],"info":{}}
{"id":"train_1740","question":"Tell me Beer festival whose name has the word oktoberfest in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2919327 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'oktoberfest' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know Lager celebration whose title has the word oktoberfest in it."],"info":{}}
{"id":"train_1741","question":"which position David Trimble holds and when did he select?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q192556 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What is David Trimble's job title and when did he start?"],"info":{}}
{"id":"train_1743","question":"What is bordered by death of William Booth","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q309882 wdt:P20 ?X . ?X wdt:P47 ?answer }","paraphrases":["What is bordered by passing of William Booth"],"info":{}}
{"id":"train_1744","question":"Tell mec ommunist party whose name has the word práce in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q233591 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'práce' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell mec ommunist party whose title has the word práce in it."],"info":{}}
{"id":"train_1745","question":"When did Leslie Lamport start working for Microsoft Research?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q92613 p:P108 ?s . ?s ps:P108 wd:Q1144725 . ?s pq:P580 ?value }","paraphrases":["When did Leslie Lamport's employment for Microsoft Research begin?"],"info":{}}
{"id":"train_1746","question":"What is the significant event held in the beginning of Laser Interferometer Gravitational-Wave Observatory in 1994","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q255371 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["What happened in 1994 at the start of the Observatory?"],"info":{}}
{"id":"train_1747","question":"How many airline hub are done by All Nippon Airways","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q204284 wdt:P113 ?obj }","paraphrases":["What are the airports used as hubs by All Nippon Airways?"],"info":{}}
{"id":"train_1748","question":"What was the significant event happend when Gina Rinehart was came to an end in 1981","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q242982 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1981' ) ) }","paraphrases":["What historical event marked Gina Rinehart's death in 1981?"],"info":{}}
{"id":"train_1749","question":"What is the name of the democratic republic, previously occupied by indigenous people, which now the majority of its population speaks American English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7976 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q5255892 }","paraphrases":["Indigenous people used to occupy a democratic republic which now speaks mostly American English, what is its name?"],"info":{}}
{"id":"train_1750","question":"Tell me an arithmetic calendar that has the word calendar in it's name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q669102 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'calendar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me an arithmetic calendar that has the phrase calendar in it is name."],"info":{}}
{"id":"train_1754","question":"What film production company owns the American Broadcasting Company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1830 wd:Q169889 . ?sbj wdt:P31 wd:Q1762059 }","paraphrases":[],"info":{}}
{"id":"train_1755","question":"What is formed in burial place of William IV, Prince of Orange ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q380949 wdt:P119 ?X . ?X wdt:P571 ?answer }","paraphrases":["What is shaped in burial put of William IV, Sovereign of Orange ?"],"info":{}}
{"id":"train_1756","question":"What is the color called HTML4 for ruby color?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43088 wdt:P462 ?obj . ?obj wdt:P31 wd:Q56053097 }","paraphrases":["What is the color called HTML4 for ruby color?"],"info":{}}
{"id":"train_1757","question":"When did Jonathan Franzen received his National Book Award for Fiction?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q316607 p:P166 ?s . ?s ps:P166 wd:Q3873144 . ?s pq:P585 ?value }","paraphrases":["When did Jonathan Franzen win the National Book Award for Fiction?"],"info":{}}
{"id":"train_1759","question":"Is Burt Reynolds a citizen of America?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q202148 wdt:P27 wd:Q30 }","paraphrases":["Is Burt Reynolds a US citizen?"],"info":{}}
{"id":"train_1762","question":"When did Romario receive the World Cup Golden Ball?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q178649 p:P166 ?s . ?s ps:P166 wd:Q17355204 . ?s pq:P585 ?value }","paraphrases":["When was the World Cup Golden Ball given to Romario?"],"info":{}}
{"id":"train_1765","question":"Who is the writer of On Liberty who's birthday is May 20, 1806?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1055881 wdt:P50 ?answer . ?answer wdt:P569 ?x FILTER ( contains ( YEAR ( ?x ) , '1806' ) ) }","paraphrases":["Who is the creator of On Liberty who's birthday is May 20, 1806?"],"info":{}}
{"id":"train_1766","question":"What are the paradox which start with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q483372 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the conundrum which begin with the letter u"],"info":{}}
{"id":"train_1769","question":"Which {role model} is {contestant} of {The Black Dahlia} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q313874 wdt:P161 ?X . ?X wdt:P737 ?answer }","paraphrases":["Which {part show} is {hopeful} of {The Dark Dahlia} ?"],"info":{}}
{"id":"train_1770","question":"Is William Lawson's first name the same as Gwyllym?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q249724 wdt:P735 ?answer . ?answer wdt:P460 wd:Q19874199 }","paraphrases":["Is William Lawson's to begin with title the same as Gwyllym?"],"info":{}}
{"id":"train_1771","question":"When did Katharine Graham receive the Library of Congress Living Legend award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q435203 p:P166 ?s . ?s ps:P166 wd:Q6542686 . ?s pq:P580 ?value }","paraphrases":["On what date did Katharine Graham win the Living Legend award for the Library of Congress?"],"info":{}}
{"id":"train_1773","question":"What is the chemical compound of erythromycin when interacting with a significant drug?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q213511 wdt:P769 ?obj . ?obj wdt:P31 wd:Q11173 }","paraphrases":["Title the individual who driven to the generation of The Birth of a Nation"],"info":{}}
{"id":"train_1774","question":"what biblical episode commemorates Palm Sunday?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q42236 wdt:P547 ?obj . ?obj wdt:P31 wd:Q22704077 }","paraphrases":["what scriptural scene commemorates Palm Sunday?"],"info":{}}
{"id":"train_1776","question":"Did Lolita reference The Emperor's New Clothes and Eulalie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q127149 wdt:P2860 wd:Q11866 . wd:Q127149 wdt:P2860 wd:Q5408733 }","paraphrases":["Is The Emperor's New Clothes and Eulalie referenced by Lolita?"],"info":{}}
{"id":"train_1778","question":"What is the event location in action of the Allies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q215669 wdt:P607 ?X . ?X wdt:P276 ?answer }","paraphrases":["What is the occasion area in activity of the Allies?"],"info":{}}
{"id":"train_1780","question":"What is the working language of endemism of the Tasmanain devil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q134964 wdt:P183 ?X . ?X wdt:P2936 ?answer }","paraphrases":["What is the working dialect of endemism of the Tasmanain devil?"],"info":{}}
{"id":"train_1781","question":"Which is {won by} {succeded by} of {Freestyle skiing at the 2014 Winter Olympics – Men's moguls} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15056096 wdt:P156 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who won the Freestyle skiing at the 2014 Winter Olympics – Men's moguls?"],"info":{}}
{"id":"train_1784","question":"What happened in New Zealand on 11/25/1947?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q664 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1947' ) ) }","paraphrases":["Which event transpired on 11/25/1947 in New Zealand?"],"info":{}}
{"id":"train_1785","question":"What is the composition of a drink, that has mixed in is floral matter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6097 wdt:P186 ?answer . ?answer wdt:P1582 wd:Q101815 }","paraphrases":["What is the composition of a drink, that has blended in is botanical matter?"],"info":{}}
{"id":"train_1786","question":"When did George Frederic Handel graduate from University of Halle-Wittenberg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7302 p:P69 ?s . ?s ps:P69 wd:Q32120 . ?s pq:P582 ?value }","paraphrases":["On which date did George Frederic Handel completed his graduation from University of Halle-Wittenberg?"],"info":{}}
{"id":"train_1787","question":"What is the head position of the Organisation for Economic Co-operation and Development","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41550 wdt:P2388 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["What is the head position of the Association for Financial Co-operation and Advancement"],"info":{}}
{"id":"train_1789","question":"When did educated at of Melinda Gates and academic major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q463877 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["When did educated at of Melinda Gates and academic major?"],"info":{}}
{"id":"train_1790","question":"Which is the bore of AK-47?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q37116 wdt:P2556 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1791","question":"Which dialect is the official language of the Achaemenid Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q389688 wdt:P37 ?obj . ?obj wdt:P31 wd:Q33384 }","paraphrases":[],"info":{}}
{"id":"train_1793","question":"which federation with the lowest life expectancy whose contains administrative territorial is saxony-anhalt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q43702 . ?ent wdt:P2250 ?obj . ?ent wdt:P150 wd:Q1206 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What federation that contains saxony-anhalt in its administrative territory has the lowest life expectancy?"],"info":{}}
{"id":"train_1794","question":"What is the {manner of death} and the {position played on team / speciality} by {Babe_Ruth} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q213812 wdt:P1196 ?ans_1 . wd:Q213812 wdt:P413 ?ans_2 }","paraphrases":["What is the {way of passing} and the {position played on group / strength} by {Babe_Ruth} ?"],"info":{}}
{"id":"train_1797","question":"Which is the Movieplayer film ID for Once Upon a Time in the West?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q168154 wdt:P4783 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1798","question":"Where was the location of the Battle of Gettysburg and who were the participation that fought in that war?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q33132 wdt:P710 ?ans_1 . wd:Q33132 wdt:P276 ?ans_2 }","paraphrases":["What was the location of, and who were the participants in the Battle of Gettysburg?"],"info":{}}
{"id":"train_1799","question":"Who plays the sister in Red Line?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7304498 wdt:P161 ?X . ?X wdt:P3373 ?answer }","paraphrases":["Who plays the sister in Ruddy Line?"],"info":{}}
{"id":"train_1801","question":"WHICH IS THE ARITHMETIC CALENDAR THAT STARTS WITH C","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q669102 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["NAME THE ARITHMETIC CALENDAR THAT STARTS WITH C?"],"info":{}}
{"id":"train_1803","question":"What was the space probe launched from Cape Canaveral that starts with letter V ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26529 . ?sbj wdt:P1427 wd:Q1034348 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What was the space probe launched from Cape Canaveral that begins with letter V ?"],"info":{}}
{"id":"train_1804","question":"What team does Alcides Pena play for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2467100 wdt:P54 ?X . ?X wdt:P159 ?answer }","paraphrases":["What group does Alcides Pena play for?"],"info":{}}
{"id":"train_1806","question":"Was Natalia Molchanova born in the Bashkir Autonomous Soviet Socialist Republic?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q59920 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q809806 }","paraphrases":["Was the Bashkir Autonomous Soviet Socialist Republic the birthplace of Natalia Molchanova?"],"info":{}}
{"id":"train_1810","question":"who is depicted by Phan Thi Kim Phuc ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q233383 wdt:P1299 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1811","question":"What place was Oliver Hazard Perry born that has a diplomatic relation to Chile?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q580513 wdt:P19 ?answer . ?answer wdt:P530 wd:Q298 }","paraphrases":["What location was once Oliver Hazard Perry born that has a diplomatic relation to Chile?"],"info":{}}
{"id":"train_1812","question":"When did Christopher A. Sims and Sveriges Riksbank win their prize in Economic Sciences Nobel Peace Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q109737 p:P166 ?s . ?s ps:P166 wd:Q47170 . ?s pq:P1706 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["When did Christopher A. Sims and Sveriges Riksbank win their prize in Financial Sciences Nobel Peace Prize?"],"info":{}}
{"id":"train_1814","question":"What country has the lowest inflation rate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7275 . ?ent wdt:P1279 ?obj . ?ent wdt:P31 wd:Q3624078 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Give me the name of the country with the lowest inflation rate."],"info":{}}
{"id":"train_1816","question":"Who is the Mistress of John Wayne, who is also the winner of the \"Knight of the Order of Leopold\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40531 wdt:P451 ?answer . ?answer wdt:P166 wd:Q14900497 }","paraphrases":["Who is the Special lady of John Wayne, who is additionally the champ of the \"Knight of the Arrange of Leopold\"?"],"info":{}}
{"id":"train_1817","question":"When was European Union dissolved, abolished or demolished as per the European Community?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q458 p:P155 ?s . ?s ps:P155 wd:Q260487 . ?s pq:P571 ?value1 . ?s pq:P576 ?value2 }","paraphrases":["When used to be European Union dissolved, abolished or demolished as per the European Community?"],"info":{}}
{"id":"train_1818","question":"What is the motto of Shahada?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1546 wd:Q41831 }","paraphrases":[],"info":{}}
{"id":"train_1821","question":"When was Saint-Étienne twinned with Fes?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42716 p:P190 ?s . ?s ps:P190 wd:Q80985 . ?s pq:P580 ?value }","paraphrases":["In what year did Saint-Étienne become coupled with Fes?"],"info":{}}
{"id":"train_1823","question":"What invention contains the word tourbillion in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18119757 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tourbillon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What innovation contains the word tourbillion in its name?"],"info":{}}
{"id":"train_1824","question":"When did Neil Gaiman receive his award for Hugo?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q210059 p:P166 ?s . ?s ps:P166 wd:Q1056240 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["When did Neil Gaiman get his award for Hugo?"],"info":{}}
{"id":"train_1825","question":"What are the place of birth and the child of Pete Wentz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q310166 wdt:P19 ?ans_1 . wd:Q310166 wdt:P40 ?ans_2 }","paraphrases":["Where was Pete Wentz born, and who is his child?"],"info":{}}
{"id":"train_1826","question":"What part of the series is preceded by \"Hooked on Monkey Fonics\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q724150 wdt:P155 ?X . ?X wdt:P179 ?answer }","paraphrases":["Which part of the series is preceded by \"Hooked on Monkey Fonics\"?"],"info":{}}
{"id":"train_1827","question":"The antiparticle of a neutron is what quantum particle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2152 wd:Q2348 . ?sbj wdt:P31 wd:Q22675015 }","paraphrases":["The antiparticle of a neutron is what quantum particle?"],"info":{}}
