{"id":"train_3133","question":"What competes in Giorgio de Chirico given the candidate of Gerard Ernest Schneider?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q156622 wdt:P1344 ?answer . ?answer wdt:P710 wd:Q118431 }","paraphrases":["What competes in Giorgio de Chirico given the candidate of Gerard Ernest Schneider?"],"info":{}}
{"id":"train_3134","question":"When Anna Netrebko was awarded State Prize of the Russian Federation?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q78516 p:P166 ?s . ?s ps:P166 wd:Q4146631 . ?s pq:P585 ?value }","paraphrases":["The State Prize of the Russian Federation was awarded to Anna Netrebko on what date?"],"info":{}}
{"id":"train_3136","question":"What political party does Aung San Suu Kyi belong to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P488 wd:Q36740 . ?sbj wdt:P31 wd:Q7278 }","paraphrases":["What political party does Aung San Suu Kyi have a place"],"info":{}}
{"id":"train_3138","question":"In what field did Zubin Mehta receive the Padma Vibhushan award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q157635 p:P166 ?s . ?s ps:P166 wd:Q672392 . ?s pq:P101 ?value }","paraphrases":["Zubin Mehta won the Padma Vibhushan award for what area of work?"],"info":{}}
{"id":"train_3140","question":"Which dwarf elliptical galaxy for parent astronomical body of  Andromeda Galaxy","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P397 wd:Q2469 . ?sbj wdt:P31 wd:Q234077 }","paraphrases":["Which elliptical dwarf galaxy for Andromeda Galaxy's parent astronomical body"],"info":{}}
{"id":"train_3141","question":"Was Seinfeld characters Cosmo Kramer and Jackie Chiles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23733 wdt:P674 wd:Q2916792 . wd:Q23733 wdt:P674 wd:Q6116288 }","paraphrases":["Did Cosmo Kramer and Jackie Chilles belong as Seinfeld characters?"],"info":{}}
{"id":"train_3143","question":"Which award did Paul Heyse receive that earned him $140,703?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q76487 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter ( contains ( ?x , '140703.0' ) ) }","paraphrases":["What was the award that Paul Heyse got that earned him $140,703?"],"info":{}}
{"id":"train_3145","question":"What is the educational level of Joseph Koo, who has PIN Code 02215?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q698537 wdt:P69 ?answer . ?answer wdt:P281 ?x FILTER ( contains ( ?x , '02215' ) ) }","paraphrases":["What is the educational degree of Joseph Koo, who has PIN Code 02215?"],"info":{}}
{"id":"train_3146","question":"Which is the ZooBank nomenclatural act of Esox lucius?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q165278 wdt:P1746 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3150","question":"From when and until when was Charles I of England monarch of Scotland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q81506 p:P39 ?s . ?s ps:P39 wd:Q18810063 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["During what time period did Charles I rule Scotland?"],"info":{}}
{"id":"train_3151","question":"What are interdisciplinary science which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1665984 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What interdisciplinary science begins with letter t"],"info":{}}
{"id":"train_3152","question":"What id made from Sichuan pepper and has the taxon Zanthoxylum in it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q756800 wdt:P1582 ?answer . ?answer wdt:P171 wd:Q147050 }","paraphrases":["What I d has been made of Sichuan pepper and the Zanthoxylum taxon in it?"],"info":{}}
{"id":"train_3153","question":"What disputed territory in Levant is located on terrain feature?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P706 wd:Q81483 . ?sbj wdt:P31 wd:Q15239622 }","paraphrases":[],"info":{}}
{"id":"train_3155","question":"WHICH IS THE PLACE OF DEATH OF LAS VEGAS","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P20 wd:Q23768 }","paraphrases":[],"info":{}}
{"id":"train_3156","question":"Name the terminal point for Bruges.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P609 wd:Q12994 . ?sbj wdt:P31 wd:Q12284 }","paraphrases":["Title the terminal point for Bruges."],"info":{}}
{"id":"train_3157","question":"Which is the bibliography for the list of works of Jessica Lange?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q173585 wdt:P1455 ?obj . ?obj wdt:P31 wd:Q1631107 }","paraphrases":["Which is the reference index for the list of works of Jessica Lange?"],"info":{}}
{"id":"train_3158","question":"What is the circle of Cornelius Jansen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1776 wd:Q318943 }","paraphrases":[],"info":{}}
{"id":"train_3160","question":"What is the gender of Sancho Panza, who is often confused with being a man?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q630823 wdt:P21 ?answer . ?answer wdt:P1889 wd:Q8441 }","paraphrases":["What is the sex of Sancho Panza, who is regularly befuddled with being a man?"],"info":{}}
{"id":"train_3161","question":"\"What is {set in the location} of {The Boondocks}, that has the {timeline of topic} in the {History of Chicago} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2456777 wdt:P840 ?answer . ?answer wdt:P2184 wd:Q3031135 }","paraphrases":["\"What is {set in the location} of {The Boondocks}, that has the {timeline of topic} in the {History of Chicago} ?\""],"info":{}}
{"id":"train_3162","question":"What is the name of the larger taxonomic group that includes budgerigar but is also commonly known and conflated with budgerigar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q121221 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'Budgerigar' ) ) }","paraphrases":["What is the name of the large taxonomic crew that consists of budgerigar but is also commonly regarded and conflated with budgerigar?"],"info":{}}
{"id":"train_3163","question":"What is the chemical compound of the drug used to treat bipolar disorder","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2175 wd:Q131755 . ?sbj wdt:P31 wd:Q11173 }","paraphrases":["What is the drug's chemical compound used to treat bipolar disorder?"],"info":{}}
{"id":"train_3167","question":"Did the disciple Zeno of Citium die in 1-1-232?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q171303 wdt:P802 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( ?x , '-232-1-1' ) ) }","paraphrases":["Did the follower Zeno of Citium pass on in 1-1-232?"],"info":{}}
{"id":"train_3168","question":"what are the country of citizenship, occupation of Steven_Tyler?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q194045 wdt:P27 ?ans_1 . wd:Q194045 wdt:P106 ?ans_2 }","paraphrases":["what are the nation of citizenship, occupation of Steven_Tyler?"],"info":{}}
{"id":"train_3169","question":"In Harry Potter, what does the term pureblood mean?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8337 wdt:P674 ?obj . ?obj wdt:P31 wd:Q12372870 }","paraphrases":["What does the term pureblood mean in Harry Potter?"],"info":{}}
{"id":"train_3170","question":"Tell me slave rebellion whose name have the word war in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1155622 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'war' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me slave revolt whose identify have the word struggle in their title"],"info":{}}
{"id":"train_3171","question":"Is the lower flammable limit of the hydrogen cyanide equal to 5.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q26075 wdt:P2202 ?obj filter ( ?obj = 5.6 ) }","paraphrases":["Is the lower combustible restrain of the hydrogen cyanide break even with to 5.6?"],"info":{}}
{"id":"train_3172","question":"Does the number of injured of the Monbar Hotel attack equals 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q15255064 wdt:P1339 ?obj filter ( ?obj = 1 ) }","paraphrases":["Were there injuries at the Monbar Hotel attack?"],"info":{}}
{"id":"train_3173","question":"Which male character is played by a woman in Faust?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q29478 wdt:P674 ?answer . ?answer wdt:P21 wd:Q6581097 }","paraphrases":["Which male character is played by a lady in Faust?"],"info":{}}
{"id":"train_3174","question":"what is geographic region that starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q82794 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'š' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is geographic area that begins with s"],"info":{}}
{"id":"train_3175","question":"Mount Rushmore is in what mountain range?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q83497 wdt:P4552 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3177","question":"who is the art movement for movement of John Cage?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q180727 wdt:P135 ?obj . ?obj wdt:P31 wd:Q968159 }","paraphrases":["who is the craftsmanship development for development of John Cage?"],"info":{}}
{"id":"train_3180","question":"When was the birth date and death date of Prince Augustus,  son of Frederick William of Prussia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q50922 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["When was the son of Frederick William of Prussia, Prince Augustus, born; and when did he die?"],"info":{}}
{"id":"train_3183","question":"Name azane that contain the word \"hydrazine\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4832226 . ?sbj wdt:P4952 wd:Q51139288 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hydrazine' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name azane that contain \"hydrazine\" in its name ?"],"info":{}}
{"id":"train_3184","question":"Who was the spouse of Myrna Loy in 1944?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q105941 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1944' ) ) }","paraphrases":["Who was the wife of Myrna Loy in 1944?"],"info":{}}
{"id":"train_3186","question":"Tell me which is the agricultural deity which starts with the letter s?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24284226 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know which is the rural divinity which begins with the letter s?"],"info":{}}
{"id":"train_3187","question":"Where is the capital that is adjacent to the Rewari district?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2301759 wdt:P47 ?X . ?X wdt:P36 ?answer }","paraphrases":["What is the capital adjacent to the Rewari district?"],"info":{}}
{"id":"train_3188","question":"Who is nominated  for Stagecoach as W. Franke Harling","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q50714 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q331123 }","paraphrases":["Name of actor who played W.Franke Harling in Stagecoach`"],"info":{}}
{"id":"train_3189","question":"When was Clement Attlee elected as the Member of the 38th Parliament of the United Kingdom and why did his term end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q129006 p:P39 ?s . ?s ps:P39 wd:Q41582597 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["When was Forbearing Attlee chosen as the Part of the 38th Parliament of the Joined together Kingdom and why did his term conclusion?"],"info":{}}
{"id":"train_3190","question":"What is the { time point } for { Karl Malone } as { All - NBA Team }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q199896 p:P166 ?s . ?s ps:P166 wd:Q674359 . ?s pq:P585 ?value }","paraphrases":["The duration of Karl Malones All NBA team selection?"],"info":{}}
{"id":"train_3191","question":"What did Jacques Lacan study in the year 1919?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q169906 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1919' ) ) }","paraphrases":["What did Jacques Lacan think about within the year 1919?"],"info":{}}
{"id":"train_3192","question":"Can you describe the state of Hagia Sophia in 1931?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12506 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1931' ) ) }","paraphrases":["What was Hagia Sophia's state in 1931?"],"info":{}}
{"id":"train_3193","question":"Tell me the federal states that starts with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43702 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me the federal states that begins with the letter s"],"info":{}}
{"id":"train_3195","question":"Mention the county seat of Erfurt","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1729 wdt:P1376 ?X . ?X wdt:P1365 ?answer }","paraphrases":["Specify the district situate of Erfurt"],"info":{}}
{"id":"train_3196","question":"What animal makes the most sound on drugs?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12140 . ?ent wdt:P2075 ?obj . ?ent wdt:P703 wd:Q15978631 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["When drugged, which animal produces the most noise?"],"info":{}}
{"id":"train_3198","question":"Name the asteroid belonging to an asteroid belt with the highest mean anomaly.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2325 ?obj . ?ent wdt:P196 wd:Q2179 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Title the space rock having a place to an space rock belt with the most elevated cruel anomaly."],"info":{}}
{"id":"train_3199","question":"Tell me  meteorological phenomenon   whose name has the word WIND IN IT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16332653 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wind' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the weather phenomenon whose name is WIND IN IT"],"info":{}}
{"id":"train_3201","question":"What are the prediction which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q748250 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the prediction that begins with the letter s"],"info":{}}
{"id":"train_3203","question":"From when and until when did Alfred Marshall reside in Marshall House, Cambridge?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q13529 p:P551 ?s . ?s ps:P551 wd:Q6773623 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["From when and till when did Alfred Marshall live in Marshall House, Cambridge?"],"info":{}}
{"id":"train_3204","question":"How many notable works did Muriel Spark create?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q233956 wdt:P800 ?obj }","paraphrases":["Muriel Spark created what number of notable works?"],"info":{}}
{"id":"train_3205","question":"Which is the takeoff roll for Typhoon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q151384 wdt:P2430 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3207","question":"When was Team Fortress 2 (retail distribution) published?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q382108 p:P577 ?s . ?s ps:P577 ?obj . ?s pq:P437 wd:Q7316614 }","paraphrases":["What date was Team Fortress 2 published?"],"info":{}}
{"id":"train_3208","question":"How many fields of work were there in the middle ages?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P101 wd:Q12554 }","paraphrases":["What is the number of professions in the middle ages?"],"info":{}}
{"id":"train_3210","question":"What is the level of taxon of the Dioscorea cubijensis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55846241 wdt:P171 ?X . ?X wdt:P1672 ?answer }","paraphrases":["What is the level of taxon of the Dioscorea cubijensis?"],"info":{}}
{"id":"train_3214","question":"What is {award received} of {Brno} where {point in time} is {2008-0-0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q14960 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2008' ) ) }","paraphrases":["What award did Brno receive?"],"info":{}}
{"id":"train_3215","question":"What is Chris Hansen's mother tongue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q562448 wdt:P103 ?answer . ?answer wdt:P2989 wd:Q131105 }","paraphrases":["What is Chris Hansen's mother tongue?"],"info":{}}
{"id":"train_3217","question":"Who is the member of the political party and also the participant of Fedor Emelianenko?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q205953 wdt:P102 ?ans_1 . wd:Q205953 wdt:P1344 ?ans_2 }","paraphrases":["What Russian political leader is a huge supporter of Fedor Emelianenko?"],"info":{}}
{"id":"train_3221","question":"Who written the prequel of The Structures of Everyday Life?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55399602 wdt:P156 ?X . ?X wdt:P50 ?answer }","paraphrases":["Who's the author of the prequel of The Structures of Everyday Life?"],"info":{}}
{"id":"train_3222","question":"Tell me news magazine whose name has the word weekly in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1684600 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'weekly' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which news magazine has the word weekly in it?W"],"info":{}}
{"id":"train_3223","question":"Which is the ASMP member ID of Jean Tirole?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q173994 wdt:P5362 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3224","question":"Name the Character role played by Yunjin Kim as a cast in Lost?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23567 p:P161 ?s . ?s ps:P161 wd:Q229389 . ?s pq:P453 ?value }","paraphrases":["What character did Yunjin Kim play as a member of the cast of Lost?"],"info":{}}
{"id":"train_3226","question":"What is the voting round with the  maximum number of abstentions whose office contested is State Vice Governor of Brazil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q24097670 . ?ent wdt:P5043 ?obj . ?ent wdt:P541 wd:Q51334165 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What voting round in Brazil had the maximum number of abstentions?"],"info":{}}
{"id":"train_3227","question":"What is the railway that was formed in Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P740 wd:Q90 . ?sbj wdt:P31 wd:Q2324835 }","paraphrases":["What is the Paris - built railway?"],"info":{}}
{"id":"train_3230","question":"Which is a fictional universe described in Bleach?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1445 wd:Q904 }","paraphrases":[],"info":{}}
{"id":"train_3231","question":"Mobutu Sese Seko is the chairperson for which political party?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P488 wd:Q164535 . ?sbj wdt:P31 wd:Q7278 }","paraphrases":["Which political party has a chairperson named Mobuto Sese Seko?"],"info":{}}
{"id":"train_3232","question":"When was the language of the digital signal processor created?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q106370 wdt:P277 ?X . ?X wdt:P571 ?answer }","paraphrases":["List the date the language of digital signal processor was discovered."],"info":{}}
{"id":"train_3234","question":"How many sports are for the {draughts} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P641 wd:Q1293 }","paraphrases":["Draughts have how many sports?"],"info":{}}
{"id":"train_3235","question":"How can you tell Bari has a population of 324198?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3519 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '324198.0' ) ) . ?s pq:P459 ?value }","paraphrases":["The population of Bari has a population of 324198, but how can you tell?"],"info":{}}
{"id":"train_3236","question":"What is the beginnig for Fritz Walter as a member from Germany football player?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q22717 p:P54 ?s . ?s ps:P54 wd:Q43310 . ?s pq:P580 ?value }","paraphrases":["Give me the date Fritz Walter began as a member from Germany football player."],"info":{}}
{"id":"train_3238","question":"What is the reason for Sophocles death on January 1st, 405 BCE?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7235 p:P570 ?s . ?s ps:P570 ?x filter ( contains ( ?x , '-405-1-1' ) ) . ?s pq:P31 ?value }","paraphrases":["what is the cause for Sophocles dying on January 1st, 405 BCE?"],"info":{}}
{"id":"train_3240","question":"\"Which exchange of Nokia, is shown in Die Hard with a Vengeance?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1418 wdt:P414 ?answer . ?answer wdt:P1441 wd:Q106871 }","paraphrases":["\"Which trade of Nokia, is appeared in Kick the bucket Difficult with a Vengeance?\""],"info":{}}
{"id":"train_3241","question":"Which cultural area has the lowest total imports from the significant event Harrying of the North","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q518261 . ?ent wdt:P2136 ?obj . ?ent wdt:P793 wd:Q1703402 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Name the cultural area that has the lowest total imports after the infamous event Harry of the North."],"info":{}}
{"id":"train_3242","question":"What is Stephen Hawkins doctoral thesis","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q17714 wdt:P1026 ?obj . ?obj wdt:P31 wd:Q187685 }","paraphrases":["What was the name of Stephen Hawkins doctoral thesis?"],"info":{}}
{"id":"train_3244","question":"who madhhab for religion of druze?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q163943 wdt:P140 ?obj . ?obj wdt:P31 wd:Q209928 }","paraphrases":["who madhhab for religion of druze?"],"info":{}}
{"id":"train_3245","question":"When Vin Diesel, with its net worth estimate 1.9e+08, started?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q178166 p:P2218 ?s . ?s ps:P2218 ?x filter ( contains ( ?x , '1.9e+08' ) ) . ?s pq:P585 ?value }","paraphrases":["On what date did Vin Diesel with its net worth estimate 1.9e+08 started?"],"info":{}}
{"id":"train_3248","question":"Is the number of perpetrators of the Gladbeck hostage crisis equal to 3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q896727 wdt:P3886 ?obj filter ( ?obj = 3 ) }","paraphrases":["Is Gladbeck hostage's perpetrators 3?"],"info":{}}
{"id":"train_3249","question":"Znin is adjacent to Dusseldorg as they are twin cities.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1718 wdt:P47 ?answer . ?answer wdt:P190 wd:Q324941 }","paraphrases":["What nearby city is the twin of Dusseldorg?"],"info":{}}
