{"id":"train_20803","question":"Is the luminous intensity of Alte Weser 424000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q436392 wdt:P3041 ?obj filter ( ?obj = 424000 ) }","paraphrases":["Is 424000 the luminous intensity of Alte weser?"],"info":{}}
{"id":"train_20804","question":"Jeannette Rankin is responsible for heading what?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q232407 wdt:P102 ?X . ?X wdt:P488 ?answer }","paraphrases":["Jeannette Rankin is dependable for heading what?"],"info":{}}
{"id":"train_20805","question":"Who was the student of Johann Wolfgang von Goethe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P802 wd:Q5879 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who were Johann Wolfgang von Goethe's students?"],"info":{}}
{"id":"train_20809","question":"What is Stephen Hillenburg's middle name, that is that same as Stefan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q318750 wdt:P735 ?answer . ?answer wdt:P460 wd:Q17496650 }","paraphrases":["What is Stephen Hillenburg's middle name, that is that equal as Stefan?"],"info":{}}
{"id":"train_20810","question":"What are the film studio which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q39816 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'valley' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the film studio which begin with the letter s"],"info":{}}
{"id":"train_20811","question":"Who is Isadora Duncan's mother?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P25 wd:Q483512 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is the name of Isadora Duncan's mother?"],"info":{}}
{"id":"train_20812","question":"Tell me machine learning whose name has the word ml in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2539 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ml' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me about learning the machine whose name contains the word ml."],"info":{}}
{"id":"train_20814","question":"Is the surface tension of acetic acid less than 32.52?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47512 wdt:P3013 ?obj filter ( ?obj < 32.52 ) }","paraphrases":["Is the surface tension of acetic acid lower than 32.52?"],"info":{}}
{"id":"train_20815","question":"When did Aktobe become head of government instead of Bekbol Saghyn?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q477232 p:P6 ?s . ?s ps:P6 wd:Q21232760 . ?s pq:P582 ?value }","paraphrases":["On which date did Aktobe replace Bekbol Saghyn as head of government?"],"info":{}}
{"id":"train_20817","question":"What is the NMHH film rating of 'Singin' in the Rain'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q309153 wdt:P2363 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20818","question":"What what is system   follows Ediacaran and also which starts with letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q403523 . ?sbj wdt:P155 wd:Q188654 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the system that follows Ediacaran and whose name begins with alphabet C."],"info":{}}
{"id":"train_20819","question":"what is the field of profession of Eileen R. L. Reed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34823585 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["what is the field of calling of Eileen R. L. Reed?"],"info":{}}
{"id":"train_20820","question":"What is the catchment area located in the river mouth of the Chari River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q135477 wdt:P403 ?X . ?X wdt:P4614 ?answer }","paraphrases":["Which catchment area is located in the Chari River's mouth."],"info":{}}
{"id":"train_20821","question":"What is the longest bridge that crosses the Schuylkill River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12570 . ?ent wdt:P1314 ?obj . ?ent wdt:P177 wd:Q605122 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the name of the longest bridge that crosses the Schuylkill River?"],"info":{}}
{"id":"train_20822","question":"What is confused with altitude having symbol h?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190200 wdt:P1889 ?answer . ?answer wdt:P416 ?x FILTER ( contains ( ?x , 'h' ) ) }","paraphrases":["What is confounded with elevation having image h?"],"info":{}}
{"id":"train_20823","question":"What is David Bowie's album?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P162 wd:Q5383 . ?sbj wdt:P31 wd:Q482994 }","paraphrases":["What is the album of David Bowie?"],"info":{}}
{"id":"train_20824","question":"What company does Warren Buffett work for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P169 wd:Q47213 . ?sbj wdt:P31 wd:Q783794 }","paraphrases":["What company does Warren Buffett work for?"],"info":{}}
{"id":"train_20828","question":"Mention the genetic codon enlisted in the L-Arginine","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q173670 wdt:P702 ?obj . ?obj wdt:P31 wd:Q165052 }","paraphrases":["Say the hereditary codon enrolled within the L-Arginine"],"info":{}}
{"id":"train_20830","question":"na","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q201477 p:P39 ?s . ?s ps:P39 wd:Q1282146 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["na"],"info":{}}
{"id":"train_20833","question":"What amount of money did Luc Montagnier receive as a prize for the Nobel Prize in Physiology or Medicine?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q103598 p:P166 ?s . ?s ps:P166 wd:Q80061 . ?s pq:P2121 ?value }","paraphrases":["Luc Montagnier received what amount of money as a prize for the Nobel Prize in Physiology or Medicine?"],"info":{}}
{"id":"train_20834","question":"Does Harvard University own Harvard Museum of Natural History?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13371 wdt:P1830 wd:Q2001855 }","paraphrases":["Is it true that Harvard University owns Harvard Museum of Natural History?"],"info":{}}
{"id":"train_20835","question":"What village does Rotterdam share the border with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q34370 . ?sbj wdt:P31 wd:Q532 }","paraphrases":["What town does Rotterdam share the border with?"],"info":{}}
{"id":"train_20836","question":"How many burial places are in Egypt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P119 wd:Q79 }","paraphrases":["Egypt has how many burial places?"],"info":{}}
{"id":"train_20838","question":"Which is {managed by} {cosmonaut mission} of {Oleg Novitskiy} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q963226 wdt:P450 ?X . ?X wdt:P137 ?answer }","paraphrases":["Which is {overseen by} {cosmonaut mission} of {Oleg Novitskiy} ?"],"info":{}}
{"id":"train_20841","question":"What is the country club with the lowest slope located in New Jersey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2022036 . ?ent wdt:P3840 ?obj . ?ent wdt:P131 wd:Q1408 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the country club with the lowest slope settled down in New Jersey?"],"info":{}}
{"id":"train_20842","question":"What is the prevalence of gout in developing countries?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q133087 p:P1193 ?s . ?s ps:P1193 ?obj . ?s pq:P276 wd:Q132453 }","paraphrases":["How common is gout in developing nations?"],"info":{}}
{"id":"train_20845","question":"Was Cuban_Missile_Crisis participant United States of America and Soviet Union ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q128160 wdt:P710 wd:Q30 . wd:Q128160 wdt:P710 wd:Q15180 }","paraphrases":["Were the United States and Soviet Union the two countries involved in the Cuban Missile Crisis?"],"info":{}}
{"id":"train_20846","question":"Tell me me a province of China whose name consist of the word \"woman\" and whose  category for films shot at this location Category:Films shot in Sichuan sichuan","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1615742 . ?sbj wdt:P1740 wd:Q19359106 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sichuan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know me a territory of China whose title comprise of the word \"lady\" and whose category for movies shot at this area Category:Films shot in Sichuan sichuan"],"info":{}}
{"id":"train_20849","question":"What is the vallis with the largest diamater and located in the hellas quadrangle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2249285 . ?ent wdt:P2386 ?obj . ?ent wdt:P276 wd:Q3054539 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Within the hellas quadrangle, what is the vallis with the largest diameter?"],"info":{}}
{"id":"train_20851","question":"What award was received by Frank Capra in 1982?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q51492 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1982' ) ) }","paraphrases":["Frank Capra received what ward in 1982?"],"info":{}}
{"id":"train_20853","question":"Who is {role model} of {writers} {Railsea} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7284118 wdt:P50 ?X . ?X wdt:P737 ?answer }","paraphrases":["Who is {part show} of {journalists} {Railsea} ?"],"info":{}}
{"id":"train_20854","question":"When Ali Khamenei started as Supreme Leader of Iran?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q57336 p:P39 ?s . ?s ps:P39 wd:Q332486 . ?s pq:P580 ?value }","paraphrases":["At what point did Ali Khamenei become Iran's Supreme Leader?"],"info":{}}
{"id":"train_20856","question":"What award did Elias Canetti receive in 1980?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q80064 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["Which award did Elias Canetti win in 1980?"],"info":{}}
{"id":"train_20857","question":"How many occupations are in the field of art history?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P425 wd:Q50637 }","paraphrases":["In the field of art history how many occupations are there?"],"info":{}}
{"id":"train_20858","question":"Which is conferred by of Tony Award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q191874 wdt:P1027 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20860","question":"What is stoicism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P135 wd:Q48235 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is stoicism?"],"info":{}}
{"id":"train_20863","question":"How many children do Jean le Rond D'Alembert have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P40 wd:Q153232 }","paraphrases":["Jean le Rond D'alembert has how many children?"],"info":{}}
{"id":"train_20864","question":"Which is the Adult Film Database person ID for Nacho Vidal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1255380 wdt:P3351 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20865","question":"Which attack had the largest number of perpetrators?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q81672 . ?ent wdt:P3886 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What attack had the most attackers?"],"info":{}}
{"id":"train_20866","question":"What award did Daniel McFadden receive and with whom did he receive it?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q312560 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 ?value1 . }","paraphrases":["What grant did Daniel McFadden get and with whom did he get it?"],"info":{}}
{"id":"train_20867","question":"what is the unit of length that starts with 'y' and that measures the physical quantity in length.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1978718 . ?sbj wdt:P111 wd:Q36253 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is the unit of length that begins with 'y' and that measures the bodily volume in length."],"info":{}}
{"id":"train_20869","question":"The Smithsonian Institution is the parent organization of which art museum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P749 wd:Q131626 . ?sbj wdt:P31 wd:Q207694 }","paraphrases":["The Smithsonian Institution is the parent organization of which craftsmanship museum?"],"info":{}}
{"id":"train_20870","question":"Which is the state or insular area capital in the United States that contains the word trenton in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21518270 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trenton' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the state or island capital of the U.S. that contains the word trenton in its name?"],"info":{}}
{"id":"train_20872","question":"What is the royal title of Louis the Pious and who followed his reign.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 ?value1 . }","paraphrases":["What's the royal title of Louis the Pious and who succeeded him?"],"info":{}}
{"id":"train_20873","question":"What is used to save Jonah Lomu from murder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q363717 wdt:P509 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What is utilized to spare Jonah Lomu from murder?"],"info":{}}
{"id":"train_20875","question":"What is the ethnic background of Mesrop Mashtots?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q104804 wdt:P172 ?X . ?X wdt:P140 ?answer }","paraphrases":["What is Mesrop Mashtots ' ethnic background?"],"info":{}}
{"id":"train_20876","question":"Who co-founded the prize that was awarded to Alfred Charles Ernest Franquet de Franqueville?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2835014 wdt:P166 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who co-founded the prize that was granted to Alfred Charles Ernest Franquet de Franqueville?"],"info":{}}
{"id":"train_20878","question":"Who are the characters in the remake of Dante XXI?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q307363 wdt:P144 ?X . ?X wdt:P674 ?answer }","paraphrases":["Who are the characters in the redo of Dante XXI?"],"info":{}}
{"id":"train_20879","question":"Which country has the currency Japanese yen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P38 wd:Q8146 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":[],"info":{}}
{"id":"train_20881","question":"Was Tim Burton's partner Lisa Marie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q56008 wdt:P451 wd:Q242015 }","paraphrases":["Was Tim Burton's married to Lisa Marie?"],"info":{}}
{"id":"train_20882","question":"Tell me the municipality of Norway that contains the word øyer in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q755707 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'øyer' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the municipality of Norway that consists of the word øyer in their title"],"info":{}}
{"id":"train_20883","question":"What is the twinned administrative body for the sovereign state of Auckland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q37100 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["What is the twinned regulatory body for the paramount state of Auckland?"],"info":{}}
{"id":"train_20884","question":"Which actor played Dana Scully in The X-Files?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2744 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q2741 }","paraphrases":["In the X-Files, what actor played Dana Scully?"],"info":{}}
{"id":"train_20885","question":"What organization applies to the European Parliament?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8889 wdt:P1001 ?obj . ?obj wdt:P31 wd:Q4120211 }","paraphrases":["What organization is applicable to the European Parliament?"],"info":{}}
{"id":"train_20887","question":"What are the borders of Northamptonshire, whose namesake is Leicester?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23115 wdt:P47 ?answer . ?answer wdt:P138 wd:Q83065 }","paraphrases":["What are the borders of Northamptonshire, whose namesake is Leicester"],"info":{}}
{"id":"train_20889","question":"What is the language used in Barbados?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q244 wdt:P2936 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20890","question":"What are the software companies  that contain the word \"xanalys\" in their names ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1058914 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'xanalys' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which are the software companies that contain word \"xanalys\" in their names?"],"info":{}}
{"id":"train_20891","question":"TELL ME SERIES OF CREATIVE WORKS WHOSE NAME HAS THE WORD SERIES IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7725310 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'series' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME SERIES OF CREATIVE WORKS WHOSE NAME HAS THE WORD SERIES IN IT."],"info":{}}
{"id":"train_20892","question":"What is the population of Jervis Bay Territory, a state suburb?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q15577 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P518 wd:Q33112019 }","paraphrases":["What is the population of the state suburb Jervis Bay Territory?"],"info":{}}
{"id":"train_20893","question":"What is started in and competes of Mike Powell ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q271952 wdt:P1344 ?X . ?X wdt:P580 ?answer }","paraphrases":["What is begun in and competes of Mike Powell ?"],"info":{}}
{"id":"train_20894","question":"What   type of taxon of taxon parent of Picozoa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10640455 wdt:P171 ?X . ?X wdt:P105 ?answer }","paraphrases":["What sort of taxon of taxon parent of Picozoa?"],"info":{}}
{"id":"train_20897","question":"When did Creative Assembly develop Halo?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1747150 p:P178 ?s . ?s ps:P178 wd:Q611508 . ?s pq:P585 ?value }","paraphrases":["What was the date when Halo was made by Creative Assembly?"],"info":{}}
{"id":"train_20898","question":"When was the 'OkayAfrica 100 Women' award received by Chimamanda Ngozi Adichie?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q230141 p:P166 ?s . ?s ps:P166 wd:Q54889438 . ?s pq:P585 ?value }","paraphrases":["Chimamanda Ngozi Adichie received the 'OkayAfrica 100 Women' award when?"],"info":{}}
{"id":"train_20899","question":"Which is the nLab ID for module?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q18848 wdt:P4215 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20900","question":"What academic discipline did Nubia study","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q135028 wdt:P2579 ?obj . ?obj wdt:P31 wd:Q11862829 }","paraphrases":["What did Nubia study?"],"info":{}}
{"id":"train_20901","question":"Which is the Christian holy day that follows the Shrove Tuesday and contains the word ash in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60075825 . ?sbj wdt:P155 wd:Q4845365 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ash' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the Christian holy day that follows the Shrove Tuesday and carries the word ash in it is name?"],"info":{}}
{"id":"train_20903","question":"Which is the Universal Decimal Classification for Christianity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5043 wdt:P1190 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20904","question":"For which determination method does Charlotte have a population of 2265 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16565 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '2265.0' ) ) . ?s pq:P459 ?value }","paraphrases":["Charlotte has a population of 2265 according to which determination?"],"info":{}}
{"id":"train_20906","question":"What did the Kingdom of Bohemia use before 1584?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q42585 p:P571 ?s . ?s ps:P571 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["Before 1584, what did the Kingdomf of Bohemia use?"],"info":{}}
{"id":"train_20907","question":"When was Chita Rivera nominated for the Tony Award for Best Actress in a Musical?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q450918 p:P1411 ?s . ?s ps:P1411 wd:Q1537996 . ?s pq:P585 ?value }","paraphrases":["The nomination for the Tony Award for Best Actress in a Musical was given to Chita Rivera on what date?"],"info":{}}
{"id":"train_20910","question":"what name is given to the day Monday is named after?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q105 p:P138 ?s . ?s ps:P138 wd:Q200 . ?s pq:P407 ?value }","paraphrases":["What is Monday named after?"],"info":{}}
{"id":"train_20912","question":"Where the human place of burial of Venice?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P119 wd:Q641 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Where the human put of burial of Venice?"],"info":{}}
{"id":"train_20913","question":"What award did Belinda Clark receive on June 8 2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3195953 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["Which is the award that Belinda Clark received in 2000?"],"info":{}}
{"id":"train_20915","question":"Where was Lyudmila Pavlichenko start being educated at in the year 1937?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q145065 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1937' ) ) }","paraphrases":["Where did Lyudmila Pavlinchenko begin school at in 1937?"],"info":{}}
{"id":"train_20916","question":"How many voice actors participated in the Futurama} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q73622 wdt:P725 ?obj }","paraphrases":["How many people voiced characters in Futurama?"],"info":{}}
{"id":"train_20917","question":"Which are the lake inflows for Yellowstone River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P200 wd:Q374772 }","paraphrases":[],"info":{}}
{"id":"train_20918","question":"Who is the role model of philanthropist Tarkan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q485771 wdt:P737 ?answer . ?answer wdt:P106 wd:Q12362622 }","paraphrases":["Who is the role model of philanthropist Tarkan?"],"info":{}}
