{"id":"train_11104","question":"Which is the chemical substance which starts with the letter z?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q79529 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["GIVE ME THE CHEMICAL SUBSTANCE THAT STARTS WITH THE LETTER Z"],"info":{}}
{"id":"train_11105","question":"Is the vapor pressure of ethylene glycol monoethyl ether 4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q209381 wdt:P2119 ?obj filter ( ?obj = 4 ) }","paraphrases":["Is the vapor weight of ethylene glycol monoethyl ether 4?"],"info":{}}
{"id":"train_11109","question":"Chinese is written is which logographic system?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7850 wdt:P282 ?obj . ?obj wdt:P31 wd:Q3953107 }","paraphrases":["Chinese is composed is which logographic system?"],"info":{}}
{"id":"train_11110","question":"WHAT IS THE SOFTWARE QUALITYN ASSURANCE OF BITCOIN","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q131723 wdt:P2992 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11112","question":"Where is the birth place of Andrew W. Mellon located at 40.44062 -79.99589?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q446858 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '40.44062 -79.99589' ) ) }","paraphrases":["Where is Andrew W. Mellon's birthplace at 40.44062 -79.99589?"],"info":{}}
{"id":"train_11113","question":"Tell me production company whose name has the word tellfilm in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1762059 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tellfilm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know generation company whose title has the word tellfilm in it."],"info":{}}
{"id":"train_11114","question":"What was Wojciech Jaruzelski's name in the first series?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q55834 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '1' ) ) }","paraphrases":["In the first season what was Wojciech Jaruzelski's name?"],"info":{}}
{"id":"train_11117","question":"Is Paul the Apostle most significant event conversion of Paul the Apostle and Dumb Ways to Die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9200 wdt:P793 wd:Q901397 . wd:Q9200 wdt:P793 wd:Q58120 }","paraphrases":["What is the most significant event in the life of Paul the Apostle?"],"info":{}}
{"id":"train_11120","question":"Name a road in Karachi.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q8660 . ?sbj wdt:P31 wd:Q34442 }","paraphrases":[],"info":{}}
{"id":"train_11121","question":"IS THE MAXIMUM CAPACITY OF THE SZD 50 PUCHARCZ EQUALS 1.6","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9375 wdt:P1083 ?obj filter ( ?obj = 1.6 ) }","paraphrases":["IS THE EQUAL MAXIMUM OF THE SZD 50 PUCHARCZ 1.6"],"info":{}}
{"id":"train_11123","question":"which ensemble starts with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1497375 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which gathering begins with the letter u"],"info":{}}
{"id":"train_11125","question":"WHAT ARE THE PERIODIZATION  WHICH START WITH THE LETTER W.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q816829 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE PERIODIZATION OF THE LETTER W."],"info":{}}
{"id":"train_11126","question":"What is the production process of medium grog?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q492554 wdt:P186 ?X . ?X wdt:P2079 ?answer }","paraphrases":["How is medium grog produced?"],"info":{}}
{"id":"train_11127","question":"How many times has Team Fortress 2 been distributed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q382108 wdt:P437 ?obj }","paraphrases":["Team Fortress 2 was distributed what number of times?"],"info":{}}
{"id":"train_11129","question":"What characters in Nabucco sing as sopranos?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q202230 p:P674 ?s . ?s ps:P674 ?obj . ?s pq:P412 wd:Q30903 }","paraphrases":["In Nabucco, which characters sing as sopranos?"],"info":{}}
{"id":"train_11130","question":"What is the partner town of Bogota, which is also Enrique Inglesias's location of birth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q47122 wdt:P19 ?answer . ?answer wdt:P190 wd:Q2841 }","paraphrases":["What is the accomplice town of Bogota, which is additionally Enrique Inglesias's region of birth?"],"info":{}}
{"id":"train_11131","question":"What is the astronomical filter for Messier 7 has apparent magnitude as 3.3?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11234 p:P1215 ?s . ?s ps:P1215 ?x filter ( contains ( ?x , '3.3' ) ) . ?s pq:P1227 ?value }","paraphrases":["What is the galactic channel for Messier 7 has clear greatness as 3.3?"],"info":{}}
{"id":"train_11134","question":"Who gave the  {sector} of {developed by} of {Ms. Pac-Man} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2141683 wdt:P178 ?X . ?X wdt:P452 ?answer }","paraphrases":["Who are the inhabitants that comes from of Misplaced"],"info":{}}
{"id":"train_11135","question":"What award was Insaaf Ka Tarazu nominated for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11000078 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What grant was Insaaf Ka Tarazu designated for?"],"info":{}}
{"id":"train_11137","question":"How many people depicted by the {Jesus Christ} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q302 wdt:P1299 ?obj }","paraphrases":["The Jesus Christ is depicted by how many people?"],"info":{}}
{"id":"train_11139","question":"What disciplines study Hebrew?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2578 wd:Q9288 . ?sbj wdt:P31 wd:Q11862829 }","paraphrases":["What disciplines think about Hebrew?"],"info":{}}
{"id":"train_11142","question":"Which award did Toni Braxton get for his work in Love,Marriage and divorce","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q155412 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q16916554 }","paraphrases":["Award given to Toni Braxton for her work in Love, Marriage and Divorce."],"info":{}}
{"id":"train_11143","question":"Genghis Khan's noble family name is?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q720 wdt:P734 ?obj . ?obj wdt:P31 wd:Q13417114 }","paraphrases":["The noble family name of Genghis Khan is?"],"info":{}}
{"id":"train_11144","question":"Which article of Z-Boys features the film director Stacy Peralta?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q191378 wdt:P805 ?answer . ?answer wdt:P57 wd:Q465229 }","paraphrases":["Which article of Z-Boys features the film director Stacy Peralta?"],"info":{}}
{"id":"train_11145","question":"Is it true that Heath Ledger's ethnicity was Ulster Protestant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q40572 wdt:P172 wd:Q17017729 }","paraphrases":["Was Heath Ledger's ethnicity Ulster Protestant?"],"info":{}}
{"id":"train_11146","question":"what position did muammar al-gaddafi hold in 2010-1-31?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q19878 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2010' ) ) }","paraphrases":["What position did Muammar Al-Gaddafi have in 2010?"],"info":{}}
{"id":"train_11147","question":"What award did Jane Goodall receive in 2004?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q184746 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["In 2004, what award did Jane Goodall receive?"],"info":{}}
{"id":"train_11148","question":"For what country and position does Allen Iverson play?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q190094 wdt:P1532 ?ans_1 . wd:Q190094 wdt:P413 ?ans_2 }","paraphrases":["Which country does Allen Iverson compete for and which position does he play?"],"info":{}}
{"id":"train_11149","question":"Is the standard molar entropy of sodium greater than 61.44?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q658 wdt:P3071 ?obj filter ( ?obj > 61.44 ) }","paraphrases":["Does the standard molar entropy of sodium exceed 61.44?"],"info":{}}
{"id":"train_11151","question":"Tell me  a album whose name consist of the word wall and whose english is the language of work","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482994 . ?sbj wdt:P407 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wall' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me an album whose name is the word wall and whose English is the working language"],"info":{}}
{"id":"train_11152","question":"What are the invention which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18119757 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the invention which begin with the letter t"],"info":{}}
{"id":"train_11155","question":"Was Grover Cleveland President of the US and Governer of New york","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q35171 wdt:P39 wd:Q11696 . wd:Q35171 wdt:P39 wd:Q2347975 }","paraphrases":["Did Grover Cleveland serve as both Governor of New York and President of the United States?"],"info":{}}
{"id":"train_11156","question":"What type of quantum particle is the antiparticle of an electon.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2225 wdt:P2152 ?obj . ?obj wdt:P31 wd:Q22675015 }","paraphrases":["What kind of quantum particle is an electon's antiparticle."],"info":{}}
{"id":"train_11158","question":"What are the subculture which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q264965 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the subculture which begin with the letter t"],"info":{}}
{"id":"train_11161","question":"Name someone ilvolved in Battle of Verdun","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P607 wd:Q130847 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Title somebody ilvolved in Fight of Verdun"],"info":{}}
{"id":"train_11163","question":"Did Masaccio die before the statement of Gregorian","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5811 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["Was Masaccio dead before the statement of Gregorian?"],"info":{}}
{"id":"train_11165","question":"When did Scotland have a population of 5.3136e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q22 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '5.3136e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["What year was Scotland's census 5.3 million?"],"info":{}}
{"id":"train_11166","question":"What ilocation to takes part of Stanislav Cherchesov ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q699557 wdt:P1344 ?X . ?X wdt:P276 ?answer }","paraphrases":["What ilocation to takes portion of Stanislav Cherchesov ?"],"info":{}}
{"id":"train_11169","question":"Who was the person that was a student of Gustav Mahler?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1066 wd:Q7304 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was the individual that was a understudy of Gustav Mahler?"],"info":{}}
{"id":"train_11172","question":"How many games did Jock Stein play with Scottish Football League XI and how many goals did he score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q355378 p:P54 ?s . ?s ps:P54 wd:Q7437735 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["What is the number of games Jock Stein played with the Scottish Football League XI and what is the number of goals he scored?"],"info":{}}
{"id":"train_11173","question":"Google has how many distributors?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P750 wd:Q95 }","paraphrases":["How many distributors at google?"],"info":{}}
{"id":"train_11175","question":"Which part of Vistula has a co-ordinate location of 54.3641?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q548 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '54.3641' ) ) . ?s pq:P518 ?value }","paraphrases":["What area in Vistula has a co-ordinate location of 54.3641?"],"info":{}}
{"id":"train_11177","question":"What what is  female beauty pageant operating area by all countries which starts with letter m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58863414 . ?sbj wdt:P2541 wd:Q62900839 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is girl splendor pageant operating area by using all international locations which starts offevolved with letter m"],"info":{}}
{"id":"train_11178","question":"When was Gabriela Mistral nominated for the Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q80871 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["which year Gabriela Mistral nominated for the Nobel Prize in Literature?"],"info":{}}
{"id":"train_11179","question":"Tell me cell type whose name has the word reticulodyte in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q189118 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'reticulocyte' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know cell sort whose title has the word reticulodyte in it."],"info":{}}
{"id":"train_11181","question":"what is residence of don bluth that has start time of 1940-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q448957 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1940' ) ) }","paraphrases":["what was residence of don bluth that's start time is 1940-0-0?"],"info":{}}
{"id":"train_11182","question":"Tell me who follows Pepin the Short who has the title of king of Franks.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q81212 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Who received the title King of Franks after Pepin the Short?"],"info":{}}
{"id":"train_11184","question":"Who is the leader of Czechoslovakia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q33946 wdt:P35 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the pioneer of Czechoslovakia?"],"info":{}}
{"id":"train_11185","question":"When was Louis XVI of France divorced his spouse Marie Antoinette?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7732 p:P26 ?s . ?s ps:P26 wd:Q47365 . ?s pq:P582 ?value }","paraphrases":["What was the date when Louis XVI of France, and Marie Antoinette, got divorced?"],"info":{}}
{"id":"train_11188","question":"What's the LombardiaBeniCulturali building ID of the Milan Cathedral.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q18068 wdt:P3503 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11189","question":"In which electoral district did Henry Morton Stanley hold a position of Member of the 26th Parliament of the United Kingdom and why did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q171421 p:P39 ?s . ?s ps:P39 wd:Q41582573 . ?s pq:P768 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["In which constituent area did Henry Morton Stanley hold a position of Part of the 26th Parliament of the Joined together Kingdom and why did it end?"],"info":{}}
{"id":"train_11191","question":"What is the available observing time of a Very Large Telescope?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q265628 wdt:P3891 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11193","question":"What chemical phenomenon starts with the letter \"c\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3382117 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What chemical marvel begins with the letter \"c\"?"],"info":{}}
{"id":"train_11194","question":"Did The Empire Strikes Back feature Carrie Fisher and Jeremy Bulloch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q181795 wdt:P161 wd:Q108941 . wd:Q181795 wdt:P161 wd:Q2369237 }","paraphrases":["Did The Empire Strikes Back feature both Jeremy Bulloch and Carrie Fisher?"],"info":{}}
{"id":"train_11196","question":"What are the literary form which start with the letter Y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4263830 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which literary paper starts with \"y\"?"],"info":{}}
{"id":"train_11197","question":"Which country was part of the Austrian Empire until 1866?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131964 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1866' ) ) }","paraphrases":["Which countries were part of the Austrian Empire until 1866?"],"info":{}}
{"id":"train_11200","question":"Who is the alumna of Edward said that is in the province of Elizabeth","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q201538 wdt:P69 ?answer . ?answer wdt:P131 wd:Q138311 }","paraphrases":["Who is the alumna of Edward said that's within the territory of Elizabeth"],"info":{}}
{"id":"train_11205","question":"WHICH IS THE LAGUOID CLASS THAT CONTAINS THE WORD VARIETY IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28923954 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'variety' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE LAGUOID CLASS THAT CONTAINS THE WORD VARIETY IN THEIR NAME"],"info":{}}
{"id":"train_11206","question":"What kinds of airplanes do American Airlines operate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q32396 wdt:P121 ?obj . ?obj wdt:P31 wd:Q15056993 }","paraphrases":["What sorts of airplanes do American Carriers operate?"],"info":{}}
{"id":"train_11208","question":"what is the codon for L-Tyrosine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P688 wd:Q188017 . ?sbj wdt:P31 wd:Q165052 }","paraphrases":["What is L-Tyrosine's codon?"],"info":{}}
{"id":"train_11209","question":"When did Pearl S. Buck receive the Nobel Prize in Literature, and how much was the prize money?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q80900 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P585 ?value1 . ?s pq:P2121 ?value2 }","paraphrases":["Pearl S. Buck won the Nobel Prize in Literature when, and how much money along with it?"],"info":{}}
{"id":"train_11210","question":"Which is the Wimbledon player ID for Novak Djokovic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5812 wdt:P4503 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11212","question":"DOES THE DISCHARGE OF THE CONCA EQUALS 1.5","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q970873 wdt:P2225 ?obj filter ( ?obj = 1.5 ) }","paraphrases":["DOES THE Release OF THE CONCA Breaks even with 1.5"],"info":{}}
{"id":"train_11213","question":"who AMSL of principal place of Zaire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6500954 wdt:P36 ?X . ?X wdt:P2044 ?answer }","paraphrases":["What is the highest AMSL of Zaire?"],"info":{}}
{"id":"train_11217","question":"What day does Easter fall on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q47164206 . ?ent wdt:P1106 ?obj . ?ent wdt:P31 wd:Q47164206 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What day does Easter drop on?"],"info":{}}
{"id":"train_11218","question":"What is the class IC flammable liquid with the least ions attached to carbon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009056 . ?ent wdt:P2260 ?obj . ?ent wdt:P527 wd:Q623 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What IC class flammable liquid has the least amount of ions attached to carbon?"],"info":{}}
{"id":"train_11220","question":"Who replaces Gerhard Schröder as Federal Chancellor of Germany?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2530 p:P39 ?s . ?s ps:P39 wd:Q4970706 . ?s pq:P1365 ?value }","paraphrases":["Who became Federal Chancellor of Germany after Gerhard Schroder?"],"info":{}}
{"id":"train_11221","question":"What are the signs of trichloromonofluoromethane poisoning?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q423000 wdt:P1542 ?X . ?X wdt:P780 ?answer }","paraphrases":["Give me the symptons of trichloromonofluoromethane poisoning."],"info":{}}
{"id":"train_11223","question":"Who is the director and director of photography of Apocalypse Now?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q182692 wdt:P57 ?ans_1 . wd:Q182692 wdt:P344 ?ans_2 }","paraphrases":["Apocalypse Now was directed by who?"],"info":{}}
{"id":"train_11224","question":"Do humans use conversation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1535 wd:Q5 . ?sbj wdt:P31 wd:Q52943 }","paraphrases":["Do people utilize conversation?"],"info":{}}
{"id":"train_11225","question":"Where is the birthplace of Johann Gottfried Herder?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q155547 p:P19 ?s . ?s ps:P19 wd:Q139725 . ?s pq:P131 ?value }","paraphrases":["Johann Gottfried Herder was born where?"],"info":{}}
{"id":"train_11226","question":"Did Philadelphia share border with Delran Township?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1345 wdt:P47 wd:Q3016798 }","paraphrases":["Has Philadelphia shared a boundary with Delran Township?"],"info":{}}
{"id":"train_11227","question":"What is a lifestyle that begins with the letter w.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q32090 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a way of life that starts with the letter w."],"info":{}}
{"id":"train_11228","question":"What Belgian municipality with city privileges shares a border with Bruges?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q12994 . ?sbj wdt:P31 wd:Q15273785 }","paraphrases":["What Belgian region with city benefits offers a border with Bruges?"],"info":{}}
{"id":"train_11230","question":"Who was the mother of Eleanor of Aquitaine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P25 wd:Q178525 }","paraphrases":["Who is Eleanor of Aquitaine's mother?"],"info":{}}
