{"id":"train_6456","question":"What are the {has states} of {sovereign state} of {Ministry of Foreign Affairs of the People's Republic of China}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1155502 wdt:P17 ?X . ?X wdt:P150 ?answer }","paraphrases":["What are the stated of the Ministry of Foreign Affairs of the People's Republic of China?"],"info":{}}
{"id":"train_6457","question":"Which ester has the highest flash point?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q101487 . ?ent wdt:P2128 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which ester has the most elevated streak point?"],"info":{}}
{"id":"train_6461","question":"Where is Japan Railways Group, the place of incorporation that has the prime minister Yuriko Koike?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q864495 wdt:P740 ?answer . ?answer wdt:P6 wd:Q261703 }","paraphrases":["Where is Japan Railways Group, the vicinity of incorporation that has the high minister Yuriko Koike?"],"info":{}}
{"id":"train_6464","question":"Are the points awarded int he 2018 AFL Women's season equal to 4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q48523108 wdt:P3260 ?obj filter ( ?obj = 4 ) }","paraphrases":["How many points were scored during the 2018 AFL Women's season?"],"info":{}}
{"id":"train_6469","question":"Which is the official language for Republic of Adygea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3734 wdt:P37 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6471","question":"What time of animation is Looney Tunes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q622435 . ?sbj wdt:P31 wd:Q27921916 }","paraphrases":[],"info":{}}
{"id":"train_6473","question":"Is the maximum viable temperature of the Pseudomonas putida KT2440 equal to 55?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q21079489 wdt:P3252 ?obj filter ( ?obj = 55 ) }","paraphrases":["Is the greatest reasonable temperature of the Pseudomonas putida KT2440 break even with to 55?"],"info":{}}
{"id":"train_6474","question":"Which is the TMDb person ID for Nick Offerman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1985488 wdt:P4985 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6475","question":"What is notable about the woman depicted in Le Déjeuner sur l'herbe?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q152509 p:P180 ?s . ?s ps:P180 wd:Q467 . ?s pq:P518 ?value }","paraphrases":["What makes the woman depicted in Le Dejeuner sur l'herbe unique?"],"info":{}}
{"id":"train_6476","question":"WHAT IS THE ZIPCODE OF ALUMNUS OF HOBEY BAKER","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1348425 wdt:P69 ?X . ?X wdt:P281 ?answer }","paraphrases":["In what zipcode is Alumnus of Hobey Baker?"],"info":{}}
{"id":"train_6480","question":"According to Wikipedia, what is the reserve currency with the lowest price?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q756202 . ?ent wdt:P2284 ?obj . ?ent wdt:P5008 wd:Q5460604 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What reserve currency has the lowest price on Wikipedia?"],"info":{}}
{"id":"train_6481","question":"which procedural programming language contains the word visual in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28922885 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'visual' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which procedural programming language contains the command visual in their name"],"info":{}}
{"id":"train_6483","question":"What is the aircraft in fleet of the user of T-54/55?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q328272 wdt:P1535 ?X . ?X wdt:P121 ?answer }","paraphrases":["What is the airplane in armada of the client of T-54/55?"],"info":{}}
{"id":"train_6485","question":"Tell me biblical episode whose name has the word woman in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22704077 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'woman' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the episode of the Bible whose name contains the word woman."],"info":{}}
{"id":"train_6486","question":"What award did Joseph Lister, 1st Baron of Lister win?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q155768 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What grant did Joseph Lister, 1st Noble of Lister win?"],"info":{}}
{"id":"train_6487","question":"What is the  musical composition for composer of  Pyotr Ilyich Tchaikovsky","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P86 wd:Q7315 . ?sbj wdt:P31 wd:Q207628 }","paraphrases":[],"info":{}}
{"id":"train_6489","question":"What is the position of political office held by a member of Augustus' family?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1405 wdt:P1038 ?X . ?X wdt:P39 ?answer }","paraphrases":["What is the position of political office held by a part of Augustus' family?"],"info":{}}
{"id":"train_6491","question":"Which is the distance from Earth for Messier 81?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q14024 wdt:P2583 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6492","question":"what is the end time for Titian has a work location as Augsburg ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47551 p:P937 ?s . ?s ps:P937 wd:Q2749 . ?s pq:P582 ?value }","paraphrases":["When does Titian stop working at Augsburg?"],"info":{}}
{"id":"train_6493","question":"Where in the Duchy of Bavaria was Hans Holbein born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q48319 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q47261 }","paraphrases":["What part of the Ducy of Bavaria was Hans Holbein's birth place?"],"info":{}}
{"id":"train_6494","question":"Name a biblical character  in the book of Isaiah that contains the word \" leviathan\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12405827 . ?sbj wdt:P1441 wd:Q131458 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'leviathan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a biblical character in Isaiah's book which contains in its name the word \"leviathan\""],"info":{}}
{"id":"train_6495","question":"When Jimmy Cliff was awarded Grammy Award for Best Reggae Album?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q109063 p:P166 ?s . ?s ps:P166 wd:Q1542180 . ?s pq:P585 ?value }","paraphrases":["In what year was Jimmy Cliff awarded the Grammy Award for Best Reggae Album?"],"info":{}}
{"id":"train_6496","question":"Tell me the religious concept that facet of Hinduism and which that starts with the letter  y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj wdt:P1269 wd:Q9089 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the devout concept that feature of Hinduism and which that begins with the letter y"],"info":{}}
{"id":"train_6497","question":"How many deaths are caused by thunderstorms?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2857578 wdt:P1542 ?X . ?X wdt:P1120 ?answer }","paraphrases":["How numerous passings are caused by thunderstorms?"],"info":{}}
{"id":"train_6498","question":"Whose father of Prince Aly Khan ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q450229 wdt:P22 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6499","question":"When did award received of Pat Summitt and together with","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q460394 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 ?value1 . }","paraphrases":["When did grant gotten of Pat Summitt and together with"],"info":{}}
{"id":"train_6500","question":"Mention the predecessor and the successor of Jeremiah in Nevi'iim","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q131590 p:P179 ?s . ?s ps:P179 wd:Q216383 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Who is the predecessor and the successor of Jeremiah in Nevi'iim?"],"info":{}}
{"id":"train_6501","question":"What is the present in work and the said to be the same as of John_the_Baptist ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q40662 wdt:P1441 ?ans_1 . wd:Q40662 wdt:P460 ?ans_2 }","paraphrases":["Who was John the Baptist?"],"info":{}}
{"id":"train_6505","question":"Was the work of Victor Hugo influenced by Plato and Miguel de Cervantes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q535 wdt:P737 wd:Q859 . wd:Q535 wdt:P737 wd:Q5682 }","paraphrases":["Did Miguel de Cervantes and Plato influence the work of Victor Hugo?"],"info":{}}
{"id":"train_6506","question":"What is Vietnam of Japan-Vietnam relations of statement is subject odf diplomatic relation?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q881 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q1051802 }","paraphrases":["Which is the diplomatic relation between Vietnam and Japan?"],"info":{}}
{"id":"train_6507","question":"Does Alexei Kudashov have more than 0.0 total assists in his career?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q688108 wdt:P6545 ?obj filter ( ?obj > 0.0 ) }","paraphrases":["Does Alexei Kudashov have an assist in his career?"],"info":{}}
{"id":"train_6508","question":"Which is the final sport of Australian rules football?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P641 wd:Q50776 . ?sbj wdt:P31 wd:Q1366722 }","paraphrases":[],"info":{}}
{"id":"train_6510","question":"Which academic major was educated by Norman Foster at the Yale School of Architecture?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q104898 p:P69 ?s . ?s ps:P69 wd:Q1514480 . ?s pq:P812 ?value }","paraphrases":["Which major did Normal Foster teach at the Yale School of Architecture?"],"info":{}}
{"id":"train_6511","question":"What political scandal involved Hillary Clinton where she has to defend herself?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1591 wd:Q6294 . ?sbj wdt:P31 wd:Q934744 }","paraphrases":["In which political scandal did Hillary Clinton have to defend herself?"],"info":{}}
{"id":"train_6513","question":"Name the chemical compound with the lowest standard molar entropy whose safety classification and labeling is Regulation EC No. 1272/2008.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P3071 ?obj . ?ent wdt:P4952 wd:Q2005334 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["what is the name of the chemical compound with the lowest standard molar entropy whose safety classification and labeling is Regulation EC No. 1272/2008."],"info":{}}
{"id":"train_6516","question":"Who is the {dominion of the British Empire} for {history of topic} of {history of Australia}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2184 wd:Q174825 . ?sbj wdt:P31 wd:Q223832 }","paraphrases":["Who is the {domain of the British Domain} for {history of point} of {history of Australia}"],"info":{}}
{"id":"train_6517","question":"Tell me syllable whose name has the word sen in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8188 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sen' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know syllable whose title has the word sen in it."],"info":{}}
{"id":"train_6518","question":"Did Jesse James have Frank James and Archie Samuel as siblings?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q213626 wdt:P3373 wd:Q711243 . wd:Q213626 wdt:P3373 wd:Q4786782 }","paraphrases":["Were Frank James, Archie Samuel, and Jesse James brothers?"],"info":{}}
{"id":"train_6519","question":"Is it true that the width of the Jochenstein is equal to 0.015?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23192 wdt:P2049 ?obj filter ( ?obj = 0.015 ) }","paraphrases":["Is 0.015 the width of the Jochenstein?"],"info":{}}
{"id":"train_6520","question":"What is the occurence of hepatitis C?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q154869 wdt:P2844 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6522","question":"When did Reese Witherspoon receive the British Academy of Film and Television Arts award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q44063 p:P166 ?s . ?s ps:P166 wd:Q159661 . ?s pq:P585 ?value }","paraphrases":["When did Reese Witherspoon get the British Foundation of Film and Tv Expressions award?"],"info":{}}
{"id":"train_6523","question":"Who is the writer of Cloud Atlas that has a last name of Mitchell?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40205 wdt:P50 ?answer . ?answer wdt:P734 wd:Q179205 }","paraphrases":["Who is the Cloud Atlas writer with a Mitchell last name?"],"info":{}}
{"id":"train_6525","question":"Which is the Google Maps CID for Empire State Building?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9188 wdt:P3749 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6526","question":"Where did Nelson Algren die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q547914 wdt:P20 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-75.0' ) ) }","paraphrases":["Where did Nelson Algren die?"],"info":{}}
{"id":"train_6529","question":"What is the sister city of the birthplace of Nikita Telenkov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7035115 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["Name the sister city of the place where Nikita Telenkov was born."],"info":{}}
{"id":"train_6530","question":"Who is Bindusara's student?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q315526 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Bindusara's student?"],"info":{}}
{"id":"train_6532","question":"Tell me peace treaty whose name has the word treaty in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q625298 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'treaty' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know peace arrangement whose title has the word arrangement in it."],"info":{}}
{"id":"train_6534","question":"Which is the office held by head of Government that is Quintana Roo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q80245 wdt:P1313 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6535","question":"What is French Olympic Committee ID for Nikola Karabatić?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q157809 wdt:P4050 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6536","question":"What tv program was the Eurovision Song Contents inspried by","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q276 wdt:P941 ?obj . ?obj wdt:P31 wd:Q15416 }","paraphrases":["What tv program was the Eurovision Melody Substance inspried by"],"info":{}}
{"id":"train_6538","question":"What person has the highest score?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1358 ?obj . ?ent wdt:P31 wd:Q5 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Who has the highest score?"],"info":{}}
{"id":"train_6541","question":"What diplomatic effect on the land did the 1948 Czechoslovak coup d'état cause?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1137957 wdt:P17 ?X . ?X wdt:P530 ?answer }","paraphrases":["What political impact on the arrive did the 1948 Czechoslovak upset d'état cause?"],"info":{}}
{"id":"train_6542","question":"Name a building located on 34th Street that contains the word \"building\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1021645 . ?sbj wdt:P669 wd:Q110049 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'building' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a constructing placed on 34th Street that contains the word \"building\" in its title"],"info":{}}
{"id":"train_6546","question":"Alexander Pushkin is a member of which literary society?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P463 wd:Q7200 . ?sbj wdt:P31 wd:Q497893 }","paraphrases":["To which literary society does Alexander Pushkin belong?"],"info":{}}
{"id":"train_6548","question":"Who is the party chair for the position of Xi Jinping?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q15031 wdt:P39 ?obj . ?obj wdt:P31 wd:Q2746259 }","paraphrases":["Who is the party chair for the position of Xi Jinping?"],"info":{}}
{"id":"train_6553","question":"What ethnic group is Karl Weierstraß?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q57103 wdt:P172 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6554","question":"When did Tuscany become the capitol of Florence?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1273 p:P150 ?s . ?s ps:P150 wd:Q18288148 . ?s pq:P580 ?value }","paraphrases":["What year was Tuscany named the capitol of Florence?"],"info":{}}
{"id":"train_6555","question":"Who is the actor in the series The Two Mrs. Sheffields?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51228874 wdt:P179 ?X . ?X wdt:P161 ?answer }","paraphrases":["Who is the performing artist within the arrangement The Two Mrs. Sheffields?"],"info":{}}
{"id":"train_6556","question":"Which is TheTVDB.com ID for The Fresh Prince of Bel-Air?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q309063 wdt:P4835 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6557","question":"What city in Ukraine starts with the letter \"v\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12131624 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which city in Ukraine starts with the letter \"v\"?"],"info":{}}
{"id":"train_6558","question":"Which territory was claimed by Taiwan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q865 wdt:P1336 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6561","question":"When did Cincinnati start the twinned administrative body in the year 1989?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43196 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1989' ) ) }","paraphrases":["What did Cincinnati start the twinned administrative body in the year 1989?"],"info":{}}
{"id":"train_6562","question":"Is the width of Bullenkuhle less than 0.018?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1004288 wdt:P2049 ?obj filter ( ?obj < 0.018 ) }","paraphrases":["Is the width of Bullenkuhle less than 0.018?"],"info":{}}
{"id":"train_6563","question":"When did Iraq become a member of the International Development Association?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q796 p:P463 ?s . ?s ps:P463 wd:Q827525 . ?s pq:P580 ?value }","paraphrases":["When did the International Development Association accept Iraq as a member?"],"info":{}}
{"id":"train_6564","question":"The piper nigrum is part of which taxon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43084 wdt:P171 ?obj . ?obj wdt:P31 wd:Q16521 }","paraphrases":["The flute player nigrum is portion of which taxon?"],"info":{}}
{"id":"train_6566","question":"What is Salman of Saudi Arabia's nickname, and what office doe he hold?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1308 wd:Q367825 . ?sbj wdt:P31 wd:Q49614 }","paraphrases":["What is Salman of Saudi Arabia's epithet, and what office doe he hold?"],"info":{}}
{"id":"train_6569","question":"What position was held by George VI and when did he begin in that position?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q280856 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["Indicate the position of Jorge VI and the time that began in this function?"],"info":{}}
{"id":"train_6571","question":"What are the positional notation which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1747853 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the positional documentation which begin with the letter v"],"info":{}}
{"id":"train_6573","question":"What is pedophilia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8388 wdt:P1995 ?obj . ?obj wdt:P31 wd:Q1047113 }","paraphrases":["What is pedophilia?"],"info":{}}
{"id":"train_6574","question":"Tell me binary operation whose name has the word union in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q164307 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'union' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know twofold operation whose title has the word union in it."],"info":{}}
{"id":"train_6576","question":"Which is the MYmovies name ID of Dino De Laurentiis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q296796 wdt:P4785 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6579","question":"What kind of music was in The Hobbit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q719915 wdt:P155 ?X . ?X wdt:P136 ?answer }","paraphrases":["The Hobbit contained what kind of music?"],"info":{}}
{"id":"train_6581","question":"Which is the tungsten alloy that has an effect on tungsten carbide exposure and starts with the letter c?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q37789249 . ?sbj wdt:P1542 wd:Q21175402 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the alloy of tungsten that affects the exposure of tungsten carbide and starts with letter c?"],"info":{}}
{"id":"train_6582","question":"What is the citrate anion for the acidity of citric acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4147 wd:Q159683 . ?sbj wdt:P31 wd:Q55502846 }","paraphrases":["For acidity of citric acid, what is the citrate anion?"],"info":{}}
{"id":"train_6583","question":"What is the business division of Aeroflot.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q58707 wdt:P199 ?obj . ?obj wdt:P31 wd:Q46970 }","paraphrases":["What are the divisions within Aeroflot?"],"info":{}}
{"id":"train_6584","question":"Name the Velká pardubická sponsored by Česká pojišťovna with the longest race time ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1701273 . ?ent wdt:P2781 ?obj . ?ent wdt:P859 wd:Q11283119 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name of the Velká pardubická sponsored with the longest race time by Česká pojišÿovna?"],"info":{}}
{"id":"train_6585","question":"What is named after Alexander Hamilton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P138 wd:Q178903 }","paraphrases":[],"info":{}}
{"id":"train_6587","question":"Tell me fish whose name has the word platichthys in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q600396 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'platichthys' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know angle whose title has the word platichthys in it."],"info":{}}
