{"id":"train_3027","question":"Who is the employer of professor Fernand Braudel?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q185105 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P39 wd:Q121594 }","paraphrases":["What is the name of Employer of Prof. Fernand Braudel?"],"info":{}}
{"id":"train_3028","question":"Which is the translation of the edition of Twenty Thousand Leagues Under the Sea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P629 wd:Q183565 . ?sbj wdt:P31 wd:Q39811647 }","paraphrases":["What is the Twenty Thousand Leagues Under the Sea edition translation?"],"info":{}}
{"id":"train_3029","question":"What is the  relation between South Ossetia and  Nicaragua-South Ossetia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23427 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q7024510 }","paraphrases":["South Ossetia and Nicaragua-South Ossetia are related in what way?"],"info":{}}
{"id":"train_3030","question":"How are called the person living next to Extremadura?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5777 wdt:P47 ?X . ?X wdt:P1792 ?answer }","paraphrases":["How are called the individual living following to Extremadura?"],"info":{}}
{"id":"train_3031","question":"which district of austria starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q871419 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which locale of austria begins with w"],"info":{}}
{"id":"train_3032","question":"Where was Michel Ney buried on December 8, 1815?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q40756 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1815' ) ) }","paraphrases":["What is the location of Michael Ney's burial on December 8, 1815?"],"info":{}}
{"id":"train_3033","question":"What precedes and what follows Isaiah in the Nevi'im?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q131458 p:P179 ?s . ?s ps:P179 wd:Q216383 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["What happens before and after Isaiah arrives in Nevi'im?"],"info":{}}
{"id":"train_3034","question":"What language uses the word \"Antygona\" instead of what is known in English as \"Antigone\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q241077 p:P747 ?s . ?s ps:P747 wd:Q24791655 . ?s pq:P407 ?value }","paraphrases":["Which language uses the word \"Antygona\" instead of the English word \"Antigone\"?"],"info":{}}
{"id":"train_3036","question":"Name the American federal holiday that contain the word \" thanksgiving\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5440534 . ?sbj wdt:P276 wd:Q29 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'thanksgiving' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the American federal excursion that comprise the word \" thanksgiving\" in its name"],"info":{}}
{"id":"train_3037","question":"Which is the location on terrain feature for Iberian Peninsula?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P706 wd:Q12837 }","paraphrases":[],"info":{}}
{"id":"train_3038","question":"What position does John F. Kennedy hold and what position was he elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q9696 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What position does John F. Kennedy hold and what position was he chosen in?"],"info":{}}
{"id":"train_3040","question":"Tell me language whose name has the word äynu in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34770 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'äynu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know dialect whose title has the word äynu in it."],"info":{}}
{"id":"train_3041","question":"who is predecessor of position held by head of government of Tainan ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q140631 wdt:P1313 ?X . ?X wdt:P1365 ?answer }","paraphrases":["Who preceded the position held by Tainan's head of government?"],"info":{}}
{"id":"train_3043","question":"What are the medical specialty which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q930752 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What medical specialty starts with the letter 't'?"],"info":{}}
{"id":"train_3044","question":"Tell me about the medical findings regarding the symptoms of lung cancer.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q47912 wdt:P780 ?obj . ?obj wdt:P31 wd:Q639907 }","paraphrases":["List the typical symptoms of lung cancer?"],"info":{}}
{"id":"train_3045","question":"How many children does Grover Cleveland have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q35171 wdt:P1971 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3046","question":"IS THE NOTATION PERIOD OF THE 17 THETIS EQUALS 12.27048","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q142553 wdt:P2147 ?obj filter ( ?obj = 12.27048 ) }","paraphrases":["IS THE PERIOD NOTATION OF THE 17 THETIS 12.27048 EQUALS"],"info":{}}
{"id":"train_3049","question":"What is an international association football national teams competition that starts with the letter c.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34542827 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is an worldwide affiliation football national groups competition that begins with the letter c."],"info":{}}
{"id":"train_3053","question":"Who was {participant in conflict} of {sister} {Emilio Polli} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3724488 wdt:P3373 ?X . ?X wdt:P607 ?answer }","paraphrases":["Who was engaged in the conflict of Sister Emilio Polli"],"info":{}}
{"id":"train_3054","question":"Where did Niels Bohr earn his doctoral thesis?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q7085 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P1026 ?value1 . }","paraphrases":["Where did Niels Bohr gain his doctoral proposition?"],"info":{}}
{"id":"train_3055","question":"when was Linus Pauling nominated for a Nobel Prize in Chemistry","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q48983 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value }","paraphrases":["The nomination for a Nobel Prize in Chemistry was received by Linus Pauling on which date?"],"info":{}}
{"id":"train_3056","question":"Name a film set in the Marvel Cinematic Universe.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q642878 wdt:P1445 ?obj . ?obj wdt:P31 wd:Q11424 }","paraphrases":["Name a film set within the Wonder Cinematic Universe."],"info":{}}
{"id":"train_3058","question":"Which is the CycleBase cyclist ID for Greg LeMond?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q312697 wdt:P4508 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3060","question":"Which country is landlocked in East Asia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P706 wd:Q27231 . ?sbj wdt:P31 wd:Q123480 }","paraphrases":["Which East Asian country is landlocked?"],"info":{}}
{"id":"train_3061","question":"Where are administrative divisions of Nicaragua with location of 11.85 -86.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q811 wdt:P150 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '11.85 -86.2' ) ) }","paraphrases":["Where are regulatory divisions of Nicaragua with area of 11.85 -86.2?"],"info":{}}
{"id":"train_3063","question":"\"What is the co-ordinate location  -90.0? do not to be confused with of the Western world","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q160381 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-90.0' ) ) }","paraphrases":["\"What is the co-ordinate area -90.0? do no longer to be confused with of the Western world"],"info":{}}
{"id":"train_3064","question":"For what role was Rachel McAdams nominated for an Oscar at the 88th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q190386 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q20022969 }","paraphrases":["At the 88th Academy Awards, what was the role that Rachel McAdams was nominated for?"],"info":{}}
{"id":"train_3065","question":"Who is Michel Houellebecq's role model, that works as a librarian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q103114 wdt:P737 ?answer . ?answer wdt:P106 wd:Q182436 }","paraphrases":["Who is Michel Houellebecq's part demonstrate, that works as a librarian?"],"info":{}}
{"id":"train_3066","question":"What is Sybaris' Digital Atlas of the Roman Empire ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q220583 wdt:P1936 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3068","question":"Who was the dedicatee at the place of interment for Jude the Apostle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43945 wdt:P119 ?X . ?X wdt:P825 ?answer }","paraphrases":["Who was the dedicatee at the put of interment for Jude the Apostle?"],"info":{}}
{"id":"train_3069","question":"What type of government is Emmanuel Macron part of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P35 wd:Q3052772 . ?sbj wdt:P31 wd:Q17152708 }","paraphrases":["What sort of government is Emmanuel Macron portion of?"],"info":{}}
{"id":"train_3071","question":"What was the end time for Eino Kaila's spouse Anna Snellman-Kaila?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q670103 p:P26 ?s . ?s ps:P26 wd:Q11851614 . ?s pq:P582 ?value }","paraphrases":["When did Anna Snellman-Kaila die?"],"info":{}}
{"id":"train_3072","question":"What did Jackie Stewart win in 1969?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3188 p:P2522 ?s . ?s ps:P2522 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1969' ) ) }","paraphrases":["What did Jackie Stewart win in 1969?"],"info":{}}
{"id":"train_3073","question":"Tell me social networking service whose name has the word yak in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3220391 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yak' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me about the social networking service whose name contains the word yak"],"info":{}}
{"id":"train_3074","question":"Who was the partner of Edith Piaf in 1948?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1631 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1948' ) ) }","paraphrases":["Who was Edith Piaf's partner in 1948?"],"info":{}}
{"id":"train_3075","question":"When did Abigail Adams marry John Adams and when did they divorce","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P26 ?s . ?s ps:P26 wd:Q11806 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["Name the marriage and divorce dates of John and Abigail Adams."],"info":{}}
{"id":"train_3076","question":"Tell me a constellation that starts with {'p'}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3917160 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know a group of stars that begins with {'p'}"],"info":{}}
{"id":"train_3079","question":"For which website Julian did use to work for ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P50 wd:Q360 . ?sbj wdt:P31 wd:Q1344897 }","paraphrases":["Which website did Julian work for?"],"info":{}}
{"id":"train_3081","question":"What thermodynamic potential starts with the letter \"g\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2420179 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What thermodynamic potential begins with the letter \"g\"?"],"info":{}}
{"id":"train_3083","question":"What religious order did Augustine of Hippo belong to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8018 wdt:P611 ?obj . ?obj wdt:P31 wd:Q2061186 }","paraphrases":["What devout arrange did Augustine of Hippo have a place to?"],"info":{}}
{"id":"train_3084","question":"who is the steamship for designed by of Isambard Kingdom Brunel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P287 wd:Q207380 . ?sbj wdt:P31 wd:Q12859788 }","paraphrases":["who is the steamship for outlined by of Isambard Kingdom Brunel?"],"info":{}}
{"id":"train_3085","question":"Which is an academic major studied by Nubia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q135028 wdt:P2579 ?obj . ?obj wdt:P31 wd:Q4671286 }","paraphrases":[],"info":{}}
{"id":"train_3086","question":"when did moselle replaced metz administratively?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q22690 p:P131 ?s . ?s ps:P131 wd:Q12652 . ?s pq:P580 ?value }","paraphrases":["In which year did Moselle replace Metz administratively?"],"info":{}}
{"id":"train_3089","question":"What time did John Winthrop's position as Governor of the Massachusetts Bay Colony end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q720766 p:P39 ?s . ?s ps:P39 wd:Q48955989 . ?s pq:P582 ?value }","paraphrases":["John Winthrop's position as Governor of the Massachusetts Bay colony ended at what time?"],"info":{}}
{"id":"train_3090","question":"What position was Justin Trudeau elected to on October 14th, 2008?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3099714 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2008' ) ) }","paraphrases":["On October 14th, 2008 Justin Trudeau was elected to what office?"],"info":{}}
{"id":"train_3093","question":"What is {adjacent to} of {death location} of {Michelangelo Antonioni} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55433 wdt:P20 ?X . ?X wdt:P47 ?answer }","paraphrases":["What is {adjoining to} of {passing area} of {Michelangelo Antonioni} ?"],"info":{}}
{"id":"train_3094","question":"Tell me the survival skill that followed by food presentation and which contains the word cooking in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891382 . ?sbj wdt:P156 wd:Q3480053 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'cooking' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the survival ability that accompanied by meals presentation and which carries the word cooking in their identify"],"info":{}}
{"id":"train_3095","question":"Does Botnkrona Opp have an average gradient of less than 0.1884?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q11962019 wdt:P2198 ?obj filter ( ?obj < 0.1884 ) }","paraphrases":["Is the incline of Botnkrona Opp less than .1884?"],"info":{}}
{"id":"train_3097","question":"Which is the UNESCO Biosphere Reserve url of São Jorge Island?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q743362 wdt:P2520 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3098","question":"When did Sergio Marqués Fernández leave his job as President of Asturias?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3934 p:P6 ?s . ?s ps:P6 wd:Q3181289 . ?s pq:P582 ?value }","paraphrases":["When did Sergio Margues Fernandez of Asturias step down from his role as President?"],"info":{}}
{"id":"train_3099","question":"Which position applies to the jurisdiction of Bilbao?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1001 wd:Q8692 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["Which position applies to the purview of Bilbao?"],"info":{}}
{"id":"train_3101","question":"\"Which is {language of work} of {L'après-midi d'un faune}, that has {name in official language} is {langue française} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1880607 wdt:P407 ?answer . ?answer wdt:P1705 ?x FILTER ( contains ( ?x , 'langue française' ) ) }","paraphrases":["\"Which is {dialect of work} of {L'après-midi d'un faune}, that has {title in official dialect} is {langue française} ?\""],"info":{}}
{"id":"train_3103","question":"What is the musical instrument of the songwriter of \"Piano Concerto No. 5\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q239700 wdt:P86 ?X . ?X wdt:P1303 ?answer }","paraphrases":["What is the melodic instrument of the musician of \"Piano Concerto No. 5\"?"],"info":{}}
{"id":"train_3104","question":"Did {Bharatiya_Janata_Party} has {political ideology} of {nationalism} and {Hindutva} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q10230 wdt:P1142 wd:Q6235 . wd:Q10230 wdt:P1142 wd:Q281347 }","paraphrases":["Did Bharatiya Janata Party have political ideas concerning nationalism and Hindutva?"],"info":{}}
{"id":"train_3106","question":"Which is the weekly newspaper owner of which is StarWipe and contains the word onion in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2305295 . ?sbj wdt:P1830 wd:Q21189788 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'onion' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the weekly newspaper proprietor of which is StarWipe and carries the phrase onion in it's name?"],"info":{}}
{"id":"train_3107","question":"What is the first name of Jules Léotrad, which is the same as Júlio?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q356388 wdt:P735 ?answer . ?answer wdt:P460 wd:Q6321687 }","paraphrases":["What is the first identify of Jules Léotrad, which is the identical as Júlio?"],"info":{}}
{"id":"train_3108","question":"Where is the place of grave of Makarios III, founded in 1001-1-17?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q153509 wdt:P119 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1001' ) ) }","paraphrases":["Where is the area of grave of Makarios III, established in 1001-1-17?"],"info":{}}
{"id":"train_3109","question":"Name the mascot for Iron Maiden.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q42482 wdt:P822 ?obj . ?obj wdt:P31 wd:Q18670161 }","paraphrases":["Title the mascot for Press Maiden."],"info":{}}
{"id":"train_3110","question":"Who is the founder of the Cricket World Cup from North East England?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192202 wdt:P112 ?answer . ?answer wdt:P150 wd:Q47983 }","paraphrases":["Cricket World Cup of North East England was founded by who?"],"info":{}}
{"id":"train_3111","question":"What is the PSS-Archi architect id of Sebastien Le Prestre de Vauban?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q192839 wdt:P2194 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3112","question":"Is the Ministry of Biblical and History Prophecy Symbols thickness less than 0.508","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q20537968 wdt:P2610 ?obj filter ( ?obj < 0.508 ) }","paraphrases":["Does the thickness of Ministry of Biblical and History Prophecy Symbols stay under 0.508?"],"info":{}}
{"id":"train_3113","question":"WHAT COMES FROM LABEL OF LCD SOUNDSYSTEM ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q45752 wdt:P264 ?X . ?X wdt:P495 ?answer }","paraphrases":["WHAT COMES FROM Name OF LCD SOUNDSYSTEM ?"],"info":{}}
{"id":"train_3114","question":"What programming language was developed by Dennis M. Ritchie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P178 wd:Q45575 . ?sbj wdt:P31 wd:Q28922885 }","paraphrases":["What programming dialect was created by Dennis M. Ritchie?"],"info":{}}
{"id":"train_3115","question":"What is east of Henry Luce's nation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q516473 wdt:P27 ?X . ?X wdt:P1334 ?answer }","paraphrases":["What is east of Henry Luce's country?"],"info":{}}
{"id":"train_3117","question":"What is diplomatic relation  citizen  of Dizzee Rascal ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q366506 wdt:P27 ?X . ?X wdt:P530 ?answer }","paraphrases":["What's Dizzee Rascal's diplomatic relationship?"],"info":{}}
{"id":"train_3120","question":"Oklahoma City is located in which county?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q34863 wdt:P131 ?obj . ?obj wdt:P31 wd:Q13414760 }","paraphrases":["Oklahoma City is found in which county?"],"info":{}}
{"id":"train_3121","question":"What award did Ousmane Sembène receive in 1966?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q314966 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1966' ) ) }","paraphrases":["What did Ousmane Sembene receive in '66?"],"info":{}}
{"id":"train_3122","question":"When was Bertha, daughter of Charlemange born, and who was her mother?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q827676 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["When was Bertha, daughter of Charlemange born, and who used to be her mother?"],"info":{}}
{"id":"train_3123","question":"For what was Isabelle Adjani nominated for in the year 1995.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q106383 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1995' ) ) }","paraphrases":["In 1995 Isabelle Adjani was nominated for what award?"],"info":{}}
{"id":"train_3124","question":"What is to be distiguished from a pub that resides at the co-ordinates: 25.9077 64.3467?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q212198 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '25.9077 64.3467' ) ) }","paraphrases":["What is to be distiguished from a bar that dwells at the co-ordinates: 25.9077 64.3467?"],"info":{}}
{"id":"train_3127","question":"How much is to be replaced by the Canadian dollar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1366 wd:Q1104069 }","paraphrases":["The Canadian dollar replaces how much?"],"info":{}}
{"id":"train_3128","question":"What award did Kiri Te Kanawa receive on 1/26/1990?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q380133 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1990' ) ) }","paraphrases":["On 1/26/1990, what award did Kiri Te Kanawa receive?"],"info":{}}
{"id":"train_3129","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12382 wdt:P800 ?obj . ?obj wdt:P31 wd:Q33093124 }","paraphrases":["n/a"],"info":{}}
{"id":"train_3131","question":"IS THE SLOPE OF THE BLACK RUN EQAULS TO 50","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1923663 wdt:P4184 ?obj filter ( ?obj = 50 ) }","paraphrases":["IS THE Slant OF THE Dark RUN EQAULS TO 50"],"info":{}}
{"id":"train_3132","question":"What is the oxidation state for nickel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q744 wdt:P1121 ?obj }","paraphrases":["When does nickel enter an oxidation state?"],"info":{}}
