{"id":"train_2301","question":"Who is the {human} for {chief executive officer} of {Ford Motor Company}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44294 wdt:P169 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {chief official officer} of {Portage Engine Company"],"info":{}}
{"id":"train_2307","question":"Tell me bell tower whose name has the word tower in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q200334 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tower' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know chime tower whose title has the word tower in it."],"info":{}}
{"id":"train_2310","question":"What are the coordinates for the National Aeronautics and Space Administration that is headquartered in Washington, D.C.?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23548 p:P159 ?s . ?s ps:P159 wd:Q61 . ?s pq:P625 ?value }","paraphrases":["Headquartered in Washington, D.C., what are the coordinates for NASA?"],"info":{}}
{"id":"train_2311","question":"What genre is the work of Sylvain Guyot?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3665127 wdt:P800 ?X . ?X wdt:P136 ?answer }","paraphrases":["What sort is the work of Sylvain Guyot?"],"info":{}}
{"id":"train_2312","question":"What are the international parliament which start with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6054776 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the international parliament which begin with the letter p"],"info":{}}
{"id":"train_2314","question":"Which is the periodical literature that has the edition of Rolling Stone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q33511 wdt:P747 ?obj . ?obj wdt:P31 wd:Q1002697 }","paraphrases":["Which is the periodical writing that has the version of Rolling Stone?"],"info":{}}
{"id":"train_2315","question":"What Wikimedia article lists Paris monuments?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q90 wdt:P1456 ?obj . ?obj wdt:P31 wd:Q13406463 }","paraphrases":["What Wikimedia article records Paris monuments?"],"info":{}}
{"id":"train_2317","question":"Who is the Chief Executive officer of BNP Paribas at its beginning time 1st Dec 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q499707 p:P169 ?s . ?s ps:P169 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["Give the name of the Chief Executive officer of BNP Paribas at its beginning time 1st Dec 2011."],"info":{}}
{"id":"train_2319","question":"Is Lucille Ball a child of Desi Arnaz, Jr.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q209662 wdt:P40 wd:Q324882 }","paraphrases":["Is it true that Lucille Ball is a child of Desi Arnaz, Jr.?"],"info":{}}
{"id":"train_2320","question":"Who gave the  {has states} of {deathplace} of {Pyotr Zakharov-Chechenets} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2366448 wdt:P20 ?X . ?X wdt:P150 ?answer }","paraphrases":["Pyotr Zakharov-Chechenet's deathplace was authorized by who?"],"info":{}}
{"id":"train_2321","question":"Who is the  {Wikidata qualifier} for {subject item of this property} of {syntax}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1629 wd:Q37437 . ?sbj wdt:P31 wd:Q15720608 }","paraphrases":["Who is the { wikidata qualifier } of { syntax } for the { subject item of this property"],"info":{}}
{"id":"train_2326","question":"WHAT IS THE NUMBER OF POINTS AND NUMBER OF MATCHES PLAYED OF mALCOLM ALLISON HAS MEMEBER OF SPORTS TEAM AS CHARITON ATHLETIC F C","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q1383862 p:P54 ?s . ?s ps:P54 wd:Q19462 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["WHAT IS THE NUMBER OF POINTS AND NUMBER OF MATCHES PLAYED OF mALCOLM ALLISON HAS MEMEBER OF SPORTS TEAM AS CHARITON ATHLETIC F C"],"info":{}}
{"id":"train_2328","question":"What is the population of Valladolid?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8356 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }","paraphrases":["How many people live in Valladolid?"],"info":{}}
{"id":"train_2329","question":"What position did Jean le Rond D'Alembert begin holding in 1772?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q153232 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1772' ) ) }","paraphrases":["What position did Jean le Rond D'Alembert hold in 1772?"],"info":{}}
{"id":"train_2330","question":"Who is with Mel Gibson and when does it start?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q42229 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["Who is with Mel Gibson and when does it start?"],"info":{}}
{"id":"train_2332","question":"Tell me the male organ that has lymphatic drainage of the Lumbar lymph nodes and contains the word testicle in it's name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25553355 . ?sbj wdt:P2288 wd:Q1662950 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'testicle' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the male organ that has lymphatic drainage of the Lumbar lymph nodes and carries the phrase testicle in it's name."],"info":{}}
{"id":"train_2335","question":"What is Newton's law of cooling named after, that was born in Parnu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2902868 wdt:P138 ?answer . ?answer wdt:P19 wd:Q102365 }","paraphrases":["What is Newton's law of cooling named after, that used to be born in Parnu?"],"info":{}}
{"id":"train_2336","question":"Edmund Gwenn was an English actor. On film, he is perhaps best remembered for his role as ... Old Bill, M.P. (1922); Christian Veit in Lilac Time (1922–23); the title role in A. A. Milne's The Great Broxoff (1923); ... Gwenn has a star on the Hollywood Walk of Fame at 1751 Vine Street for his contribution to motion pictures.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q344750 wdt:P735 ?answer . ?answer wdt:P460 wd:Q632842 }","paraphrases":["Edmund Gwenn was an English on-screen character. On film, he is maybe best recollected for his part as ... Ancient Charge, M.P. (1922); Christian Veit in Lilac Time (1922–23); the title part in A. A. Milne's The Extraordinary Broxoff (1923); ... Gwenn features a star on the Hollywood Walk of Popularity at 1751 Vine Road for his commitment to movement pictures."],"info":{}}
{"id":"train_2337","question":"How many different boyar social classifications are there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3716 wd:Q203563 }","paraphrases":["What is the number of different boyar social classifications?"],"info":{}}
{"id":"train_2339","question":"What are the political philosophy which start with the letter whiggism","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179805 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'whiggism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the political philosophy which start with the letter whiggism"],"info":{}}
{"id":"train_2340","question":"What is the birth place of Raffaele Calace, whose patron saint is Januarius?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1344676 wdt:P19 ?answer . ?answer wdt:P417 wd:Q315312 }","paraphrases":["What is the birth put of Raffaele Calace, whose benefactor holy person is Januarius?"],"info":{}}
{"id":"train_2342","question":"What is the name of Jupiter's youngest moon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q319 wdt:P398 ?obj . ?obj wdt:P31 wd:Q61702557 }","paraphrases":["What is the title of Jupiter's most youthful moon?"],"info":{}}
{"id":"train_2343","question":"WHO IS SISTER OR BROTHER OF SANADA NOBUMASA'S NEPHEW?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11583366 wdt:P3373 ?X . ?X wdt:P1038 ?answer }","paraphrases":["WHO IS SISTER OR BROTHER OF SANADA NOBUMASA'S NEPHEW?"],"info":{}}
{"id":"train_2345","question":"How many presenters are held in the {Adriano Celentano} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P371 wd:Q199943 }","paraphrases":["Which is the number of presenters that are held by Adriano Celentano?"],"info":{}}
{"id":"train_2346","question":"who has administrative divisions of neighborhood of eastern front ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q154573 wdt:P276 ?X . ?X wdt:P150 ?answer }","paraphrases":["who has managerial divisions of neighborhood of eastern front ?"],"info":{}}
{"id":"train_2347","question":"What are the game of skill  which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1368898 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the amusement of aptitude which begin with the letter t"],"info":{}}
{"id":"train_2348","question":"What is the used language of Latin literature whose case is ablative case?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184890 wdt:P407 ?answer . ?answer wdt:P2989 wd:Q156986 }","paraphrases":["What is the utilized dialect of Latin writing whose case is ablative case?"],"info":{}}
{"id":"train_2349","question":"Is the shear modulus of polyethylene equal to 93.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q143429 wdt:P5673 ?obj filter ( ?obj = 93.6 ) }","paraphrases":["Is the shear modulus of polyethylene rise to to 93.6?"],"info":{}}
{"id":"train_2353","question":"What's the population of Yokohama in 2018?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q38283 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2018' ) ) }","paraphrases":["2018's Yokohama population was?"],"info":{}}
{"id":"train_2354","question":"Tell me {city of India} which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58339717 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What popular location in India starts with the letter 'w'?"],"info":{}}
{"id":"train_2356","question":"Which is the city for the currency of the Russian ruble?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P38 wd:Q41044 . ?sbj wdt:P31 wd:Q7930989 }","paraphrases":["Which is the Russian ruble's currency city?"],"info":{}}
{"id":"train_2360","question":"What is the destination point of Franz Josef Land ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1444 wd:Q185018 }","paraphrases":[],"info":{}}
{"id":"train_2362","question":"What are the dog type which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q38672 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the canine sort which begin with the letter t"],"info":{}}
{"id":"train_2365","question":"Which is after a work by Stanisława Przybyszewska?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1877 wd:Q3067991 }","paraphrases":[],"info":{}}
{"id":"train_2366","question":"What petroleum product has the lowest consumption rate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2424752 . ?ent wdt:P2292 ?obj . ?ent wdt:P910 wd:Q6572327 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which petroleum product has the lowest rate of consumption?"],"info":{}}
{"id":"train_2369","question":"\"Where is {work location} of {William Beveridge}, that has {PIN Code} is {SW3 6RS} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q335049 wdt:P937 ?answer . ?answer wdt:P281 ?x FILTER ( contains ( ?x , 'SW3 6RS' ) ) }","paraphrases":["\"Where is {work area} of {William Beveridge}, that has {Stick Code} is {SW3 6RS} ?\""],"info":{}}
{"id":"train_2370","question":"Did the brother of Frederick IV, Duke of Austria have any children?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q550692 wdt:P3373 ?X . ?X wdt:P40 ?answer }","paraphrases":["Is it true that the brother of Frederick IV, Duke of Austria had children?"],"info":{}}
{"id":"train_2371","question":"What cellular component has the word \"vesicle\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5058355 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vesicle' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What cellular component has the word \"vesicle\" in its name?"],"info":{}}
{"id":"train_2372","question":"What Academy Awards was Ron Howard nominated for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q103646 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q19020 }","paraphrases":["What Institute Grants was Ron Howard designated for?"],"info":{}}
{"id":"train_2373","question":"Did Phil Hartman attend Santa Monica College and Manual Arts High School?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q366834 wdt:P69 wd:Q1033692 . wd:Q366834 wdt:P69 wd:Q6752299 }","paraphrases":["Did Phil Hartman go to both Santa Monica College and Manual Arts High School?"],"info":{}}
{"id":"train_2375","question":"When was Nicholas I of Russia awarded the Order of St. Alexander Nevsky?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q130734 p:P166 ?s . ?s ps:P166 wd:Q10514065 . ?s pq:P585 ?value }","paraphrases":["In what year did Nicholas I of Russia receive the Order of St. Alexander Nevsky?"],"info":{}}
{"id":"train_2376","question":"Who is ideology of member of party of Michel Pouzol ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3310625 wdt:P102 ?X . ?X wdt:P1142 ?answer }","paraphrases":["Who is philosophy of part of party of Michel Pouzol ?"],"info":{}}
{"id":"train_2379","question":"What was Eyvind Johnson nominated for in 1963?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131326 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1963' ) ) }","paraphrases":["For which award did Eyvind Johnson receive a nomination in 1963?"],"info":{}}
{"id":"train_2380","question":"when did charles mingus jr received the grammy hall of fame award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q107432 p:P166 ?s . ?s ps:P166 wd:Q81180 . ?s pq:P585 ?value }","paraphrases":["The Grammy Hall of Fame Award was awarded to Charles Mingus, Jr. in what year?"],"info":{}}
{"id":"train_2381","question":"For what Cyril Ramaphosa was in position held in the year 2018?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1148669 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2018' ) ) }","paraphrases":["What position was held by Cyril Ramaphosa in the year 2018?"],"info":{}}
{"id":"train_2383","question":"Is the suicide rate of Nigeria more than 7.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1033 wdt:P3864 ?obj filter ( ?obj > 7.6 ) }","paraphrases":["Is the suicide rate of Nigeria more than 7.6?"],"info":{}}
{"id":"train_2384","question":"What is the population of Timisoara that is determined by the questionnaire?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q83404 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q747810 }","paraphrases":["The form gives what as Timisoara's population?"],"info":{}}
{"id":"train_2385","question":"What is the earliest known sport in Scotland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P4912 ?obj . ?ent wdt:P1532 wd:Q22 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Scotland had which sport first?"],"info":{}}
{"id":"train_2386","question":"Who is the son of the brother of Murray Guggenheim?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1702576 wdt:P3373 ?X . ?X wdt:P22 ?answer }","paraphrases":["Who is the child of the brother of Murray Guggenheim?"],"info":{}}
{"id":"train_2388","question":"Who is the {human} for {composer} of {My Fair Lady}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q591943 wdt:P86 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {composer} of {My Reasonable Woman}"],"info":{}}
{"id":"train_2390","question":"Was Mohenjo-daro discovered by John Marshall and Rakhaldas Bandyopadhyay?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5725 wdt:P61 wd:Q1376456 . wd:Q5725 wdt:P61 wd:Q7286651 }","paraphrases":["Did John Marshall and Rakhaldas Bandyopadhyay discover Mohenjo-daro?"],"info":{}}
{"id":"train_2391","question":"What are the cryptid which start with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q772636 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the cryptide that begins with the letter y"],"info":{}}
{"id":"train_2393","question":"What {type of music} is {songwriter} {Princess Mononoke} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q186572 wdt:P86 ?X . ?X wdt:P136 ?answer }","paraphrases":["What {sort of music} is {lyricist} {Princess Mononoke} ?"],"info":{}}
{"id":"train_2394","question":"WHAT IS THE NEUTRON NUMBER OF SILVER?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1373385 . ?ent wdt:P1148 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["How many neutrons are in silver?"],"info":{}}
{"id":"train_2395","question":"Is the takeoff roll on the Airbus A400M less than 752?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6496 wdt:P2430 ?obj filter ( ?obj < 752.0 ) }","paraphrases":["Does the Airbus A400M have less than 752 takeoff roll?"],"info":{}}
{"id":"train_2396","question":"Was American_Idol presenter Ryan Seacrest and Brian Dunkleman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q201052 wdt:P371 wd:Q299266 . wd:Q201052 wdt:P371 wd:Q618908 }","paraphrases":["Is it true that the American Idol presenters were Ryan Seacrest and Brian Dunkleman?"],"info":{}}
{"id":"train_2397","question":"Which is the consumption rate per capital of petroleum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q22656 wdt:P2662 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2398","question":"What's the first human that starts with the letter \"p\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4349921 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What's the primary human that begins with the letter \"p\"?"],"info":{}}
{"id":"train_2400","question":"What is the irritant with enthalpy of vaporization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q6073871 . ?ent wdt:P2116 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["In the process of vaporization enthalpy, what substance is considered the irritant?"],"info":{}}
{"id":"train_2401","question":"Did King Charles I of England and  King Louis XIII of France rule twenty years apart?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1639633 wdt:P674 wd:Q81506 . wd:Q1639633 wdt:P674 wd:Q737533 }","paraphrases":["Was there a twenty year span between King Charles 1 of England vand King Louis XIII of France?"],"info":{}}
{"id":"train_2406","question":"Tell me which eau de vie contains the word williamine in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2166541 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'williamine' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me which eau de vie includes the word williamine in it is name?"],"info":{}}
{"id":"train_2407","question":"Which is the satellite state that has the motto Workers of the world, unite! and contains the word democratic in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q325261 . ?sbj wdt:P1546 wd:Q877781 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'democratic' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the satellite tv for pc country that has the motto Workers of the world, unite! and consists of the word democratic in it's name?"],"info":{}}
{"id":"train_2408","question":"Was Stephen King born in Portland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q39829 wdt:P19 wd:Q49201 }","paraphrases":["Was Portland the birth place of Stephen King?"],"info":{}}
{"id":"train_2412","question":"Tell me archaeological site whose name has the word tripolis in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q839954 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tripolis' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me archaeological site whose name has the word tripolis in it."],"info":{}}
{"id":"train_2413","question":"How many have the facet polytope {rectangle} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1312 wd:Q209 }","paraphrases":["How many of the facet polytope rectangle are there?"],"info":{}}
{"id":"train_2414","question":"What is the formation of Zero Mostel with subsidiary company in the United States Army Human Resources Command?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q191952 wdt:P241 ?answer . ?answer wdt:P355 wd:Q7889484 }","paraphrases":["What is the formation of Zero Mostel in the U.S. Army Human Resources Command with a subsidiary?"],"info":{}}
{"id":"train_2416","question":"What is a phase change that starts with the letter s.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185357 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a stage alter that begins with the letter s."],"info":{}}
{"id":"train_2418","question":"What name is given for the least bite force in Otto's encyclopedia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q502895 . ?ent wdt:P3485 ?obj . ?ent wdt:P1343 wd:Q2041543 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Tell me the name for the least bite force in Otto's encyclopedia."],"info":{}}
{"id":"train_2420","question":"What is opposite of reality ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P461 wd:Q9510 }","paraphrases":[],"info":{}}
{"id":"train_2421","question":"Name a decimal classification that contains the word \"classification \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1207369 . ?sbj wdt:P747 wd:Q15222117 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'classification' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a decimal classification that includes the word \"classification \" in its name"],"info":{}}
{"id":"train_2422","question":"In what field of work was Theodosius Dobzhansky awarded the National Medal of Science?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q246731 p:P166 ?s . ?s ps:P166 wd:Q737051 . ?s pq:P101 ?value }","paraphrases":["What profession did Theodosius Dobzhansky have when awarded the National Medal of Science?"],"info":{}}
{"id":"train_2423","question":"Who shot and killed JFK?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q9696 p:P509 ?s . ?s ps:P509 wd:Q2140674 . ?s pq:P1542 ?value1 . ?s pq:P157 ?value2 }","paraphrases":["Who assassinated John F. Kennedy?"],"info":{}}
