{"id":"train_13526","question":"Which is the {city} of {Jared Leto} which has a {twin city} called {Bordeaux}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q484523 wdt:P551 ?answer . ?answer wdt:P190 wd:Q1479 }","paraphrases":["Which is the {city} of {Jared Leto} which has a {twin city} called {Bordeaux}?"],"info":{}}
{"id":"train_13530","question":"\"What is {geography of Melbourne}  of {geography of topic}, that has {Cate Blanchett} is {location born} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q80966 wdt:P19 ?answer . ?answer wdt:P2633 wd:Q5535186 }","paraphrases":["\"What is {topography of Melbourne} of {topography of subject}, that has {Cate Blanchett} is {area born} ?\""],"info":{}}
{"id":"train_13532","question":"When did Adrian Piper receive the Women's Caucus for Art Lifetime Achievement Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q373948 p:P166 ?s . ?s ps:P166 wd:Q17019319 . ?s pq:P585 ?value }","paraphrases":["In what year was the Lifetime Achievement Award for Art given to Adrian Piper by the Women's Caucus for Art?"],"info":{}}
{"id":"train_13533","question":"Which is different from the sternum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1889 wd:Q8481 }","paraphrases":[],"info":{}}
{"id":"train_13534","question":"Tell me  vector physical quantity whose name has the word velociy in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2672914 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'velocity' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me civil war whose name has the word war in it."],"info":{}}
{"id":"train_13538","question":"What are the coordinates of Douro's river mouth?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q14299 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q1233637 }","paraphrases":["Where is the mouth of the Doruro River?"],"info":{}}
{"id":"train_13539","question":"\"Which is {said to be different from} of {cloud}, whose {language of URL} is {creole language} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8074 wdt:P460 ?answer . ?answer wdt:P407 wd:Q33289 }","paraphrases":["\"Which is {said to be diverse from} of {cloud}, whose {dialect of URL} is {creole dialect} ?\""],"info":{}}
{"id":"train_13540","question":"When did British Airway stop operating the Concorde 204?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8766 p:P121 ?s . ?s ps:P121 wd:Q41240958 . ?s pq:P582 ?value }","paraphrases":["The Concorde 204 ceased operations in what year?"],"info":{}}
{"id":"train_13541","question":"Was Susan Sarandon's partner Tim Robbins?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q133050 wdt:P451 wd:Q95048 }","paraphrases":["Is it true that Tim Robbins was the partner of Susan Sarandon?"],"info":{}}
{"id":"train_13542","question":"What fan convention starts with the letter \"v\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1129398 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What fan tradition begins with the letter \"v\"?"],"info":{}}
{"id":"train_13544","question":"Name the divide and conquer algorithm discovered by Tony Hoare that contains the word \"quicksort\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q671298 . ?sbj wdt:P61 wd:Q92602 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'quicksort' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the divide and triumph over algorithm determined by using Tony Hoare that incorporates the phrase \"quicksort\" in its name"],"info":{}}
{"id":"train_13545","question":"What is outcome of fertilizer for crane ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178692 wdt:P618 ?X . ?X wdt:P828 ?answer }","paraphrases":["What is the result of crane fertilizer?"],"info":{}}
{"id":"train_13546","question":"For which sports team did Stanley Matthews play and in how many matches did he compete?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q216140 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["For which sports group did Stanley Matthews play and in how numerous matches did he compete?"],"info":{}}
{"id":"train_13547","question":"What is the highest level of judicial authority in the institution of the European Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q458 wdt:P209 ?obj . ?obj wdt:P31 wd:Q748720 }","paraphrases":["What is the most elevated level of legal specialist within the institution of the European Union?"],"info":{}}
{"id":"train_13548","question":"Which the Showrunner of the series of protest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q52146081 wdt:P179 ?X . ?X wdt:P1431 ?answer }","paraphrases":["Which the Showrunner of the arrangement of protest?"],"info":{}}
{"id":"train_13549","question":"Which sports team did Michelle Akers join on January 1, 1985?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q232508 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1985' ) ) }","paraphrases":["On January 1, 1985, what athletic team did Michelle Akers become a part of?"],"info":{}}
{"id":"train_13550","question":"What is the University board for the subsidary of the Georgia Institute of Technology.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P355 wd:Q864855 . ?sbj wdt:P31 wd:Q1075106 }","paraphrases":["What is the board of the University of Georgia Technology Institute's subsidy?"],"info":{}}
{"id":"train_13555","question":"Is the short-term exposure limit of benzene equal to 4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2270 wdt:P2407 ?obj filter ( ?obj = 4 ) }","paraphrases":["Is the short-term introduction constrain of benzene break even with to 4?"],"info":{}}
{"id":"train_13556","question":"Name the Core 2 Duo CPU with the fastest FSB speed ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5300 . ?ent wdt:P2150 ?obj . ?ent wdt:P279 wd:Q4036548 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Core 2 Duo CPUS has the fastest FSB speed?"],"info":{}}
{"id":"train_13557","question":"Which airline alliance does KLM belong to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P114 wd:Q181912 }","paraphrases":[],"info":{}}
{"id":"train_13559","question":"\"Which is {candidate} of {Battle of Oudenarde}, that has {diplomatic relation} is {Japan} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q316139 wdt:P710 ?answer . ?answer wdt:P530 wd:Q17 }","paraphrases":["\"Which is {candidate} of {Battle of Oudenarde}, that has {diplomatic relation} is {Japan} ?\""],"info":{}}
{"id":"train_13561","question":"Who is Ralph Vaughan Williams's pupil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207947 wdt:P802 ?X . ?X wdt:P1066 ?answer }","paraphrases":["Who is Ralph Vaughan Williams's pupil?"],"info":{}}
{"id":"train_13562","question":"Name a salad invented in Tijuana that contains the word \"caesar \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9266 . ?sbj wdt:P189 wd:Q124739 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'caesar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a serving of mixed greens designed in Tijuana that contains the word \"caesar \" in its name"],"info":{}}
{"id":"train_13563","question":"What is Zac Efron's timezone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q45229 wdt:P551 ?X . ?X wdt:P421 ?answer }","paraphrases":["What is Zac Efron's timezone?"],"info":{}}
{"id":"train_13565","question":"who child  of has brother of Arthur Baldwin, 3rd earl baldwin of bewdley ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4797909 wdt:P3373 ?X . ?X wdt:P22 ?answer }","paraphrases":["who child of has brother of Arthur Baldwin, 3rd earl baldwin of bewdley ?"],"info":{}}
{"id":"train_13566","question":"What is { total revenue } of { Alibaba Group } that is { time point } { 2016 - 0 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1359568 p:P2139 ?s . ?s ps:P2139 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["1000000000"],"info":{}}
{"id":"train_13571","question":"What is the olympic record for sprinting?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q624482 wdt:P641 ?X . ?X wdt:P2869 ?answer }","paraphrases":["what is the current record to beat for sprinting?"],"info":{}}
{"id":"train_13572","question":"tell me about the position that martin McGuinness elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q57689 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["et me know almost the position that martin McGuinness chosen in?"],"info":{}}
{"id":"train_13573","question":"What is the { end time } for { Holy Roman Emperor Frederick II } as { Isabella II of Jerusalem }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q130221 p:P26 ?s . ?s ps:P26 wd:Q233809 . ?s pq:P582 ?value }","paraphrases":["For {Holy Roman Emperor Fredrick II} what was the {end time} as {Isabella II of Jerusalem}"],"info":{}}
{"id":"train_13574","question":"What is the international parliament led by the President of the United Nations General Assembly that contains the word \"assembly\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6054776 . ?sbj wdt:P2388 wd:Q1161813 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'assembly' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the global parliament led through the President of the United Nations General Assembly that carries the phrase \"assembly\" in its name ?"],"info":{}}
{"id":"train_13576","question":"What are the colonial origins of the European Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q458 wdt:P150 ?obj . ?obj wdt:P31 wd:Q20181813 }","paraphrases":["What are the colonial beginnings of the European Union?"],"info":{}}
{"id":"train_13578","question":"Who is the film director of The Powerpuff Girls whose forename is Gennadi ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1236206 wdt:P57 ?answer . ?answer wdt:P735 wd:Q1502356 }","paraphrases":["Who is the film director of The Powerpuff Girls whose forename is Gennadi ?"],"info":{}}
{"id":"train_13580","question":"Name the medicine field related to pregnancy that starts with letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q35456 . ?sbj wdt:P3489 wd:Q28123568 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which medicine field is related to pregnancy that starts with letter W?"],"info":{}}
{"id":"train_13581","question":"What award did Michael Moorcock receive in 1976?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q316138 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1976' ) ) }","paraphrases":["In 1976, Michel Moorcock received what award?"],"info":{}}
{"id":"train_13582","question":"Who has said to be the same as Satan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P460 wd:Q35230 }","paraphrases":["Has anyone claimed to be the likes of Satan?"],"info":{}}
{"id":"train_13583","question":"What is in the category described by source of Mardonius ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q155063 wdt:P1343 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13585","question":"what is in the ammunition of rocket engine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P739 wd:Q335225 }","paraphrases":[],"info":{}}
{"id":"train_13586","question":"What are the maritime identification digits for the county of George Town?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q172996 wdt:P1376 ?X . ?X wdt:P2979 ?answer }","paraphrases":["Name the maritime identification digits for the county of George Town."],"info":{}}
{"id":"train_13587","question":"Which is the duration of Jurassic Park?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q167726 wdt:P2047 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13588","question":"Which suicide attack instigated the War on Terror?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1536 wd:Q185729 . ?sbj wdt:P31 wd:Q217327 }","paraphrases":[],"info":{}}
{"id":"train_13589","question":"What are the gene that encode Insulin, isoform CRA_a and which that starts with the letter i","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7187 . ?sbj wdt:P688 wd:Q21121462 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the gene that encode Insulin, isoform CRA_a and which that begins with the letter i"],"info":{}}
{"id":"train_13590","question":"what is fictional detective that contains the word sam in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3656924 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sam' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a fictional detective whose name contains the word sam?"],"info":{}}
{"id":"train_13592","question":"Who was the Church of Jesus Christ of Latter day Saints founder and who owns it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q42504 wdt:P1830 ?ans_1 . wd:Q42504 wdt:P112 ?ans_2 }","paraphrases":["Who founded the Church of Jesus Christ of Latter Day Saints, and who is it owned by?"],"info":{}}
{"id":"train_13593","question":"Which is the place of burial for Katowice?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P119 wd:Q588 }","paraphrases":[],"info":{}}
{"id":"train_13594","question":"When did series of World of Warcraft and follows?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q131007 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["When and after World Warcraft series?"],"info":{}}
{"id":"train_13597","question":"What what is archaeological site World Heritage criteria(iii)}  and also which starts with letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q839954 . ?sbj wdt:P2614 wd:Q23038977 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is archaeological web site World Heritage criteria(iii)} and also which starts with letter t"],"info":{}}
{"id":"train_13598","question":"Which is the city designated by government ordinance which starts with ō?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1749269 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ō' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the city designated by government ordinance which starts with ō?"],"info":{}}
{"id":"train_13599","question":"What is an active member of Salvador Dali?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5577 wdt:P937 ?X . ?X wdt:P463 ?answer }","paraphrases":["What are the qualifications to be a member of Salvador Dali?"],"info":{}}
{"id":"train_13600","question":"Who died in of authors of Oedipus Rex ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q148643 wdt:P50 ?X . ?X wdt:P20 ?answer }","paraphrases":["Which characters died in the play Oedipus Rex?"],"info":{}}
{"id":"train_13602","question":"When did Steve Bannon complete his studies at Virginia Tech?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16146870 p:P69 ?s . ?s ps:P69 wd:Q65379 . ?s pq:P582 ?value }","paraphrases":["When did Steve Bannon graduate from Viginia Tech?"],"info":{}}
{"id":"train_13604","question":"What is the region of Perth has wards such as the Shire of Cunderin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3183 wdt:P131 ?answer . ?answer wdt:P150 wd:Q1143918 }","paraphrases":["What is the region of Perth has wards such as the Shire of Cunderin?"],"info":{}}
{"id":"train_13606","question":"How many people have been inspired by The Lion King?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q36479 wdt:P941 ?obj }","paraphrases":["The Lion King was very inspiring. Can you say the total amount of people that have been inspired by it?"],"info":{}}
{"id":"train_13608","question":"which non-governmental organization for development starts with the letter o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3356057 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which non - governmental development organization begins with the letter o"],"info":{}}
{"id":"train_13609","question":"Who is Sebastian Pinera's nominee?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2453 wd:Q306 }","paraphrases":[],"info":{}}
{"id":"train_13610","question":"Which is the symbol of the physical form of British thermal unit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q211580 wdt:P111 ?X . ?X wdt:P416 ?answer }","paraphrases":["Specify the physical form symbol associated with British thermal unit."],"info":{}}
{"id":"train_13612","question":"Give me the name of  award received of Lin-Manuel Miranda that is winner is Alex Lacamoire?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1646482 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q4717332 }","paraphrases":["What award has Lin-Manuel Miranda received that has also been won by Alex Lacamoire?"],"info":{}}
{"id":"train_13613","question":"What is the vaccine used to prevent Hepatitis A?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1924 wd:Q157661 }","paraphrases":[],"info":{}}
{"id":"train_13615","question":"What was the population of Catania in 2017-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1903 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2017' ) ) }","paraphrases":["What was Catania's population at the start of 2017?"],"info":{}}
{"id":"train_13616","question":"Is it true that the energy storage capacity of Nokia X is less than 1800?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q15299648 wdt:P4140 ?obj filter ( ?obj < 1800.0 ) }","paraphrases":["Is it genuine that the vitality capacity capacity of Nokia X is less than 1800?"],"info":{}}
{"id":"train_13617","question":"What area of operations of the UEFA European Football Championship has an age of majority of 18.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q260858 wdt:P2541 ?answer . ?answer wdt:P2997 ?x FILTER ( contains ( ?x , '18.0' ) ) }","paraphrases":["What range of operations of the UEFA European Football Championship has an age of lion's share of 18.0?"],"info":{}}
{"id":"train_13618","question":"Who is nominated for Xuxa that is point in time is 2012-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q275939 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2012' ) ) }","paraphrases":["The nomination for Xuxa with the point in time of 2012-0-0 is?"],"info":{}}
{"id":"train_13622","question":"Was X-Men among the notable works of Ian McKellen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q170510 wdt:P800 wd:Q106182 }","paraphrases":["Do the notable works of Ian McKellen include X-Men?"],"info":{}}
{"id":"train_13624","question":"Which is the one responsible commander for John Ledyard's headed branch","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q718690 wdt:P241 ?X . ?X wdt:P4791 ?answer }","paraphrases":["Which is the one responsible commander for John Ledyard's headed department"],"info":{}}
{"id":"train_13625","question":"Does the Safar time index equal to 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q489557 wdt:P4895 ?obj filter ( ?obj = 2 ) }","paraphrases":["Is the Safar Time Index equal to 2?"],"info":{}}
{"id":"train_13627","question":"When did Rem Koolhaas receive the Pritzker Architecture Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q232364 p:P166 ?s . ?s ps:P166 wd:Q133160 . ?s pq:P585 ?value }","paraphrases":["which year the Rem Koolhaas receive the Pritzker Architecture Prize?"],"info":{}}
{"id":"train_13628","question":"When were Nelly Sachs books burned by the Nazi's?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q57074 p:P793 ?s . ?s ps:P793 wd:Q3927614 . ?s pq:P585 ?value }","paraphrases":["MAY 10, 1933"],"info":{}}
{"id":"train_13630","question":"Who is the founder of Marxism, and after whom was it named?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q7264 wdt:P61 ?ans_1 . wd:Q7264 wdt:P138 ?ans_2 }","paraphrases":["Marxism was founded by, and named after, which person?"],"info":{}}
{"id":"train_13631","question":"What is Soviet Union's office held by head of state and its office held by head of government?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q15180 wdt:P1906 ?ans_1 . wd:Q15180 wdt:P1313 ?ans_2 }","paraphrases":["Give me the name of the Soviet Union's office held by head of state and the office held by head of government."],"info":{}}
{"id":"train_13632","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P495 wd:Q18097 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["n/a"],"info":{}}
{"id":"train_13633","question":"How many points/goals/sets scored by Homare Sawa of the Washington Freedom team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q230865 p:P54 ?s . ?s ps:P54 wd:Q2151803 . ?s pq:P1351 ?value }","paraphrases":["Quantity of points by Homare Sawa of Washington Freedom Team?"],"info":{}}
{"id":"train_13634","question":"What position did George Curzon, 1st Marquess Curzon of Kedleston, hold from December 16, 1916 until October 10, 1923?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q271878 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1919' ) ) }","paraphrases":["who held the position of 1st Marquess Curzon of Kedleston from December 16, 1916 until October 10, 1923?"],"info":{}}
{"id":"train_13639","question":"Who was the actress that was mentioned in Red Skull?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2034529 wdt:P1441 ?X . ?X wdt:P161 ?answer }","paraphrases":["What actress was mentioned in Red Skull?"],"info":{}}
{"id":"train_13642","question":"When was the number of households in Kenitra 54158.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q478207 p:P1538 ?s . ?s ps:P1538 ?x filter ( contains ( ?x , '54158.0' ) ) . ?s pq:P585 ?value }","paraphrases":["During what time period were the households in Kenitria 54158.0?"],"info":{}}
{"id":"train_13643","question":"What has an sRGB of FFFFFF that is played for Casey Stengel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1047261 wdt:P54 ?answer . ?answer wdt:P465 ?x FILTER ( contains ( ?x , 'FFFFFF' ) ) }","paraphrases":["What has an sRGB of FFFFFF that is played for Casey Stengel?"],"info":{}}
