{"id":"train_8032","question":"tell me beer style starts with t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1998962 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know brew fashion begins with t"],"info":{}}
{"id":"train_8033","question":"Which galaxy with the Eridanus constellation has the fastest radial velocity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q318 . ?ent wdt:P2216 ?obj . ?ent wdt:P59 wd:Q10433 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Within the Eridanus constellation, what galaxy has the fastest radial velocity?"],"info":{}}
{"id":"train_8035","question":"Vladimir Lenin is a citizen of which republic of the Soviet Union ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1394 wdt:P27 ?obj . ?obj wdt:P31 wd:Q236036 }","paraphrases":[],"info":{}}
{"id":"train_8036","question":"Who is the sculptor portrayed in mandolin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q302497 wdt:P1299 ?X . ?X wdt:P170 ?answer }","paraphrases":["Which sculptor is portrayed in Mandolin?"],"info":{}}
{"id":"train_8037","question":"\"Whichis {protonym} of {King Quail}, that has {taxon parent} is {Tetrao} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q244429 wdt:P1403 ?answer . ?answer wdt:P171 wd:Q756174 }","paraphrases":["\"Whichis {protonym} of {Lord Quail}, that has {taxon parent} is {Tetrao} ?\""],"info":{}}
{"id":"train_8038","question":"Microbiology comes under which health specialty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1995 wd:Q7193 }","paraphrases":[],"info":{}}
{"id":"train_8039","question":"What is award received  from  Claudia Cardinale   point in time  is  2002 - 6 - 1 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q107006 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["What award in 2002 - 6 - 1 did Claudia Cardinale receive for point in time"],"info":{}}
{"id":"train_8041","question":"Which is the shopping day that starts with \"b\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43516519 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the shopping day that begins with \"b\"?"],"info":{}}
{"id":"train_8042","question":"How many US National Archives Identifier are mentioned in newspaper?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q11032 wdt:P1225 ?obj }","paraphrases":["What is the number of US National Archives that the newspaper mentioned?"],"info":{}}
{"id":"train_8043","question":"Is it true that julius_caesar has the citizenship of ancient rome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1048 wdt:P27 wd:Q1747689 }","paraphrases":["Does Julius Caesar hold the citizenship of ancient Rome?"],"info":{}}
{"id":"train_8044","question":"Which is the day in year for periodic occurrence of the Chinese New Year?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q131772 wdt:P837 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8045","question":"Who is the director and director of photography of Spirited Away?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q155653 wdt:P57 ?ans_1 . wd:Q155653 wdt:P344 ?ans_2 }","paraphrases":["The movie Spirited Away was directed by whom;  additionally, who directed the photography?"],"info":{}}
{"id":"train_8046","question":"Is it true that the prussian s 3 has 2.4 cylinders?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q319087 wdt:P1100 ?obj filter ( ?obj = 2.4 ) }","paraphrases":["How many cylinders does the Prussian S3 have?"],"info":{}}
{"id":"train_8047","question":"What is the home of Isaac?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q671872 wdt:P551 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8048","question":"What are the measurements for the mental depression disease ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q4340209 wdt:P1880 ?obj }","paraphrases":["What measurements are taken for the disease depression?"],"info":{}}
{"id":"train_8050","question":"How many significant drug interactions are there for aspirin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q18216 wdt:P769 ?obj }","paraphrases":["The significant number of drug interactions for asprin are?"],"info":{}}
{"id":"train_8051","question":"Which is the Compagnon de la Libération ID for Winston Churchill?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q8016 wdt:P4804 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8054","question":"Which is the taxon parent of the ingredient of squab?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7581884 wdt:P186 ?X . ?X wdt:P171 ?answer }","paraphrases":["Which is the taxon parent of the fixing of squab?"],"info":{}}
{"id":"train_8058","question":"What award did Fred Astaire receive in the year 1959?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q100937 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1959' ) ) }","paraphrases":["What was Fred Astaire awarded in the year 1959?"],"info":{}}
{"id":"train_8061","question":"Oleg Davydov played what instrument for what sport?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q920635 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["Oleg Davydov played what instrument for what sport?"],"info":{}}
{"id":"train_8062","question":"What is the diplomatic relation of the sovereign state of North China?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1046848 wdt:P17 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is the conciliatory connection of the imperial state of North China?"],"info":{}}
{"id":"train_8063","question":"Who is the {narrator} and the {characters} of {The_Catcher_in_the_Rye} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q183883 wdt:P2438 ?ans_1 . wd:Q183883 wdt:P674 ?ans_2 }","paraphrases":["which character narrated the catcher in the rye?"],"info":{}}
{"id":"train_8064","question":"WhIch is medical specialty of genetic association of FUT2 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18024807 wdt:P2293 ?X . ?X wdt:P1995 ?answer }","paraphrases":["WhIch is therapeutic claim to fame of hereditary affiliation of FUT2 ?"],"info":{}}
{"id":"train_8066","question":"WHICH IS THE AIRCRAFT MODEL THAT CONTAINS THE WORD TU IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15056995 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE Flying machine Show THAT CONTAINS THE WORD TU IN THEIR Title"],"info":{}}
{"id":"train_8069","question":"What was the top-level domain country code for the Soviet Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q15180 wdt:P78 ?obj . ?obj wdt:P31 wd:Q42032 }","paraphrases":["What was the top-level space nation code for the Soviet Union?"],"info":{}}
{"id":"train_8070","question":"In 1928, where was Ralph Bunch educated?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q213500 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1928' ) ) }","paraphrases":["Name the place where Ralph Bunch educated in the year 1928?"],"info":{}}
{"id":"train_8071","question":"What is the Australian Classification category with the highest minimum age whose instance of is 15 rating?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q26708074 . ?ent wdt:P2899 ?obj . ?ent wdt:P31 wd:Q47542366 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the Australian Classification category that has the highest minimum age of 15?"],"info":{}}
{"id":"train_8073","question":"Who are the publishers for Civilization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q1868663 wdt:P123 ?obj }","paraphrases":["Civilization is published by who?"],"info":{}}
{"id":"train_8075","question":"What country uses the currency of Japanese Yen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P38 wd:Q8146 . ?sbj wdt:P31 wd:Q6456916 }","paraphrases":["what is the country name using the currency Yen?"],"info":{}}
{"id":"train_8078","question":"WHat are the science branches that contain the word \"engineering\" in their name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2465832 . ?sbj wdt:P3095 wd:Q81096 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'engineering' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat are the science branches that contain the word \"designing\" in their title ?"],"info":{}}
{"id":"train_8079","question":"Name a computer network protocol that contain the word \" hypertext\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15836568 . ?sbj wdt:P92 wd:Q30500704 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hypertext' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What computer network protocol has the word \"hypertext\" in its name?"],"info":{}}
{"id":"train_8083","question":"When did Tadao Ando receive his Asahi Prize award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q208220 p:P166 ?s . ?s ps:P166 wd:Q720434 . ?s pq:P585 ?value }","paraphrases":["When did Tadao Ando get his Asahi Prize award?"],"info":{}}
{"id":"train_8084","question":"In 1993, what award did Anthony Hopkins receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q65932 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1993' ) ) }","paraphrases":["Name the award received by Anthony Hopkins in 1993."],"info":{}}
{"id":"train_8085","question":"When was the city of Frankfurt founded ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1794 p:P31 ?s . ?s ps:P31 ?x filter ( contains ( ?x , 'http://dbpedia.org/ontology/City' ) ) . ?s pq:P580 ?value }","paraphrases":["When was the city of Frankfurt established ?"],"info":{}}
{"id":"train_8086","question":"What is the played by of the before was of The Wiggles Movie Soundtrack ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7774812 wdt:P155 ?X . ?X wdt:P175 ?answer }","paraphrases":["What is the played by of the some time recently was of The Squirms Movie Soundtrack ?"],"info":{}}
{"id":"train_8087","question":"What are the hot spring which start with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q177380 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the hot spring which begin with the letter u"],"info":{}}
{"id":"train_8088","question":"What is the gene for genetic association of major depressive disorder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2293 wd:Q42844 . ?sbj wdt:P31 wd:Q7187 }","paraphrases":["Major depressive disorder is found on which gene?"],"info":{}}
{"id":"train_8089","question":"How many people have the title of Sir?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P97 wd:Q209690 }","paraphrases":["What is the number of people with the title of Sir?"],"info":{}}
{"id":"train_8091","question":"What does Bank of China own?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q790068 wdt:P127 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8092","question":"Name a sibling of Wonder Woman","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q338430 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q1114461 }","paraphrases":["Who is Wonder Woman's sister?"],"info":{}}
{"id":"train_8093","question":"What UK Country's electoral division has the minimum age?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q589282 . ?ent wdt:P4442 ?obj . ?ent wdt:P17 wd:Q145 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["give me the name of the electoral division minimum age?"],"info":{}}
{"id":"train_8097","question":"Is the atomic number of sulfur 16?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2359934 wdt:P1086 ?obj filter ( ?obj = 16 ) }","paraphrases":["Tell me the atomic number of sulfur 16?"],"info":{}}
{"id":"train_8098","question":"What is the subtopic in the economy of Japan with diplomatic relation with Afghanistan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q319831 wdt:P1269 ?answer . ?answer wdt:P530 wd:Q889 }","paraphrases":["What is the subtopic within the economy of Japan with conciliatory connection with Afghanistan?"],"info":{}}
{"id":"train_8104","question":"Who wrote the theme of the Bernstein Bears (1985 TV series)?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16200174 wdt:P144 ?X . ?X wdt:P50 ?answer }","paraphrases":["Who composed the topic of the Bernstein Bears (1985 TV series)?"],"info":{}}
{"id":"train_8105","question":"How many presenters has the Tonight Show had?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q1338655 wdt:P371 ?obj }","paraphrases":["The Tonight Show has had how many presenters?"],"info":{}}
{"id":"train_8108","question":"What is the determination method for war?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P459 wd:Q198 }","paraphrases":[],"info":{}}
{"id":"train_8109","question":"How many days in a year for the {Passover} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q121393 wdt:P837 ?obj }","paraphrases":["How many days out of the year is Passover?"],"info":{}}
{"id":"train_8110","question":"Tell me Divided country  whose name has the word korea in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11396118 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'korea' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me  Divided country whose name contains the word korea"],"info":{}}
{"id":"train_8111","question":"The coordinates of 26.933 94.7481 is the location of which county seat of Ahom kingdom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2308237 wdt:P1376 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '26.933 94.7481' ) ) }","paraphrases":["The coordinates of 26.933 94.7481 is the region of which county seat of Ahom kingdom?"],"info":{}}
{"id":"train_8112","question":"Which {has wards} of {stockholders} of {Kagawa Prefectural Road Route 18} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11667481 wdt:P127 ?X . ?X wdt:P150 ?answer }","paraphrases":["Which {has wards} of {stockholders} of {Kagawa Prefectural Street Course 18}"],"info":{}}
{"id":"train_8115","question":"Which is the natural language which starts with the letter t?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33742 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the natural language that starts with letter t?"],"info":{}}
{"id":"train_8116","question":"Is the town with the local dialling code 45 the home town of Horiyoshi III?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1558289 wdt:P551 ?answer . ?answer wdt:P473 ?x FILTER ( contains ( ?x , '45' ) ) }","paraphrases":["Is the town with the neighborhood dialling code forty five the domestic town of Horiyoshi III?"],"info":{}}
{"id":"train_8118","question":"Which is the FIS ski jumper ID of Matti Nykänen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q16849 wdt:P2775 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8120","question":"What twinned administrative body of Krakow started in 1995?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q31487 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1995' ) ) }","paraphrases":["in 1995 Krakow started what administrative body?"],"info":{}}
{"id":"train_8121","question":"When did Karl Pearson become a member of the American Academy of Arts and Sciences?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q310794 p:P463 ?s . ?s ps:P463 wd:Q463303 . ?s pq:P580 ?value }","paraphrases":["What was the date that Karl Person began his membership at the American Academy of Arts and Sciences?"],"info":{}}
{"id":"train_8124","question":"A degree in the history of mathematics requires what academic discipline or degree?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2184 wd:Q185264 . ?sbj wdt:P31 wd:Q11862829 }","paraphrases":["A degree within the history of science requires what scholastic teach or degree?"],"info":{}}
{"id":"train_8126","question":"When did Lech Walesa receive the Order of Pius IX award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q444 p:P166 ?s . ?s ps:P166 wd:Q1423841 . ?s pq:P585 ?value }","paraphrases":["When Lech Wales was presented with the Order of Pius IX award, what was the date?"],"info":{}}
{"id":"train_8127","question":"Who is the mayor of Sihanoukville's sister town?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18207676 wdt:P190 ?X . ?X wdt:P6 ?answer }","paraphrases":["Who is the leader of Sihanoukville's sister town?"],"info":{}}
{"id":"train_8128","question":"Where is the death location coined by BL Lacertae?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q373148 wdt:P61 ?X . ?X wdt:P20 ?answer }","paraphrases":["Where is the passing area coined by BL Lacertae?"],"info":{}}
{"id":"train_8130","question":"Is the literate population of Matukpur equals 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q60379965 wdt:P6499 ?obj filter ( ?obj = 0 ) }","paraphrases":["Are there 0 people a part of the literate population of Matukpur?"],"info":{}}
{"id":"train_8131","question":"What town is near where Yi Sun-sin was born.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q50184 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["What town is close where Yi Sun-sin was born."],"info":{}}
{"id":"train_8132","question":"re the number of elevators in the Garching-Forschungszentrum equal to 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q439592 wdt:P1301 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is there one elevator in the Garching-Forschungszentrum?"],"info":{}}
{"id":"train_8133","question":"What is the sequel to Great Expectations ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P156 wd:Q219552 . ?sbj wdt:P31 wd:Q47461344 }","paraphrases":["What is the continuation to Incredible Desires ?"],"info":{}}
{"id":"train_8134","question":"What kind of ships are produced by SpaceX?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q193701 wdt:P1056 ?obj . ?obj wdt:P31 wd:Q2235308 }","paraphrases":["What kind of ships are delivered by SpaceX?"],"info":{}}
{"id":"train_8136","question":"Is the radial velocity of the Andromeda galaxy greater than -240.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2469 wdt:P2216 ?obj filter ( ?obj > -240.8 ) }","paraphrases":["Tell me if the radial velocity of the Andromeda galaxy is more than -240.8."],"info":{}}
{"id":"train_8138","question":"Name a communist party located at Pravda that starts with letter C","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q233591 . ?sbj wdt:P2813 wd:Q183644 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a communist party placed at Pravda that starts offevolved with letter C"],"info":{}}
{"id":"train_8139","question":"What religion resides in the history of Islam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q642379 wdt:P1269 ?obj . ?obj wdt:P31 wd:Q9174 }","paraphrases":["What religion dwells within the history of Islam?"],"info":{}}
{"id":"train_8140","question":"Who are the kids of Henry I of England, whose brother is Robert FitzEdith, Lord Okehampton}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q101384 wdt:P40 ?answer . ?answer wdt:P3373 wd:Q7344358 }","paraphrases":["Who are the kids of Henry I of Britain, whose brother is Robert FitzEdith, Master Okehampton}?"],"info":{}}
{"id":"train_8142","question":"what is the locomotive class has the highest  boiler pressure?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19832486 . ?ent wdt:P5071 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What category of locomotives have higher pressure in the boiler?"],"info":{}}
{"id":"train_8144","question":"Who is the  {taxon} for {parent taxon} of {fly agaric}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q131227 wdt:P171 ?obj . ?obj wdt:P31 wd:Q16521 }","paraphrases":["Who is the {taxon} for {parent taxon} of {fly agari"],"info":{}}
{"id":"train_8145","question":"What method did the census use to determine the population of the Coquimbo Region?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2121 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["The population of Coquimbo Region was conducted by the census using what method?"],"info":{}}
{"id":"train_8147","question":"What does the nominee of the Donald Allen Wollheim receive?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q908589 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What does the candidate of the Donald Allen Wollheim receive?"],"info":{}}
{"id":"train_8150","question":"When was the Human Development Index recorded as 0.827 for Argentina?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q414 p:P1081 ?s . ?s ps:P1081 ?x filter ( contains ( ?x , '0.827' ) ) . ?s pq:P585 ?value }","paraphrases":["When the Human Development Index was recorded at 0.827 for Argentina, what was the date?"],"info":{}}
{"id":"train_8151","question":"When did Santiago Ramón y Cajal receive the award for Grand Cross of the Order of Isabella Catholic?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q150526 p:P166 ?s . ?s ps:P166 wd:Q17365974 . ?s pq:P585 ?value }","paraphrases":["On what date did Santiago Ramón y Cajal receive the award for Grand Cross of the Order of Isabella Catholic?"],"info":{}}
{"id":"train_8152","question":"Tell me era whose name has the word zirconian in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q630830 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zirconian' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the age in which the word zirconian has its name."],"info":{}}
{"id":"train_8153","question":"Where was the contestant, Kiri born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q48699802 wdt:P161 ?X . ?X wdt:P19 ?answer }","paraphrases":["Where was the hopeful, Kiri born?"],"info":{}}
{"id":"train_8155","question":"Do American football player wear football boots?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41323 wdt:P2283 wd:Q512804 }","paraphrases":["Is football boots worn by American football players?"],"info":{}}
{"id":"train_8156","question":"What thermal power station in Russia/the Soviet Union has the smallest capacity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q200297 . ?ent wdt:P2109 ?obj . ?ent wdt:P31 wd:Q2628147 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which thermal power station in Russia has the least capacity?"],"info":{}}
