{"id":"train_12797","question":"When did Bergen stop being controlled by a union between Sweden and Norway?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q26793 p:P17 ?s . ?s ps:P17 wd:Q62589 . ?s pq:P582 ?value }","paraphrases":["Name the time at which Bergen was no longer controlled by a Sweden/Norway union."],"info":{}}
{"id":"train_12798","question":"How many matches have been played by Arsène Wenger as a member of the sports team RC Strasbourg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47576 p:P54 ?s . ?s ps:P54 wd:Q126334 . ?s pq:P1350 ?value }","paraphrases":["Arsene Wenger has had how many matches while as a member of the sports team RC Strasbourg?"],"info":{}}
{"id":"train_12799","question":"Csc-blanc-spreadthesign.ogv has a  plagioclase label in sign language, what is the streak color?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q714830 wdt:P534 ?answer . ?answer wdt:P2919 ?x FILTER ( contains ( ?x , 'Csc-blanc-spreadthesign.ogv' ) ) }","paraphrases":["Csc-blanc-spreadthesign.ogv encompasses a plagioclase name in sign dialect, what is the streak color?"],"info":{}}
{"id":"train_12801","question":"What historical Chinese state replaces Yuan dynasty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7313 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q50068795 }","paraphrases":["What chronicled Chinese state replaces Yuan dynasty?"],"info":{}}
{"id":"train_12802","question":"Can you name the species of omnivore with the longest observed lifespan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P4214 ?obj . ?ent wdt:P279 wd:Q164509 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the longest living omnivorous species?"],"info":{}}
{"id":"train_12803","question":"What is an anime television series that contains the word yatterman in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11086742 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yatterman' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is an anime tv arrangement that contains the word yatterman in its title?"],"info":{}}
{"id":"train_12804","question":"what is the located in the administrative territorial entity for email giles has place of birth as odessa?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q319732 p:P19 ?s . ?s ps:P19 wd:Q1874 . ?s pq:P131 ?value }","paraphrases":["where is the admin territory for giles in odessa?"],"info":{}}
{"id":"train_12805","question":"How many muscles work on the clavicle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q16343 wdt:P3491 ?obj }","paraphrases":["The clavicle has how many muscles working on it?"],"info":{}}
{"id":"train_12806","question":"What maintenance is connected with Tochigi Prefecturual Road Route 175?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11535385 wdt:P2789 ?X . ?X wdt:P126 ?answer }","paraphrases":["What upkeep is associated with Tochigi Prefecturual Street Course 175?"],"info":{}}
{"id":"train_12807","question":"What is Russian language regulatory body.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7737 wdt:P1018 ?obj . ?obj wdt:P31 wd:Q2093358 }","paraphrases":["What is Russian dialect administrative body."],"info":{}}
{"id":"train_12808","question":"Who replaced Macbeth, King of Scotland as the Monarch of Scotland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q244403 p:P39 ?s . ?s ps:P39 wd:Q18810063 . ?s pq:P1365 ?value }","paraphrases":["Who took over from Macbeth as the new Monarch of Scotland?"],"info":{}}
{"id":"train_12809","question":"In 1646, what was the name of the spouse of Ferdinand III, Holy Roman Emperor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q150575 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1646' ) ) }","paraphrases":["In 1646, what was the name of the mate of Ferdinand III, Holy Roman Emperor?"],"info":{}}
{"id":"train_12810","question":"Which is {given name} of {G. M. Trevelyan} whose {series ordinal} is {1} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1373357 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '1' ) ) }","paraphrases":["Get me the name of G. M. Trevelyan with series ordinal 1"],"info":{}}
{"id":"train_12815","question":"What subtopic of Moscow's history contains the division called the Khoroshyovsky District?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q338434 wdt:P1269 ?answer . ?answer wdt:P150 wd:Q2366712 }","paraphrases":["What subtopic of Moscow's history contains the division called the Khoroshyovsky District?"],"info":{}}
{"id":"train_12817","question":"What is the taxon with the minimum genome size whose instance of is taxon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P2143 ?obj . ?ent wdt:P31 wd:Q16521 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the name of the taxon with the minimum genome size whose instance of is taxon?"],"info":{}}
{"id":"train_12818","question":"Name the architectural structure with maximum number of elevators?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q811979 . ?ent wdt:P1301 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which building has the most elevators?"],"info":{}}
{"id":"train_12819","question":"Which subsidiary company of Alstom has it's head quarters in London?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q309084 wdt:P355 ?answer . ?answer wdt:P159 wd:Q84 }","paraphrases":["Which subsidiary enterprise of Alstom has it is head quarters in London?"],"info":{}}
{"id":"train_12820","question":"What is the uncertainty that corresponds to tritium, which has a mass excess of 14949.8?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q54389 p:P2160 ?s . ?s ps:P2160 ?x filter ( contains ( ?x , '14949.8' ) ) . ?s pq:P2571 ?value }","paraphrases":["Which is the uncertainty that corresponds to tritium, which has a mass excess of 14949.8?"],"info":{}}
{"id":"train_12822","question":"Which is the mouthpiece of Pravda?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2813 wd:Q183644 }","paraphrases":[],"info":{}}
{"id":"train_12823","question":"What are the  creation myth which start with the letter d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215304 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the creation myth which begin with the letter d"],"info":{}}
{"id":"train_12824","question":"When was Martin Heidegger nominated for a Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q48301 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["Martin Heidegger was nominated for the Nobel Prize in Literature for what?"],"info":{}}
{"id":"train_12826","question":"What sport has the least amount of players according to the Armenian Soviet Encyclopedia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q31629 . ?ent wdt:P1872 ?obj . ?ent wdt:P1343 wd:Q2657718 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["According to the Armenian soviet Encycolpedia, which sport has a lower quantity of players?"],"info":{}}
{"id":"train_12827","question":"Is fascism opposite of anti-fascism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6223 wdt:P461 wd:Q210189 }","paraphrases":["Are fascism and anti-fascism opposites?"],"info":{}}
{"id":"train_12828","question":"Who follows Berengar 1 of Italy as monarch of Italy","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q274606 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Who takes after Berengar 1 of Italy as ruler of Italy"],"info":{}}
{"id":"train_12829","question":"Who is the participant of Lee Chong Wei whose ranking is 3.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q319346 p:P1344 ?s . ?s ps:P1344 ?obj . ?s pq:P1352 ?x filter ( contains ( ?x , '3.0' ) ) }","paraphrases":["What is Lee Chong Wei's official ranking?"],"info":{}}
{"id":"train_12831","question":"Who is the pupil of the tutor Miguel Ángel Estrella?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q960716 wdt:P1066 ?X . ?X wdt:P802 ?answer }","paraphrases":["Give me the name of the pupil of the tutor Miguel Ángel Estrella."],"info":{}}
{"id":"train_12833","question":"What chemical compound is considered a Class IB flammable liquid and has a maximum peak exposure limit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P2406 ?obj . ?ent wdt:P31 wd:Q11173 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What chemical compound is considered a Lesson IB combustible fluid and includes a greatest top introduction limit?"],"info":{}}
{"id":"train_12835","question":"Moon Jae-in is the leader of what country?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q21001 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["What country does Moon Jae-in lead?"],"info":{}}
{"id":"train_12836","question":"Who gave the{founder} of {owner} of {Bigbig Studios} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q794750 wdt:P127 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who gave { owner } of { Bigbig Studios } to the { founder }?"],"info":{}}
{"id":"train_12838","question":"When did Ernst Mach get nominated for an Nobel Prize in Physics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q93996 p:P1411 ?s . ?s ps:P1411 wd:Q38104 . ?s pq:P585 ?value }","paraphrases":["In which year was Ernst Mach nominated for Nobel Prize in Physics?"],"info":{}}
{"id":"train_12840","question":"IS THE RURAL POULATION OF SERCHHIP DISTRICT EQUALS 39501.6","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2086190 wdt:P6344 ?obj filter ( ?obj = 39501.6 ) }","paraphrases":["IS THE Provincial POULATION OF SERCHHIP Area Breaks even with 39501.6"],"info":{}}
{"id":"train_12841","question":"Where is the mouth of the Rhone river?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q602 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q1233637 }","paraphrases":["Where does the Rhone river begin?"],"info":{}}
{"id":"train_12842","question":"If I am looking for people associated with the voivodeship of Lusaka, is it correct to write Category:People from Lusaka Province?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3881 wdt:P131 ?answer . ?answer wdt:P1792 wd:Q8740956 }","paraphrases":["If I am looking for humans associated with the voivodeship of Lusaka, is it correct to write Category:People from Lusaka Province?"],"info":{}}
{"id":"train_12843","question":"What position did Stanley Baldwin hold as an elected member of the 29th Parliament of the UK and why did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q166635 p:P39 ?s . ?s ps:P39 wd:Q41582579 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["Give me position of Stanley Baldwin, member of the 29th Parliament of the UK  and why did it end?"],"info":{}}
{"id":"train_12844","question":"Tell me inner plant whose name has the word venus in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3504248 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'venus' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know internal plant whose title has the word venus in it."],"info":{}}
{"id":"train_12848","question":"Who is the mother and her date of birth of Pedro I her child, Prince of Beira?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q4765121 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["Which woman gave birth to Pedro I, the Prince of Beira, and on what day?"],"info":{}}
{"id":"train_12853","question":"Is the luminous intensity of the Umhlanga Rocks Lighthouse more than 480000.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13036249 wdt:P3041 ?obj filter ( ?obj > 480000.0 ) }","paraphrases":["Is the luminous intensity of the Umhlanga Rocks Lighthouse greater than 480000.0?"],"info":{}}
{"id":"train_12854","question":"Which is the maximum age for compulsory education of Haiti?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q790 wdt:P3271 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12855","question":"The Graphics Interchange Format has which Uniform Type Identifier?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2192 wdt:P3641 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12856","question":"When did Perpignan start as twinned administrative body as Tyre?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6730 p:P190 ?s . ?s ps:P190 wd:Q82070 . ?s pq:P580 ?value }","paraphrases":["When did Perpignan start as the body of Tyre?"],"info":{}}
{"id":"train_12857","question":"Name an economic union that has strong ties with Switzerland that contains the word \"E \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3623811 . ?sbj wdt:P530 wd:Q39 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an economic union that has strong ties with Switzerland that contains the word \"E \" in its name"],"info":{}}
{"id":"train_12858","question":"When did Limoges have a population of 133627?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q45656 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '133627' ) ) . ?s pq:P585 ?value }","paraphrases":["Limoges had a population of 133627 where?"],"info":{}}
{"id":"train_12860","question":"na","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q382062 wdt:P509 ?X . ?X wdt:P927 ?answer }","paraphrases":["na"],"info":{}}
{"id":"train_12862","question":"Who is the daughter of the Unfinished Symphony's film director?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7884354 wdt:P57 ?X . ?X wdt:P22 ?answer }","paraphrases":["Who is the Unfinished Symphony's film director's daughter?"],"info":{}}
{"id":"train_12863","question":"Who is the titleholder of the honor of Evangelina Vigil-Piñón?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16143588 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["who holds the title of the honor of Evangelina Vigil-Piñón?"],"info":{}}
{"id":"train_12864","question":"When did Oslo have a population of 623966?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q585 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '623966.0' ) ) . ?s pq:P585 ?value }","paraphrases":["Oslo's population was 623966 at what time?"],"info":{}}
{"id":"train_12865","question":"Where was the accident located of Hugo Münsterberg ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57946 wdt:P937 ?X . ?X wdt:P793 ?answer }","paraphrases":["Where was the mishap found of Hugo Münsterberg ?"],"info":{}}
{"id":"train_12866","question":"Tell me a treatment used for the medical condition of lidocaine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q216935 wdt:P2175 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What treatment is used for lidocaine?"],"info":{}}
{"id":"train_12867","question":"When did August Wilson get nominated for the Drama Desk Award for Outstanding Play?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q764812 p:P1411 ?s . ?s ps:P1411 wd:Q5305720 . ?s pq:P585 ?value }","paraphrases":["Drama Desk Award nominations for Outstanding Play included August Wilson in what year?"],"info":{}}
{"id":"train_12872","question":"Are the eligible voters of the Catalan regional election 2015 in Gisclareny equal to 26?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44869211 wdt:P1867 ?obj filter ( ?obj = 26 ) }","paraphrases":["Does one have to be 26 to be an eligible voter of the Catalan regional election in Gisclareny in 2015?"],"info":{}}
{"id":"train_12873","question":"What are the cuisines in the {sushi} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2012 wd:Q46383 }","paraphrases":["What type of cuisine is sushi?"],"info":{}}
{"id":"train_12874","question":"What country for Pius IX has the birth place of Senigallia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43720 p:P19 ?s . ?s ps:P19 wd:Q124925 . ?s pq:P17 ?value }","paraphrases":["Which country for Pius IX holds the place of birth of Senigallia?"],"info":{}}
{"id":"train_12875","question":"Which sports team did Tim Cahill play 2 matches for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q187238 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter ( contains ( ?x , '2.0' ) ) }","paraphrases":["Tim Cahill played 2 matches for which sports team?"],"info":{}}
{"id":"train_12876","question":"tell me satellite state that anthem Rising from the Ruins  starts with d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q325261 . ?sbj wdt:P85 wd:Q48147 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["inform me satellite country that anthem Rising from the Ruins begins with d"],"info":{}}
{"id":"train_12877","question":"tell me the port city with the highest point that starts with lettter \"b\" in Tibidabo.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2264924 . ?sbj wdt:P610 wd:Q658271 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know the harbour city with the most noteworthy point that begins with lettter \"b\" in Tibidabo."],"info":{}}
{"id":"train_12878","question":"Which dwarf planet follows (134339) 5628 T-3 and which that starts with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2199 . ?sbj wdt:P155 wd:Q3454012 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which dwarf planet follows (134339) 5628 T-3 and which that starts offevolved with the letter p"],"info":{}}
{"id":"train_12880","question":"Is it true that floors above ground of Ahlden House equals to 1.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q567878 wdt:P1101 ?obj filter ( ?obj = 1.6 ) }","paraphrases":["Are there 1.6 floors above ground on Ahlden House?"],"info":{}}
{"id":"train_12882","question":"What city with many monuments contains the word \"yekaterinburg \" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7930989 . ?sbj wdt:P1456 wd:Q16724419 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yekaterinburg' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What town with many monuments includes the word \"yekaterinburg \" in its identify ?"],"info":{}}
{"id":"train_12883","question":"which state of india starts with letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13390680 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which state of india begins with letter u"],"info":{}}
{"id":"train_12884","question":"Who is the patron saint of Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q90 wdt:P417 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What's Paris's patron saint?"],"info":{}}
{"id":"train_12887","question":"the","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q19661 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["the"],"info":{}}
{"id":"train_12891","question":"Is it true that the galactic latitude of SN 1987A is greater than -38.28?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q584905 wdt:P6261 ?obj filter ( ?obj > -38.28 ) }","paraphrases":["Is it true that SN 1987A's galactic latitude exceeds -38.28?"],"info":{}}
{"id":"train_12892","question":"What what is ice giant parent astronomical body Sun which that starts with letters u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1319599 . ?sbj wdt:P397 wd:Q525 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is ice massive father or mother astronomical body Sun which that begins with letters u"],"info":{}}
{"id":"train_12894","question":"Who is the disciple of Louise Elisabeth Vigee Le Brun that has a major work called the Portrait of a Negress?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q213163 wdt:P802 ?answer . ?answer wdt:P800 wd:Q1923320 }","paraphrases":["Who is the disciple of Louise Elisabeth Vigee Le Brun that has a important work called the Portrait of a Negress?"],"info":{}}
{"id":"train_12895","question":"On which year Felix Adler became an employee of Columbia University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1386165 p:P108 ?s . ?s ps:P108 wd:Q49088 . ?s pq:P580 ?value }","paraphrases":["When did Felix Adler start working for Columbia University?"],"info":{}}
{"id":"train_12896","question":"Which is the INSEE municipality code for Cayenne?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q44401 wdt:P374 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12897","question":"Which is the historical aspect of the facet of Hungary?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1269 wd:Q9067 . ?sbj wdt:P31 wd:Q17524420 }","paraphrases":["Which is the verifiable angle of the feature of Hungary?"],"info":{}}
{"id":"train_12898","question":"What are the aircraft model which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15056995 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the aircraft models that begin with alphabet T."],"info":{}}
{"id":"train_12901","question":"What is number out of school children  stockholders of The Birth of Venus ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1283024 wdt:P127 ?X . ?X wdt:P2573 ?answer }","paraphrases":["During The Birth of Venus, how many school children stockholders are there?"],"info":{}}
{"id":"train_12902","question":"What is the single-family detached home with a heritage designation from the tentative World Heritage Site that contains \"house\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1307276 . ?sbj wdt:P1435 wd:Q17278671 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'house' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the single-family indifferent domestic with a heritage designation from the tentative World Heritage Site that contains \"house\" in its name?"],"info":{}}
{"id":"train_12903","question":"What book of the Bible is written in Hebrew?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q9288 . ?sbj wdt:P31 wd:Q29154430 }","paraphrases":[],"info":{}}
