{"id":"train_10363","question":"Name a City in France with many monuments that starts with letter L","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22927616 . ?sbj wdt:P1456 wd:Q3252117 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a City in France with numerous landmarks that begins with letter L"],"info":{}}
{"id":"train_10365","question":"Does Dick Cheney have children Elizabeth Cheney and Mary Cheney?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q48259 wdt:P40 wd:Q5362573 . wd:Q48259 wdt:P40 wd:Q442226 }","paraphrases":["How many children does Dick Cheney have?"],"info":{}}
{"id":"train_10366","question":"Who is the rector of McGill University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q201492 wdt:P1075 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the minister of McGill University?"],"info":{}}
{"id":"train_10367","question":"Who is the {national anthem} for {anthem} of {European Union}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q458 wdt:P85 ?obj . ?obj wdt:P31 wd:Q23691 }","paraphrases":["Who is the {national song of devotion} for {song of devotion} of {European Union}"],"info":{}}
{"id":"train_10368","question":"What sports team was Glenn Mcgrath a member of during the 2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1392178 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["What team did Glenn McGrath play for during the 2000?"],"info":{}}
{"id":"train_10369","question":"Is the number of volunteers of the French Red Cross equal to 68400?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3003244 wdt:P6125 ?obj filter ( ?obj = 68400.0 ) }","paraphrases":["Does the French Red Cross have 68400 volunteers?"],"info":{}}
{"id":"train_10371","question":"When did Martin Scorsese receive his Grammy Award for best music film?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q41148 p:P166 ?s . ?s ps:P166 wd:Q4992254 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["On what date did Martin Scorses receive his Grammy Award for best music film?"],"info":{}}
{"id":"train_10372","question":"What is the GUI toolkit or framework for Objective-C?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1414 wd:Q188531 }","paraphrases":[],"info":{}}
{"id":"train_10373","question":"Who is Luigi's sidekick?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q210593 wdt:P2546 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10374","question":"What was Mark Rylance awarded the BAFTA Best Actor Award for.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q324572 p:P166 ?s . ?s ps:P166 wd:Q2925701 . ?s pq:P1686 ?value }","paraphrases":["Mark Rylance was given the BAFTA Best Actor Award for what work of his?"],"info":{}}
{"id":"train_10375","question":"What is Songkick artist ID of Bohuslav Martinů ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q223258 wdt:P3478 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10378","question":"Which is {extreme south} {set location} as {The Third Man} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q271830 wdt:P840 ?X . ?X wdt:P1333 ?answer }","paraphrases":["The Third Man had what extreme south set location?"],"info":{}}
{"id":"train_10380","question":"What is the altitude of the town of Saskatoon ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10566 wdt:P190 ?X . ?X wdt:P2044 ?answer }","paraphrases":["At what altitude is Saskatoon town located?"],"info":{}}
{"id":"train_10382","question":"Name a city located next to the Rhine river that contains the word \" mannheim\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1187811 . ?sbj wdt:P206 wd:Q584 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'mannheim' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a city situated alongside the Rhine stream that contains the word \" mannheim\" in its name"],"info":{}}
{"id":"train_10383","question":"Who is the actress in Cotton Comes to Harlem?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5175678 wdt:P156 ?X . ?X wdt:P161 ?answer }","paraphrases":["Who is the female star in \"Cotton Comes to Harlem?\""],"info":{}}
{"id":"train_10384","question":"Is the chromosome count of the Passiflora pentagona equal to 24?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q17557987 wdt:P5230 ?obj filter ( ?obj = 24 ) }","paraphrases":["The Passiflora pentagona chromosome count, if memory serves me correct, is the number 24, correct?"],"info":{}}
{"id":"train_10385","question":"Where is the birthplace of Joseph Brodsky that is on the edge of the Bolshaya Neva River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q862 wdt:P19 ?answer . ?answer wdt:P206 wd:Q27780 }","paraphrases":["Where is the birthplace of Joseph Brodsky that is on the part of the Bolshaya Neva River?"],"info":{}}
{"id":"train_10386","question":"Who played Forrest Gump","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q134773 wdt:P161 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What actor played Forrest Gump?"],"info":{}}
{"id":"train_10390","question":"Give me the big city with the largest fiscal/tax revenue located in the region of Metro Manila.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1549591 . ?ent wdt:P3087 ?obj . ?ent wdt:P131 wd:Q13580 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which City in Metro Manila has the largest fiscal/tax  revenue?"],"info":{}}
{"id":"train_10395","question":"TELL ME WHICH IS THE MONOTYPIC TAXON STARTS WITH T","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q310890 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know WHICH IS THE MONOTYPIC TAXON Begins WITH T"],"info":{}}
{"id":"train_10396","question":"What are some famous pieces composed by The Seasons?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7762868 wdt:P86 ?X . ?X wdt:P800 ?answer }","paraphrases":["What are a few celebrated pieces composed by The Seasons?"],"info":{}}
{"id":"train_10397","question":"Where is the deathplace of Rupa Goswami whose height is 170.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2989506 wdt:P20 ?answer . ?answer wdt:P2044 ?x FILTER ( contains ( ?x , '170.0' ) ) }","paraphrases":["Where is the deathplace of Rupa Goswami whose stature is 170.0?"],"info":{}}
{"id":"train_10402","question":"What are the thoracic disease which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18553676 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the thoracic disease that begins with the letter s"],"info":{}}
{"id":"train_10405","question":"What is the location of the place of death for Aleksis Kivi in the administrative territorial entity?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q216904 p:P20 ?s . ?s ps:P20 wd:Q17380002 . ?s pq:P131 ?value }","paraphrases":["Which is the location of the place of death of Aleksis Kivi?"],"info":{}}
{"id":"train_10406","question":"At what point in time did Barry Bonds receive the award for MLB MVP?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q314712 p:P166 ?s . ?s ps:P166 wd:Q1514249 . ?s pq:P585 ?value }","paraphrases":["When did Barry Bonds get the MVP award?"],"info":{}}
{"id":"train_10407","question":"Who preceded and who followed Charles the Fat as emperor of Occident?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q150712 p:P97 ?s . ?s ps:P97 wd:Q23906200 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Who preceded and who observed Charles the Fat as emperor of Occident?"],"info":{}}
{"id":"train_10408","question":"Which is the first edition?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P747 wd:Q199 }","paraphrases":[],"info":{}}
{"id":"train_10409","question":"What was the inflation rate of Estonia in the year of 2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q191 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["What was Estonia's year 2000 inflation rate?"],"info":{}}
{"id":"train_10410","question":"Were there 0 missing people after the 2018 Magnitogorsk building collapse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q60311957 wdt:P1446 ?obj filter ( ?obj = 0 ) }","paraphrases":["Were there no missing people after the 2018 Magnitogorsk building collapse?"],"info":{}}
{"id":"train_10412","question":"Cairo is located in which country that began on May second in the year 1250?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q85 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1250' ) ) }","paraphrases":["On May 2nd, 1250, what country began where Cairo is located?"],"info":{}}
{"id":"train_10413","question":"Who built the seat of mastermind?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17286 wdt:P176 ?X . ?X wdt:P159 ?answer }","paraphrases":["Who built the situate of mastermind?"],"info":{}}
{"id":"train_10414","question":"What are notation which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2001982 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the notation beginning with the letter s"],"info":{}}
{"id":"train_10415","question":"When did Ivan Udaltsov start as rector for Moscow State University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q13164 p:P1075 ?s . ?s ps:P1075 wd:Q4469264 . ?s pq:P580 ?value }","paraphrases":["On What date did Ivan Udaltsov start as rector for Moscow State University?"],"info":{}}
{"id":"train_10416","question":"Who was a noble before the Frank Duke of Lithuania and who was after him?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q244852 p:P97 ?s . ?s ps:P97 wd:Q2639920 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Who was a respectable some time recently the Straight to the point Duke of Lithuania and who was after him?"],"info":{}}
{"id":"train_10417","question":"where is the {point in time} for {bell hooks} who has {educated at} as {Stanford University} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q259507 p:P69 ?s . ?s ps:P69 wd:Q41506 . ?s pq:P585 ?value }","paraphrases":["where is the {point in time} for {chime snares} who has {taught at} as {Stanford College} ?"],"info":{}}
{"id":"train_10419","question":"Which musician created the album The Fragile?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q902850 wdt:P658 ?X . ?X wdt:P175 ?answer }","paraphrases":["Who is the composer of The Fragile?"],"info":{}}
{"id":"train_10420","question":"Did the 2008 Iwate-Miyagi Nairiku earthquake reach JMA magnitude 5.76?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q748301 wdt:P5900 ?obj filter ( ?obj = 5.76 ) }","paraphrases":["Was the JMA magnitude of the Iwate-Miyagi Nairiku earthquake 5.76?"],"info":{}}
{"id":"train_10421","question":"What is Mira's type of variable star?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12965 wdt:P881 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10422","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1027 wd:Q866 . ?sbj wdt:P31 wd:Q30041186 }","paraphrases":["n/a"],"info":{}}
{"id":"train_10424","question":"What was the inflation rate of Sri Lanka on 1-1-2004?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q854 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["How high was the Sri Lanka's inflation rate on January 1, 2004?"],"info":{}}
{"id":"train_10426","question":"What was the namesake for Bohr radius with a recognition title of Copley Medal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q652571 wdt:P138 ?answer . ?answer wdt:P166 wd:Q28003 }","paraphrases":["What was once the namesake for Bohr radius with a focus title of Copley Medal?"],"info":{}}
{"id":"train_10431","question":"When did Golden Horde start in khanate?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q79965 p:P31 ?s . ?s ps:P31 wd:Q331644 . ?s pq:P580 ?value }","paraphrases":["on what date Golden Horde start in khanate"],"info":{}}
{"id":"train_10432","question":"\"Who is the {spouse} of {Lauryn Hill}, that has {craft} who is a {Canadian football player} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q214226 wdt:P26 ?answer . ?answer wdt:P106 wd:Q19841381 }","paraphrases":["Who is the husband of Layryn Hill, with the craft of a Canadian football player?"],"info":{}}
{"id":"train_10434","question":"What are the series of creative works that starts with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7725310 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the arrangement of imaginative works that begins with the letter s"],"info":{}}
{"id":"train_10435","question":"What is short name  of Leviticus ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41490 wdt:P1813 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10436","question":"How much child astronomical bodies are in a Virgo Supercluster?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q175760 wdt:P398 ?obj }","paraphrases":["What is the number of young astronomical bodies in the Virgo Supercluster?"],"info":{}}
{"id":"train_10438","question":"tell me german nationalism starts with n","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q370744 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which German nationalism starts with N?"],"info":{}}
{"id":"train_10440","question":"What is that of his","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q193027 wdt:P547 ?answer . ?answer wdt:P461 wd:Q1202197 }","paraphrases":["What is that of his"],"info":{}}
{"id":"train_10441","question":"In which location Joseph Freiherr von Eichendorff works at?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q77204 wdt:P937 ?answer . ?answer wdt:P190 wd:Q34370 }","paraphrases":["In which area Joseph Freiherr von Eichendorff works at?"],"info":{}}
{"id":"train_10443","question":"How many signatories are there for the {U.S. Declaration of Independence} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q127912 wdt:P1891 ?obj }","paraphrases":["How many people were signatories on the United States' Declaration of Independence?"],"info":{}}
{"id":"train_10445","question":"For which state was Jefferson Davis the president?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P35 wd:Q162269 . ?sbj wdt:P31 wd:Q43702 }","paraphrases":["Which country was Jefferson Davis president of?"],"info":{}}
{"id":"train_10446","question":"Give me the country of Hebron that started in 1948","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q168225 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1948' ) ) }","paraphrases":["Which Hebron country began in 1948?"],"info":{}}
{"id":"train_10448","question":"What is the relation of Q48460 and medical speciality to suicide?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10737 wdt:P1995 ?X . ?X wdt:P1036 ?answer }","paraphrases":["What is the relation of Q48460 and clinical speciality to suicide?"],"info":{}}
{"id":"train_10449","question":"What is the religion and gender of David Hasselhof?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q201927 wdt:P140 ?ans_1 . wd:Q201927 wdt:P21 ?ans_2 }","paraphrases":["David Hasselhof follows which religion and is which gender?"],"info":{}}
{"id":"train_10450","question":"What did W.D. Hamilton win in 1991?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q15451 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1991' ) ) }","paraphrases":["W.D. Hamilton won what in 1991?"],"info":{}}
{"id":"train_10451","question":"Of which German district is Karl Steinhoff governor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16957 wdt:P150 ?answer . ?answer wdt:P6 wd:Q531807 }","paraphrases":["Of which German locale is Karl Steinhoff representative?"],"info":{}}
{"id":"train_10452","question":"Who is the employer conservatory of Pyotr llyich Tchaikovsky?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7315 wdt:P108 ?obj . ?obj wdt:P31 wd:Q184644 }","paraphrases":["Pyotr llyich Tchaikovsky employer of conservatory was?"],"info":{}}
{"id":"train_10453","question":"What building has the least number of platform tracks located in Nuremberg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q811979 . ?ent wdt:P1103 ?obj . ?ent wdt:P131 wd:Q2090 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["In Nuremberg, which building has the lowest number of platform tracks?"],"info":{}}
{"id":"train_10454","question":"What award did Enrique Peña Nieto receive in 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q296741 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["Which award did Enrique Peña Nieto get in 2015?"],"info":{}}
{"id":"train_10457","question":"Which is the parent club of the St. Louis Cardinals?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P831 wd:Q504309 }","paraphrases":[],"info":{}}
{"id":"train_10458","question":"What are the city with millions of inhabitants which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1637706 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the city with millions of inhabitants which begin with the letter v"],"info":{}}
{"id":"train_10460","question":"What UCI Trade Team I does Bradley Wiggins play for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q193876 wdt:P54 ?obj . ?obj wdt:P31 wd:Q20653563 }","paraphrases":["What UCI Exchange Group I does Bradley Wiggins play for?"],"info":{}}
{"id":"train_10465","question":"Tell the name of military museum with the highest number of visitors per year whose location is les invalides?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2772772 . ?ent wdt:P1174 ?obj . ?ent wdt:P276 wd:Q188977 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which military museum in Les Invalides has the highest number of visitors per year?"],"info":{}}
{"id":"train_10467","question":"What education does Sergei Diaghilev have that begins at 1890-8-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q211513 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1890' ) ) }","paraphrases":["What school did Sergei Diaghilev attend beginning 1890-8-1?"],"info":{}}
{"id":"train_10470","question":"What is a dynasty that begins with the letter p?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q164950 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a dynasty that starts with the letter p?"],"info":{}}
{"id":"train_10472","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q3318231 . ?sbj wdt:P31 wd:Q13107770 }","paraphrases":["Not applicable"],"info":{}}
{"id":"train_10473","question":"what is a flag image of Nebraska","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1553 wdt:P41 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10474","question":"What is the scientific discipline of the author who wrote \"Structural colouration of mammalian skin: convergent evolution of coherently scattering dermal collagen arrays\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q31061242 wdt:P50 ?X . ?X wdt:P101 ?answer }","paraphrases":["What is the logical teach of the creator who composed \"Basic colouration of mammalian skin: focalized advancement of coherently scrambling dermal collagen arrays\"?"],"info":{}}
{"id":"train_10475","question":"What type of quantum particle is the antiparticle of an electon.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2152 wd:Q2225 . ?sbj wdt:P31 wd:Q22675015 }","paraphrases":["What sort of quantum molecule is the antiparticle of an electon."],"info":{}}
{"id":"train_10476","question":"WHAT IS WIKIDATA PROJECT OF MATHEMATICS","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q395 wdt:P4570 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10480","question":"How many notable work done by the Henrik Ibsen} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q36661 wdt:P800 ?obj }","paraphrases":["How many notable works are there by Henrik Ibsen?"],"info":{}}
{"id":"train_10481","question":"Name a cryptocurrency that  starts with letter B","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13479982 . ?sbj wdt:P913 wd:Q23055403 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a cryptocurrency that begins with letter B"],"info":{}}
{"id":"train_10483","question":"What is the parent company of Bombardier Transportation","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q688893 wdt:P749 ?X . ?X wdt:P452 ?answer }","paraphrases":["What is the parent company of Bombardier Transportation"],"info":{}}
{"id":"train_10485","question":"Was Alex Rodriguez a member of the Baltimore Orioles and the Trenton Thunder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q558664 wdt:P54 wd:Q650816 . wd:Q558664 wdt:P54 wd:Q3526064 }","paraphrases":["Did Alex Rodrigues play for the Baltimore Orioles and the Trenton Thunder?"],"info":{}}
{"id":"train_10486","question":"Tell me ethnoreligious group whose name has the word yazidis in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11197007 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yazidis' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know ethnoreligious bunch whose title has the word yazidis in it."],"info":{}}
{"id":"train_10488","question":"What is the name of the publishing house that published the journal of the Once-daily gentamicin administration for community-associated methicillin resistant Staphylococcus aureus in an in vitro pharmacodynamic model: preliminary reports for the advantages for optimizing pharmacodynamic index?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41877860 wdt:P1433 ?X . ?X wdt:P123 ?answer }","paraphrases":["What is the title of the distributing house that distributed the diary of the Once-daily gentamicin organization for community-associated methicillin safe Staphylococcus aureus in an in vitro pharmacodynamic show: preparatory reports for the points of interest for optimizing pharmacodynamic index?"],"info":{}}
