{"id":"train_3252","question":"Who is the producer and administrator of Q/U Imaging ExperimenT?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7265603 wdt:P137 ?X . ?X wdt:P1056 ?answer }","paraphrases":["Get me the name of the producer and administrator of Q/U Imaging ExperimenT?"],"info":{}}
{"id":"train_3253","question":"What fictional location starts with the letter \"z\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3895768 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which fictional location starts with the letter \"z\"?"],"info":{}}
{"id":"train_3254","question":"From what country is Jacques Cartier, who was born in Rotheneuf?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7321 p:P19 ?s . ?s ps:P19 wd:Q2168809 . ?s pq:P17 ?value }","paraphrases":["Jacques Cartier was born in Rotheneuf; what is the name of the country?"],"info":{}}
{"id":"train_3255","question":"Who replaced Zachary Taylor as President of the United States?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11896 p:P39 ?s . ?s ps:P39 wd:Q11696 . ?s pq:P1365 ?value }","paraphrases":["Who supplanted Zachary Taylor as President of the United States?"],"info":{}}
{"id":"train_3256","question":"Which is the communist party of the mouthpiece of Pravda and which contains the word communist in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q233591 . ?sbj wdt:P2813 wd:Q183644 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'communist' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is Pravda's mouthpiece's communist party and which contains the word communist in its name?"],"info":{}}
{"id":"train_3257","question":"Tell me asymmetric warfare  whose name has the word drug  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q752673 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'drug' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["t me know hilter kilter fighting whose title has the word sedate in it."],"info":{}}
{"id":"train_3258","question":"Who is the {human} for {relative} of {Joseph Conrad}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1038 wd:Q82925 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the { human } for Joseph Conrad's { relative }"],"info":{}}
{"id":"train_3263","question":"What is the sign language for the written spelling of Ronnie Corbett?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q756377 wdt:P1412 ?X . ?X wdt:P2919 ?answer }","paraphrases":["Spell out Ronnie Corbett in sign language."],"info":{}}
{"id":"train_3264","question":"Where is the {architectural structure} of {architect} {Zaha Hadid}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P84 wd:Q47780 . ?sbj wdt:P31 wd:Q811979 }","paraphrases":["Where is Zaha Hadid's architectural structure?"],"info":{}}
{"id":"train_3265","question":"What sculpture is located at Yale University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P276 wd:Q49112 . ?sbj wdt:P31 wd:Q860861 }","paraphrases":[],"info":{}}
{"id":"train_3266","question":"Where does Christopher Walken reside and what is his occupation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q185051 wdt:P551 ?ans_1 . wd:Q185051 wdt:P106 ?ans_2 }","paraphrases":["What does Christopher Walken do and where does he live?"],"info":{}}
{"id":"train_3267","question":"Is the number of spans of Ponte dell'Accademia equal to 1.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q52509 wdt:P1314 ?obj filter ( ?obj = 1.2 ) }","paraphrases":["Does the Ponte dell'Accademia have 1.2 spans?"],"info":{}}
{"id":"train_3268","question":"What is the employment of José Mujica whose field of this employment is agriculture ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9094 wdt:P106 ?answer . ?answer wdt:P425 wd:Q11451 }","paraphrases":["What is José Mujica's job, whose field of work is agriculture?"],"info":{}}
{"id":"train_3275","question":"Is the boyfriend of Poseidon who has daughters Briareus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41127 wdt:P451 ?answer . ?answer wdt:P40 wd:Q849647 }","paraphrases":["Is the boyfriend of Poseidon who has girls Briareus?"],"info":{}}
{"id":"train_3276","question":"How many are influenced by Gustave Courbet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P737 wd:Q34618 }","paraphrases":["How many people are there that are influenced by Gustave Courbet?"],"info":{}}
{"id":"train_3279","question":"who division of teams played for of harry beadles ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10449958 wdt:P54 ?X . ?X wdt:P118 ?answer }","paraphrases":["who division of groups played for of harry beadles ?"],"info":{}}
{"id":"train_3281","question":"What is Swami-Vivekananda's native, spoken and written/signed language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q47478 wdt:P103 ?ans_1 . wd:Q47478 wdt:P1412 ?ans_2 }","paraphrases":["Name the native and official (written, spoken) language of Swami-Vivekananda."],"info":{}}
{"id":"train_3283","question":"Tell me me a therapywhose name consist of the word \"woman\" and whose Sigmund Freud  psychoanalysis","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179661 . ?sbj wdt:P50 wd:Q9215 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'psychoanalysis' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose  me me a therapywhose name consist of the word \"woman\" and whose Sigmund Freud psychoanalysis"],"info":{}}
{"id":"train_3284","question":"Was David Foster Wallace's notable works \"Infinite Jest\" and \"House of Leaves\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q313246 wdt:P800 wd:Q1077445 . wd:Q313246 wdt:P800 wd:Q521688 }","paraphrases":["Are the \"Infinite Jest\" and \"House of Leaves\" the notable works of David Foster Wallace?"],"info":{}}
{"id":"train_3285","question":"What was Anne Bancroft nominated for in 1967?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q183532 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1967' ) ) }","paraphrases":["Anne Bancroft was nominated for what in 1967?"],"info":{}}
{"id":"train_3287","question":"What is the common name with the highest minimum frequency of audible sound whose on focus list of Wikimedia project is Wikipedia:Vital articles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q502895 . ?ent wdt:P3387 ?obj . ?ent wdt:P5008 wd:Q5460604 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["On the specialized list of Wikipedia:Vital articles, which ordinary name is the most high pitched?"],"info":{}}
{"id":"train_3289","question":"Vanessa Redgrave was nominated for the Academy Awards.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q347879 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q19020 }","paraphrases":["Vanessa Redgrave was assigned for the Foundation Grants."],"info":{}}
{"id":"train_3295","question":"How was it determined that Olongapo has a population of 233040?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q56759 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '233040' ) ) . ?s pq:P459 ?value }","paraphrases":["What determined Olongapo's population of 233040?"],"info":{}}
{"id":"train_3297","question":"Name something based in New Mexico that has diplomatic relations with the Caymen Islands.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1522 wdt:P131 ?answer . ?answer wdt:P530 wd:Q5785 }","paraphrases":["Name something based in New Mexico that has diplomatic family members with the Caymen Islands."],"info":{}}
{"id":"train_3299","question":"who is the work location of yekaterinburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P937 wd:Q887 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["who is the work area of yekaterinburg?"],"info":{}}
{"id":"train_3301","question":"WHICH IS THE MONUMENT WITH THE MAXIMUM LIGHTHOUSE RANGE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4989906 . ?ent wdt:P2929 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What monument has the maximum lighthouse range?"],"info":{}}
{"id":"train_3302","question":"When did Nigel Farage started to work at Refco and when did he leave?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q318471 p:P108 ?s . ?s ps:P108 wd:Q2136640 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["Nigel Farage worked at refco. When did he start and when did he leave?"],"info":{}}
{"id":"train_3303","question":"What ancient civilization is located on a classical land?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q486761 wdt:P706 ?obj . ?obj wdt:P31 wd:Q28171280 }","paraphrases":["What is the name of an ancient civilization set on a classical land?"],"info":{}}
{"id":"train_3304","question":"Are there 411600000.0 children on Earth out of school","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2 wdt:P2573 ?obj filter ( ?obj = 411600000.0 ) }","paraphrases":["Are there 411600000.0 children on Soil out of school"],"info":{}}
{"id":"train_3305","question":"Is Chuck Norris the student of Sun Hwan Chung?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2673 wdt:P1066 wd:Q15987799 }","paraphrases":["Is Chuck Norris the understudy of Sun Hwan Chung?"],"info":{}}
{"id":"train_3307","question":"Tell mebook series whose name has the word world in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q277759 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose mebook series whose name has the word world in it."],"info":{}}
{"id":"train_3310","question":"How many recordings are there in the {Hollywood} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P483 wd:Q34006 }","paraphrases":["How many recordings does Hollywood contain"],"info":{}}
{"id":"train_3311","question":"Who is the follower of Guy de Lusignan who has a noble title of King of Jerusalem?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 wd:Q693614 . ?s pq:P156 ?value1 . ?s pq:P1706 ?value2 }","paraphrases":["Who is the follower of the noble King of Jerusalem, Guy de Lusignan?"],"info":{}}
{"id":"train_3312","question":"Robert Fogel won what award and when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q237821 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["Robert Fogel received what award and when?"],"info":{}}
{"id":"train_3313","question":"How many names are there for Almaty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q35493 wdt:P1448 ?obj }","paraphrases":["How many different names does Almaty have?"],"info":{}}
{"id":"train_3316","question":"Name the season that includes the month of august that starts with letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24384 . ?sbj wdt:P2922 wd:Q122 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the season that includes the August month that begins with letter W"],"info":{}}
{"id":"train_3318","question":"What are the interdisciplinary science which start with the letter toxicology","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1665984 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'toxicology' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the interdisciplinary science branches that begin with the word \"toxicology\"."],"info":{}}
{"id":"train_3321","question":"Who replaced Henry VI of England as monarch of England?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q160337 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P1365 ?value }","paraphrases":["Which monarch of England came after Henry VI?"],"info":{}}
{"id":"train_3322","question":"What location in the administrative territorial entity of Vilnuis is the start time of 1413-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q216 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1413' ) ) }","paraphrases":["What administrative territorial entity of Vilnuis location began on 1413-0-0?"],"info":{}}
{"id":"train_3324","question":"Which means {Banque de noms de lieux du Québec ID} at{Hudson Bay} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3040 wdt:P2100 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3325","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2483432 wdt:P50 ?answer . ?answer wdt:P109 ?x FILTER ( contains ( ?x , 'Jorge Luis Borges signature.png' ) ) }","paraphrases":["What is it?"],"info":{}}
{"id":"train_3326","question":"which natural number with the highest numeric value whose instance is natural number?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21199 . ?ent wdt:P1181 ?obj . ?ent wdt:P31 wd:Q21199 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which natural number with the highest numeric value has instance being also a natural number?"],"info":{}}
{"id":"train_3327","question":"How many points were scored and matches played by Neymar, a Brazillian national under 17 football team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q142794 p:P54 ?s . ?s ps:P54 wd:Q2402747 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["When Neymar played in the Brazilian national under 17 football team, how many points were scored and how many matches were played."],"info":{}}
{"id":"train_3330","question":"Which is the song of the tracklist of OK Computer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q202996 wdt:P658 ?obj . ?obj wdt:P31 wd:Q7366 }","paraphrases":["What is OK Computer's tracklist?"],"info":{}}
{"id":"train_3331","question":"Where are the headquarters of HBO in the United States?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23633 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P17 wd:Q30 }","paraphrases":["What city in the United States has the headquarters for HBO?"],"info":{}}
{"id":"train_3332","question":"Who is the musician a split from of Tell Me 'bout It?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1158846 wdt:P155 ?X . ?X wdt:P175 ?answer }","paraphrases":["Who is the artist a part from of Let Me know 'bout It?"],"info":{}}
{"id":"train_3333","question":"Who received Steiger Award together with Wladimir Klitschko?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q18797 p:P166 ?s . ?s ps:P166 wd:Q821717 . ?s pq:P1706 ?value }","paraphrases":["Who is the other person that Wladimir Klitschko recieved the Steiger Award with?"],"info":{}}
{"id":"train_3334","question":"What particle radiation stars with the letter c?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q945733 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What molecule radiation stars with the letter c?"],"info":{}}
{"id":"train_3337","question":"Vladimir Lenin was the leader of which country?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q1394 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["What country was Vladimir Lenin the leader of?"],"info":{}}
{"id":"train_3338","question":"When did Harold Eugene Edgerton receive the SPIE Gold Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q475733 p:P166 ?s . ?s ps:P166 wd:Q8153695 . ?s pq:P585 ?value }","paraphrases":["In what year was Harold Eugen Edgerton awarded the SPIE Gold Medal?"],"info":{}}
{"id":"train_3340","question":"What motto of Spain has the words \"Further Beyond\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q29 p:P1546 ?s . ?s ps:P1546 ?obj . ?s pq:P1451 ?x filter ( contains ( ?x , 'Further Beyond' ) ) }","paraphrases":["Name the full motto of the Spain that contained the words \"Further Beyond\"."],"info":{}}
{"id":"train_3342","question":"What TV show is inspired by the life of Blackbeard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P941 wd:Q213518 . ?sbj wdt:P31 wd:Q15416 }","paraphrases":["What TV appear is motivated by the life of Blackbeard?"],"info":{}}
{"id":"train_3344","question":"Is the vehicle range of INS Talwar equal to 4215?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q175967 wdt:P2073 ?obj filter ( ?obj = 4215 ) }","paraphrases":["Is 4215 the vehicle range of INS Talwar?"],"info":{}}
{"id":"train_3347","question":"What are the enterprise which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6881511 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the company that begins with the letter s"],"info":{}}
{"id":"train_3348","question":"WHAT IS THE HUMAN POPULATION IN PLACE OF ORIGIN OF CULINARY MUSTARD ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131748 wdt:P495 ?X . ?X wdt:P1082 ?answer }","paraphrases":["WHAT IS THE HUMAN Populace IN Put OF Root OF CULINARY MUSTARD ?"],"info":{}}
{"id":"train_3349","question":"Which cricket team has Mahela Jayawardene as the head coach and also starts with the letter \"i\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17376093 . ?sbj wdt:P286 wd:Q2739165 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which cricket team is the head coach of Mahela Jayawardene and starts with the letter I as well?"],"info":{}}
{"id":"train_3350","question":"What award did Richard Meier recieve on Janurary 1, 1988?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q159612 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1988' ) ) }","paraphrases":["Which is the award that Richard Meller received in 1988?"],"info":{}}
{"id":"train_3354","question":"Who authored the Second Epistle of John, equivalent to John of Patmos?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131453 wdt:P50 ?answer . ?answer wdt:P460 wd:Q2733634 }","paraphrases":["Who authored the Second Epistle of John, equivalent to John of Patmos?"],"info":{}}
{"id":"train_3355","question":"Which is the other different gesture to imitate the sign language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1889 wd:Q34228 . ?sbj wdt:P31 wd:Q8514257 }","paraphrases":["Which is the other distinctive signal to mimic the sign dialect?"],"info":{}}
{"id":"train_3356","question":"How many eMedicine are acromegaly?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q189580 wdt:P673 ?obj }","paraphrases":["What are the number of acromegaly eMedicine's?"],"info":{}}
{"id":"train_3359","question":"who colors of player of nico yennaris ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q59600 wdt:P54 ?X . ?X wdt:P462 ?answer }","paraphrases":["who colors of player of nico yennaris ?"],"info":{}}
{"id":"train_3360","question":"Tell me mythical human-animal hybrid that contains the word polkan in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20902363 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'polkan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know legendary human-animal half breed that contains the word polkan in their name"],"info":{}}
{"id":"train_3361","question":"what is the  date of birth of Chlohar II in the statement with Gregorian date earlier than 1584} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q209118 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["On what date, prior to 1584, was the birth of Chlohar II?"],"info":{}}
{"id":"train_3362","question":"What are the space observatory which start with the letter x","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q148578 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the space observatory which begins with  the letter x"],"info":{}}
{"id":"train_3363","question":"Tell me the sedative that starts with the letter n","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q847705 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me how sedative the letter n begins"],"info":{}}
{"id":"train_3364","question":"What is the nominal GDP of La Rioja in the year 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5727 p:P2131 ?s . ?s ps:P2131 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["What was the Gross Domestic Product of La Rioja in 2015?"],"info":{}}
{"id":"train_3365","question":"Does the number of losses of the 1924 British Lions tour to South Africa equal 9?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3535469 wdt:P1356 ?obj filter ( ?obj = 9 ) }","paraphrases":["Did the 1924 British Lions tour to South Africa lose 9 times?"],"info":{}}
{"id":"train_3366","question":"what {pupil of} {gioachino Rossini} has a {career} as a {musicologist}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9726 wdt:P1066 ?answer . ?answer wdt:P106 wd:Q14915627 }","paraphrases":["what {pupil of} {gioachino Rossini} has a {career} as a {musicologist}"],"info":{}}
{"id":"train_3367","question":"Is the pitting resistance equivalent number of the UNS S32760 / EN 1.4501 super duplex stainless steel more than 48?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q55841586 wdt:P5624 ?obj filter ( ?obj > 48.0 ) }","paraphrases":["Is the pitting resistance equivalent number of the UNS S32760 / EN 1.4501 super duplex stainless stell greater than 48?"],"info":{}}
{"id":"train_3369","question":"What position is referred to by the honorific prefix \"Salman of Saudi Arabia\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q367825 wdt:P511 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":[],"info":{}}
{"id":"train_3370","question":"What is the LONSEA people ID of Eleftherios Venizelos?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q205545 wdt:P5306 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3371","question":"Who is the {human} for {professional or sports partner} of {Scott Moir}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1327 wd:Q440940 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {proficient or sports accomplice} of {Scott Moir}"],"info":{}}
{"id":"train_3372","question":"What is the administration head quarters of the twin city of Politecnico di Milano?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q392904 wdt:P159 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is Politecnico di Milano's twin city's administrative head quarters?"],"info":{}}
