{"id":"train_13891","question":"What is INDUCKS character ID for Scrooge McDuck?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11937 wdt:P4479 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13892","question":"What are the brain region that starts with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620186 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know around the unitary state that contains the definitive territorial substance of Sofia."],"info":{}}
{"id":"train_13893","question":"What is the determination method for Missouri whose population is 5.98893e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1581 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '5.98893e+06' ) ) . ?s pq:P459 ?value }","paraphrases":["How can we figure out the population of Missouri?"],"info":{}}
{"id":"train_13894","question":"Who is the screenwriter for The Birth of a Nation","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q220394 wdt:P58 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the screenwriter for The Birth of a Nation"],"info":{}}
{"id":"train_13895","question":"Which is the serial number for Enola Gay?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q204424 wdt:P2598 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13896","question":"What is the name of the crude drug that contains monoclinic crystal system and has gypsium in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q735160 . ?sbj wdt:P556 wd:Q624543 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'gypsum' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of the crude drug that contains monoclinic crystal device and has gypsium in its name?"],"info":{}}
{"id":"train_13897","question":"Name the newest NMHH rating category that replaces category IV?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23683425 . ?ent wdt:P2899 ?obj . ?ent wdt:P1365 wd:Q23830579 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["State the newest category that replaces NMHH rating category IV?"],"info":{}}
{"id":"train_13899","question":"Chemical compounds are studied in what branch of science?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11173 wdt:P2579 ?obj . ?obj wdt:P31 wd:Q2465832 }","paraphrases":["Chemical compounds are examined in what department of science?"],"info":{}}
{"id":"train_13900","question":"Give the name of the most memory capacity smartphone by the Android Nougat operating system?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19723451 . ?ent wdt:P2928 ?obj . ?ent wdt:P306 wd:Q22274379 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Android Nougat OS has the best memory?"],"info":{}}
{"id":"train_13902","question":"Is Czech and Canadian French listed in country calling codes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q34768 wdt:P407 wd:Q9056 . wd:Q34768 wdt:P407 wd:Q1450506 }","paraphrases":["Have Czech and Canadian French Country Calling Codes?"],"info":{}}
{"id":"train_13903","question":"Is the number of victims of killer Ronald Gene Simmons less than 12.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1685542 wdt:P1345 ?obj filter ( ?obj < 12.8 ) }","paraphrases":["How many people did Ronald Gene Simmons kill?"],"info":{}}
{"id":"train_13906","question":"Is the albedo of teh 1347 Patria larger than 0.024?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q138260 wdt:P4501 ?obj filter ( ?obj > 0.024 ) }","paraphrases":["Is the alebedo of teh 1347 bigger than 0.024?"],"info":{}}
{"id":"train_13908","question":"Where in the HQ location of Transparency International is the border?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q174240 wdt:P159 ?X . ?X wdt:P47 ?answer }","paraphrases":["Where is the head quarters of Transparency International is located?"],"info":{}}
{"id":"train_13912","question":"Is the Cardinality of the group of the McLaughlin group less than 1077753600.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q997257 wdt:P1164 ?obj filter ( ?obj < 1077753600.0 ) }","paraphrases":["what is the total cardinality of the mclaughlin group?"],"info":{}}
{"id":"train_13913","question":"Is San Vicente's electorate fewer than 8658.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12868 wdt:P1831 ?obj filter ( ?obj < 8658.0 ) }","paraphrases":["Does San Vicente have lower than 8658 voters?"],"info":{}}
{"id":"train_13914","question":"What is the position held by Bonar Law who is elected in UK Parliamentary by-election?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q166663 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 wd:Q7864918 }","paraphrases":["Bonar Law held what position in UK Parliamentary by election?"],"info":{}}
{"id":"train_13919","question":"Tell me the newcast whose presenter is Steve Kroft and starts with number 6!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1358344 . ?sbj wdt:P371 wd:Q541068 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , '6' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the newcast of which Steve Kroft is the presenter, starting with number 6!"],"info":{}}
{"id":"train_13920","question":"What is the archeological site named after Qin Shi Huang?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P138 wd:Q7192 . ?sbj wdt:P31 wd:Q839954 }","paraphrases":["Tell me the name of the archeological site that is named after Qin Shi Huang."],"info":{}}
{"id":"train_13921","question":"What is the number of out of school children of the  continent of Slave River ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2226 wdt:P30 ?X . ?X wdt:P2573 ?answer }","paraphrases":["What is the number of out of school children of the landmass of Slave Waterway ?"],"info":{}}
{"id":"train_13923","question":"Who is the chairman that developed ARPANET?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q177524 wdt:P178 ?X . ?X wdt:P488 ?answer }","paraphrases":["Which chairman developed ARPANET?"],"info":{}}
{"id":"train_13924","question":"Which is the mean lifetime for red blood cell?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q37187 wdt:P2645 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13928","question":"Who is the closest female relative?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q171318 . ?ent wdt:P4500 ?obj . ?ent wdt:P1552 wd:Q6581072 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Who is the closest female relative?"],"info":{}}
{"id":"train_13931","question":"What is given name of James Russell Lowell that is series ordinal is 1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q449670 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '1' ) ) }","paraphrases":["For the series ordinal 1, what was the given name of James Russel Lowell?"],"info":{}}
{"id":"train_13932","question":"Tell me about award received of Animal Farm and followed by?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q1396889 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P156 ?value1 . }","paraphrases":["Tell me about award received of Animal Farm and followed by?"],"info":{}}
{"id":"train_13933","question":"tell me mausoleum that World Heritage criteria   that starts with letter m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162875 . ?sbj wdt:P2614 wd:Q23038972 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tell me mausoleum that World Heritage standards that starts with letter m"],"info":{}}
{"id":"train_13936","question":"Which star is part of the constellation, WASP-13b?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1146824 wdt:P397 ?X . ?X wdt:P59 ?answer }","paraphrases":["What star is part of the constellation, WASP-13b?"],"info":{}}
{"id":"train_13937","question":"What country of the Russian Empire is the birth place of Feodor Chaliapin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q189164 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q34266 }","paraphrases":["In what country was Feodor Chaliapin born?"],"info":{}}
{"id":"train_13939","question":"What was the population of Damietta Governorate on November 17, 1986?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q30644 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1986' ) ) }","paraphrases":["On November 17, 1986, what was the population of Damietta Governorate?"],"info":{}}
{"id":"train_13941","question":"Who is Rafael Nadal's coach ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10132 wdt:P286 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Rafael Nadal's coach ?"],"info":{}}
{"id":"train_13942","question":"What government office pays tribute to the Church of St Peter.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17556725 wdt:P825 ?X . ?X wdt:P39 ?answer }","paraphrases":["What government office pays tribute to the Church of St Diminish."],"info":{}}
{"id":"train_13943","question":"What is the named after and the followed by of Electron ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q2225 wdt:P138 ?ans_1 . wd:Q2225 wdt:P156 ?ans_2 }","paraphrases":["Electron is named after and followed by what?"],"info":{}}
{"id":"train_13944","question":"The word bocce is contained in which game variant","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28807042 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'bocce' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["The word bocce is contained in which diversion variation"],"info":{}}
{"id":"train_13946","question":"What are the legal concept which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2135465 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the legal concept that begins with the letter s"],"info":{}}
{"id":"train_13949","question":"IBM has employees Wikimedia category?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q37156 wdt:P4195 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["Does IDM have employees Wikimedia category?"],"info":{}}
{"id":"train_13951","question":"Who is the person in the head of state of Tokugawa Shogunata?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q205662 wdt:P35 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the person in Tokugawa Shogunata's head of state?"],"info":{}}
{"id":"train_13952","question":"When and where did Henry I of France and Anne of Kiev get married?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q178908 p:P26 ?s . ?s ps:P26 wd:Q230073 . ?s pq:P580 ?value1 . ?s pq:P2842 ?value2 }","paraphrases":["Henry I of France and Anne of Kiev got married when and where?"],"info":{}}
{"id":"train_13954","question":"When did Scott Moir win the ice dancing competition","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q440940 wdt:P2522 ?obj . ?obj wdt:P31 wd:Q16510064 }","paraphrases":["When did Scott Moir win the competition for ice dancing"],"info":{}}
{"id":"train_13955","question":"What is Biblioteca Nacional de México ID of Cantinflas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q195371 wdt:P4440 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13956","question":"What was the prize money Johannes Diderik van der Waals received for the Nobel Prize in Physics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q131721 p:P166 ?s . ?s ps:P166 wd:Q38104 . ?s pq:P2121 ?value }","paraphrases":["How much money did Johannes Diderik van der Walls win for his Nobel Prize in Physics?"],"info":{}}
{"id":"train_13958","question":"What are the historical region which start with the letter värend","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620908 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'värend' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the verifiable locale which begin with the letter värend"],"info":{}}
{"id":"train_13959","question":"What is the songwriter of Hard Contract known for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q374974 wdt:P86 ?X . ?X wdt:P800 ?answer }","paraphrases":["Give what the songwriter of Hard Contract is known for."],"info":{}}
{"id":"train_13960","question":"Who is the married child of Tabinshwehti?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q981475 wdt:P22 ?X . ?X wdt:P26 ?answer }","paraphrases":["Who is the hitched child of Tabinshwehti?"],"info":{}}
{"id":"train_13962","question":"What Manila twinned administrative body started on January 1, 1966?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1461 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1966' ) ) }","paraphrases":["What was the name of the Manila twinned administrative body that started on January 1, 1966?"],"info":{}}
{"id":"train_13963","question":"Which bridge did engineer Isambard Kingdom Burnel build?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P631 wd:Q207380 . ?sbj wdt:P31 wd:Q537127 }","paraphrases":["Which bridge did build Isambard Kingdom Burnel build?"],"info":{}}
{"id":"train_13964","question":"Is the watershed area of the Schottmecke more than .5112?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2249328 wdt:P2053 ?obj filter ( ?obj > 0.5112 ) }","paraphrases":["Is the Schottmecke watershed more than .5112?"],"info":{}}
{"id":"train_13966","question":"Is Kieran Culkin a sibling to Macaulay_Culkin ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q103578 wdt:P3373 wd:Q313204 }","paraphrases":["Are Macaulay Culkin and Kieran Culkin related to one another?"],"info":{}}
{"id":"train_13967","question":"What is the area of mathematics that algebraists practice and contain the word algebra in its name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1936384 . ?sbj wdt:P3095 wd:Q23900107 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'algebra' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the area of arithmetic that algebraists practice and include the word algebra in its name."],"info":{}}
{"id":"train_13968","question":"When was Milos Forman received the Czech Medal of Merit award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q51525 p:P166 ?s . ?s ps:P166 wd:Q1141859 . ?s pq:P585 ?value }","paraphrases":["What was the date Milos Forman received the Czech Medal of Merit award?"],"info":{}}
{"id":"train_13969","question":"According to the census, what is the population of Hawaii?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q68740 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["From census statistics, how many people live in Hawaii?"],"info":{}}
{"id":"train_13970","question":"Which is {series} of {prequel} {Within a Budding Grove} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2343985 wdt:P155 ?X . ?X wdt:P179 ?answer }","paraphrases":["Which is {arrangement} of {prequel} {Inside a Budding Woods} ?"],"info":{}}
{"id":"train_13971","question":"\"Who is {Wolf Totem} of {set location}, that has {diplomatic relation} to {Zambia} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3115559 wdt:P840 ?answer . ?answer wdt:P530 wd:Q953 }","paraphrases":["\"Who is {Wolf Totem} of {set area}, that has {discretionary connection} to {Zambia} ?\""],"info":{}}
{"id":"train_13973","question":"When was Tatum O'Neal has received  Academy Award for Best Supporting Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q230138 p:P166 ?s . ?s ps:P166 wd:Q106301 . ?s pq:P805 ?value }","paraphrases":["When did Tatum O'Neal with a Best Supporting Actress Academy Award?"],"info":{}}
{"id":"train_13974","question":"Did Pliny the Younger die in Brazil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q168707 wdt:P20 ?answer . ?answer wdt:P530 wd:Q155 }","paraphrases":["Did Pliny the More youthful pass on in Brazil?"],"info":{}}
{"id":"train_13976","question":"What is the name of the place where Moliere is buried, with latitude 48.860532 and longitude 2.395079?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q687 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P625 ?x filter ( contains ( ?x , '48.860532 2.395079' ) ) }","paraphrases":["The place where Moliere is buried, having a latitude of 48.860532 and a longitude of 2.395079, is named?"],"info":{}}
{"id":"train_13977","question":"who is the position held of Joko Widodo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3318231 wdt:P39 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["who is the position held of Joko Widodo?"],"info":{}}
{"id":"train_13981","question":"who is translated of the translation by nemean ode I?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55287508 wdt:P747 ?X . ?X wdt:P655 ?answer }","paraphrases":["What is the name of the person who is translated in the translation by Nemean Ode I?"],"info":{}}
{"id":"train_13982","question":"What award did Ursula K. Guin receive as the the victor over Jacinda Townsend","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q181659 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q28933643 }","paraphrases":["What award did Ursula K. Guin get hold of as the the victor over Jacinda Townsend"],"info":{}}
{"id":"train_13983","question":"What is the isospin z-component of pion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q4097 wdt:P1127 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13986","question":"What state with the lowest mains voltage is a member of Interpol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7275 . ?ent wdt:P2884 ?obj . ?ent wdt:P463 wd:Q8475 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which state of Interpol has the lowest mains voltage?"],"info":{}}
{"id":"train_13987","question":"What is the place of activity of Paul Gauguin, that has shires and is in the 7th arrondissement of Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37693 wdt:P937 ?answer . ?answer wdt:P150 wd:Q259463 }","paraphrases":["What is the put of action of Paul Gauguin, that has shires and is within the 7th arrondissement of Paris?"],"info":{}}
{"id":"train_13988","question":"When did the Iron Age start in Greece?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11764 p:P580 ?s . ?s ps:P580 ?obj . ?s pq:P518 wd:Q41 }","paraphrases":["In Greece the Iron Age started in what year?"],"info":{}}
{"id":"train_13989","question":"Pompeu Fabra University has how many rectors?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q24543 wdt:P1075 ?obj }","paraphrases":["Tell me how many reactors Pompeu Fabra University has."],"info":{}}
{"id":"train_13990","question":"Name the country associated with Himachal Pradesh.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1177 wdt:P17 ?obj . ?obj wdt:P31 wd:Q6256 }","paraphrases":[],"info":{}}
{"id":"train_13991","question":"When did Queens have a population of 2.23494 million?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q18424 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '2.23494e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["In what year did the population of Queens top 2.23494 million?"],"info":{}}
{"id":"train_13992","question":"WHICH IS THE ROMAN AGNOMEN FOR CONSTANTINE THE GREAT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q8413 wdt:P2366 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13996","question":"What are the specialized agency of the United Nations which start with the letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15925165 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the specialized organization of the Joined together Countries which begin with the letter W"],"info":{}}
{"id":"train_13999","question":"Which platinum isotope has the most excess mass?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19475 . ?ent wdt:P2160 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which platinum isotope has the foremost overabundance mass"],"info":{}}
{"id":"train_14000","question":"Tell me the name of the smallest collection of artwork that includes a painting of Samson destroying the Temple.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15727816 . ?ent wdt:P3740 ?obj . ?ent wdt:P527 wd:Q17334432 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the name of the smallect artwork collection that includes a painting of Samson destroying the temple?"],"info":{}}
{"id":"train_14003","question":"How many people did Queen Victoria commemorate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P547 wd:Q9439 }","paraphrases":["What is the number of people that Queen Victoria commemorated?"],"info":{}}
{"id":"train_14004","question":"Which is the royal or noble rank for what is said to be the same as that of Sultan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43292 wdt:P460 ?obj . ?obj wdt:P31 wd:Q355567 }","paraphrases":["DOES THE URBAN Populace OF THE HIRAMANDALAM MANDAL More prominent THAN 0.0"],"info":{}}
{"id":"train_14006","question":"What record label did Patti Smith start with in 1975?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q557 p:P264 ?s . ?s ps:P264 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1975' ) ) }","paraphrases":["Tell me what label Patti Smith started with in 1975?"],"info":{}}
{"id":"train_14007","question":"What are the musical duo which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9212979 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the musical duet that begins with the letter z"],"info":{}}
{"id":"train_14008","question":"What position did Thomas Cranmer replace William Warham?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q199894 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q744845 }","paraphrases":["In what role did Thomas Cranmer replace William Warham?"],"info":{}}
{"id":"train_14010","question":"Name a city in Spain that contain the word \"granada \" in its name and whose patron saint is John of God","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2074737 . ?sbj wdt:P417 wd:Q320171 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'granada' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a city in Spain that contain the word \"granada \" in its title and whose supporter holy person is John of God"],"info":{}}
