{"id":"train_4911","question":"is a baby","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q379814 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'чол' ) ) }","paraphrases":["may be a baby"],"info":{}}
{"id":"train_4912","question":"What is the dam of Lake Gordon","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q366813 wdt:P4792 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4913","question":"Who were the patron saints that formed the Society of Jesus ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q36380 wdt:P417 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who were the supporter holy people that shaped the Society of Jesus ?"],"info":{}}
{"id":"train_4914","question":"When did Kofi Annan receive the award Confucius Peace Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1254 p:P166 ?s . ?s ps:P166 wd:Q1192712 . ?s pq:P585 ?value }","paraphrases":["When did Kofi Annan win the Confucius Peace Prize?"],"info":{}}
{"id":"train_4915","question":"What is the native language of Modern Standard Arabic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P103 wd:Q56467 }","paraphrases":[],"info":{}}
{"id":"train_4919","question":"For what position was Winston Churchill elected in the United Kingdom general election in 1935?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8016 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 wd:Q918378 }","paraphrases":["Winston Churchill was voted in for what position in the United Kingdom general election in 1935?"],"info":{}}
{"id":"train_4920","question":"When did George Canning become Secretary of State for Foreign and Commonwealth Affairs?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q219731 p:P39 ?s . ?s ps:P39 wd:Q1371091 . ?s pq:P580 ?value }","paraphrases":["What was the date that George Canning began working as Secretary of State for Foreign and Commonwealth Affairs?"],"info":{}}
{"id":"train_4921","question":"What is the quantity of honorific suffix for a Doctor of Philosophy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1035 wd:Q752297 }","paraphrases":["What is the appropriate suffix for a Doctor of Philosophy?"],"info":{}}
{"id":"train_4923","question":"What is in the category of blue whale?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q42196 wdt:P1403 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4924","question":"WHICH  SPORTS IS SUCCEDED  ON 1993 RALLY GB","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6361563 wdt:P156 ?X . ?X wdt:P641 ?answer }","paraphrases":["WHICH SPORTS IS SUCCEDED ON 1993 RALLY GB"],"info":{}}
{"id":"train_4925","question":"Who is the officeholder of United Nations Secretary-General?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q81066 wdt:P1308 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4926","question":"Which is the sexual preference for the specialty of psychotherapy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1995 wd:Q183257 . ?sbj wdt:P31 wd:Q2275640 }","paraphrases":[],"info":{}}
{"id":"train_4927","question":"When did Urban II's position as Cardinal/Bishop end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q30578 p:P39 ?s . ?s ps:P39 wd:Q1729113 . ?s pq:P582 ?value }","paraphrases":["Provide the point at which Urban II's position as Cardinal/Bishop ended."],"info":{}}
{"id":"train_4928","question":"How many students studied the subject {astronomy} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2579 wd:Q333 }","paraphrases":["How many students studied astronomy?"],"info":{}}
{"id":"train_4929","question":"What is the perceived population for the solar system of the planet Uranus.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q324 wdt:P397 ?obj . ?obj wdt:P31 wd:Q3592493 }","paraphrases":["What is the perceived population for planet Uranus ' solar system."],"info":{}}
{"id":"train_4930","question":"What is SSRN author ID for Fischer Black ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q963275 wdt:P3747 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4931","question":"who sexual preference for studied by of psychotherapy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2579 wd:Q183257 . ?sbj wdt:P31 wd:Q2275640 }","paraphrases":["Psychotherapy studies what type of sexual preference?"],"info":{}}
{"id":"train_4932","question":"What are thegroup or class of chemical substances which start with the letter vitamin","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17339814 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vitamin' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are thegroup or course of chemical substances which begin with the letter vitamin"],"info":{}}
{"id":"train_4933","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3975 wd:Q15031 . ?sbj wdt:P31 wd:Q233591 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_4935","question":"What is the luxury yacht with the highest beam whose manufacturer is Lürssen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q443802 . ?ent wdt:P2261 ?obj . ?ent wdt:P176 wd:Q657096 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which luxury yacht manufactured by Lurssen has the highest beam?"],"info":{}}
{"id":"train_4937","question":"What is the { electoral district } for { Shinzō Abe } as { member of the House of Representatives of Japan }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132345 p:P39 ?s . ?s ps:P39 wd:Q17506823 . ?s pq:P768 ?value }","paraphrases":["What is the { constituent locale } for { Shinzō Abe } as { part of the House of Agents of Japan }?"],"info":{}}
{"id":"train_4939","question":"Tell me me a video game console model whose name consist of the \" wii\" and whose input method Classic Controller","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56682555 . ?sbj wdt:P479 wd:Q2573628 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wii' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a video game console model with a \"wii\" name and a Classic Controller input method."],"info":{}}
{"id":"train_4942","question":"Where and what did Guion Bluford study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q528943 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["Where and what did Guion Bluford study?"],"info":{}}
{"id":"train_4944","question":"What is the name of the single which features Hrithik Roshan","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P175 wd:Q233619 . ?sbj wdt:P31 wd:Q134556 }","paraphrases":["Give me the name of the single that Hrithik Roshan is featured in."],"info":{}}
{"id":"train_4945","question":"Tell me the commune of France with specific status that is in the list of monument of the Lyon's list of monuments and whose name contains the word lyon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22927616 . ?sbj wdt:P1456 wd:Q3252117 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'lyon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the commune of France with unique status that is in the listing of monument of the Lyon's listing of monuments and whose title incorporates the word lyon?"],"info":{}}
{"id":"train_4947","question":"What is the mean anomaly of Ceres that equals 138.662?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q596 p:P2325 ?s . ?s ps:P2325 ?x filter ( contains ( ?x , '138.662' ) ) . ?s pq:P585 ?value }","paraphrases":["What is the average anomaly of Ceres that is equivalent to 138.662?"],"info":{}}
{"id":"train_4949","question":"Who is a member of the school attended by Sidney Mintz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q327017 wdt:P69 ?X . ?X wdt:P463 ?answer }","paraphrases":["Who is an individual from the school gone to by Sidney Mintz?"],"info":{}}
{"id":"train_4950","question":"Who is the co-founder of publishing house of Journal of experimental psychology, human learning and memory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27711480 wdt:P123 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who is the co-founder of distributing house of Diary of exploratory brain research, human learning and memory?"],"info":{}}
{"id":"train_4951","question":"What number of partnerships does Autonomous University of Barcelona have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q43452 wdt:P2652 ?obj }","paraphrases":["Autonomous University of Barcelona has how many partnerships?"],"info":{}}
{"id":"train_4953","question":"What is Hansard (1803–2005) ID for Clement Attlee?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q129006 wdt:P2015 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4956","question":"Thomas Aquinas is the patron saint of what part of Italy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P417 wd:Q9438 . ?sbj wdt:P31 wd:Q747074 }","paraphrases":["What part of Italy is the patron saint of Thomas Aquinas?"],"info":{}}
{"id":"train_4957","question":"Name the poem presented in the work of Hera.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q38012 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q37484 }","paraphrases":["What was the poem presented in the work of Hera?"],"info":{}}
{"id":"train_4958","question":"When did Hippocrates in Circa die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5264 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1480 wd:Q5727902 }","paraphrases":["On what date did Hippocrates in Circa die?"],"info":{}}
{"id":"train_4960","question":"Who is the  {protein} for {physically interacts with} of {diazepam}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q210402 wdt:P129 ?obj . ?obj wdt:P31 wd:Q8054 }","paraphrases":["What protein physically interacts with diazepam?"],"info":{}}
{"id":"train_4961","question":"Which position was George Reid held and elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q23352 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["Which position was George Reid held and chosen in?"],"info":{}}
{"id":"train_4962","question":"Is it true that the electorate of Del Carmen is greater than 8388?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28735 wdt:P1831 ?obj filter ( ?obj > 8388.0 ) }","paraphrases":["Are there more than 8388 people in the electorate of Del Carmen"],"info":{}}
{"id":"train_4963","question":"What is the think tank for the Smithsonian Institution's parent organization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P749 wd:Q131626 . ?sbj wdt:P31 wd:Q155271 }","paraphrases":["What is the research organization for the Smithsonian Institution's parent association?"],"info":{}}
{"id":"train_4965","question":"What is the diocese of Paris archdiocese?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q90 wdt:P708 ?obj . ?obj wdt:P31 wd:Q2072238 }","paraphrases":["What's Paris' archdiocese's diocese?"],"info":{}}
{"id":"train_4966","question":"Is the budget of Tinkoff equal to 19200000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q62424 wdt:P2769 ?obj filter ( ?obj = 19200000.0 ) }","paraphrases":["Is Tinkoff's budget 19200000?"],"info":{}}
{"id":"train_4967","question":"TELL ME USE WHOSE NAME HAS THE WORD TINDER IN IT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1724915 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tinder' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know Utilize WHOSE Title HAS THE WORD TINDER IN IT"],"info":{}}
{"id":"train_4968","question":"Tell me how many kids Amlaib's sister has.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q281752 wdt:P3373 ?X . ?X wdt:P40 ?answer }","paraphrases":["Amlaib's sister has how many children?"],"info":{}}
{"id":"train_4969","question":"What is informed by Saul Bellow whose nom-de-amore is Horatio?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83059 wdt:P737 ?answer . ?answer wdt:P742 ?x FILTER ( contains ( ?x , 'Horatio' ) ) }","paraphrases":["What is educated by Saul Howl whose nom-de-amore is Horatio?"],"info":{}}
{"id":"train_4971","question":"Who is Taxi Driver's film editor and director?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q47221 wdt:P1040 ?ans_1 . wd:Q47221 wdt:P57 ?ans_2 }","paraphrases":["Who was the editor and director of the film, Taxi Driver?"],"info":{}}
{"id":"train_4972","question":"When did Beverly Sills ended her position as a chairperson?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q235517 p:P39 ?s . ?s ps:P39 wd:Q140686 . ?s pq:P582 ?value }","paraphrases":["On what date did Beverly Sills leave her position as chairperson?"],"info":{}}
{"id":"train_4974","question":"Are Karen Carpenter and Ringo Starr singers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1250861 wdt:P106 wd:Q177220 . wd:Q1250861 wdt:P106 wd:Q2632 }","paraphrases":["Do both Karen Carpenter and Ringo Starr sing?"],"info":{}}
{"id":"train_4975","question":"Which Radofin MSX has the fastest clock speed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q853547 . ?ent wdt:P2149 ?obj . ?ent wdt:P178 wd:Q3928891 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Out of all the Radofin MSX, which has the overall fastest clock speed?"],"info":{}}
{"id":"train_4976","question":"When did Friedrich Nietzsche finish his education at the University of Bonn?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9358 p:P69 ?s . ?s ps:P69 wd:Q152171 . ?s pq:P582 ?value }","paraphrases":["When did Friedrich Nietzsche finish at U of Bonn?"],"info":{}}
{"id":"train_4977","question":"What academic institute did Ralph Abernathy earn a Master of Arts degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q545488 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q2091008 }","paraphrases":["Which academic institute did Ralph Abernathy obtain a Master of Arts degree?"],"info":{}}
{"id":"train_4979","question":"What is the mineral resource that starts with the letter 'p'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q889659 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE MINERAL RESOURCE THAT STARTS WITH THE LETTER C"],"info":{}}
{"id":"train_4980","question":"Mention the doctoral disciple of Janet Yellen","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P185 wd:Q263725 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Specify the doctoral follower of Janet Yellen"],"info":{}}
{"id":"train_4983","question":"What is allegiance of Mughal Empire ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P945 wd:Q33296 }","paraphrases":[],"info":{}}
{"id":"train_4984","question":"When did Frederick Sanger earn his “Doctor Honoris Causa” academic degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q151564 p:P512 ?s . ?s ps:P512 wd:Q11415564 . ?s pq:P585 ?value }","paraphrases":["When was the “Doctor Honoris Causa” academic degree received by Frederick Sanger?"],"info":{}}
{"id":"train_4986","question":"Who is the owner of American Airlines","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1830 wd:Q32396 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Who owns American Airlines?"],"info":{}}
{"id":"train_4988","question":"Name an anime television series broadcasted on Nippon BS Broadcasting in Japan starts with letter L","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11086742 . ?sbj wdt:P449 wd:Q843957 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an anime television collection broadcasted on Nippon BS Broadcasting in Japan starts with letter L"],"info":{}}
{"id":"train_4995","question":"What are the commune of France with specific status which start with the letter E","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22927616 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'è' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the commune of France with particular status which begin with the letter E"],"info":{}}
{"id":"train_4996","question":"What is the legal citation for Roe v. Wade?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q300950 wdt:P1031 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4997","question":"What country was replaced by the Kingdom of Great Britain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1366 wd:Q161885 . ?sbj wdt:P31 wd:Q3024240 }","paraphrases":["What nation was supplanted by the Kingdom of Incredible Britain?"],"info":{}}
{"id":"train_4999","question":"What geographical region and terrain feature is Thessaloniki located among?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q17151 wdt:P706 ?obj . ?obj wdt:P31 wd:Q82794 }","paraphrases":["What geological locale and landscape include is Thessaloniki found among?"],"info":{}}
{"id":"train_5001","question":"TELL ME VEGETATION ZONE WHOSE NAME HAS THE WORD TAIGA IN IT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2083910 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'taiga' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know VEGETATION ZONE WHOSE Title HAS THE WORD TAIGA IN IT"],"info":{}}
{"id":"train_5002","question":"Is the price of the Kuwaiti dinar less than 3.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q193098 wdt:P2284 ?obj filter ( ?obj < 3.6 ) }","paraphrases":["Is the Kuwaiti dinar price below 3.6?"],"info":{}}
{"id":"train_5004","question":"What is the { start time } of { Herbert Hoover } that is { 1891 - 0 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q35236 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1891' ) ) }","paraphrases":["What is the { begin time } of { Herbert Hoover } that's { 1891 - }?"],"info":{}}
{"id":"train_5005","question":"When was Manchuko's capital Hsinking?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q30623 p:P36 ?s . ?s ps:P36 wd:Q92237 . ?s pq:P582 ?value }","paraphrases":["Hsinking was the capital of Manchuko in what year?"],"info":{}}
{"id":"train_5006","question":"Name a state in Australia ruled by the Government of South Australia that contains the word \"Australia\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5852411 . ?sbj wdt:P208 wd:Q3112580 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'australia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a state in Australia ruled by the Government of South Australia that contains the word \"Australia\" in its name"],"info":{}}
{"id":"train_5007","question":"According to Otto's encyclopedia, what is the shortest unit of time ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1790144 . ?ent wdt:P2370 ?obj . ?ent wdt:P1343 wd:Q2041543 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["According to Otto's encyclopedia, what is the shortest unit of time ?"],"info":{}}
{"id":"train_5008","question":"How many sources are described by the Times","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1343 wd:Q50008 }","paraphrases":["What is the number of sources described by the Times?"],"info":{}}
{"id":"train_5009","question":"Who gave the {interment} of {consecrated by} of {Klaus Dick} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q76132 wdt:P1598 ?X . ?X wdt:P119 ?answer }","paraphrases":["Klaus Dick was consecrated and got interment by whom?"],"info":{}}
{"id":"train_5010","question":"When G. Evelyn Hutchinson was awarded Kyoto Prize in Basic Sciences?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q302752 p:P166 ?s . ?s ps:P166 wd:Q18344281 . ?s pq:P585 ?value }","paraphrases":["What date did G. Evelyn Hutchinson awarded the Kyoto Prize in Basic Sciences?"],"info":{}}
{"id":"train_5011","question":"Mention the manager or the director of David Foster.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1037 wd:Q77112 . ?sbj wdt:P31 wd:Q2510436 }","paraphrases":["Specify the supervisor or the chief of David Foster."],"info":{}}
{"id":"train_5014","question":"Are people or cargo transported in an ambulance?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q180481 wdt:P3437 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5016","question":"What is the MYmovies ID for Game of Thrones?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q23572 wdt:P4780 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5017","question":"What is the twin town of George Cukor's native home?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q56014 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the twin town of George Cukor's local domestic?"],"info":{}}
{"id":"train_5019","question":"What are list of monuments in Rennes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q647 wdt:P1456 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5020","question":"What is the raw square of pippinger?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18745045 wdt:P669 ?X . ?X wdt:P186 ?answer }","paraphrases":["What is the crude square of pippinger?"],"info":{}}
{"id":"train_5021","question":"Which is the chartered company is a public company in it's legal form and whose name contains the word company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162157 . ?sbj wdt:P1454 wd:Q891723 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'company' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the chartered organisation is a public employer in it's criminal form and whose identify contains the phrase company?"],"info":{}}
{"id":"train_5026","question":"This extremely large, diverse family of tree frogs contains four subfamilies, in approximately 38 genera, with more than 700 species. Distribution is widespread, with hylids occurring throughout temperate North America and the neotropics, including the Caribbean islands. Hylids are also prevalent in Australia and Papua New Guinea. The genus Hyla is known from temperate Eurasia, Japan, and the northern tip of Africa.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q53696 wdt:P4728 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5027","question":"WHAT IS DRAFTEXPRESS.COM ID OF LEBRON JAMES","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q36159 wdt:P3533 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5028","question":"What is the number of points/goals/set scored for Ali Daei, the member of sports team of Saipa F.C.?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q159622 p:P54 ?s . ?s ps:P54 wd:Q782983 . ?s pq:P1351 ?value }","paraphrases":["How many goals has Ali Daei scored?"],"info":{}}
