{"id":"train_7666","question":"what is the coordinate location in Ötztal Alps where Ötzi died?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q171291 p:P20 ?s . ?s ps:P20 wd:Q307518 . ?s pq:P625 ?value }","paraphrases":["Find the coordinates of the location of Ötzi's death in the Ötztal Alps."],"info":{}}
{"id":"train_7667","question":"WHAT IS THE IMPACT CRATER WITH THE MAXIMUM DIAMETER","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q55818 . ?ent wdt:P2386 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which impact crater has the maximum diameter?"],"info":{}}
{"id":"train_7669","question":"where did Vladimir Putin study and get academic degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q7747 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["Which college did Vladimir Putin graduate from?"],"info":{}}
{"id":"train_7670","question":"Is Jim Carrey a film producer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q40504 wdt:P106 wd:Q3282637 }","paraphrases":["Has Jim Carrey produced a film?"],"info":{}}
{"id":"train_7672","question":"What what is solstice month of the year december  and also which that starts with  letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q123524 . ?sbj wdt:P2922 wd:Q126 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is solstice month of the yr december and also which that starts with letter s"],"info":{}}
{"id":"train_7674","question":"whats the occupation of the members of Coen brothers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q56095 wdt:P3989 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7677","question":"Tell me civilization whose name has the word vandals in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8432 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vandals' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know civilization whose title has the word vandals in it."],"info":{}}
{"id":"train_7678","question":"What is the next steel bridge crossing upstream of London Bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q130206 wdt:P2673 ?obj . ?obj wdt:P31 wd:Q12042110 }","paraphrases":["What is the another steel bridge crossing upstream of London Bridge?"],"info":{}}
{"id":"train_7682","question":"What type of student role model is Octavian  Angheluta?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18543692 wdt:P802 ?X . ?X wdt:P737 ?answer }","paraphrases":["What sort of understudy part show is Octavian Angheluta?"],"info":{}}
{"id":"train_7683","question":"When did Tiraspol leave the Soviet Union?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132572 p:P17 ?s . ?s ps:P17 wd:Q15180 . ?s pq:P582 ?value }","paraphrases":["At what time did Tiraspol leave the Soviet Union?"],"info":{}}
{"id":"train_7684","question":"what are studio album starts with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q208569 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are studio collection begins with the letter w"],"info":{}}
{"id":"train_7685","question":"What are the lifestyles of students of Lanfranc?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q317098 wdt:P802 ?X . ?X wdt:P1576 ?answer }","paraphrases":["What are the ways of life of understudies of Lanfranc?"],"info":{}}
{"id":"train_7686","question":"who cat films shot of birth city of stanisława przybyszewska ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3067991 wdt:P19 ?X . ?X wdt:P1740 ?answer }","paraphrases":["who cat movies shot of birth city of stanisława przybyszewska ?"],"info":{}}
{"id":"train_7687","question":"Which is the khanate which contains the word türgesh in their name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q331644 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'türgesh' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the khanate in their name that contains the word türgesh?"],"info":{}}
{"id":"train_7689","question":"Who is the operator of Boeing 787 Dreamliner and where is the final assembly located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q6428 wdt:P1071 ?ans_1 . wd:Q6428 wdt:P137 ?ans_2 }","paraphrases":["Who operates the Boeing 787 Dreamliner and where is it located?"],"info":{}}
{"id":"train_7691","question":"What statement was the subject of Bernard Herrmann's nomination at the 14th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q296804 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q508406 }","paraphrases":["Bernard Herrmann's nomination at the 14th Academy Awards was on what subject?"],"info":{}}
{"id":"train_7692","question":"Which is the ammunition for Minigun?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q864060 wdt:P739 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7693","question":"What are the pseudovector which start with the letter angular","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q621476 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'angular' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the pseudovector that starts with the angular letter"],"info":{}}
{"id":"train_7694","question":"During what time did Stanley Bruce receive an award for Companion of Honour?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23358 p:P166 ?s . ?s ps:P166 wd:Q16947520 . ?s pq:P585 ?value }","paraphrases":["which time stanley bruce receive an award for companion of honour?"],"info":{}}
{"id":"train_7700","question":"What is Ottawa's border town for shares?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1930 wdt:P47 ?obj . ?obj wdt:P31 wd:Q515 }","paraphrases":["What is Ottawa's border town for shares?"],"info":{}}
{"id":"train_7701","question":"According to the registration office, what is the current population of Granada?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8810 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }","paraphrases":["In registration office statistics what is the official population of Granada?"],"info":{}}
{"id":"train_7702","question":"What positions does the United Nations General Assembly appoint?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P748 wd:Q47423 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["What positions does the Joined together Countries Common Gathering appoint?"],"info":{}}
{"id":"train_7705","question":"What was the administrative body of Cairo Governate on 1990-10-23?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q30805 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1990' ) ) }","paraphrases":["On October 23, 1990, what was the administrative body of Cairo Governate?"],"info":{}}
{"id":"train_7706","question":"What award did Carl Osburn win for shooting the men's 100 metre team running deer, single shots at the 1920 Summer Olympics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q726114 p:P1344 ?s . ?s ps:P1344 wd:Q7500659 . ?s pq:P166 ?value }","paraphrases":["At the 1920 summer olympics, Carl Osburn won what award for his single shot's during the men's 100 metre deer running shooting team?"],"info":{}}
{"id":"train_7710","question":"Was Diego Maradona a member of Colombia national football team and Newell's Old Boys?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q17515 wdt:P54 wd:Q212564 . wd:Q17515 wdt:P54 wd:Q221882 }","paraphrases":["Did Diego Maradona belong to Newell's Old Boys and the Colombia national football team?"],"info":{}}
{"id":"train_7711","question":"For What  George Bernard Shaw was nomination in the year 1925-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q19185 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1925' ) ) }","paraphrases":["What was George Bernard Shaw nominated for in 1925-1-1"],"info":{}}
{"id":"train_7712","question":"Dortmund is located on terrain feature of what type?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q1295 wdt:P706 ?obj }","paraphrases":["What type of terrain is Dortmund located?"],"info":{}}
{"id":"train_7713","question":"What is Rockipedia ID of Bergen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q26793 wdt:P5173 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7714","question":"Which is the international airport for the place served by transport hub of Los Angeles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P931 wd:Q65 . ?sbj wdt:P31 wd:Q644371 }","paraphrases":["The transport hub of Los Angeles serves what international airport?"],"info":{}}
{"id":"train_7718","question":"What are the republic which start with the letter zimbabwe","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7270 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zimbabwe' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the republic which begin with the letter zimbabwe"],"info":{}}
{"id":"train_7720","question":"What are the film studio which start with the letter studios","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q375336 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'studios' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the film studio which begin with the letter studios"],"info":{}}
{"id":"train_7723","question":"What is The Black Book ID of Otto Strasser ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q76640 wdt:P4248 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7725","question":"tell me city of iran contains the word zaviyeh in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56557504 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zaviyeh' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know city of iran contains the word zaviyeh in their name"],"info":{}}
{"id":"train_7726","question":"How much is the mass of potassium ferricyanide?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q408810 wdt:P2067 ?obj }","paraphrases":["What is the molecular weight of potassium ferricyanide?"],"info":{}}
{"id":"train_7727","question":"What golf  tournament contains the word \"championship \" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15259995 . ?sbj wdt:P2094 wd:Q55864193 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'championship' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What golf competition contains \"title \" in its name ?"],"info":{}}
{"id":"train_7728","question":"Name a colonial empire that starts with the letter I","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1790360 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tell me a Name  colonial empire that starts with the letter I"],"info":{}}
{"id":"train_7730","question":"what is the isotope of tin has the highest spin quantum number?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q687521 . ?ent wdt:P1122 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["which isotope of tin has the highest spin quantum number?"],"info":{}}
{"id":"train_7731","question":"How many spouses did Rezā Shāh have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q182921 wdt:P26 ?obj }","paraphrases":["To how many people was Reza Shah married?"],"info":{}}
{"id":"train_7732","question":"Tell me childbirth whose name has the word jesus in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34581 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'jesus' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know childbirth whose title has the word jesus in it."],"info":{}}
{"id":"train_7733","question":"What was the academic major of Larry Page who was educated at Stanford University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q4934 p:P69 ?s . ?s ps:P69 wd:Q41506 . ?s pq:P812 ?value }","paraphrases":["Larry page majored in what subject while at Stanford University?"],"info":{}}
{"id":"train_7734","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q127050 wdt:P1056 ?obj . ?obj wdt:P31 wd:Q650051 }","paraphrases":["n/a"],"info":{}}
{"id":"train_7738","question":"Who is the sculptor of the ring theory, whose death date was 9-10-1948?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1208658 wdt:P170 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( YEAR ( ?x ) , '1948' ) ) }","paraphrases":["Who is the sculptor of the ring theory, whose dying date was once 9-10-1948?"],"info":{}}
{"id":"train_7739","question":"How many students are studying in the {Wilhelm Furtwängler} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q57285 wdt:P1066 ?obj }","paraphrases":["Which is the number of students that are studying in the Wilhelm Furtwängler?"],"info":{}}
{"id":"train_7741","question":"\"Where is {deathplace} of {Robert Knox}, which has {partner city} is {New Delhi} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q352109 wdt:P20 ?answer . ?answer wdt:P190 wd:Q987 }","paraphrases":["\"Where is {deathplace} of {Robert Knox}, which has {accomplice city} is {Modern Delhi} ?\""],"info":{}}
{"id":"train_7742","question":"What is the founder builder of Lancashier Witch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6483054 wdt:P176 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who was the founder builder of Lancashier Witch?"],"info":{}}
{"id":"train_7743","question":"which aircraft model with the lowest takeoff roll whose instance is airrcraft model?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15056995 . ?ent wdt:P2430 ?obj . ?ent wdt:P31 wd:Q15056995 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["what aircraft model with the shortest takeoff roll whose occasion is aircraft model?"],"info":{}}
{"id":"train_7744","question":"Where is the position of office held by head of the organisation of World Trade Organization","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7825 wdt:P2388 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["Where is the role of office held via head of the company of World Trade Organization"],"info":{}}
{"id":"train_7745","question":"What is Xi Jinping occupied by the political organization for members?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3989 wd:Q15031 . ?sbj wdt:P31 wd:Q7210356 }","paraphrases":["What is Xi Jinping possessed by the political organization for members?"],"info":{}}
{"id":"train_7747","question":"What was the population of Staten Island on July 1st, 2013?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q18432 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["What was total number of people of Staten Island on July 1st, 2013?"],"info":{}}
{"id":"train_7748","question":"Was Stephen Hawking influenced by Karl Popper?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q17714 wdt:P737 wd:Q81244 }","paraphrases":["Did Karl Popper influence Stephen Hawking?"],"info":{}}
{"id":"train_7751","question":"How was the  time period of early middle ages?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2348 wd:Q202763 }","paraphrases":[],"info":{}}
{"id":"train_7752","question":"Which is {CPI inflation rate} of {citizen of} {Asa Griggs Candler} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q744866 wdt:P27 ?X . ?X wdt:P1279 ?answer }","paraphrases":["Which is {CPI expansion rate} of {citizen of} {Asa Griggs Candler} ?"],"info":{}}
{"id":"train_7753","question":"What are thebookkeeping system which start with the letter stathmography","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60158614 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'stathmography' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are thebookkeeping framework which begin with the letter stathmography"],"info":{}}
{"id":"train_7755","question":"What is the location of Edmonton","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q2096 wdt:P131 ?ans_1 . wd:Q2096 wdt:P190 ?ans_2 }","paraphrases":["which location is EDMONTON?"],"info":{}}
{"id":"train_7756","question":"What media player works on the MS-Dos operating system?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P306 wd:Q47604 . ?sbj wdt:P31 wd:Q210337 }","paraphrases":["What media player works on the MS-Dos working system?"],"info":{}}
{"id":"train_7757","question":"Name the chinese character with grade 4 kanji","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q53764738 . ?ent wdt:P5205 ?obj . ?ent wdt:P5277 wd:Q53785305 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Give me the name of the  chinese character with grade 4 kanji?"],"info":{}}
{"id":"train_7760","question":"What award did Milton Friedman receive in 1976?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q47426 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1976' ) ) }","paraphrases":["Tell me the award Milton Friedman received in 1976?"],"info":{}}
{"id":"train_7761","question":"At what time did L'Hospitalet de Llobregat have a population of 250,536?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q15470 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '250536.0' ) ) . ?s pq:P585 ?value }","paraphrases":["When did L'Hospitalet de Llobregat reach a population of 250,536?"],"info":{}}
{"id":"train_7763","question":"Meditations has been translated into how many languages?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P629 wd:Q1152283 }","paraphrases":["How many languages has Meditations been translated into?"],"info":{}}
{"id":"train_7764","question":"WHICH IS THE MYTHICAL CREATURE THAT STARTS WITH S","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2239243 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ş' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What mythical creature starts with \"s\"?"],"info":{}}
{"id":"train_7765","question":"Who is the spouse, and what position does Derek Jeter play in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q353511 wdt:P26 ?ans_1 . wd:Q353511 wdt:P413 ?ans_2 }","paraphrases":["Who is the wife of Derek Jeter and in what position did play?"],"info":{}}
{"id":"train_7768","question":"what is the Photon weight become 0.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3198 p:P2067 ?s . ?s ps:P2067 ?x filter ( contains ( ?x , '0.0' ) ) . ?s pq:P642 ?value }","paraphrases":["Why did the Photon weight become 0?"],"info":{}}
{"id":"train_7769","question":"What award did Komosomolskaya Pravda win on December 6, 1957?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q849047 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1957' ) ) }","paraphrases":["On December 6, 1957 what award was won by Komosomolskaya Pravda?"],"info":{}}
{"id":"train_7771","question":"What framework and programming language are used in Skype?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q40984 wdt:P1414 ?ans_1 . wd:Q40984 wdt:P277 ?ans_2 }","paraphrases":["Tell me the framework and programming language that were used for creating Skype?"],"info":{}}
{"id":"train_7772","question":"When did award received of Pat Summitt and together with","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q460394 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 ?value1 . }","paraphrases":["When was Pat Summitt awarded and together with"],"info":{}}
{"id":"train_7773","question":"Who is Akbar's father?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P22 wd:Q8597 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is Akbar's dad?"],"info":{}}
{"id":"train_7774","question":"Which chemical compound has the highest acceptable daily intake?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2542 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which chemical compound has the most noteworthy worthy every day admissions?"],"info":{}}
{"id":"train_7776","question":"Name the location of work of Patrick Swayze and is also knows as Welthauptstadt.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49004 wdt:P937 ?answer . ?answer wdt:P1449 ?x FILTER ( contains ( ?x , 'Welthauptstadt' ) ) }","paraphrases":["which location of work of Patrick Swayze known as Welthauptstadt?"],"info":{}}
{"id":"train_7778","question":"What organization is a subsidiary of the Organisation for Economic Co-operation and Development?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41550 wdt:P355 ?obj . ?obj wdt:P31 wd:Q245065 }","paraphrases":["The OECD has what subsidiary organisation?"],"info":{}}
{"id":"train_7779","question":"Who is the author of Things Fall Apart","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q622400 wdt:P50 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the creator of Things Drop Separated"],"info":{}}
{"id":"train_7781","question":"Tacloban belongs to which electorate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q40626 wdt:P1831 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7782","question":"What award did Marvin Hamlisch win at the 46th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q337206 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q570921 }","paraphrases":["At the 46th Academy Awards, what award did Marvin Hamlisch win?"],"info":{}}
{"id":"train_7785","question":"When did Christopher Lloyd receive the Independent Spirit Award for Best Supporting Male?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q109324 p:P166 ?s . ?s ps:P166 wd:Q2294693 . ?s pq:P585 ?value }","paraphrases":["In which year Christopher Lloyd had reveived the Independent Spirit Award for Best Supporting Male?"],"info":{}}
{"id":"train_7787","question":"Who is the Governor of Jersey that has Queen Elizabeth as their mother.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q785 wdt:P35 ?answer . ?answer wdt:P25 wd:Q10633 }","paraphrases":["Who is the Governor of Jersey that has Queen Elizabeth as their mother."],"info":{}}
