{"id":"train_12679","question":"Which is the ERIH PLUS ID for Journal des sçavans?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q927072 wdt:P3434 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12681","question":"How many history exhibitions are at the Indianapolis Museum of Art?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P608 wd:Q1117704 }","paraphrases":["Which is the number of history exhibitions at the Indianapolis Museum of Art?"],"info":{}}
{"id":"train_12682","question":"Is it true that the height of the Gravity Recovery and Climate Experiment is greater than 0.576?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q704319 wdt:P2048 ?obj filter ( ?obj > 0.576 ) }","paraphrases":["Is the height of the Gravity Recovery and Climate Experiment more than 0.576?"],"info":{}}
{"id":"train_12683","question":"Is the distance of the 1957 Pescara Grand Prix equal to 14.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q424206 wdt:P3157 ?obj filter ( ?obj = 14.4 ) }","paraphrases":["Was the distance of the 1957 Grand Prix 14.4?"],"info":{}}
{"id":"train_12684","question":"Tell me the performing arts genre that begins with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q45971958 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the performing expressions class that starts with the letter v"],"info":{}}
{"id":"train_12685","question":"Name a disease associated with the gene LAMC1 that contains the word \"cancer\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12136 . ?sbj wdt:P2293 wd:Q18028460 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'cancer' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a illness related with the quality LAMC1 that contains the word \"cancer\" in its name"],"info":{}}
{"id":"train_12686","question":"How many military ranks are for Alexander Suvorov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q154232 wdt:P410 ?obj }","paraphrases":["Alex Suvorov has how many military ranks?"],"info":{}}
{"id":"train_12689","question":"What city is a twin administrative to Lahore ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11739 wdt:P190 ?obj . ?obj wdt:P31 wd:Q1549591 }","paraphrases":["Which  city is a twin administrative to Lahore ?"],"info":{}}
{"id":"train_12690","question":"What is the period of time point in time} for {DJ Jazzy Jeff & The Fresh Prince has been nominated for Soul Train Music Award for Best R&B/Soul or Rap Music Video ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1154136 p:P1411 ?s . ?s ps:P1411 wd:Q7564367 . ?s pq:P585 ?value }","paraphrases":["When was DJ Jazzy Jeff & The Fresh Prince nominated for Best R&B/Soul or Rap Music Video at the Soul Train Music Awards?"],"info":{}}
{"id":"train_12692","question":"Is the installed capacity of Kraftwerk Nussdorf equal to 4.74?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1786165 wdt:P2109 ?obj filter ( ?obj = 4.74 ) }","paraphrases":["Is 4.74 the installed capacity of Kraftwerk Nussdorf?"],"info":{}}
{"id":"train_12693","question":"tell me mountain name starts with z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8502 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know mountain title begins with z"],"info":{}}
{"id":"train_12695","question":"What was the award received from Chris Hemsworth that declared the winner as Tom Hiddleston?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q54314 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q295803 }","paraphrases":["What award did Chris Hemsworth receive that delcared Tom Hiddleston as the winner?"],"info":{}}
{"id":"train_12697","question":"What is the highest award given in science and engineering by Padma Vibhushan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q618779 . ?ent wdt:P1114 ?obj . ?ent wdt:P527 wd:Q30147268 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the most prestigious award given in science and engineering by Padma Vibhushan?"],"info":{}}
{"id":"train_12699","question":"Which bank has the most total equity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22687 . ?ent wdt:P2137 ?obj . ?ent wdt:P31 wd:Q16691582 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which global banking corporation has the highest total equity?"],"info":{}}
{"id":"train_12702","question":"Which is the Wikimedia category for the category of films shot at the location of Kuala Lumpur?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1865 wdt:P1740 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["Which is the Wikimedia category for the category of movies shot at the area of Kuala Lumpur?"],"info":{}}
{"id":"train_12704","question":"Is Ray Charles occupation composer and arrangement?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q544387 wdt:P106 wd:Q36834 . wd:Q544387 wdt:P106 wd:Q379755 }","paraphrases":["Was Ray Charles occupation composing and arrangement?"],"info":{}}
{"id":"train_12705","question":"Which US settlement has the lowest number of households?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q486972 . ?ent wdt:P1538 ?obj . ?ent wdt:P131 wd:Q12226949 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the US settlement which has the lowest number of households?"],"info":{}}
{"id":"train_12706","question":"Rama was a character of which national epic ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P674 wd:Q160213 . ?sbj wdt:P31 wd:Q1521512 }","paraphrases":[],"info":{}}
{"id":"train_12709","question":"Which is the OmegaWiki Defined Meaning for platinum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q880 wdt:P1245 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12710","question":"What internet presence does the voice actor Jerry Seinfeld have.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P725 wd:Q215506 . ?sbj wdt:P31 wd:Q2927074 }","paraphrases":["What presence the voice actor Jerry Seinfeld has on the internet."],"info":{}}
{"id":"train_12711","question":"Is it true that the the disease burden of AIDS equals to 91907445?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12199 wdt:P2854 ?obj filter ( ?obj = 91907445 ) }","paraphrases":["Does AIDS burden 91907445 people?"],"info":{}}
{"id":"train_12712","question":"Name an English spoken radio network that starts with letter N","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1061197 . ?sbj wdt:P2936 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an English spoken radio network that starts with letter N"],"info":{}}
{"id":"train_12713","question":"regular icosahedron is base ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q18015071 wdt:P3263 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12714","question":"What is the death date of the brother of Kangxi Emporer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17790 wdt:P3373 ?X . ?X wdt:P570 ?answer }","paraphrases":["The death date of the brother of Kangxi Emporer is what?"],"info":{}}
{"id":"train_12715","question":"MiG-21 has how many operators?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q150609 wdt:P137 ?obj }","paraphrases":["How many operators does MiG-21 have?"],"info":{}}
{"id":"train_12716","question":"What city is named for St. Paul?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P417 wd:Q9200 . ?sbj wdt:P31 wd:Q515 }","paraphrases":["What city is named for St. Paul?"],"info":{}}
{"id":"train_12717","question":"Who is the partner of Michel Foucault","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P451 wd:Q44272 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the accomplice of Michel Foucault"],"info":{}}
{"id":"train_12718","question":"Who's last meal was white wine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3902 wd:Q10210 }","paraphrases":[],"info":{}}
{"id":"train_12719","question":"For what Stephanie L. Kwolek received an award in 01/01/1986?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7509 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1986' ) ) }","paraphrases":["What award did Stephanie L. Kwolek win in 1986?"],"info":{}}
{"id":"train_12720","question":"What position did Gerald Ford hold as 40?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9582 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '40' ) ) }","paraphrases":["Which position did Gerald Ford have at 40?"],"info":{}}
{"id":"train_12722","question":"Tell me relation  whose name has the word zustandszahl in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q930933 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zustandszahl' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a relationship whose name contains the word zustandszahl"],"info":{}}
{"id":"train_12724","question":"What was Maxim Gorky nominated for in 1918?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12706 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1918' ) ) }","paraphrases":["Which nomination did Maxim Gorky get in 1918?"],"info":{}}
{"id":"train_12725","question":"Who is the parent of John ll Komnenos having death place at Constantinople?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41628 wdt:P25 ?answer . ?answer wdt:P20 wd:Q16869 }","paraphrases":["Who is the mum or dad of John ll Komnenos having death area at Constantinople?"],"info":{}}
{"id":"train_12726","question":"Toyota is a division of another automobile marque, which one ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q53268 wdt:P199 ?obj . ?obj wdt:P31 wd:Q17412622 }","paraphrases":["Toyota could be a division of another vehicle marque, which one ?"],"info":{}}
{"id":"train_12727","question":"Which is the NUKAT (WarsawU) authorities ID of Jerome Kern?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q313270 wdt:P1207 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12728","question":"What is the middle name of Francis Frith that has the equivalent of Frans?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q978878 wdt:P735 ?answer . ?answer wdt:P460 wd:Q3480175 }","paraphrases":["What is the center name of Francis Frith that has the equal of Frans?"],"info":{}}
{"id":"train_12731","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P748 wd:Q8889 . ?sbj wdt:P31 wd:Q43229 }","paraphrases":["n/a"],"info":{}}
{"id":"train_12732","question":"What are theprogramming language which start with the letter x","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9143 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are theprogramming dialect which begin with the letter x"],"info":{}}
{"id":"train_12733","question":"By whom is the designer of the Burj Khalifa  employed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12495 wdt:P84 ?obj . ?obj wdt:P31 wd:Q4387609 }","paraphrases":["By whom is the originator of the Burj Khalifa employed?"],"info":{}}
{"id":"train_12734","question":"What is the first described of Twelve-tone technique whose pupil is Eduard Steuermann?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q221686 wdt:P61 ?answer . ?answer wdt:P802 wd:Q214108 }","paraphrases":["What is the first described of Twelve-tone approach whose pupil is Eduard Steuermann?"],"info":{}}
{"id":"train_12735","question":"What are the accomplishments of Benjamin Thorpe's teacher?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4382004 wdt:P1066 ?X . ?X wdt:P800 ?answer }","paraphrases":["What are the achievements of Benjamin Thorpe's teacher?"],"info":{}}
{"id":"train_12736","question":"When did hotel for location of Manhattan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P276 wd:Q11299 . ?sbj wdt:P31 wd:Q27686 }","paraphrases":[],"info":{}}
{"id":"train_12738","question":"What is number of out of school children continent of dvaravati?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1268307 wdt:P30 ?X . ?X wdt:P2573 ?answer }","paraphrases":["Dvaravati has how many school children that are continent?"],"info":{}}
{"id":"train_12739","question":"What is Michal Martikán's ICF canoer ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q287399 wdt:P3689 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12740","question":"Tell me naval battle whose name has the word beard in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1261499 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'beard' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE NAVAL BATTLE THAT HAS THE WORD BEARD IN IT"],"info":{}}
{"id":"train_12746","question":"What was Abd al-Mu'min's estimated date of birth?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q307312 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1480 wd:Q5727902 }","paraphrases":["As the birth date of Abd al-Mu'min's, what date was it?"],"info":{}}
{"id":"train_12747","question":"na","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q185351 wdt:P425 ?X . ?X wdt:P1150 ?answer }","paraphrases":["na"],"info":{}}
{"id":"train_12748","question":"When award received of Clive Granger and point in time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q312575 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["When grant gotten of Clive Granger and point in time?"],"info":{}}
{"id":"train_12750","question":"Who is The Jungle Book's publisher and illustrator?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q189509 wdt:P123 ?ans_1 . wd:Q189509 wdt:P110 ?ans_2 }","paraphrases":["Who is the publisher and illustrator of The Jungle Book?"],"info":{}}
{"id":"train_12751","question":"What Taiwanese election for the President and Vice President of China had the fewest ballots cast?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19801853 . ?ent wdt:P1868 ?obj . ?ent wdt:P17 wd:Q865 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What Taiwanese election for the President and Vice President of China had the fewest ballots cast?"],"info":{}}
{"id":"train_12752","question":"What award did Ian Thorpe received for swimming at the 2000 Summer Olympics – Men's 4 × 100 metre medley relay?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q185044 p:P1344 ?s . ?s ps:P1344 wd:Q3879601 . ?s pq:P166 ?value }","paraphrases":["What medal for the Men's 4 x 100 metre medley relay did Ian Thope receive in swimming at the 2000 Summer Olympics?"],"info":{}}
{"id":"train_12756","question":"How many non-binary genders are there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P21 wd:Q48270 }","paraphrases":["What number of genders are there that identify as non-binary?"],"info":{}}
{"id":"train_12757","question":"Can achalasia and dyspepsia be treated with sodium bicarbonate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q179731 wdt:P2175 wd:Q661015 . wd:Q179731 wdt:P2175 wd:Q653971 }","paraphrases":["Anyone who experiences acid reflux more than twice a week should seek medical treatment, as it may be a sign of gastroesophageal reflux disease (GERD) or another underlying condition. However, if acid reflux comes and goes and lasts less than 2 weeks, baking soda, or sodium bicarbonate may help."],"info":{}}
{"id":"train_12758","question":"Is there a bibliography and case number for Planned Parenthood vs. Casey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2107009 wdt:P2860 ?X . ?X wdt:P793 ?answer }","paraphrases":["Get me the  bibliography and case number for Planned Parenthood vs. Casey"],"info":{}}
{"id":"train_12759","question":"Who is the elder brother of William who is known politician?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q128902 wdt:P3373 ?answer . ?answer wdt:P106 wd:Q82955 }","paraphrases":["Who is the senior brother of William who is known politician?"],"info":{}}
{"id":"train_12760","question":"At what opera did librettist Philip Glass play in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P87 wd:Q189729 . ?sbj wdt:P31 wd:Q1344 }","paraphrases":["Librettist Philip Glass was in what opera?"],"info":{}}
{"id":"train_12761","question":"Which is the circumstellar disk which starts with the letter b?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3235978 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the circumstellar disk which begins with the letter b?"],"info":{}}
{"id":"train_12762","question":"Who is the employer of Georges Dumezil when he was a professor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q310590 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P39 wd:Q121594 }","paraphrases":["When Georges Dumezil was a professor, who was his employer?"],"info":{}}
{"id":"train_12763","question":"What is the nickname of the Rivne Oblast that was used beginning in 1991?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q174187 p:P1813 ?s . ?s ps:P1813 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1991' ) ) }","paraphrases":["Mention the nickname of the Rivne Oblast which was used in the year 1991 beginning?."],"info":{}}
{"id":"train_12764","question":"Who is Will Ferrell's sibling, and who is his child?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q218503 wdt:P3373 ?ans_1 . wd:Q218503 wdt:P40 ?ans_2 }","paraphrases":["Who is the sibling and child of Will Ferrell?"],"info":{}}
{"id":"train_12765","question":"What is the version of the operating system of the video game \"Myst?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6497116 wdt:P400 ?X . ?X wdt:P348 ?answer }","paraphrases":["What is the form of the working framework of the video amusement \"Myst?\""],"info":{}}
{"id":"train_12766","question":"When did South Korea have a population of 2.72617e+07?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q884 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '2.72617e+07' ) ) . ?s pq:P585 ?value }","paraphrases":["In what year did South Korea have a population of 2.72617e+07?"],"info":{}}
{"id":"train_12767","question":"What are the coordinates for the source of the Krishna River?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q193499 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }","paraphrases":["Give me the exact geographical location details of the region from where Krishna river originates?"],"info":{}}
{"id":"train_12768","question":"Name the most soluble flammable liquid that contains chlorine.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5457310 . ?ent wdt:P2177 ?obj . ?ent wdt:P527 wd:Q688 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the most soluble flammable liquid that includes chlorine."],"info":{}}
{"id":"train_12769","question":"What is Dagens Næringsliv topic ID for aviation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q765633 wdt:P4167 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12771","question":"When is {twinned administrative body} of {Fuzhou} where {start time} is {1981-5-20} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q68481 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1981' ) ) }","paraphrases":["Did Fuzhou become a twinned administrative body on May 20th, 1981?"],"info":{}}
{"id":"train_12776","question":"Sigmund Freud'f field of work is used in what type of therapy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9215 wdt:P101 ?obj . ?obj wdt:P31 wd:Q179661 }","paraphrases":["Sigmund Freud'f field of work is utilized in what sort of therapy?"],"info":{}}
{"id":"train_12778","question":"Which musician preceeds Parisian Solos?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7137466 wdt:P156 ?X . ?X wdt:P175 ?answer }","paraphrases":["Which performer preceeds Parisian Solos?"],"info":{}}
{"id":"train_12779","question":"Tell me paramedical speciality  whose name has the word T","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q30109942 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know paramedical claim to fame whose title has the word T"],"info":{}}
{"id":"train_12782","question":"Is sulfur dioxide harmful to humans?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5282 wdt:P1542 ?X . ?X wdt:P689 ?answer }","paraphrases":["Can sulfur dioxide be harmful to humans"],"info":{}}
{"id":"train_12783","question":"Which is the mythology for the culture of Hittites?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2596 wd:Q5406 . ?sbj wdt:P31 wd:Q9134 }","paraphrases":["Which is the mythology for the culture of Hittites?"],"info":{}}
{"id":"train_12788","question":"What are the tributaries of the river which the Incheon Bridge spans?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q483949 wdt:P177 ?X . ?X wdt:P974 ?answer }","paraphrases":["What tributaries does Incheon Bridge go over?"],"info":{}}
{"id":"train_12790","question":"What newspaper has the largest Alexa rank?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11032 . ?ent wdt:P1661 ?obj . ?ent wdt:P452 wd:Q38926 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which newspaper is ranked the highest by Alexa?"],"info":{}}
{"id":"train_12791","question":"how many occupy the percussion intruments?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P106 wd:Q133163 }","paraphrases":["Percussion instruments are occupied by how many people?"],"info":{}}
{"id":"train_12793","question":"Can you say which area in Tenerife has the highest cosmic background radiation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q33093130 . ?ent wdt:P2144 ?obj . ?ent wdt:P131 wd:Q40846 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["In Tenerife, which area has the highest level of cosmic background radiation?"],"info":{}}
{"id":"train_12794","question":"Who is the National member of Aileen Wuornos?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q264849 wdt:P27 ?X . ?X wdt:P463 ?answer }","paraphrases":["Who is the National part of Aileen Wuornos?"],"info":{}}
{"id":"train_12795","question":"What's the NIOSH Pocket Guide ID number of cobalt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q740 wdt:P1931 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12796","question":"Tell me the part of speech that starts with the letter v.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q82042 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the portion of discourse that begins with the letter v."],"info":{}}
