{"id":"train_10257","question":"What are the coordinates for the location of the Limpopo river source?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q173017 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }","paraphrases":["which the coordinates for the location of the limpopo river source?"],"info":{}}
{"id":"train_10258","question":"Who are the carries for the Confederation Bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q865076 wdt:P2505 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10259","question":"How many matches has Rinus Michels played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q2154479 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["How numerous matches has Rinus Michels played?"],"info":{}}
{"id":"train_10261","question":"When did Kim Novak and Richard Johnson get married and when did the marriage end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q212879 p:P26 ?s . ?s ps:P26 wd:Q166422 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["On what dat did Kim Novak and Richard Johnson get married and divorced?"],"info":{}}
{"id":"train_10264","question":"What are the animated series that executive producer Ken Keeler and which contains the word futurama in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q581714 . ?sbj wdt:P1431 wd:Q1339527 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'futurama' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the enlivened arrangement that official maker Ken Keeler and which contains the word futurama in their name"],"info":{}}
{"id":"train_10265","question":"Mayor John Purroy Mitchel is the mayor of what place which is also the deathplace of William Magear Tweed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1353450 wdt:P20 ?answer . ?answer wdt:P6 wd:Q3182321 }","paraphrases":["Mayor John Purroy Mitchel is the mayor of what place is William Magear Tweed's deathplace?"],"info":{}}
{"id":"train_10268","question":"Is it true that the stroke of the SNCF 232.P.1 equals 255?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2815068 wdt:P2557 ?obj filter ( ?obj = 255 ) }","paraphrases":["Is it genuine that the stroke of the SNCF 232.P.1 breaks even with 255?"],"info":{}}
{"id":"train_10269","question":"Did Jerry Heller serve in the U.S. Army?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2748625 wdt:P241 wd:Q9212 }","paraphrases":["Was Jerry Heller a soldier in the U.S. Army?"],"info":{}}
{"id":"train_10271","question":"tell  me document that editor National Constituent Assembly  starts withc","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49848 . ?sbj wdt:P98 wd:Q876424 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tell me document that editor National Constituent Assembly begins withc"],"info":{}}
{"id":"train_10272","question":"Which region of Zealand is headed by Christopher of Bavaria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q25535 wdt:P131 ?answer . ?answer wdt:P35 wd:Q58056 }","paraphrases":["Which locale of Zealand is headed by Christopher of Bavaria?"],"info":{}}
{"id":"train_10273","question":"Is Mexico subject to the Holy See-Mexico relations?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q96 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q5886105 }","paraphrases":["Does the Holy See-Mexico relations comprise of Mexico?"],"info":{}}
{"id":"train_10274","question":"What is the series ordinal of Maria de Montserrat?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q151435 p:P735 ?s . ?s ps:P735 wd:Q47487249 . ?s pq:P1545 ?value }","paraphrases":["What are the ordinal series of Maria de Montserrat?"],"info":{}}
{"id":"train_10276","question":"When did J.R.R. Tolkien receive the Hugo Award for Best Dramatic Presentation?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q892 p:P166 ?s . ?s ps:P166 wd:Q3414212 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["When did J.R.R. Tolkien acquire the Hugo Award for Best Dramatic Presentation?"],"info":{}}
{"id":"train_10277","question":"Who was born in Monterrey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P19 wd:Q81033 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was born in Monterrey?"],"info":{}}
{"id":"train_10278","question":"What award did Piero Gherardi receive when he scored 8 1/2?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12018 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q506734 }","paraphrases":["When Piero Gherardi scored 8 1/2, what award did he receive?"],"info":{}}
{"id":"train_10280","question":"What are the origins of lynching that were started in the Colony of Virginia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q486775 wdt:P138 ?answer . ?answer wdt:P19 wd:Q1070529 }","paraphrases":["What are the origins of lynching that had been commenced in the Colony of Virginia?"],"info":{}}
{"id":"train_10281","question":"What is the HDI of the city of Ceuta?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5823 wdt:P131 ?answer . ?answer wdt:P1081 ?x FILTER ( contains ( ?x , '0.803' ) ) }","paraphrases":["Specify Ceuta city's HDI."],"info":{}}
{"id":"train_10282","question":"Who is {musician} of {sequel} {I Will Be Here} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5979779 wdt:P155 ?X . ?X wdt:P175 ?answer }","paraphrases":["Who is {performer} of {continuation} {I Will Be Here} ?"],"info":{}}
{"id":"train_10283","question":"When Tsung-Dao Lee was award Nobel Prize in Physics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q183679 p:P166 ?s . ?s ps:P166 wd:Q38104 . ?s pq:P585 ?value }","paraphrases":["When was Tsung-Dao Lee give the Nobel Prize in Physics?"],"info":{}}
{"id":"train_10284","question":"Which American citizen has spent the least amount of time in space?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P2873 ?obj . ?ent wdt:P27 wd:Q30 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What American has spent less time in space?"],"info":{}}
{"id":"train_10285","question":"What are feature film which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24869 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are include film which begin with the letter t"],"info":{}}
{"id":"train_10286","question":"Which is the Shironet song ID of O Captain! My Captain!?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2008338 wdt:P4035 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10287","question":"Tell me atmospheric electricity whose name has the word ball in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q427085 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ball' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know climatic power whose title has the word ball in it."],"info":{}}
{"id":"train_10289","question":"Tell me Freedom suit  whose name has the word dred in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5500839 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dred' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal to me Freedom suit whose name has the word dred in it"],"info":{}}
{"id":"train_10290","question":"What is established by the Rurik dynasty that has been born in Europe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q210398 wdt:P112 ?answer . ?answer wdt:P19 wd:Q46 }","paraphrases":["What is hooked up by way of the Rurik dynasty that has been born in Europe?"],"info":{}}
{"id":"train_10291","question":"When was Bryan Adams nominated as Juno Award for Single of the Year?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q482907 p:P1411 ?s . ?s ps:P1411 wd:Q6314103 . ?s pq:P585 ?value }","paraphrases":["When was Bryan Adams designated as Juno Grant for Single of the Year?"],"info":{}}
{"id":"train_10292","question":"What is PHP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P277 wd:Q59 . ?sbj wdt:P31 wd:Q1293664 }","paraphrases":["What is PHP?"],"info":{}}
{"id":"train_10295","question":"Who was the student of John the Baptist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q40662 wdt:P802 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was John the Baptist's student?"],"info":{}}
{"id":"train_10296","question":"Name a uninformed search that uses graph that starts with letter F","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4443425 . ?sbj wdt:P2283 wd:Q2479726 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an uninformed search using a graph starting with letter F"],"info":{}}
{"id":"train_10297","question":"When was Sasha Grey a member of aTelecine?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2709 p:P463 ?s . ?s ps:P463 wd:Q4033106 . ?s pq:P582 ?value }","paraphrases":["When was Sasha Grey an individual from a Telecine?"],"info":{}}
{"id":"train_10298","question":"what is the start time for Rashi has residence as Worms ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q26456 p:P551 ?s . ?s ps:P551 wd:Q3852 . ?s pq:P580 ?value }","paraphrases":["When did Rashi begin their residence at Worms?"],"info":{}}
{"id":"train_10299","question":"Where are the inhabitants of \"The Fresh Prince of Bel-Air\" from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q309063 wdt:P495 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Where are the occupants of \"The New Sovereign of Bel-Air\" from?"],"info":{}}
{"id":"train_10301","question":"What award did Clint Eastwood recieve","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43203 wdt:P166 ?obj . ?obj wdt:P31 wd:Q60754876 }","paraphrases":["What grant did Clint Eastwood recieve"],"info":{}}
{"id":"train_10305","question":"Where in the Province of Milan was the county seat Claudio Abbado born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q151608 wdt:P19 ?answer . ?answer wdt:P1376 wd:Q15121 }","paraphrases":["Where was the county seat Claudio Abbado born in the Province of Milan?"],"info":{}}
{"id":"train_10307","question":"Which taxon has the highest frequency of audible sound?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3465 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which taxon has the most elevated recurrence of capable of being heard sound?"],"info":{}}
{"id":"train_10308","question":"The descriptions and figures of the Araneides of the United States are what consort of authors?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28667629 wdt:P50 ?X . ?X wdt:P26 ?answer }","paraphrases":["The portrayals and figures of the Araneides of the Joined together States are what associate of creators?"],"info":{}}
{"id":"train_10309","question":"Tell me studio album whose name has the word wolf in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q208569 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wolf' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE STUDIO ALBUM HAT HAS THE WORD WOLF IN IT"],"info":{}}
{"id":"train_10310","question":"IS THE ORBITAL ECCENTRICITY OF THE 6275 KIRYU EQAULS TO 0.01","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q556104 wdt:P1096 ?obj filter ( ?obj = 0.01 ) }","paraphrases":["IS THE EQAULATION ORBITAL OF THE 6275 KIRYU TO 0.01"],"info":{}}
{"id":"train_10311","question":"Which musical did Pete Townshend compose?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P86 wd:Q26933 . ?sbj wdt:P31 wd:Q2743 }","paraphrases":["Pete Townshend composed which musical?"],"info":{}}
{"id":"train_10313","question":"Which is an active ingredient of the alcoholic beverage?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q154 wdt:P3781 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10314","question":"what differs from heat that has a sub item of energy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44432 wdt:P1889 ?answer . ?answer wdt:P1269 wd:Q11379 }","paraphrases":["what varies from warm that features a sub thing of energy?"],"info":{}}
{"id":"train_10315","question":"When did Delta Air Lines have a 12.8 market capitalization?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q188920 p:P2226 ?s . ?s ps:P2226 ?x filter ( contains ( ?x , '1.1643e+10' ) ) . ?s pq:P585 ?value }","paraphrases":["On what date was a 12.8 market capitalization achieved by Delta Air Lines?"],"info":{}}
{"id":"train_10316","question":"What is the maximum angular resolution of robotic telescope?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3982946 . ?ent wdt:P3439 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the most angular resolution of robotic telescope?"],"info":{}}
{"id":"train_10318","question":"What is the {alloy} with the lowest yield strength whose use is construction ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q37756 . ?ent wdt:P5529 ?obj . ?ent wdt:P366 wd:Q385378 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What construction allow has the lowest yield strength?"],"info":{}}
{"id":"train_10319","question":"Is it true that 96 is the hydraulic head of Alqueva Dam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2165228 wdt:P4441 ?obj filter ( ?obj = 96 ) }","paraphrases":["Is it genuine that 96 is the pressure driven head of Alqueva Dam?"],"info":{}}
{"id":"train_10320","question":"What president edited the Garcia Report?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17277843 wdt:P98 ?X . ?X wdt:P488 ?answer }","paraphrases":["What president altered the Garcia Report?"],"info":{}}
{"id":"train_10321","question":"What cities are the Buddenbrooks set in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q326909 wdt:P2860 ?obj }","paraphrases":["What locations are the Buddenbrooks set in?"],"info":{}}
{"id":"train_10322","question":"What area are the papers at the Monique Genonceaux about?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49965119 wdt:P485 ?X . ?X wdt:P101 ?answer }","paraphrases":["What range are the papers at the Monique Genonceaux about?"],"info":{}}
{"id":"train_10324","question":"What is Javier Zanetti's Soccerway player ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q52876 wdt:P2369 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10325","question":"When did Takeshi Inoue lose their employment?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11373250 wdt:P106 ?X . ?X wdt:P461 ?answer }","paraphrases":["When did Takeshi Inoue lose their business?"],"info":{}}
{"id":"train_10326","question":"When did Madison have a population of 6611?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43788 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '6611.0' ) ) . ?s pq:P585 ?value }","paraphrases":["Mention the year in which Madison have population of 6611?"],"info":{}}
{"id":"train_10327","question":"What is the chemical compound with the least acceptable daily intake?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2542 ?obj . ?ent wdt:P31 wd:Q11173 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What chemical compound has the least daily intake acceptability?"],"info":{}}
{"id":"train_10328","question":"What medical condition is treated with Sodium Bicarbonate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q179731 wdt:P2175 ?X . ?X wdt:P1995 ?answer }","paraphrases":["What is the medical condition of Sodium Bicarbonate being treated?"],"info":{}}
{"id":"train_10331","question":"The 60762 dollar prize went to John Mott","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q159726 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter ( contains ( ?x , '60762.0' ) ) }","paraphrases":["John Mott won the $60,762 prize."],"info":{}}
{"id":"train_10332","question":"Which kind of weather caused by coldburst contains the word \"rain\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11663 . ?sbj wdt:P828 wd:Q1292121 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'rain' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which type of weather precipitated by means of coldburst incorporates the phrase \"rain\" in its name ?"],"info":{}}
{"id":"train_10334","question":"tell me chartered company starts with c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162157 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE CHARTERED SPORT STARTS WITH C"],"info":{}}
{"id":"train_10335","question":"According to the census, what is the population of Arizona?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q816 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["What is the population of Arizona, according to the census?"],"info":{}}
{"id":"train_10337","question":"What type of government replaced the ruling of the thirteen colonies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q179997 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What sort of government supplanted the administering of the thirteen colonies?"],"info":{}}
{"id":"train_10338","question":"Who is the showrunner of Creeper?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3696918 wdt:P1441 ?X . ?X wdt:P1431 ?answer }","paraphrases":["Name the showrunner of Creeper"],"info":{}}
{"id":"train_10339","question":"Which is partially coincident with the web application?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q189210 wdt:P1382 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10341","question":"Is the average shot length of the Too Late greater than 16.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q20649989 wdt:P2208 ?obj filter ( ?obj > 16.0 ) }","paraphrases":["Is the normal shot length of the As well Late more prominent than 16.0?"],"info":{}}
{"id":"train_10342","question":"What was the powerstation that replaced the Yamaha RD400?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18395834 wdt:P1365 ?X . ?X wdt:P516 ?answer }","paraphrases":["What was the powerstation that supplanted the Yamaha RD400?"],"info":{}}
{"id":"train_10343","question":"who top dog of martha raye ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q435236 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Which is top dog of Martha Raye?"],"info":{}}
{"id":"train_10344","question":"When did the Kingdom of England become a country?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q179876 p:P31 ?s . ?s ps:P31 ?x filter ( contains ( ?x , 'http://dbpedia.org/ontology/State' ) ) . ?s pq:P580 ?value }","paraphrases":["What year did England become an official country?"],"info":{}}
{"id":"train_10345","question":"Is the wing area of the Lancaster equal to 1556.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q203622 wdt:P2112 ?obj filter ( ?obj = 1556.4 ) }","paraphrases":["What is the Lancaster's wing area?"],"info":{}}
{"id":"train_10346","question":"How do you determine Saturday is the first date of the week?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q131 p:P1545 ?s . ?s ps:P1545 ?x filter ( contains ( ?x , '0' ) ) . ?s pq:P1013 ?value }","paraphrases":["How will the rest of the week be ordered if saturday is the first day of the week?"],"info":{}}
{"id":"train_10348","question":"What is the name of the artery that supplies the liver?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9368 wdt:P2286 ?obj . ?obj wdt:P31 wd:Q9655 }","paraphrases":["What is  the  artery that is connected to  the liver?"],"info":{}}
{"id":"train_10349","question":"When did the marriage of Jefferson and Varina Davis end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q162269 p:P26 ?s . ?s ps:P26 wd:Q457993 . ?s pq:P582 ?value }","paraphrases":["What day did Jefferson and Varina Davis break up?"],"info":{}}
{"id":"train_10350","question":"When did Michael Palin receive the BAFTA Award for Best Actor in a Supporting Role?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q223985 p:P166 ?s . ?s ps:P166 wd:Q548389 . ?s pq:P585 ?value }","paraphrases":["On what date did Michael Palin receive the BAFTA Award for Best Actor in a Supporting Role?"],"info":{}}
{"id":"train_10351","question":"who location of item of process of pastry ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q477248 wdt:P2079 ?X . ?X wdt:P276 ?answer }","paraphrases":["who area of thing of handle of cake ?"],"info":{}}
{"id":"train_10352","question":"Tell me neighborhood whose name has zeitungsviertel in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q123705 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zeitungsviertel' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What neighborhood is named zeitungsviertel?"],"info":{}}
{"id":"train_10353","question":"How many executive bodies are by prefecture?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P208 wd:Q515716 }","paraphrases":["What is the number of executive bodies by prefecture?"],"info":{}}
{"id":"train_10356","question":"What year did Luxembourg join the International Centre for Settlement of Investment Disputes?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q32 p:P463 ?s . ?s ps:P463 wd:Q899770 . ?s pq:P580 ?value }","paraphrases":["When did Luxembourg join the International Centre for Settlement of Investment disputes"],"info":{}}
{"id":"train_10357","question":"What is the official language of Syrian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q200608 wdt:P2348 ?X . ?X wdt:P1705 ?answer }","paraphrases":["What language is officially recognised in Syria?"],"info":{}}
{"id":"train_10358","question":"What country includes the sovereign state of HOryu-ji?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q261932 wdt:P17 ?X . ?X wdt:P150 ?answer }","paraphrases":["What nation incorporates the paramount state of HOryu-ji?"],"info":{}}
{"id":"train_10361","question":"DOES THE ELONGATION AT BREAK IF THE POLYAMID 610 EQUALS 50","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q57249107 wdt:P5811 ?obj filter ( ?obj = 50 ) }","paraphrases":["DOES THE POLYAMID 610 EQUALS 50 THE POLYAMID"],"info":{}}
{"id":"train_10362","question":"When was Victor Hugo a member of the Académie française?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q535 p:P463 ?s . ?s ps:P463 wd:Q161806 . ?s pq:P580 ?value }","paraphrases":["Victor Hugo was a member of the Academie francaise when?"],"info":{}}
