{"id":"train_5149","question":"what was the  facet and  history of topic of copyright?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q12948581 wdt:P1269 ?ans_1 . wd:Q12948581 wdt:P2184 ?ans_2 }","paraphrases":["What are some facts and history of copyrights?"],"info":{}}
{"id":"train_5151","question":"who  is the human spacefligh for member of the crew  of Christa McAuliffe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q229674 wdt:P5096 ?obj . ?obj wdt:P31 wd:Q752783 }","paraphrases":["who is the human spacefligh for part of the team of Christa McAuliffe?"],"info":{}}
{"id":"train_5152","question":"Who is a graduate of John Key, who is a member of the Association of Research Libraries?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57783 wdt:P69 ?answer . ?answer wdt:P463 wd:Q4810036 }","paraphrases":["Who may be a graduate of John Key, who could be a part of the Affiliation of Inquire about Libraries?"],"info":{}}
{"id":"train_5153","question":"What book publishing company developed Final Fantasy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q189842 wdt:P178 ?obj . ?obj wdt:P31 wd:Q1320047 }","paraphrases":["What book distributing company created Last Fantasy?"],"info":{}}
{"id":"train_5154","question":"How many games did Richie McCaw play when he was on the New Zealand national rugby union team and how many points did he score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q726148 p:P54 ?s . ?s ps:P54 wd:Q55801 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How numerous diversions did Richie McCaw play when he was on the Unused Zealand national rugby union group and how numerous focuses did he score?"],"info":{}}
{"id":"train_5158","question":"Name the bisphonel A polymer with the lowest Young's modulus ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q81163 . ?ent wdt:P5480 ?obj . ?ent wdt:P4600 wd:Q271980 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What bisphonel A polymer has the lowest Young's modulus?"],"info":{}}
{"id":"train_5159","question":"What is the final time for Wayde van Niekerk has a partecipant of 2015 World Championships in Athletics - Men's 400 metres?)","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16855376 p:P1344 ?s . ?s ps:P1344 wd:Q20798444 . ?s pq:P2781 ?value }","paraphrases":["What was the final year in which Wayde van Niekerk has a partecipant of 2015 World Championships in Athletics - Men's 400 metres?)"],"info":{}}
{"id":"train_5160","question":"When did Charles the Fat get the noble title as King of Aquitane?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q150712 p:P97 ?s . ?s ps:P97 wd:Q23931012 . ?s pq:P580 ?value }","paraphrases":["On what date did Charles the Fat received the noble title of King of Aquitane?"],"info":{}}
{"id":"train_5162","question":"Who was head of the Munich government until 06/30/1993?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1726 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1993' ) ) }","paraphrases":["Who ran the Munich Government until 6/30/1993?"],"info":{}}
{"id":"train_5165","question":"To what country does Honolulu belong and when did it become a part of that country?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q18094 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["What country is Honolulu a city in and when did it become part of that country?"],"info":{}}
{"id":"train_5166","question":"Tell me video game whose name has the word zauberschloß in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7889 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zauberschloß' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know video amusement whose title has the word zauberschloß in it."],"info":{}}
{"id":"train_5167","question":"How many people have been inspired by Batman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q2695156 wdt:P941 ?obj }","paraphrases":["Which is the number of people that have been inspired by Batman?"],"info":{}}
{"id":"train_5168","question":"what is the honours of Fred Astaire, that has leader of James Mason ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q100937 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q209186 }","paraphrases":["what is the respects of Fred Astaire, that has pioneer of James Bricklayer ?"],"info":{}}
{"id":"train_5170","question":"When did South America have 7.07274e+06 students out of school?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q18 p:P2573 ?s . ?s ps:P2573 ?x filter ( contains ( ?x , '7.07274e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["When did South America have over 7000000 students out of school"],"info":{}}
{"id":"train_5171","question":"Who owns NSDAP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P127 wd:Q7320 }","paraphrases":["Who is the owner of NSDAP?"],"info":{}}
{"id":"train_5173","question":"How many people were in the lineage of Johann Wolfgang von goethe?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5879 p:P735 ?s . ?s ps:P735 wd:Q11122389 . ?s pq:P1545 ?value }","paraphrases":["Give me the number of people who were in the lineage of Johann Wolfgang von goethe."],"info":{}}
{"id":"train_5174","question":"What is the procedural programming language designed by Grace Hopper ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P287 wd:Q11641 . ?sbj wdt:P31 wd:Q28922885 }","paraphrases":["What is the procedural programming dialect outlined by Elegance Container ?"],"info":{}}
{"id":"train_5176","question":"How many exhibition histories are for the L'Origine du monde} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q334138 wdt:P608 ?obj }","paraphrases":["L'Origine du monde has now many exhibition histories?"],"info":{}}
{"id":"train_5177","question":"Wich means {animal housed} for {sucessor } at {İzmir Zoo} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6055483 wdt:P156 ?X . ?X wdt:P1990 ?answer }","paraphrases":["Wich implies {creature housed} for {sucessor } at {İzmir Zoo} ?"],"info":{}}
{"id":"train_5178","question":"When did Bobby Moore join the Seattle Sounders?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q191492 p:P54 ?s . ?s ps:P54 wd:Q956200 . ?s pq:P580 ?value }","paraphrases":["Tell me when Bobby Moore became a Seattle Sounder."],"info":{}}
{"id":"train_5179","question":"What was Neil Simon nominated for and when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q315808 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What was once Neil Simon nominated for and when?"],"info":{}}
{"id":"train_5180","question":"What noble title did Louis the Pious have in year 814?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P582 ?x filter ( contains ( ?x , '814-0-0' ) ) }","paraphrases":["Louis the Pious possessed what noble title in 814?"],"info":{}}
{"id":"train_5182","question":"Which is the US Federal Election Commission ID of Carly Fiorina?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q256380 wdt:P1839 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5184","question":"What is the minimal incubation period in humans of the influenza vaccine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q383260 wdt:P1924 ?X . ?X wdt:P3488 ?answer }","paraphrases":["For the influenza vaccine in humans, what is the minimal incubation period?"],"info":{}}
{"id":"train_5185","question":"What is the human spaceflight for Christa McAuliffe's crew member?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1029 wd:Q229674 . ?sbj wdt:P31 wd:Q752783 }","paraphrases":["What is the human spaceflight for Christa McAuliffe's group member?"],"info":{}}
{"id":"train_5186","question":"Who was nominated for Monday Night Football in the year 1980?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1088765 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["Give the name(s) nominated for Monday Night Football in 1980."],"info":{}}
{"id":"train_5188","question":"What was Howard H. Aiken's academic major at Harvard University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q299723 p:P69 ?s . ?s ps:P69 wd:Q13371 . ?s pq:P812 ?value }","paraphrases":["What did Howard H. Aiken major in while at Harvard University?"],"info":{}}
{"id":"train_5190","question":"What is the chemical compound of water?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4149 wd:Q283 . ?sbj wdt:P31 wd:Q11173 }","paraphrases":["What is the chemical compound of water?"],"info":{}}
{"id":"train_5191","question":"Who did Bram Stoker work for in 1878?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q36184 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1878' ) ) }","paraphrases":["Who was Bram Stoker working for in 1878?"],"info":{}}
{"id":"train_5192","question":"What is the demised placce of Leo III}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q132086 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q170174 }","paraphrases":["Where did Leo III die?"],"info":{}}
{"id":"train_5194","question":"Is the thermal design power of the Core i7-7700 equal to 65?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28973012 wdt:P2229 ?obj filter ( ?obj = 65 ) }","paraphrases":["65 is the design power of the Core i7-7700, right?"],"info":{}}
{"id":"train_5195","question":"Name a space observatory wose starting point is ELA-3 and that contains the word \"space\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q148578 . ?sbj wdt:P1427 wd:Q455731 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'space' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a space observatory wose starting point is ELA-3, containing in its name the word \"space\""],"info":{}}
{"id":"train_5201","question":"How many Oceania children were out of school on January 1, 2005?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q538 p:P2573 ?s . ?s ps:P2573 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2005' ) ) }","paraphrases":["On January 1, 2005 how many Oceania children were not in school?"],"info":{}}
{"id":"train_5202","question":"Who is the {human} for {place of death} of {Madrid}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P20 wd:Q2807 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {put of passing} of {Madrid}"],"info":{}}
{"id":"train_5204","question":"What is the vapor pressure of butane when its temperature is at 68.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q134192 p:P2119 ?s . ?s ps:P2119 ?obj . ?s pq:P2076 ?x filter ( contains ( ?x , '68.0' ) ) }","paraphrases":["At a temperature f 68.0, what is the vapor pressure of butane?"],"info":{}}
{"id":"train_5206","question":"Who was the spouse of John Gilbert up until the beginning of 1931?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q503956 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1931' ) ) }","paraphrases":["Who was the wife of John Gilbert up until the beginning of 1931?"],"info":{}}
{"id":"train_5207","question":"Is the stated age at the event of the Hammou Mouhal greater than 30.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3126541 wdt:P3629 ?obj filter ( ?obj > 30.4 ) }","paraphrases":["Is the stated age greater than 30.4 in the Hammou Mouhal event?"],"info":{}}
{"id":"train_5208","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1536 wd:Q185729 . ?sbj wdt:P31 wd:Q750215 }","paraphrases":["There is no question given."],"info":{}}
{"id":"train_5210","question":"What award did Sidney Sheldon receive at the 20th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q105118 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q303473 }","paraphrases":["What is the name of the award Sidney Sheldon received at the 20th Academy Awards?"],"info":{}}
{"id":"train_5211","question":"Who was Jiang Qing's spouse after 1936?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q236017 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1936' ) ) }","paraphrases":["After 1936, who was Jiang Qing's spouse?"],"info":{}}
{"id":"train_5212","question":"What is the correct way to say \"ecology\" in German?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7150 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q188 }","paraphrases":["What is the right method to say \"ecology\" in German?"],"info":{}}
{"id":"train_5213","question":"What does Preludi en do major de Johann Sebastian Bach per a clavicèmbal sound like?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q81982 p:P51 ?s . ?s ps:P51 ?obj . ?s pq:P2096 ?x filter ( contains ( ?x , 'Preludi en do major de Johann Sebastian Bach per a clavicèmbal' ) ) }","paraphrases":["How do you pronounce Preludi en do major de Johann Sebastian Bach per a clavicèmbal?"],"info":{}}
{"id":"train_5215","question":"What hypothesis states that there are many worlds?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1557 wd:Q40590 . ?sbj wdt:P31 wd:Q41719 }","paraphrases":["Name the hypothesis that states there are many worlds."],"info":{}}
{"id":"train_5217","question":"The biological process of learning is what?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P682 wd:Q133500 }","paraphrases":[],"info":{}}
{"id":"train_5218","question":"What Class IB flammable liquid has the highest time-weighted average exposure limit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P2404 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What class IB flammable liquid has the largest time-weighted avg exposure limit?"],"info":{}}
{"id":"train_5220","question":"Is the nominal GDP per capita of North Macedonia more than 5823.192?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q221 wdt:P2132 ?obj filter ( ?obj > 5823.192 ) }","paraphrases":["Is North Macedonia's nominal GDP per capita over 5823.192?"],"info":{}}
{"id":"train_5221","question":"What is the moveable object location of the Sicilian Expedition, that has a coordinate moveable object location of 14.0154?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q844289 wdt:P276 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '14.0154' ) ) }","paraphrases":["What is the Sicilian Expedition's mobile object location, which has a mobile object location of 14.0154?"],"info":{}}
{"id":"train_5222","question":"What is the topic of chronology of the citizenship of Harry Chipeni?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q45781169 wdt:P27 ?X . ?X wdt:P2184 ?answer }","paraphrases":["Give me the topic of chronology of the citizenship of Harry Chipeni."],"info":{}}
{"id":"train_5223","question":"What has a grammatical person in the languages of expression of Magda Szabó?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q231948 wdt:P1412 ?X . ?X wdt:P5110 ?answer }","paraphrases":["Which was the grammatical person in the languages of expression of Magda Szabó?"],"info":{}}
{"id":"train_5224","question":"What is the artfor of the moveable object location of Ärztestopp?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q256634 wdt:P276 ?X . ?X wdt:P805 ?answer }","paraphrases":["What is the artfor of the moveable question area of Ärztestopp?"],"info":{}}
{"id":"train_5225","question":"Which is the maximum operating altitude for Airbus A380?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5830 wdt:P2254 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5227","question":"What was the population of San Francisco at the beginning of 1880?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q62 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1880' ) ) }","paraphrases":["At the beginning of 1880, what was the population of San Francisco?"],"info":{}}
{"id":"train_5229","question":"What position did Henry Temple, 3rd Viscount Palmerston hold until June 23, 1841?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q193656 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1841' ) ) }","paraphrases":["Henry Temple, 3rd Viscount Palmerston held what position until June 23, 1841?"],"info":{}}
{"id":"train_5230","question":"Name the business company where Indra Nooyi served as the Chief Executive Officer","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P169 wd:Q264913 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Title the trade company where Indra Nooyi served as the Chief Official Officer"],"info":{}}
{"id":"train_5233","question":"What is the monoanion for the water base?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q283 wdt:P4149 ?obj . ?obj wdt:P31 wd:Q55523986 }","paraphrases":["What is the monoanion for the water base?"],"info":{}}
{"id":"train_5236","question":"What strategy game has the least players?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q573573 . ?ent wdt:P1872 ?obj . ?ent wdt:P31 wd:Q573573 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Give me the name of the strategy game with the lowest number of players."],"info":{}}
{"id":"train_5237","question":"On the date 29th January 2018 , what award was received by Joko Widodo?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3318231 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2018' ) ) }","paraphrases":["which award has given by Joko Widodo On the date 29th January 2018"],"info":{}}
{"id":"train_5238","question":"Which perpetual war involves the Cuban Missile Crisis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P793 wd:Q128160 . ?sbj wdt:P31 wd:Q1469686 }","paraphrases":[],"info":{}}
{"id":"train_5239","question":"What is the motif of the mascot of the Wisconsin Badgers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3098117 wdt:P822 ?X . ?X wdt:P180 ?answer }","paraphrases":["What is the theme of the mascot of the Wisconsin Badgers?"],"info":{}}
{"id":"train_5240","question":"Name an earthquake from Italy with the lowest vertical depth.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7944 . ?ent wdt:P4511 ?obj . ?ent wdt:P17 wd:Q38 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Name the shallowest earthquake to hit Italy?"],"info":{}}
{"id":"train_5244","question":"What award did John Wayne receive in 2007?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q40531 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2007' ) ) }","paraphrases":["Give me the name of the award given to John Wayne in 2007."],"info":{}}
{"id":"train_5245","question":"What is the name in the original language of the daughter of Tyr?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q172713 wdt:P22 ?X . ?X wdt:P1705 ?answer }","paraphrases":["What is the name in the authentic language of the daughter of Tyr?"],"info":{}}
{"id":"train_5246","question":"Is the total votes of the Popular Initiative, \"Protection Against Passive Smoking\" 1150388?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3151185 wdt:P1111 ?obj filter ( ?obj = 1150388.0 ) }","paraphrases":["Is the overall votes of the Prevalent Activity, \"Security Against Inactive Smoking\" 1150388?"],"info":{}}
{"id":"train_5247","question":"Is the draft of Adler XI equal to 1.45?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q358239 wdt:P2262 ?obj filter ( ?obj = 1.45 ) }","paraphrases":["Is the draft of Adler XI rise to to 1.45?"],"info":{}}
{"id":"train_5254","question":"Where is the border of where Paulo Freire wrote?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q164797 wdt:P937 ?X . ?X wdt:P47 ?answer }","paraphrases":["Where is the border of where Paulo Freire wrote?"],"info":{}}
{"id":"train_5255","question":"What is the form of government in the place where death metal originated?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q483251 wdt:P495 ?X . ?X wdt:P122 ?answer }","paraphrases":["What is the frame of government within the put where passing metal started?"],"info":{}}
{"id":"train_5256","question":"What is { start time } for { Fort Lauderdale } as { Astrakhan } has { twined administrative body }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q165972 p:P190 ?s . ?s ps:P190 wd:Q3927 . ?s pq:P580 ?value }","paraphrases":["The {start time} for {Fort Laurderdale} as {Astrakhan} has {twined administrative body} is?"],"info":{}}
{"id":"train_5258","question":"With which transcontinental countries did the Empire of Japan have diplomatic relations?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q188712 wdt:P530 ?obj . ?obj wdt:P31 wd:Q1323642 }","paraphrases":["Outside of Asia, what countries did the Empire of Japan engage in diplomacy with?"],"info":{}}
{"id":"train_5260","question":"What murder method of Camaron de la Isla is due to air pollution?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q312093 wdt:P509 ?answer . ?answer wdt:P828 wd:Q131123 }","paraphrases":["What homicide technique of Camaron de la Isla is due to air pollution?"],"info":{}}
{"id":"train_5263","question":"How many symbols are there for Manitoba?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q1948 wdt:P2238 ?obj }","paraphrases":["How many characters are there for Manitoba?"],"info":{}}
{"id":"train_5264","question":"Is Ceraunius' diamater higher than 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q24064213 wdt:P2386 ?obj filter ( ?obj > 0.0 ) }","paraphrases":["Is Ceraunius' diamater higher than 0?"],"info":{}}
{"id":"train_5265","question":"Who was married to Faye Dunaway and when did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q168721 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who was hitched to Faye Dunaway and when did it end?"],"info":{}}
{"id":"train_5266","question":"What town's partner capital is Almohad?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q199688 wdt:P36 ?X . ?X wdt:P190 ?answer }","paraphrases":["What town's companion capital is Almohad?"],"info":{}}
{"id":"train_5267","question":"What are the Colonial Colleges which start with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1188663 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What Colonial Colleges start with \"u\"?"],"info":{}}
{"id":"train_5269","question":"What award did Adele receive at that 59th Annual Grammy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23215 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q25060439 }","paraphrases":["Which award did Adele win at the 59th Grammy Awards?"],"info":{}}
