{"id":"train_2424","question":"When did Franz Liszt begin his relationship with his partner Marie d'Agoult?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41309 p:P451 ?s . ?s ps:P451 wd:Q253453 . ?s pq:P580 ?value }","paraphrases":["When did Franz Liszt commenced his engagement with his partner Marie d'Agoult?"],"info":{}}
{"id":"train_2428","question":"Are the total assets of the Zlin Aircraft equal to 291600000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q207278 wdt:P2403 ?obj filter ( ?obj = 291600000 ) }","paraphrases":["Are Zlin Aircraft's total assets equal to 291600000?"],"info":{}}
{"id":"train_2431","question":"Tell me the historical language that contains the word 'ancient' in its name and that has the grammatical feminine gender.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2315359 . ?sbj wdt:P5109 wd:Q1775415 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ancient' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the historical language that contains the phrase 'ancient' in its identify and that has the grammatical feminine gender."],"info":{}}
{"id":"train_2432","question":"When is {diplomatic relation} with {nationality} of {Usher} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q165911 wdt:P27 ?X . ?X wdt:P530 ?answer }","paraphrases":["When is {diplomatic relation} with {nationality} of {Usher} ?"],"info":{}}
{"id":"train_2433","question":"What is known   writer of Shakespeare's sonnets ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q662550 wdt:P50 ?X . ?X wdt:P800 ?answer }","paraphrases":["What is known author of Shakespeare's pieces ?"],"info":{}}
{"id":"train_2434","question":"Which are the afflicts that has a result of ethylene glycol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q194207 wdt:P1542 ?X . ?X wdt:P689 ?answer }","paraphrases":["What has a result of ethylene glycol?"],"info":{}}
{"id":"train_2435","question":"In which time zone is Newcastle upon Tyne located?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1425428 p:P421 ?s . ?s ps:P421 wd:Q6655 . ?s pq:P1264 ?value }","paraphrases":["Newcastle upon Tyne is located in which time zone?"],"info":{}}
{"id":"train_2436","question":"In what branch of Chemistry would you study the properties of peat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2578 wd:Q184624 . ?sbj wdt:P31 wd:Q11790203 }","paraphrases":["In which Chemistry branch would you study the peat properties?"],"info":{}}
{"id":"train_2437","question":"how many courts does the supreme court of the united kingdom have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P4884 wd:Q1122261 }","paraphrases":["The Supreme Court of the United Kingdom has how many courts?"],"info":{}}
{"id":"train_2439","question":"Name the venue in Romania that had diplomatic relations in Israel during World War I.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q553157 wdt:P276 ?answer . ?answer wdt:P530 wd:Q801 }","paraphrases":["Title the scene in Romania that had discretionary relations in Israel amid World War I."],"info":{}}
{"id":"train_2443","question":"What literary work follows the book of Exodus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9190 wdt:P155 ?obj . ?obj wdt:P31 wd:Q7725634 }","paraphrases":["What scholarly work takes after the book of Exodus?"],"info":{}}
{"id":"train_2444","question":"which institution that starts with the letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q178706 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which institution that begins with the letter r"],"info":{}}
{"id":"train_2445","question":"What position is held by James Callaghan and when was he elected?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q9576 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What position is held by James Callaghan and when was he elected?"],"info":{}}
{"id":"train_2446","question":"What is the PTSD treatment medicine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q202387 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q11173 }","paraphrases":["What is the PTSD treatment medicine?"],"info":{}}
{"id":"train_2447","question":"What did Nick Faldo discover or invent?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q531520 wdt:P793 ?X . ?X wdt:P61 ?answer }","paraphrases":["Which was the discovery or invention of Nick Faldo?"],"info":{}}
{"id":"train_2449","question":"What is MessesInfo ID for Notre Dame de Paris ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2981 wdt:P1644 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2450","question":"Where was Harambe, the gorilla, kept?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26388682 wdt:P551 ?X . ?X wdt:P1990 ?answer }","paraphrases":["Which location was Harambe (the gorilla) kept in?"],"info":{}}
{"id":"train_2451","question":"Since 2016-1-1, what shares a border with Ile-de-France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q13917 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["What borders with Ile-de-France since January 1st, 2016?"],"info":{}}
{"id":"train_2452","question":"Tell me biblical place whose name has the word zorah in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12404340 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zorah' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me biblical place whose name has the word zorah in it."],"info":{}}
{"id":"train_2453","question":"GIVE ME THE PROPOSED AIRCRAFT WITH MOST WING AREA","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15061018 . ?ent wdt:P2112 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which aircraft is the longest wingspan?"],"info":{}}
{"id":"train_2455","question":"Is Barbara Streisand's net worth greater than 312,000,000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4636 wdt:P2218 ?obj filter ( ?obj > 312000000.0 ) }","paraphrases":["Is Barbara Streisand's net worth more prominent than 312,000,000?"],"info":{}}
{"id":"train_2456","question":"How many students does Jacques-Louis David teach?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q83155 wdt:P802 ?obj }","paraphrases":["Give me the number of students Jacques David teaches."],"info":{}}
{"id":"train_2457","question":"What is Pedre I mother's name and birthdate?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q156774 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["What is Pedre I mother's title and birthdate?"],"info":{}}
{"id":"train_2459","question":"Who employed J.R.R. Tolkien","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P108 wd:Q892 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the employer of J.R.R. Tolkien?"],"info":{}}
{"id":"train_2461","question":"Who is the Director of Photography and the Director of Blade Runner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q184843 wdt:P344 ?ans_1 . wd:Q184843 wdt:P57 ?ans_2 }","paraphrases":["In Blade Runner, who are the directory and the directory of photography?"],"info":{}}
{"id":"train_2463","question":"What are the world day which start with the letter n","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2558684 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the world day which begin with the letter n"],"info":{}}
{"id":"train_2464","question":"Who has a tomb in All Saints' Church and wrote \"Ninety-five Theses\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q157506 wdt:P50 ?answer . ?answer wdt:P119 wd:Q661752 }","paraphrases":["Who has a tomb in All Saints' Church and wrote \"Ninety-five Theses\"?"],"info":{}}
{"id":"train_2467","question":"Is the VAT-rate of South Korea equal to 10?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q884 wdt:P2855 ?obj filter ( ?obj = 10 ) }","paraphrases":["Is 10 the VAT-rate of South Korea?"],"info":{}}
{"id":"train_2468","question":"Who is the leader of Qantas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P108 wd:Q32491 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Qantas is lead by who?"],"info":{}}
{"id":"train_2469","question":"Treaty of Versailles is the aftermath of which world war?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P828 wd:Q8736 . ?sbj wdt:P31 wd:Q103495 }","paraphrases":["Which world war did the Treaty of Versailles take place after?"],"info":{}}
{"id":"train_2470","question":"What is the historical aspect of cryptography topic history?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8789 wdt:P2184 ?obj . ?obj wdt:P31 wd:Q17524420 }","paraphrases":["What is the authentic angle of cryptography point history?"],"info":{}}
{"id":"train_2471","question":"Which is the bridge that is located in the administrative territorial entity of London Borough of Southwark and whose name contains the word bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12280 . ?sbj wdt:P131 wd:Q730706 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'bridge' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the bridge that is positioned in the administrative territorial entity of London Borough of Southwark and whose name carries the phrase bridge?"],"info":{}}
{"id":"train_2472","question":"is it true that the age of candidacy of the member of the chamber of deputies of the parliament of czech republic is equal to 18?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q19803234 wdt:P2998 ?obj filter ( ?obj = 18 ) }","paraphrases":["Is 18 the age of candidacy of the member of Chamber of Deputies for the Parliament of Czech Republic?"],"info":{}}
{"id":"train_2474","question":"WHICH IS THE MANTRA THAT IS THE FACET OF HINDUISM AND WHICH STARTS WITH G","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131510 . ?sbj wdt:P1269 wd:Q9089 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE MANTRA THAT IS THE FACET OF HINDUISM AND WHICH STARTS WITH G"],"info":{}}
{"id":"train_2477","question":"Who is the mother of Jesus Christ","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q302 wdt:P25 ?obj . ?obj wdt:P31 wd:Q20643955 }","paraphrases":["Who is the mother of Jesus Christ"],"info":{}}
{"id":"train_2478","question":"What basic emotion starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16748867 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what basic emotion begins with the letter\"t\"?"],"info":{}}
{"id":"train_2479","question":"How much prize money did Tomas Tanstromer receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q42122 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter ( contains ( ?x , '1e+07' ) ) }","paraphrases":["Tomaas Transtromer received prize money, how much was it?"],"info":{}}
{"id":"train_2480","question":"Was Old English John F. Kennedy's native language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9696 wdt:P103 wd:Q42365 }","paraphrases":["Was John F. Kennedy's native language Old English?"],"info":{}}
{"id":"train_2481","question":"Who gave the {item used} of {sports} of {Tug of war at the 1904 Summer Olympics} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q855289 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["Which person handed over the mallet used in croquet at the garden party."],"info":{}}
{"id":"train_2482","question":"How many birth name are for Sarah Bernhardt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q4605 wdt:P1477 ?obj }","paraphrases":["Sarah Bernhardt has how many birth names?"],"info":{}}
{"id":"train_2483","question":"What was the population of Kokand in 1970?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q489890 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1970' ) ) }","paraphrases":["What was the number of inhabitants in Kokand in 1970?"],"info":{}}
{"id":"train_2484","question":"Which is the worst-case space complexity of quicksort?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q486598 wdt:P3755 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2485","question":"Which sovereign state diplomatically related to Bolivia has the least central government debt as a percent of GDP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P1689 ?obj . ?ent wdt:P530 wd:Q750 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["which Bolivian ally has the lowest debt per percent of GDP?"],"info":{}}
{"id":"train_2487","question":"When did Alexander Pushkin move to Ulyanovsk?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q7200 p:P551 ?s . ?s ps:P551 wd:Q5627 . ?s pq:P1706 ?value1 . ?s pq:P1319 ?value2 }","paraphrases":["Alexander Pushkin moved to Ulyanovsk in what year?"],"info":{}}
{"id":"train_2488","question":"Where was Jane Austen born and where did she die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q36322 wdt:P19 ?ans_1 . wd:Q36322 wdt:P20 ?ans_2 }","paraphrases":["Where was Jane Austen born and where did she die?"],"info":{}}
{"id":"train_2492","question":"When was Wendy Wasserstein received the William Inge Theatre Festival Distinguised Achievement in the American Theatre Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q450050 p:P166 ?s . ?s ps:P166 wd:Q29458167 . ?s pq:P585 ?value }","paraphrases":["Give me the date Wendy Wasserstein received the William Inge Theatre Festival Distinguised Achievement in the American Theatre Award."],"info":{}}
{"id":"train_2493","question":"What is the record label that 50 Cent belongs to called","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q6060 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2608849 }","paraphrases":["What is the record name that 50 Cent has a place to called"],"info":{}}
{"id":"train_2494","question":"Is Martin Luther a son of Magdalena Luther?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9554 wdt:P40 wd:Q6729875 }","paraphrases":["Did Magdalena Luther have a son named Martin Luther?"],"info":{}}
{"id":"train_2495","question":"In which major city is Urdu the official language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q1617 . ?sbj wdt:P31 wd:Q174844 }","paraphrases":["In which major city is Urdu the official language?"],"info":{}}
{"id":"train_2497","question":"When was Diana Ross inducted into the Michigan Women's Hall of Fame?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36290 p:P166 ?s . ?s ps:P166 wd:Q6837811 . ?s pq:P585 ?value }","paraphrases":["Provide the date of Diana Ross' induction into the Michigan Women's Hall of Fame."],"info":{}}
{"id":"train_2498","question":"What is Flora of China's ID for Citrus ×limon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q500 wdt:P1747 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2500","question":"What is the zip code where Georges BIzet is buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q56158 wdt:P119 ?X . ?X wdt:P281 ?answer }","paraphrases":["What is the zip code where Georges BIzet is buried?"],"info":{}}
{"id":"train_2502","question":"What's the capital of Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q90 wdt:P1376 ?obj }","paraphrases":["Referring to Paris, what is the capital?"],"info":{}}
{"id":"train_2503","question":"When was Thomas Hardy nominated for the Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132805 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["Thomas Hardy was nominated for the Nobel Prize in Literature in what year?"],"info":{}}
{"id":"train_2504","question":"Was Mitt Romney a bishop and a US senator?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4496 wdt:P39 wd:Q4917468 . wd:Q4496 wdt:P39 wd:Q13217683 }","paraphrases":["Is it true that Mitt Romney was both a senator and a bishop?"],"info":{}}
{"id":"train_2506","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q51624 wdt:P841 ?obj . ?obj wdt:P31 wd:Q1401522 }","paraphrases":["n/a"],"info":{}}
{"id":"train_2507","question":"Where is the location of death of John Dowland whose zipcode is BR?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207355 wdt:P20 ?answer . ?answer wdt:P281 ?x FILTER ( contains ( ?x , 'BR' ) ) }","paraphrases":["Where is the area of passing of John Dowland whose zipcode is BR?"],"info":{}}
{"id":"train_2508","question":"What government was in charge of Hosni Mubarak's sentence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34105 wdt:P607 ?X . ?X wdt:P710 ?answer }","paraphrases":["What government was responsible for the sentence of Hosni Mubarak?"],"info":{}}
{"id":"train_2509","question":"What is Q48460 of  the antonym  of virtue ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q157811 wdt:P461 ?X . ?X wdt:P1036 ?answer }","paraphrases":["What is Q48460 of the antonym of ideals ?"],"info":{}}
{"id":"train_2511","question":"What is time zone of subitem of of history of Lithuania?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q215063 wdt:P1269 ?X . ?X wdt:P421 ?answer }","paraphrases":["What is time zone of subitem of of history of Lithuania?"],"info":{}}
{"id":"train_2512","question":"Which is the currency symbol description for Australian dollar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q259502 wdt:P489 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2513","question":"Which unit of pressure has maximum conversion to standard unit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q10751953 . ?ent wdt:P2442 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["The unit of pressure with the maximum conversion to standard unit is ?"],"info":{}}
{"id":"train_2517","question":"Which is the clan for the family name of Genghis Khan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q720 wdt:P734 ?obj . ?obj wdt:P31 wd:Q211503 }","paraphrases":[],"info":{}}
{"id":"train_2519","question":"God Save the Queen is the anthem for which island nation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P85 wd:Q40807 . ?sbj wdt:P31 wd:Q112099 }","paraphrases":["Which island nation has \"God Save The Queen\" for its national anthem?"],"info":{}}
{"id":"train_2520","question":"For which movie did Burl Ives receive the Academy Award for Best Supporting Actor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q315723 p:P166 ?s . ?s ps:P166 wd:Q106291 . ?s pq:P805 ?value }","paraphrases":["For what movie did Burl ives receive the Academy Award for Best Supporting Actor?"],"info":{}}
{"id":"train_2522","question":"What denomination in the Durrani Empire has a history in Islam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q467627 wdt:P140 ?answer . ?answer wdt:P2184 wd:Q642379 }","paraphrases":["What group within the Durrani Realm features a history in Islam?"],"info":{}}
{"id":"train_2523","question":"Which musical did Andrew Lloyd Webber write?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P58 wd:Q180975 . ?sbj wdt:P31 wd:Q2743 }","paraphrases":["Which melodic did Andrew Lloyd Webber write?"],"info":{}}
{"id":"train_2524","question":"Name the sea with salt that is used to make brackish water","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q165 . ?ent wdt:P4350 ?obj . ?ent wdt:P186 wd:Q105533 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Brackish water is made from the salt of what sea?"],"info":{}}
{"id":"train_2527","question":"What effect did the Big Bang have on the universe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q323 wdt:P1542 ?obj . ?obj wdt:P31 wd:Q36906466 }","paraphrases":["What impact did the Enormous Blast have on the universe?"],"info":{}}
{"id":"train_2529","question":"Name a borough of New York City closed to water that starts with letter M","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q408804 . ?sbj wdt:P206 wd:Q1064776 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a borough of New York City closed to water that starts offevolved with letter M"],"info":{}}
{"id":"train_2531","question":"What was the area of the Indian ocean in 1982?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1239 p:P2046 ?s . ?s ps:P2046 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1982' ) ) }","paraphrases":["In 1982, what were the dimensions of the area of the Indian Ocean?"],"info":{}}
{"id":"train_2532","question":"Which satellite  orbits of Messier 22?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11392 wdt:P397 ?X . ?X wdt:P398 ?answer }","paraphrases":["Which fawning circles of Messier 22?"],"info":{}}
{"id":"train_2535","question":"Who is the parent organization and chief executive officer of the Society of Jesus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q36380 wdt:P749 ?ans_1 . wd:Q36380 wdt:P169 ?ans_2 }","paraphrases":["Who is the Society of Jesus' parent organization and chief executive officer?"],"info":{}}
{"id":"train_2536","question":"Which company owns Burger King ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q177054 wdt:P127 ?obj . ?obj wdt:P31 wd:Q1252971 }","paraphrases":["Which company possesses Burger Lord ?"],"info":{}}
{"id":"train_2537","question":"Who is Pan's Labyrinth's make-up artist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q216006 wdt:P4805 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2538","question":"Which is the sausage sandwich of the parent astronomical body of Proxima Centauri that starts with the letter d?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7427595 . ?sbj wdt:P397 wd:Q14266 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the sausage sandwich of the parent astronomical physique of Proxima Centauri that starts with the letter d?"],"info":{}}
{"id":"train_2539","question":"What is the residence and the work of Derek Hough?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1189327 wdt:P551 ?ans_1 . wd:Q1189327 wdt:P106 ?ans_2 }","paraphrases":["What does Derek Hough do and where does he live?"],"info":{}}
{"id":"train_2540","question":"What is the tea house made of according to the creator?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1072166 wdt:P1056 ?X . ?X wdt:P186 ?answer }","paraphrases":["According to the creator tea house is made of which particle?"],"info":{}}
{"id":"train_2541","question":"When does menopause begin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q177708 wdt:P3415 ?answer }","paraphrases":[],"info":{}}
