{"id":"train_14534","question":"which phase starts with the letter h","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q104837 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which stage begins with the letter h"],"info":{}}
{"id":"train_14535","question":"What is the name of Hannah Murray's character on Game of Thrones?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23572 p:P161 ?s . ?s ps:P161 wd:Q231086 . ?s pq:P453 ?value }","paraphrases":["Hannah Murray plays what role on Game of Thrones?"],"info":{}}
{"id":"train_14536","question":"What is wool made of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42329 wdt:P1582 ?X . ?X wdt:P1672 ?answer }","paraphrases":["What is the composition of wool?"],"info":{}}
{"id":"train_14538","question":"Who is the daughter of Edward I of England where she died at Belgium?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57798 wdt:P40 ?answer . ?answer wdt:P20 wd:Q31 }","paraphrases":["Who is the daughter of Edward I of England the place she died at Belgium?"],"info":{}}
{"id":"train_14540","question":"What arrondissement handles administration in Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q90 wdt:P150 ?obj . ?obj wdt:P31 wd:Q702842 }","paraphrases":["What arrondissement handles organization in Paris?"],"info":{}}
{"id":"train_14541","question":"which party starts with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q200538 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which party begins with the letter z"],"info":{}}
{"id":"train_14542","question":"how many number of deaths for measles ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q79793 wdt:P1120 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14543","question":"Where was Fred Rogers born and buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1275768 wdt:P119 ?ans_1 . wd:Q1275768 wdt:P19 ?ans_2 }","paraphrases":["Fred rogers was born and buried where?"],"info":{}}
{"id":"train_14544","question":"How many sibling are determined for Caroline Rose Hunt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q16089754 wdt:P3373 ?obj }","paraphrases":["How many siblings does Caroline Rose Hunt have?"],"info":{}}
{"id":"train_14547","question":"Are Craig Steven Wright and Nick Szabo said to be the same as Satoshi Nakamoto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13382352 wdt:P460 wd:Q21686827 . wd:Q13382352 wdt:P460 wd:Q15410426 }","paraphrases":["Are Craig Steven Wright and Scratch Szabo said to be the same as Satoshi Nakamoto?"],"info":{}}
{"id":"train_14550","question":"tell me hydroxide salts  starts with h","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q425597 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which hydroxide salts begin with letter h?"],"info":{}}
{"id":"train_14551","question":"What is the brother of the kids of Llywelyn the Great?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q467685 wdt:P40 ?X . ?X wdt:P3373 ?answer }","paraphrases":["What's Llywelyn the Great's children's brother?"],"info":{}}
{"id":"train_14552","question":"Who is the person with the lowest score in ski jumping.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P2415 ?obj . ?ent wdt:P641 wd:Q7718 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Who is the person in ski jumping with the lowest score."],"info":{}}
{"id":"train_14553","question":"What railway tunnel that ends at Erstfeld starts with letter B ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1311958 . ?sbj wdt:P559 wd:Q69642 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What railway tunnel that ends at Erstfeld begins with letter B ?"],"info":{}}
{"id":"train_14554","question":"Is the foreign direct investment net outflow of Belarus less than 876240000.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q184 wdt:P2140 ?obj filter ( ?obj < 876240000.0 ) }","paraphrases":["Does Belarus have a net foreign direct investment outflow of 876240000?"],"info":{}}
{"id":"train_14556","question":"what role did Frasier play in recurring character?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q209282 p:P674 ?s . ?s ps:P674 ?obj . ?s pq:P3831 wd:Q1086098 }","paraphrases":["Frasier played in what role in recurring character?"],"info":{}}
{"id":"train_14558","question":"What is satrap's availability?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q170305 wdt:P1264 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14560","question":"What is Tara Strong's real name?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4029 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '2' ) ) }","paraphrases":["Tara Stong's real name?"],"info":{}}
{"id":"train_14561","question":"When did the Lower Paleolithic period begin in Western Asia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7463501 p:P580 ?s . ?s ps:P580 ?obj . ?s pq:P518 wd:Q27293 }","paraphrases":["In what year did the Lower Paleolithic period begin in Western Asia?"],"info":{}}
{"id":"train_14562","question":"Which is the {taxon rank} and the {parent taxon} of {Chickpea} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q81375 wdt:P105 ?ans_1 . wd:Q81375 wdt:P171 ?ans_2 }","paraphrases":["What's the taxon parent and rank of a chickpea?"],"info":{}}
{"id":"train_14563","question":"What is the official language of the Byzantine Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12544 wdt:P37 ?X . ?X wdt:P1705 ?answer }","paraphrases":["What language was spoken by the residents of the Byzantine Empire?"],"info":{}}
{"id":"train_14564","question":"What is the diplomatic relations status of South Sydney Rabbitohs?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3325289 wdt:P17 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is the conciliatory relations status of South Sydney Rabbitohs?"],"info":{}}
{"id":"train_14565","question":"TELL ME COMMUNICATIONS PROTOCOL WHICH START WITH THE LETTER Z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q132364 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know COMMUNICATIONS Convention WHICH Begin WITH THE LETTER Z"],"info":{}}
{"id":"train_14566","question":"\"Who works at the art from Antony Tudor, that's is in the voivodeship of the Orange county?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q608183 wdt:P108 ?answer . ?answer wdt:P131 wd:Q5925 }","paraphrases":["\"Who works at the artwork from Antony Tudor, it is is in the voivodeship of the Orange county?\""],"info":{}}
{"id":"train_14567","question":"Which  is greater than super-Earth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q327757 wdt:P5135 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14568","question":"What are the conjecture which start with the letter problem","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q319141 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'problem' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the guess which begin with the letter problem"],"info":{}}
{"id":"train_14570","question":"From {start time} and {end time} {Damon Dash}} was  {spouse} of {Aaliyah}","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q11617 p:P26 ?s . ?s ps:P26 wd:Q344384 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["From {begin time} and {conclusion time} {Damon Sprint}} was {life partner} of {Aaliyah}"],"info":{}}
{"id":"train_14571","question":"What is J.K. Rowling's Ricochet author ID","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q34660 wdt:P5413 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14572","question":"Who are the publisher and author of The Catcher in the Rye?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q183883 wdt:P123 ?ans_1 . wd:Q183883 wdt:P50 ?ans_2 }","paraphrases":["Provide the publisher and author of The Catcher in the Rye."],"info":{}}
{"id":"train_14573","question":"WHICH IS THE FEMALES BEAUTY PAGEANT THAT STARTS WITH W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58863414 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me the name of the females beauty pageant that starts with the letter W."],"info":{}}
{"id":"train_14574","question":"What is the minimum age of the G =O?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23790275 wdt:P2899 ?obj filter ( ?obj = 0 ) }","paraphrases":["Is 0 the youngest allowable age of the G"],"info":{}}
{"id":"train_14575","question":"Who wrote the Spin Alternative record Guide?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20875838 wdt:P50 ?X . ?X wdt:P26 ?answer }","paraphrases":["Who is the author of the Spin Alternative record, Guide?"],"info":{}}
{"id":"train_14576","question":"Do the visitors per year of the Paul-Raymond Museum equal to 1145?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3329306 wdt:P1174 ?obj filter ( ?obj = 1145 ) }","paraphrases":["How many visitors visit the Paul-Raymond per year?"],"info":{}}
{"id":"train_14577","question":"Who is named after radiography, who had August Kundt as a teacher?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q245341 wdt:P138 ?answer . ?answer wdt:P1066 wd:Q60554 }","paraphrases":["Who is named after radiography, who had Admirable Kundt as a teacher?"],"info":{}}
{"id":"train_14582","question":"Which contains the administrative territorial entity of Foshan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P150 wd:Q34412 }","paraphrases":[],"info":{}}
{"id":"train_14584","question":"Which Indian state speaks Urdu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q1617 . ?sbj wdt:P31 wd:Q13390680 }","paraphrases":["which indian state is speaks urdu?"],"info":{}}
{"id":"train_14585","question":"What is the sports club with the highest member count whose instance of is association football club?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q847017 . ?ent wdt:P2124 ?obj . ?ent wdt:P31 wd:Q476028 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which soccer team has the most members?"],"info":{}}
{"id":"train_14587","question":"What award did Godzilla receive?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q6567 wdt:P166 ?ans_1 . wd:Q6567 wdt:P1441 ?ans_2 }","paraphrases":["Give me the name of the award that Godzilla received."],"info":{}}
{"id":"train_14588","question":"When did Aaron Sorkin receive the New York Film Critics Circle Award for Best Screenplay?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q299194 p:P166 ?s . ?s ps:P166 wd:Q1355247 . ?s pq:P585 ?value }","paraphrases":["The New York Film Critics Circle Award for Best Screenplay was won by Aaron Sorkin in what year?"],"info":{}}
{"id":"train_14589","question":"When is {drug interaction} {treatment} of {gastroenteritis} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q156103 wdt:P2176 ?X . ?X wdt:P769 ?answer }","paraphrases":["When is {medicate interaction} {treatment} of {gastroenteritis} ?"],"info":{}}
{"id":"train_14592","question":"Who is the victim that was conflicted with Stanley Rous?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q218270 wdt:P607 ?X . ?X wdt:P710 ?answer }","paraphrases":["Who is the victim of Stanley Rous's conflict?"],"info":{}}
{"id":"train_14593","question":"What is the maximum number of players of skat","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q504577 wdt:P1873 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14594","question":"When was Verner von Heidenstam nominated for the Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q129173 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["In what year was Verner von Heidenstam nominated for the Nobel Prize in Literature?"],"info":{}}
{"id":"train_14595","question":"What is the dual administrative body of Omsk that started in 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q898 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["What dual administrative body of Omsk began in 2011?"],"info":{}}
{"id":"train_14596","question":"How many instances of the Northern Hemisphere exist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P31 wd:Q39061 }","paraphrases":["What number of Norther Hemispheres are there?"],"info":{}}
{"id":"train_14597","question":"Mention the federative entity of Mexico responsible for Tenochtitlan","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1365 wd:Q13695 . ?sbj wdt:P31 wd:Q20528428 }","paraphrases":["Say the federative substance of Mexico capable for Tenochtitlan"],"info":{}}
{"id":"train_14598","question":"The Banglapedia ID for mammal is?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7377 wdt:P4254 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14599","question":"Which is the ESPN.com NBA player ID for LeBron James?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q36159 wdt:P3685 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14601","question":"when is the {end time} for {Erik Erikson} who has {spouse} as {Joan Erikson} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q58074 p:P26 ?s . ?s ps:P26 wd:Q3179577 . ?s pq:P582 ?value }","paraphrases":["When did Erik Erikson separate from his spouse Joan Erikson?"],"info":{}}
{"id":"train_14603","question":"Which is the position of the organisation directed from the office of Mossad?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2389 wd:Q34216 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["Which position of the organization was directed by Mossad's office?"],"info":{}}
{"id":"train_14606","question":"Who is the  {human} for {family} of {Akhenaten}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P53 wd:Q81794 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the { human } of { Akhenaten } for { family }"],"info":{}}
{"id":"train_14607","question":"What business is the parent organization of Sears?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q6499202 wdt:P749 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":["What trade is the parent organization of Burns?"],"info":{}}
{"id":"train_14609","question":"Which is the box office for Breakfast at Tiffany's?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q193066 wdt:P2142 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14610","question":"What is Campania's MusicBrainz area ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1438 wdt:P982 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14613","question":"What has arrondissements of the diplomatic relations of The Gambia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1005 wdt:P530 ?X . ?X wdt:P150 ?answer }","paraphrases":["What has arrondissements of the political relations of The Gambia?"],"info":{}}
{"id":"train_14614","question":"When did Francisco Goya end his residence in Quinta del Sordo?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5432 p:P551 ?s . ?s ps:P551 wd:Q2344241 . ?s pq:P582 ?value }","paraphrases":["On what date did Francisco Goya end his residence in Quinta del Sordo."],"info":{}}
{"id":"train_14615","question":"What is the company name operated by Galex?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49944 wdt:P137 ?X . ?X wdt:P355 ?answer }","paraphrases":["Name the company run by Galex."],"info":{}}
{"id":"train_14617","question":"who is written by Letters of Ayn Rand ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6533759 wdt:P50 ?X . ?X wdt:P101 ?answer }","paraphrases":["The Letter of Ayn Rand are written by whom?"],"info":{}}
{"id":"train_14621","question":"What are the fictional hybrid which starts with letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q30147469 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the anecdotal crossover which begins with letter w"],"info":{}}
{"id":"train_14622","question":"which was the aircraft component for the manifestation of Global Positioning System?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q18822 wdt:P1557 ?obj . ?obj wdt:P31 wd:Q28816538 }","paraphrases":["which was the air ship component for the appearance of Worldwide Situating Framework?"],"info":{}}
{"id":"train_14623","question":"When did Yo-Yo Ma receive the award as David Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q234891 p:P166 ?s . ?s ps:P166 wd:Q1158951 . ?s pq:P585 ?value }","paraphrases":["Yo-Yo Ma received the David Prize award on what date?"],"info":{}}
{"id":"train_14624","question":"Which is the Snooker.org player ID for Ronnie O'Sullivan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q190782 wdt:P4502 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14626","question":"What is the main tourist attraction for the religion of the Russian Orthodox Church?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P140 wd:Q60995 . ?sbj wdt:P31 wd:Q570116 }","paraphrases":["What is the Russian Orthodox Church's main tourist attraction?"],"info":{}}
{"id":"train_14628","question":"Who is the operator and country of Bombardier Dash 8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q736765 wdt:P137 ?ans_1 . wd:Q736765 wdt:P17 ?ans_2 }","paraphrases":["Which airlines, in what countries, use the Bombardier Dash 8?"],"info":{}}
{"id":"train_14629","question":"What position is held by Julius II which was once held by Marco Barbo?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q80516 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q1643096 }","paraphrases":["Julius replaced Marco Barbo in what position."],"info":{}}
{"id":"train_14631","question":"What is the Lingusphere code for Swahili?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7838 wdt:P1396 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14632","question":"Name a song written by Lady Gaga.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P676 wd:Q19848 . ?sbj wdt:P31 wd:Q7366 }","paraphrases":[],"info":{}}
{"id":"train_14634","question":"What was Iceland's population in 1996?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q189 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1996' ) ) }","paraphrases":["In 1996, Iceland's population was?"],"info":{}}
{"id":"train_14637","question":"What are the Greek deity which start with the letter Z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22989102 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Greek divinity which begin with the letter Z"],"info":{}}
{"id":"train_14638","question":"What municipality was Nikolai Trubetzkoy born in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q159491 wdt:P19 ?X . ?X wdt:P150 ?answer }","paraphrases":["What region was Nikolai Trubetzkoy born in?"],"info":{}}
{"id":"train_14640","question":"What is the terrorist attack with the highest number of deaths whose participant is Grupos Antiterroristas de Liberación ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5710433 . ?ent wdt:P1120 ?obj . ?ent wdt:P710 wd:Q1259273 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which was the terrorist attack of Grupos Antiterroristas de Liberación that resulted in  highest number of deaths ?"],"info":{}}
{"id":"train_14641","question":"University of Pennsylvania painting collection is about which topic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P195 wd:Q49117 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["What is the University of Pennsylvania's painting collection about?"],"info":{}}
{"id":"train_14643","question":"WHAT ARE THE PHILOSOPHICAL MOVEMENT STARTS WITH Y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2915955 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE PHILOSOPHICAL MOVEMENT BEGINS WITH Y"],"info":{}}
{"id":"train_14644","question":"What is the cause of stock market crash of Great Depression?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8698 wdt:P828 ?obj . ?obj wdt:P31 wd:Q1020018 }","paraphrases":["What is the cause of stock showcase crash of Incredible Depression?"],"info":{}}
{"id":"train_14646","question":"What is the taxon due to severe acute respiratory syndrome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q103177 wdt:P828 ?obj . ?obj wdt:P31 wd:Q16521 }","paraphrases":["What is the taxon due to extreme intense respiratory syndrome?"],"info":{}}
{"id":"train_14647","question":"was jean-michel Basquiat's movement art movement and neo-expressionism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q155407 wdt:P135 wd:Q968159 . wd:Q155407 wdt:P135 wd:Q589655 }","paraphrases":["Was  Jean-Michel Basquiat's art style movement and neo-expressionism?"],"info":{}}
{"id":"train_14650","question":"Who painted Mona Lisa ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1299 wd:Q12418 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who painted Mona Lisa ?"],"info":{}}
{"id":"train_14652","question":"Who is the architect of the Hagia Sophia and what is its architectural style?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q12506 wdt:P84 ?ans_1 . wd:Q12506 wdt:P149 ?ans_2 }","paraphrases":["Which architect designed the Hagia Sophia and what style is the architecture?"],"info":{}}
{"id":"train_14653","question":"What is Sigmund Jähn's first name in Latin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57229 wdt:P735 ?answer . ?answer wdt:P282 wd:Q8229 }","paraphrases":["What is the Latin name of Sigmund Jähn?"],"info":{}}
{"id":"train_14655","question":"Which is the Norse deity that is partner of Odin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43610 wdt:P451 ?obj . ?obj wdt:P31 wd:Q16513881 }","paraphrases":["Which is the Norse divinity that's accomplice of Odin?"],"info":{}}
{"id":"train_14656","question":"Who are the followers of the King of Jerusalem (Guy of Lusignan)?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 wd:Q693614 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Who are Jerusalem King's followers (Lusignan's Guy)?"],"info":{}}
