{"id":"train_13402","question":"when was the brazil national football team ranked the 1.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q83459 p:P1352 ?s . ?s ps:P1352 ?x filter ( contains ( ?x , '1.0' ) ) . ?s pq:P585 ?value }","paraphrases":["On what date was the Brazil national football team ranked number one?"],"info":{}}
{"id":"train_13404","question":"Which is the research center that is affiliated with Niels Bohr?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7085 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q7315155 }","paraphrases":["Which is the inquire about center that's partnered with Niels Bohr?"],"info":{}}
{"id":"train_13407","question":"Ambrose holds what idea about their position as the ultimate importance?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43689 wdt:P39 ?X . ?X wdt:P140 ?answer }","paraphrases":["Ambrose holds what thought almost their position as the extreme significance?"],"info":{}}
{"id":"train_13408","question":"What was the population of the Al Sharqia Governorate on 2017-3-28 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q31074 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2017' ) ) }","paraphrases":["On March 28, 2017, what was the population of the Al Sharquia Governorate?"],"info":{}}
{"id":"train_13410","question":"Where is the longitude and latitude for the mouth of the Orontes River?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q188871 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '34.196944444444 36.3525' ) ) . ?s pq:P518 ?value }","paraphrases":["Give the longitude and latitude for the mouth of the Orontes River."],"info":{}}
{"id":"train_13411","question":"What award did Edward Snowden win in 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q13424289 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["What prize did Edward Snowden achieve in 2014?"],"info":{}}
{"id":"train_13412","question":"How many days are open for the {Thursday} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3025 wd:Q129 }","paraphrases":["What is the number of days open for Thursday?"],"info":{}}
{"id":"train_13413","question":"What was the immediate cause of World War I?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q361 wdt:P1478 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13415","question":"Tell me the number of points and games played by Lionel Messi as a member of the Argentina national under-23 football team.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q615 p:P54 ?s . ?s ps:P54 wd:Q2462207 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["How many games did Lionel Messi play as a member of the Argentina national under-23 football team and how many points did he score?"],"info":{}}
{"id":"train_13418","question":"What was DeWitt Clinton's position on 1-1-1807?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q527462 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1807' ) ) }","paraphrases":["What position did DeWitt Clinton hold in 1807?"],"info":{}}
{"id":"train_13419","question":"What is the birth date of writer Principia Mathematica?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q163335 wdt:P50 ?X . ?X wdt:P569 ?answer }","paraphrases":["What is the birth date of author Principia Mathematica?"],"info":{}}
{"id":"train_13420","question":"Tell me economic activity whose name has the word vehices in it name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8187769 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vehicles' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know financial action whose title has the word vehices in it name"],"info":{}}
{"id":"train_13427","question":"Which is {diplomatic relation} of {location of discovered object} of {krypton} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q888 wdt:P189 ?X . ?X wdt:P530 ?answer }","paraphrases":["Which is {conciliatory connection} of {area of found question} of {krypton} ?"],"info":{}}
{"id":"train_13429","question":"Which is the memory capacity of a floppy disk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5293 wdt:P2928 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13430","question":"How many prisons are by the Black Sea Canal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2632 wd:Q592260 }","paraphrases":["What number of prisons are by the Black Sea Canal?"],"info":{}}
{"id":"train_13432","question":"What are the children of Euphorion of Eleusis famous for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13410739 wdt:P40 ?X . ?X wdt:P800 ?answer }","paraphrases":["What are the children of Euphorion of Eleusis popular for?"],"info":{}}
{"id":"train_13433","question":"Name a state function measured by a thermometer that contains the word \"temperature\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q230937 . ?sbj wdt:P1880 wd:Q646 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'temperature' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a state function measured by means of a thermometer that carries the word \"temperature\" in its name"],"info":{}}
{"id":"train_13434","question":"Which animal species can hear the lowest frequencies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3465 ?obj . ?ent wdt:P105 wd:Q7432 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What animal species can hear the lowest frequencies?"],"info":{}}
{"id":"train_13436","question":"What is Eugene lonesco of country due to place of death of France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q46706 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q142 }","paraphrases":["What is Eugene lonesco of nation due to put of passing of France?"],"info":{}}
{"id":"train_13438","question":"Is the number of clubs in the South African rugby union greater than 1220.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q638727 wdt:P4999 ?obj filter ( ?obj > 1220.8 ) }","paraphrases":["Are there more than 1220.8 clubs in the South African rugby union?"],"info":{}}
{"id":"train_13441","question":"What is the population of Cagayan de Oro with the determination method census?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1645 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["Using the determination method of the census, what is the number of residents of Cagayan de Oro."],"info":{}}
{"id":"train_13443","question":"For what was Juliette Lewis in nomination at the 64th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q230523 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q857047 }","paraphrases":["Which award was Juliette Lewis nominated for at the 64th Academy Awards?"],"info":{}}
{"id":"train_13444","question":"What was the college attended by Alexander Dubcek, which precedes the Academy of Social Sciences of the Central Committee of CPSU?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q150543 wdt:P69 ?answer . ?answer wdt:P156 wd:Q4059245 }","paraphrases":["What was once the college attended by means of Alexander Dubcek, which precedes the Academy of Social Sciences of the Central Committee of CPSU?"],"info":{}}
{"id":"train_13447","question":"Who are Bette Midler's child and spouse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q190631 wdt:P40 ?ans_1 . wd:Q190631 wdt:P26 ?ans_2 }","paraphrases":["Name of Bette Midler's child and spouse"],"info":{}}
{"id":"train_13449","question":"In what position did Jean-Antoine-Nicolas de Caritat de Condorcet replace Jean-Paul Grandjean de Fouchy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q201477 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q3168514 }","paraphrases":["What did Jean-Antoine-Nicolas de Caritat de Condorcet replace Jean-Paul Grandjean de Fouchy as?"],"info":{}}
{"id":"train_13450","question":"Is the total revenue of the Indian Space Research Organisation equal 205.264?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q229058 wdt:P2139 ?obj filter ( ?obj = 205.264 ) }","paraphrases":["what is the total revenue of the Indian Space Research Organisation?"],"info":{}}
{"id":"train_13452","question":"Tell me colossal statue whose name has the word statue in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1779653 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'statue' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know colossal statue whose title has the word statue in it"],"info":{}}
{"id":"train_13454","question":"Tell me phase whose name has the word hydrogen in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q104837 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hydrogen' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know stage whose title has the word hydrogen in it."],"info":{}}
{"id":"train_13455","question":"Tell me the State church that office held by head of the organisation Archbishop of Canterbury and which that starts with the letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2325038 . ?sbj wdt:P2388 wd:Q29282 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the State church that office held by head of the association Ecclesiastical overseer of Canterbury and which that begins with the letter c"],"info":{}}
{"id":"train_13456","question":"Who gave the{trend} of {sculptor} of {No. F} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19887461 wdt:P170 ?X . ?X wdt:P135 ?answer }","paraphrases":["Who started the trend of sculpture of No.F?"],"info":{}}
{"id":"train_13457","question":"For what was Melvyn Douglas nominated for the 36th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q312084 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917143 }","paraphrases":["The 36th annual Academy Awards nominated Melvyn Doulglas in what category?"],"info":{}}
{"id":"train_13458","question":"what are the biological process which starts with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2996394 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the organic handle which begins with the letter v"],"info":{}}
{"id":"train_13462","question":"What government is headed by the partner town of Netanya?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192225 wdt:P190 ?X . ?X wdt:P6 ?answer }","paraphrases":["What government is headed by the accomplice town of Netanya?"],"info":{}}
{"id":"train_13463","question":"What conflict was cause by Leon Trotsky","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q33391 wdt:P607 ?obj . ?obj wdt:P31 wd:Q180684 }","paraphrases":["What was Leon Trotsky's conflict?"],"info":{}}
{"id":"train_13464","question":"what is spouse of Booker T.Washington that is end time is 1884-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q319871 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1884' ) ) }","paraphrases":["Which spouse divorced Booker T. Washington in 1884?"],"info":{}}
{"id":"train_13465","question":"What is Arthur Phillip's sign language alphabet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q311548 wdt:P1412 ?X . ?X wdt:P282 ?answer }","paraphrases":["What is the sign language alphabet of Arthur Phillip?"],"info":{}}
{"id":"train_13467","question":"Who is the mother of Harold Godwinson and the child of the Gunhild of Wessex?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q159597 p:P40 ?s . ?s ps:P40 wd:Q4365556 . ?s pq:P25 ?value }","paraphrases":["Who is the mother of Harold Godwinson and the offspring of the Gunhild of Wessex?"],"info":{}}
{"id":"train_13468","question":"Name the award shared by Christopher A. Pissarides along with Dale T. Mortensen.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q109582 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q109721 }","paraphrases":["Christopher Pissarides and Dale Mortsen share what award?"],"info":{}}
{"id":"train_13471","question":"In what Free imperial city did twinned administrative body of Auckland from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q37100 . ?sbj wdt:P31 wd:Q57318 }","paraphrases":[],"info":{}}
{"id":"train_13473","question":"What is the name of the trade association that contains the word \"association\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2178147 . ?sbj wdt:P1454 wd:Q48204 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'association' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give the name of the trade association that contains the word \"association\" in its name?"],"info":{}}
{"id":"train_13474","question":"What awards has Aruna Irani received?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q158225 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What grants has Aruna Irani received?"],"info":{}}
{"id":"train_13477","question":"What is Mike Myer's Producer's film?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P162 wd:Q185724 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["What is Mike Myer's Producer's film?"],"info":{}}
{"id":"train_13478","question":"What place is located at co-ordinates of 58.625, at the outflow of the Vattern?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q188195 wdt:P201 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '58.625' ) ) }","paraphrases":["What location is positioned at co-ordinates of 58.625, at the outflow of the Vattern?"],"info":{}}
{"id":"train_13481","question":"What is painting of Astronomical Observations: Jupiter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24007751 wdt:P180 ?X . ?X wdt:P398 ?answer }","paraphrases":["What is portray of Galactic Perceptions: Jupiter?"],"info":{}}
{"id":"train_13482","question":"Which  is military branch of engineering?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P241 wd:Q11023 }","paraphrases":[],"info":{}}
{"id":"train_13483","question":"Does the oxidation state of nitrogen equal 4.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q627 wdt:P1121 ?obj filter ( ?obj = 4.0 ) }","paraphrases":["Is the oxidation state of nitrogen 4.0?"],"info":{}}
{"id":"train_13484","question":"WHICH IS THE IAFD FEMALE PERFORMER ID FOR PARIS HILTON","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q47899 wdt:P3869 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13485","question":"At what time has Maurice Chevalier received the Disney Legends award ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q106001 p:P166 ?s . ?s ps:P166 wd:Q1150306 . ?s pq:P585 ?value }","paraphrases":["In which year was Maurice Chevalier awarded with Disney Legends Award?"],"info":{}}
{"id":"train_13487","question":"Who was Maurice Merleau-Ponty  studying under, that was born at Bar-le-Duc?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q212639 wdt:P1066 ?answer . ?answer wdt:P19 wd:Q185721 }","paraphrases":["Who was Maurice Merleau-Ponty examining beneath, that was born at Bar-le-Duc?"],"info":{}}
{"id":"train_13488","question":"What was Zbigniew Brezzinski's position in 1977-1-20?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q168041 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1977' ) ) }","paraphrases":["What position did Zbigniew Brezzinski hold on 1977-1-20?"],"info":{}}
{"id":"train_13490","question":"Which is the Footoféminin.fr player ID of Hope Solo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q229619 wdt:P4262 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13491","question":"What date was Charlemagne's child Rotrude born and what date did he die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q269691 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When was the birth and death of Charlemagne's son, Rotrude?"],"info":{}}
{"id":"train_13492","question":"did marta scored 111.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q228616 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?x filter ( contains ( ?x , '111.0' ) ) }","paraphrases":["Was 111.0 Marta's score?"],"info":{}}
{"id":"train_13493","question":"Which is the Atomic Heritage Foundation ID for Richard Feynman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q39246 wdt:P4590 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13494","question":"\"Which is {used language} of {Miguel Ángel Asturias Rosales}, that has {typology} is {subject–verb–object} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q75603 wdt:P1412 ?answer . ?answer wdt:P4132 wd:Q651641 }","paraphrases":["\"Which is {used language} of {Miguel Ángel Asturias Rosales}, that has {typology} is {subject–verb–object} ?\""],"info":{}}
{"id":"train_13495","question":"What is the original language of work for Sinhala?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P364 wd:Q13267 }","paraphrases":[],"info":{}}
{"id":"train_13497","question":"Tell me the matter phase and pressure where water has a phase point as triple.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q106410 . ?s pq:P515 ?value1 . ?s pq:P2077 ?value2 }","paraphrases":["What is the phase in water when matter and pressure have tripled?"],"info":{}}
{"id":"train_13498","question":"How does neutrino interact?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2126 wdt:P517 ?X . ?X wdt:P1269 ?answer }","paraphrases":["How does neutrino interact?"],"info":{}}
{"id":"train_13499","question":"What are the names of the twin cities of Corinth adjacent to Salvitelle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q103011 wdt:P190 ?answer . ?answer wdt:P47 wd:Q81486 }","paraphrases":["What are the names of the twin cities of Corinth adjoining to Salvitelle?"],"info":{}}
{"id":"train_13500","question":"What is the Merkelstiftung ID of Albrecht Düre","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5580 wdt:P4620 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13501","question":"What was the cauae of death of Alfred Jarry, which had pott diaease as an effect?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7841 wdt:P509 ?answer . ?answer wdt:P1542 wd:Q2723627 }","paraphrases":["What was the cauae of death of Alfred Jarry, which had pott diaease as an effect?"],"info":{}}
{"id":"train_13502","question":"What place of activity is of Eva Braun, that is has Human Development Index 0.926?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q76433 wdt:P937 ?answer . ?answer wdt:P1081 ?x FILTER ( contains ( ?x , '0.926' ) ) }","paraphrases":["where is Eva Brawn active that has the Human Development Index 0.926?"],"info":{}}
{"id":"train_13503","question":"Which is the university with which is affiliated Niels Bohr?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7085 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q3918 }","paraphrases":["Which is the college with which is subsidiary Niels Bohr?"],"info":{}}
{"id":"train_13506","question":"Which is the fictional lion in the characters of The Lion King?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q36479 wdt:P674 ?obj . ?obj wdt:P31 wd:Q27267085 }","paraphrases":["Which is the anecdotal lion in the characters of The Lion King?"],"info":{}}
{"id":"train_13507","question":"What are the type of quantum particle which start with the letter o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22675015 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'σ' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What kind of quantum particle does the letter o start?"],"info":{}}
{"id":"train_13508","question":"What can be the language regulator body of Latin for language regulator","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q397 wdt:P1018 ?obj . ?obj wdt:P31 wd:Q2093358 }","paraphrases":[],"info":{}}
{"id":"train_13510","question":"TELL ME THE SIGNS OF LYME DISEASE TREATMENT?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q201989 wdt:P780 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What are the signs and treatments for lyme disease?"],"info":{}}
{"id":"train_13511","question":"What does Pedigree Petfoods Make?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2027177 wdt:P749 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What does Family Petfoods Make?"],"info":{}}
{"id":"train_13515","question":"Name the fastest transportation in Japan with less patronage?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5503 . ?ent wdt:P1373 ?obj . ?ent wdt:P17 wd:Q17 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What mode of transportation in Japan consistently has the least amount of patrons?"],"info":{}}
{"id":"train_13517","question":"What is stated on the Berlin Wall?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5086 wdt:P248 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13518","question":"Tell me first principle  whose name has the word structure  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q536351 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'structure' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me first principle whose name has the word structure in it."],"info":{}}
{"id":"train_13520","question":"What countries celebrate Christmas as a public holiday?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q19809 p:P31 ?s . ?s ps:P31 wd:Q1197685 . ?s pq:P17 ?value }","paraphrases":["Which nations observe Christmas as a public holiday?"],"info":{}}
{"id":"train_13522","question":"What type of music genre is hard rock","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P136 wd:Q83270 . ?sbj wdt:P31 wd:Q7366 }","paraphrases":["What genre does hard rock fall into?"],"info":{}}
{"id":"train_13523","question":"Who is the  {street} for {named after} of {Niels Bohr}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P138 wd:Q7085 . ?sbj wdt:P31 wd:Q79007 }","paraphrases":["Which street is named after Niels Bohr?"],"info":{}}
{"id":"train_13524","question":"Tell me the Wikimedia category for employees of Arizona State University.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q670897 wdt:P4195 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["Let me know the Wikimedia category for representatives of Arizona State College."],"info":{}}
