{"id":"train_4254","question":"What was the population of Mogilyov in 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q154835 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["How many people lived in Mogilyov in 2016?"],"info":{}}
{"id":"train_4255","question":"Who did Ed O'Neill play on Married.. with Children?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q208647 p:P674 ?s . ?s ps:P674 ?obj . ?s pq:P175 wd:Q16758 }","paraphrases":["Name the actor being played by Ed O'Neil in Married..with Children"],"info":{}}
{"id":"train_4256","question":"TELL ME SQUARE ROOT WHOSE NAME HAS THE WORD ROOT IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134237 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'root' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal to ME SQUARE ROOT WHOSE NAME HAS THE WORD ROOT IN IT."],"info":{}}
{"id":"train_4258","question":"Which is the organization that has it's headquarters located in Cleveland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q37320 . ?sbj wdt:P31 wd:Q43229 }","paraphrases":["Which is the organization that has it's central station found in Cleveland?"],"info":{}}
{"id":"train_4264","question":"was Isaac newton given professorship in 1669-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q935 p:P803 ?s . ?s ps:P803 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1669' ) ) }","paraphrases":["Did Isaac Newton become professor in 1669?"],"info":{}}
{"id":"train_4265","question":"tell me comic genre whose name has the word novel in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20087698 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'novel' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know comedian class whose title has the word novel in it"],"info":{}}
{"id":"train_4267","question":"Which chemical element of subclass period 5 has the highest density?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11344 . ?ent wdt:P2054 ?obj . ?ent wdt:P279 wd:Q244982 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the densest element in subclass period 5?"],"info":{}}
{"id":"train_4269","question":"Name a principality located in the Weimar Republic","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q41304 . ?sbj wdt:P31 wd:Q208500 }","paraphrases":["Name a Weimar Republic Principality"],"info":{}}
{"id":"train_4270","question":"Tell me who directed The Night of the Headless Horseman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7754144 wdt:P57 ?X . ?X wdt:P54 ?answer }","paraphrases":["Who was the director of the Night of the Headless Horseman?"],"info":{}}
{"id":"train_4273","question":"Which is the economic branch licensed by macOS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14116 wdt:P3931 ?X . ?X wdt:P452 ?answer }","paraphrases":["Which is the financial department authorized by macOS?"],"info":{}}
{"id":"train_4274","question":"Where did Konrad Zacharias Lorenz begin working on 8-31-1940?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q78496 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1940' ) ) }","paraphrases":["On the 31st August 1940, where did Konrad Zacharias Lorenz begin working?"],"info":{}}
{"id":"train_4275","question":"Who is the songwriter of Die Fledermaus whose artistic genre is classical music?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q464930 wdt:P86 ?answer . ?answer wdt:P136 wd:Q9730 }","paraphrases":["Who is the songwriter of Die Fledermaus whose artistic style is classical music?"],"info":{}}
{"id":"train_4277","question":"What was the linguistic origin of sugar?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11002 p:P443 ?s . ?s ps:P443 ?x filter ( contains ( ?x , 'Ru-сахар.ogg' ) ) . ?s pq:P407 ?value }","paraphrases":["What did the word sugar come from?"],"info":{}}
{"id":"train_4278","question":"What award did Maureen O'Hara receive in 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q229276 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["Maureen O' Hara received what award in 2014?"],"info":{}}
{"id":"train_4281","question":"When did the cruzeiro become the currency of Brazil?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q155 p:P38 ?s . ?s ps:P38 wd:Q8351983 . ?s pq:P580 ?value }","paraphrases":["The Cruzeiro, the currency of Brazil, was established when?"],"info":{}}
{"id":"train_4282","question":"Released in 1996, what is the prequel to \"Watership Down\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q936801 wdt:P156 ?answer . ?answer wdt:P577 ?x FILTER ( contains ( YEAR ( ?x ) , '1996' ) ) }","paraphrases":["Discharged in 1996, what is the prequel to \"Watership Down\"?"],"info":{}}
{"id":"train_4283","question":"Give the genetic association of attention deficit hyperactivity disorder that is determined via TAS.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q181923 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q23190853 }","paraphrases":["What is the genetic association of ADHD per TAS?"],"info":{}}
{"id":"train_4285","question":"Name a video game that starts with the letter Z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7889 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the name of a video game that starts with the letter Z?"],"info":{}}
{"id":"train_4289","question":"What is the area of provinces that border the Entre Rios Province?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44762 wdt:P47 ?X . ?X wdt:P2046 ?answer }","paraphrases":["What is the range of areas that border the Entre Rios Area?"],"info":{}}
{"id":"train_4290","question":"What is ideology of member  party of Lars Krarup ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12323862 wdt:P102 ?X . ?X wdt:P1142 ?answer }","paraphrases":["Which party is Lars Krarup a member of?"],"info":{}}
{"id":"train_4291","question":"Which is the painting that depicts the Richard III of England?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P180 wd:Q133028 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["Which is the portray that delineates the Richard III of England?"],"info":{}}
{"id":"train_4295","question":"Who was Ted Kaczynski's doctoral advisor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q222134 wdt:P184 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was the doctoral advisor for Ted Kaczynski?"],"info":{}}
{"id":"train_4296","question":"what is the start time for Aethelred the unready has position held  monarch of England?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q183499 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P580 ?value }","paraphrases":["When did Aethrlred the Unread start his position as the Monarch of England?"],"info":{}}
{"id":"train_4297","question":"Who replaced Bhumibol Adulyadej as King of Thailand?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q855252 p:P39 ?s . ?s ps:P39 wd:Q27330121 . ?s pq:P1365 ?value }","paraphrases":["What is the name of the person who replaced Bhumibol Adulyadeg as the King of Thailand?"],"info":{}}
{"id":"train_4299","question":"Who was Dino De Laurentiis' spouse when their marriage ended in 1988?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q296796 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1988' ) ) }","paraphrases":["Who did Dina De Laurentiis' divorce in 1988?"],"info":{}}
{"id":"train_4302","question":"What is the sourcing circumstances for Roger Williams, who was born in 1603?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q391591 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( YEAR ( ?x ) , '1603' ) ) . ?s pq:P1480 ?value }","paraphrases":["Name the sourcing circumstances for Roger Williams, who was born in 1603."],"info":{}}
{"id":"train_4304","question":"Which is the GNIS ID of Bridgeport?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q49174 wdt:P590 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4305","question":"Which is Berlin cultural heritage ID for  Pergamon Museum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q157298 wdt:P2424 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4306","question":"What is {studied by} the {manifestation of} of {Human_body} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q23852 wdt:P2579 ?ans_1 . wd:Q23852 wdt:P1557 ?ans_2 }","paraphrases":["What is {examined by} the {sign of} of {Human_body} ?"],"info":{}}
{"id":"train_4308","question":"What is  the timezone of the civilisation of Chinese mythology ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q210677 wdt:P2596 ?X . ?X wdt:P421 ?answer }","paraphrases":["What is the timezone of the civilisation of Chinese mythology ?"],"info":{}}
{"id":"train_4309","question":"What award did Kurt Godel receive on 1974-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41390 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1974' ) ) }","paraphrases":["Kurt Godel received what award on 1974-1-1?"],"info":{}}
{"id":"train_4311","question":"What is the opposite genre for fiction ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P461 wd:Q8253 . ?sbj wdt:P31 wd:Q483394 }","paraphrases":["What is the inverse class for fiction ?"],"info":{}}
{"id":"train_4312","question":"What was the position of Fernando Álvarez de Toledo in 1581?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q80847 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1581' ) ) }","paraphrases":["Which position did Fernando Alvarez de Toledo hold in 1581?."],"info":{}}
{"id":"train_4313","question":"What is taxonomy of goldfish","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P171 wd:Q123141 . ?sbj wdt:P31 wd:Q16521 }","paraphrases":["What is scientific classification of goldfish"],"info":{}}
{"id":"train_4314","question":"Which human Go player, has the minimum EGF rating?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P4105 ?obj . ?ent wdt:P106 wd:Q12039558 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["State the name of the human Go player with the minimum EGF rating."],"info":{}}
{"id":"train_4315","question":"What is the name of David Fosters record label?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q77112 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2442401 }","paraphrases":["What is David Fosters's record label named?"],"info":{}}
{"id":"train_4318","question":"Which is {cases} of {language used} in {Ismail Kadare} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q179695 wdt:P1412 ?X . ?X wdt:P2989 ?answer }","paraphrases":["Which is {cases} of {dialect utilized} in {Ismail Kadare} ?"],"info":{}}
{"id":"train_4324","question":"When did Paul Erdős live in Manchester?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q173746 p:P551 ?s . ?s ps:P551 wd:Q18125 . ?s pq:P580 ?value }","paraphrases":["Paul Erdos lived in Manchester during what years?"],"info":{}}
{"id":"train_4325","question":"What was the population of the Central African Republic in 1987?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q929 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1987' ) ) }","paraphrases":["Which was the number of population in Central African Republic in 1987?"],"info":{}}
{"id":"train_4327","question":"Where I can find on the map Kherson Oblast?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q163271 wdt:P1943 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4328","question":"What are the national economy which start with the letter e","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6456916 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the national economies whose first alphabet is e."],"info":{}}
{"id":"train_4332","question":"What is the National Cancer Institute's ID for melanoma?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q180614 wdt:P1395 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4334","question":"WHAT ARE FILM WHICH START WITH THE LETTER Y.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11424 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE FILM WHICH Begin WITH THE LETTER Y."],"info":{}}
{"id":"train_4336","question":"Give the lowest block size standard designed by John Daemen","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q317623 . ?ent wdt:P2599 ?obj . ?ent wdt:P287 wd:Q1690741 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is John Daemen's lowest block size standard design?"],"info":{}}
{"id":"train_4337","question":"What is located on linear feature of the London Underground?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P795 wd:Q20075 }","paraphrases":[],"info":{}}
{"id":"train_4339","question":"Is it true Facebook founded by Andrew McCollum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q355 wdt:P112 wd:Q4757939 }","paraphrases":["Did Andrew McCollum create Facebook?"],"info":{}}
{"id":"train_4340","question":"What are the places of death and burial of Stonewall Jackson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q216124 wdt:P119 ?ans_1 . wd:Q216124 wdt:P20 ?ans_2 }","paraphrases":["Where did Stonewall Jackson die and where was he buried?"],"info":{}}
{"id":"train_4342","question":"Were Grendel's mother and Hygelac characters in Beowulf?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q48328 wdt:P674 wd:Q2361245 . wd:Q48328 wdt:P674 wd:Q889694 }","paraphrases":["In Beowulf, were Grendel's mother and Hygelac characters?"],"info":{}}
{"id":"train_4343","question":"What is the pronoun for Charlamagne Tha God that is shortened to мужской?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16203002 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'мужской' ) ) }","paraphrases":["What is the pronoun for Charlamagne Tha God that is shortened to мужской?"],"info":{}}
{"id":"train_4347","question":"What are the  legal status of medicine   whose name has the word UK IN IT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26715005 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'uk' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the legal status of medicinal products whose name is UK IN IT?"],"info":{}}
{"id":"train_4348","question":"What is the native language of Theodosius I in the year 347?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q46696 p:P1559 ?s . ?s ps:P1559 ?obj . ?s pq:P580 ?x filter ( contains ( ?x , '347-1-11' ) ) }","paraphrases":["Which is the native language of Theodosius I in the year 347?"],"info":{}}
{"id":"train_4349","question":"tell me about language family starts with the letter q","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25295 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'q' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know approximately dialect family begins with the letter q"],"info":{}}
{"id":"train_4350","question":"What is the ecclesiastical title for the office of the head of the Coptic Orthodox Church of Alexandria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q198998 wdt:P2388 ?obj . ?obj wdt:P31 wd:Q11773926 }","paraphrases":["Which is the national tune of commitment that contains the word nunarput in it's title?"],"info":{}}
{"id":"train_4351","question":"What job did Michelangelo, also known as inż, have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5592 wdt:P106 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'inż.' ) ) }","paraphrases":["What work did Michelangelo, too known as inż, have?"],"info":{}}
{"id":"train_4352","question":"What organization does George Rudinger work at?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1505786 wdt:P108 ?X . ?X wdt:P131 ?answer }","paraphrases":["What organization does George Rudinger work at?"],"info":{}}
{"id":"train_4353","question":"Are apples red and blue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q89 wdt:P462 wd:Q3142 . wd:Q89 wdt:P462 wd:Q1088 }","paraphrases":["Do apples have a red and blue color?"],"info":{}}
{"id":"train_4354","question":"Which is {detection method} for {child body} of {Ross 128} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q926610 wdt:P398 ?X . ?X wdt:P1046 ?answer }","paraphrases":["What is the method for detection for the child body Ross 128?"],"info":{}}
{"id":"train_4355","question":"Where in Spain was Muhammad al-Idrisi born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q173441 wdt:P19 ?answer . ?answer wdt:P131 wd:Q29 }","paraphrases":["Where in Spain was Muhammad al-Idrisi born?"],"info":{}}
{"id":"train_4356","question":"What sports are included in the biathlon","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P641 wd:Q166788 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What sports are incorporated into the biathlon"],"info":{}}
{"id":"train_4357","question":"Who was the chairperson of the US Department of State in January of 2013?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q789915 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["Who chaired the US Department of State in January of 2013?"],"info":{}}
{"id":"train_4358","question":"TELL ME THE CREATION MYTH THAT CONTAINS THE WORD DEAMTIME IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215304 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dreamtime' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME THE CREATION MYTH THAT CONTAINS THE WORD DEAMTIME IN THEIR NAME"],"info":{}}
{"id":"train_4359","question":"What genre of music is part of the series of Bomberman II?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2002828 wdt:P179 ?X . ?X wdt:P136 ?answer }","paraphrases":["What genre of music is the Bomberman II series part?"],"info":{}}
{"id":"train_4360","question":"What company did Antonin Eymieu co-found?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2857113 wdt:P611 ?X . ?X wdt:P112 ?answer }","paraphrases":["Which company did Antonin Eymieu co-found?"],"info":{}}
{"id":"train_4362","question":"Name an academic writing author that starts with letter O","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4119870 . ?sbj wdt:P50 wd:Q1035 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a scholarly composition creator that begins with letter O"],"info":{}}
{"id":"train_4363","question":"What is the translation of the post review of the 17th annual Scripps Spelling Bee?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16155303 wdt:P155 ?X . ?X wdt:P629 ?answer }","paraphrases":["For the 17th annual Scripps Spelling Bee, what is the post review translation?"],"info":{}}
{"id":"train_4364","question":"Did {Lemmy} used {instrument} as {harmonica}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q309926 wdt:P1303 wd:Q51290 }","paraphrases":["Did Lemmy use an harmonica as an instrument?"],"info":{}}
{"id":"train_4365","question":"who chronology of topic  of continent of western asia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27293 wdt:P30 ?X . ?X wdt:P2184 ?answer }","paraphrases":["who chronology of point of landmass of western asia?"],"info":{}}
{"id":"train_4366","question":"Did Sarah Michelle Gellar practice taekwondo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q180665 wdt:P641 wd:Q36389 }","paraphrases":["Does Sarah Michelle Gellar know taekwondo?"],"info":{}}
{"id":"train_4369","question":"How are Carl Maria von Weber and Constanze Mozart related?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q154812 p:P1038 ?s . ?s ps:P1038 wd:Q84464 . ?s pq:P1039 ?value }","paraphrases":["Carl Maria von Weber is related to Constanze Mozart in what way?"],"info":{}}
{"id":"train_4370","question":"Which financial center is a twinned administrative body of Mumbai?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1156 wdt:P190 ?obj . ?obj wdt:P31 wd:Q1066984 }","paraphrases":[],"info":{}}
{"id":"train_4372","question":"Which war's did the Soviet Union take part in.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P710 wd:Q15180 . ?sbj wdt:P31 wd:Q198 }","paraphrases":["The Soviet Union took part in what war?"],"info":{}}
{"id":"train_4373","question":"When did Vyacheslav Molotov received the Order of Lenin award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132899 p:P166 ?s . ?s ps:P166 wd:Q185493 . ?s pq:P585 ?value }","paraphrases":["In what year was the Order of Lenin award given to Vyacheslav Molotov?"],"info":{}}
{"id":"train_4375","question":"What is developed by SPICE that has working languages in English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q174907 wdt:P178 ?answer . ?answer wdt:P2936 wd:Q1860 }","paraphrases":["What is developed through SPICE that has working languages in English?"],"info":{}}
{"id":"train_4376","question":"What is a significant event that Matthias Corvinus was apart of and  what was the location of that event?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q188634 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P276 ?value1 . }","paraphrases":["What major event is Matthias Corvinus known for and where did this event take place?"],"info":{}}
{"id":"train_4378","question":"Who married the contestant of Aelita?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q380803 wdt:P161 ?X . ?X wdt:P26 ?answer }","paraphrases":["Who hitched the hopeful of Aelita?"],"info":{}}
{"id":"train_4380","question":"Name the aircraft model with the highest take off roll involved in the Seville A400M crash.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15056995 . ?ent wdt:P2430 ?obj . ?ent wdt:P793 wd:Q19882906 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which aircraft model involved in the Seville A400M crash has the highest take off roll?"],"info":{}}
{"id":"train_4381","question":"Where is the head office location of Miss World, whose twin city is Los Angeles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q173402 wdt:P159 ?answer . ?answer wdt:P190 wd:Q65 }","paraphrases":["Where is the head workplace vicinity of Miss World, whose twin town is Los Angeles?"],"info":{}}
