{"id":"train_13146","question":"What are the topics,  in chronological order, of Irina Rossius?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23656509 wdt:P101 ?X . ?X wdt:P2184 ?answer }","paraphrases":["What are the topics, in chronological order, that Irina Rossius talked about?"],"info":{}}
{"id":"train_13149","question":"What award did Padmini Kolhapure, whose top dog is Lakshmi, win?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3595902 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q277698 }","paraphrases":["What award did Padmini Kolhapure, whose top dog is Lakshmi, win?"],"info":{}}
{"id":"train_13150","question":"What is number of out of school children  is the antonym  of developed country ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132453 wdt:P461 ?X . ?X wdt:P2573 ?answer }","paraphrases":["What number of children out of school is the developed country's antonym?"],"info":{}}
{"id":"train_13153","question":"When did Cesar Chavez receive the California Hall of Fame award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q355425 p:P166 ?s . ?s ps:P166 wd:Q5020532 . ?s pq:P585 ?value }","paraphrases":["In what year did Cesar Chavez earn the California Hall of Fame prize?"],"info":{}}
{"id":"train_13155","question":"What is Aldus Manutius field of work at Caterina Pico and who are his students?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q213220 p:P108 ?s . ?s ps:P108 wd:Q3663523 . ?s pq:P101 ?value1 . ?s pq:P802 ?value2 }","paraphrases":["What is Aldus Manutius field of work at Caterina Pico and who are his students?"],"info":{}}
{"id":"train_13156","question":"Since when Ghent is considered as twinned administrative body of Brașov?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1296 p:P190 ?s . ?s ps:P190 wd:Q82174 . ?s pq:P580 ?value }","paraphrases":["When did Ghent become an administrative body of Brasov?"],"info":{}}
{"id":"train_13157","question":"what is the number of matches  and number of points  scored of kevin  keegan  has member of sportsteam as  blacktown city  FC?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q152832 p:P54 ?s . ?s ps:P54 wd:Q4923485 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["What is the number of matches scored by kevin keegan as a blacktown FC member of the sport steam?"],"info":{}}
{"id":"train_13158","question":"Who was the main actress in Guiding Light?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1145764 wdt:P161 ?X . ?X wdt:P106 ?answer }","paraphrases":["Who was the most performing artist in Directing Light?"],"info":{}}
{"id":"train_13160","question":"Which municipality of Norway shares its border with Oslo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q585 . ?sbj wdt:P31 wd:Q755707 }","paraphrases":["Which district of Norway offers its border with Oslo?"],"info":{}}
{"id":"train_13161","question":"Who is the publisher of  scientific journal Society of Jesus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P123 wd:Q36380 . ?sbj wdt:P31 wd:Q5633421 }","paraphrases":["Who is the distributer of logical diary Society of Jesus?"],"info":{}}
{"id":"train_13163","question":"Is the IDLH of bromotrifluoromethane equal to 292320?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q413018 wdt:P2129 ?obj filter ( ?obj = 292320.0 ) }","paraphrases":["Is the IDLH of bromotrifluoromethane break even with to 292320?"],"info":{}}
{"id":"train_13164","question":"What are the city-state which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q133442 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the city-state which begin with the letter v"],"info":{}}
{"id":"train_13165","question":"why was ichiro suzuki given his birth name  {鈴木 一朗}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q600 p:P1477 ?s . ?s ps:P1477 ?x filter ( contains ( ?x , '鈴木 一朗' ) ) . ?s pq:P1814 ?value }","paraphrases":["Give the reason Ichiro Suzuki was named {鈴木 一朗}."],"info":{}}
{"id":"train_13166","question":"What parliamentary group had Michael Collins as Deputy to the Dáil ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q173196 p:P39 ?s . ?s ps:P39 wd:Q654291 . ?s pq:P4100 ?value }","paraphrases":["Michael collins served what parliamentary group in Dail?"],"info":{}}
{"id":"train_13167","question":"Who reprinted the Death of a Salesman book?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1790910 wdt:P1877 ?X . ?X wdt:P135 ?answer }","paraphrases":["Who republished the Passing of a Sales representative book?"],"info":{}}
{"id":"train_13168","question":"Which is the SpeedSkatingStats speed skater ID for Johann Olav Koss?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q318403 wdt:P3695 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13170","question":"Tell me mountain whose name has the word zumsteinspitze  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8502 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zumsteinspitze' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal  me mountain whose name has the word zumsteinspitze in it."],"info":{}}
{"id":"train_13172","question":"How many reactors are there for the {Charles University in Prague} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q31519 wdt:P1075 ?obj }","paraphrases":["Charles University in Prgue has how may reactors?"],"info":{}}
{"id":"train_13174","question":"Which is the municipality of the Netherlands that shares border with Rotterdam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q34370 . ?sbj wdt:P31 wd:Q2039348 }","paraphrases":[],"info":{}}
{"id":"train_13175","question":"What is the archive with the  most data size whose owned by is  Wikimedia Foundation, Inc.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q166118 . ?ent wdt:P3575 ?obj . ?ent wdt:P127 wd:Q180 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which archive that's owned by Wikimedia Foundation, Inc. has the largest data size?"],"info":{}}
{"id":"train_13176","question":"Who was Margaret Rutherford's spouse in 1972?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q230143 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1972' ) ) }","paraphrases":["Give me the name of Margaret Rutherford's spouse in 1972"],"info":{}}
{"id":"train_13182","question":"Does the cost of the Monmouth County Gaol equal 5000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q767102 wdt:P2130 ?obj filter ( ?obj = 5000 ) }","paraphrases":["Is the cost of the Monmouth County Gaol 5000?"],"info":{}}
{"id":"train_13183","question":"Which sport discipline competed in Ninja having time of publication as 2007-9-26?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q50825725 wdt:P2416 ?answer . ?answer wdt:P577 ?x FILTER ( contains ( YEAR ( ?x ) , '2007' ) ) }","paraphrases":["Which game discipline competed in Ninja having time of booklet as 2007-9-26?"],"info":{}}
{"id":"train_13184","question":"What is the mascot of Georgia institute of Technology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q864855 wdt:P822 ?obj . ?obj wdt:P31 wd:Q386208 }","paraphrases":["What is the mascot of Georgia established of Technology?"],"info":{}}
{"id":"train_13187","question":"\"What is {murder method} of {Fernandel}, which has {signs} is {wheeze} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q129092 wdt:P509 ?answer . ?answer wdt:P780 wd:Q517104 }","paraphrases":["\"What is {murder method} of {Fernandel}, which has {signs} is {wheeze} ?\""],"info":{}}
{"id":"train_13189","question":"Who was Ada Lovelace's husband when she died on November 27, 1852?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7259 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1852' ) ) }","paraphrases":["At the time of her death on November 27, 1852, Ada Lovelace was married to what man?"],"info":{}}
{"id":"train_13190","question":"Sonic the Hedgehog is the anthropomorphic cat for what present work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q1046812 . ?sbj wdt:P31 wd:Q27303706 }","paraphrases":["The humanlike cat; Sonic the Hedgehog belongs to what company?"],"info":{}}
{"id":"train_13194","question":"Which taxon has the highest observed lifespan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P4214 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the taxon with the highest lifespan?"],"info":{}}
{"id":"train_13197","question":"When did Andy Murray receive the award as BBC Sports Personality of the Year?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q10125 p:P166 ?s . ?s ps:P166 wd:Q2267946 . ?s pq:P585 ?value }","paraphrases":["Andy Murray was presented the award as BBC Sports Personality of the Year in what year?"],"info":{}}
{"id":"train_13198","question":"What Piano Sonata No. 8 music is associated with the iron overload disorder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q146113 wdt:P86 ?answer . ?answer wdt:P1050 wd:Q2025687 }","paraphrases":["What music is associated with the iron overload disorder with Piano Sonata No. 8"],"info":{}}
{"id":"train_13201","question":"What is the { capital } of the { Western Roman Empire } that { start time } is { 402 - 0 - 0 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q42834 p:P36 ?s . ?s ps:P36 ?obj . ?s pq:P580 ?x filter ( contains ( ?x , '402-0-0' ) ) }","paraphrases":["What Western Roman Empire capital began in the year 402?"],"info":{}}
{"id":"train_13202","question":"What is the religious affiliation of the victim of the Battle of Stalingrad?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q38789 wdt:P710 ?X . ?X wdt:P140 ?answer }","paraphrases":["To which religion does the victim of the Battle of Stalingrad belong?"],"info":{}}
{"id":"train_13203","question":"what are the media franchise starts with t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q196600 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the media establishment begins with t"],"info":{}}
{"id":"train_13204","question":"What action did shareholders in Malibu take?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q177092 wdt:P127 ?X . ?X wdt:P452 ?answer }","paraphrases":["What action have Malibu shareholders taken?"],"info":{}}
{"id":"train_13206","question":"What is the part of the constellation is the child's body in HD 4208?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1367671 wdt:P398 ?X . ?X wdt:P59 ?answer }","paraphrases":["The child's body in HD 4208 occurs in which part of the constellation?"],"info":{}}
{"id":"train_13208","question":"How many continents are bordering Africa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P30 wd:Q15 }","paraphrases":["What is the number of continents that border Africa?"],"info":{}}
{"id":"train_13212","question":"What did Jim Kublin participate as in the event?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18586173 wdt:P1344 ?X . ?X wdt:P1427 ?answer }","paraphrases":["What did Jim Kublin take part as within the event?"],"info":{}}
{"id":"train_13213","question":"What is the 24 Hours of Le Mans entry with the most laps completed whose sponsor is Bentley ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q55096520 . ?ent wdt:P5349 ?obj . ?ent wdt:P859 wd:Q27224 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which one of the 24 Hours of Le Mans entry had completed the most laps and Bentley was the sponsor?"],"info":{}}
{"id":"train_13214","question":"List the codes for DRD2","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15335165 wdt:P688 ?X . ?X wdt:P681 ?answer }","paraphrases":["List the codes for DRD2"],"info":{}}
{"id":"train_13215","question":"Where is the copy of the book, Philosophiae Naturalis Principia Mathematica written by Isaac Newton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q205921 wdt:P144 ?answer . ?answer wdt:P50 wd:Q935 }","paraphrases":["Where is the replica of the book, Philosophiae Naturalis Principia Mathematica written via Isaac Newton?"],"info":{}}
{"id":"train_13216","question":"Who is the person of the native language of Yiddish?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P103 wd:Q8641 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["The native language of Yiddish is exemplified by which individual?"],"info":{}}
{"id":"train_13217","question":"What is the Global Poker Index ID of Phil Hellmuth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q375966 wdt:P3564 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13218","question":"When did Bradley Cooper receive the Indiana Film Journalists Association Award for Best Actor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q205707 p:P166 ?s . ?s ps:P166 wd:Q16058281 . ?s pq:P585 ?value }","paraphrases":["On what date did Bradley Cooper receive the Indiana Film Journalists Association Award for Best Actor?"],"info":{}}
{"id":"train_13220","question":"Which was the country of Vinnutsia Oblast till 1991?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q166709 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1991' ) ) }","paraphrases":["Give me the name of the country of Vinnutsia Oblast until 1991."],"info":{}}
{"id":"train_13223","question":"Who are the spouses of the characters from Batman: Haunted Knight?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2891507 wdt:P674 ?X . ?X wdt:P451 ?answer }","paraphrases":["Who are the companions of the characters from Batman: Frequented Knight?"],"info":{}}
{"id":"train_13224","question":"Who is the employer of Giosuè Carducci?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q43440 wdt:P108 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13225","question":"What role Edward Burnett Tylor played to contribute to publish Dictionary of National Biography?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q141037 p:P3919 ?s . ?s ps:P3919 wd:Q1210343 . ?s pq:P2868 ?value }","paraphrases":["What contribution did Edward Burnett Taylor give to publish the Dictionary of National Biography?"],"info":{}}
{"id":"train_13227","question":"Does the santa monica electorate equal 7227","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28958 wdt:P1831 ?obj filter ( ?obj = 7227 ) }","paraphrases":["Is the amount of santa monica electorate equal to 7227?"],"info":{}}
{"id":"train_13228","question":"When did the Delhi Metro have a daily patronage of 279e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q271195 p:P1373 ?s . ?s ps:P1373 ?x filter ( contains ( ?x , '2.79e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["What was the date that Delhi Metro had a daily patronage of 279e+06."],"info":{}}
{"id":"train_13234","question":"Who is the{academic institution} for {subsidiary} of {Clemson University}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q631066 wdt:P355 ?obj . ?obj wdt:P31 wd:Q4671277 }","paraphrases":["Which academic institutions are subsidiaries of Clemson University?"],"info":{}}
{"id":"train_13235","question":"Name a mathematical function whose notation is made with a radical sign and that contains the word \"root\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47279819 . ?sbj wdt:P913 wd:Q11536248 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'root' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a scientific work whose documentation is made with a radical sign which contains the word \"root\" in its name"],"info":{}}
{"id":"train_13237","question":"What was the population of Central Visayas on August 1, 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q13669 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["What was the population census on August 1, 2015 for Central Visayas?"],"info":{}}
{"id":"train_13238","question":"who Q48460 of language official of kingdom of sicily ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q188586 wdt:P37 ?X . ?X wdt:P1036 ?answer }","paraphrases":["What is the official language of the Kingdom of Sicily?"],"info":{}}
{"id":"train_13239","question":"Where is the death location of Paul Castellano whose death location is also adjacent to Queens","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q304489 wdt:P20 ?answer . ?answer wdt:P47 wd:Q18424 }","paraphrases":["Where is the passing area of Paul Castellano whose passing area is additionally adjoining to Queens"],"info":{}}
{"id":"train_13241","question":"What is the county seat of the death location of Sylvia Plath?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q133054 wdt:P20 ?X . ?X wdt:P1376 ?answer }","paraphrases":["What is the province situate of the passing area of Sylvia Plath?"],"info":{}}
{"id":"train_13242","question":"Which minor plane that starts with '9","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1022867 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , '9' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which minor aircraft begins with ' 9"],"info":{}}
{"id":"train_13243","question":"Which city in Belgium shares a border with Bruges?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q12994 . ?sbj wdt:P31 wd:Q493522 }","paraphrases":["What city in Belgium is adjacent to Bruges?"],"info":{}}
{"id":"train_13244","question":"Tell me the law of thermodynamics which contains the word law in it's name!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q849392 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'law' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the law of thermodynamics which contains the word law in it's name!"],"info":{}}
{"id":"train_13245","question":"What is Electronic Gaming Monthly's review score?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P447 wd:Q793981 }","paraphrases":[],"info":{}}
{"id":"train_13248","question":"What is the period for Hradec Králové Region has in time zone as UTC+01:00?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q193295 p:P421 ?s . ?s ps:P421 wd:Q6655 . ?s pq:P1264 ?value }","paraphrases":["For time zone UTC+01:00, what is the perod for Hradec Kralove Region?"],"info":{}}
{"id":"train_13250","question":"How many settlements are in Tilburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q26430 wdt:P1383 ?obj }","paraphrases":["Tilburg has how many settlements?"],"info":{}}
{"id":"train_13252","question":"\"Which is {place of formation} of {Pussy Riot}, where {point on the globe} is {37.6178} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7551 wdt:P740 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '37.6178' ) ) }","paraphrases":["\"Which is {place of formation} of {Pussy Riot}, where {point on the globe} is {37.6178} ?\""],"info":{}}
{"id":"train_13254","question":"When was John A. MacDonald replaced as a member of the House of Commons?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q128702 p:P39 ?s . ?s ps:P39 wd:Q15964890 . ?s pq:P1365 ?value }","paraphrases":["When someone took over for John A. MacDonald as a member of the House of Commons, what was the date?"],"info":{}}
{"id":"train_13255","question":"How did Pete Maravich die, and what was the team and speciality that he played?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q316183 wdt:P509 ?ans_1 . wd:Q316183 wdt:P413 ?ans_2 }","paraphrases":["What causet Pete Maravich's death and what club and position is he known for?"],"info":{}}
{"id":"train_13256","question":"Zimbabwe has what UK Parliament thesaurus identification?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q954 wdt:P4527 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13257","question":"What prize was awarded in the work of the Simpson family?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9762 wdt:P1441 ?X . ?X wdt:P166 ?answer }","paraphrases":["What prize was awarded to the Simpson Family?"],"info":{}}
{"id":"train_13258","question":"Did J.K. Simmons graduate from the College of Clinical and Translational Science at Ohio State University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q150482 wdt:P69 ?answer . ?answer wdt:P355 wd:Q45137588 }","paraphrases":["Did J.K. Simmons graduate from the College of Clinical and Translational Science at Ohio State University?"],"info":{}}
{"id":"train_13259","question":"What is the now extinct native language used by the Khazars?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q173282 wdt:P103 ?obj . ?obj wdt:P31 wd:Q38058796 }","paraphrases":["What language is used by the Khazars?"],"info":{}}
{"id":"train_13260","question":"What was the last year that FC Bayern Munich used the Olympic Stadium of Munich as its home venue?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q15789 p:P115 ?s . ?s ps:P115 wd:Q131610 . ?s pq:P582 ?value }","paraphrases":["When was the last year that FC Bayern Munich had the Munich Olympic Stadium as their center?"],"info":{}}
{"id":"train_13261","question":"Is the box office of  Snow White and The Seven Dwarfs less than 5040000.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q134430 wdt:P2142 ?obj filter ( ?obj < 5040000.0 ) }","paraphrases":["Did Snow White and the Seven Dwarfs make less than 50,400,000?"],"info":{}}
{"id":"train_13262","question":"Which is the antihydrogen isotope of proton ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2294 wdt:P2152 ?obj . ?obj wdt:P31 wd:Q31804375 }","paraphrases":["Which is the antihydrogen isotope of proton ?"],"info":{}}
{"id":"train_13263","question":"Tell me Wikimedia list article whose name has the word nuts in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13406463 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'nuts' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know Wikimedia list article whose title has the word nuts in it."],"info":{}}
{"id":"train_13264","question":"In what partner town of Santo Domingo was Francis Bedford born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3504712 wdt:P19 ?answer . ?answer wdt:P190 wd:Q34820 }","paraphrases":["In what accomplice city of Santo Domingo was Francis Bedford born?"],"info":{}}
{"id":"train_13275","question":"Which is the exhibition history of Le Déjeuner sur l'herbe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q152509 wdt:P608 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13276","question":"Which is the Southampton shipwrecking start point containing the word rms ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q906512 . ?sbj wdt:P1427 wd:Q79848 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'rms' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the Southampton shipwrecking begin point containing the word rms ?"],"info":{}}
