{"id":"train_2795","question":"Mention the location of headquarters of University of Toronto which has coordinate location 43.661666666667 -79.395?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q180865 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P625 ?x filter ( contains ( ?x , '43.661666666667 -79.395' ) ) }","paraphrases":["Notice the area of central station of University of Toronto which has facilitate area 43.661666666667 - 79.395?"],"info":{}}
{"id":"train_2796","question":"What's the active ingredient in fentanyl?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3781 wd:Q407541 }","paraphrases":["Fentanyl has what active ingredient?"],"info":{}}
{"id":"train_2799","question":"Which is the big city in the continent of North America that starts with the letter v?:","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1549591 . ?sbj wdt:P30 wd:Q49 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the big city in the continent of North America that begins with the letter v?:"],"info":{}}
{"id":"train_2800","question":"What is the profit for Taiwan High Speed rail?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q706198 wdt:P137 ?X . ?X wdt:P3362 ?answer }","paraphrases":["What is the benefit for Taiwan Tall Speed rail?"],"info":{}}
{"id":"train_2801","question":"Tell me about the company that runs Walt Disney Parks and Resorts.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P199 wd:Q1431781 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["Tell me about the corporation running Disney Parks and Resorts?"],"info":{}}
{"id":"train_2803","question":"Which is the resource which contains the word natural in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1554231 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'natural' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the asset which contains the word normal in it's name?"],"info":{}}
{"id":"train_2805","question":"What is the Erdos number for G.H. Hardy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q184337 wdt:P2021 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2806","question":"What is parent organisation of Uber","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q780442 wdt:P749 ?obj . ?obj wdt:P31 wd:Q6881511 }","paraphrases":["Which organisation owns Uber?"],"info":{}}
{"id":"train_2807","question":"Which is the inception for The Peasants?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2896338 wdt:P571 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2808","question":"What is the work of Annibale Carracci, whose patron saint is Luke the Evangelist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7824 wdt:P106 ?answer . ?answer wdt:P417 wd:Q128538 }","paraphrases":["What is the work of Annibale Carracci, whose buyer saint is Luke the Evangelist?"],"info":{}}
{"id":"train_2810","question":"What start located in the constellation of Centaurus has the least radial velocity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q523 . ?ent wdt:P2216 ?obj . ?ent wdt:P59 wd:Q8844 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which star as the least radial velocity in the Centaurus constellation?"],"info":{}}
{"id":"train_2811","question":"Who is the person that had Adelaide as place of death?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P20 wd:Q5112 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Which individual listed Adelaide as the location of death?"],"info":{}}
{"id":"train_2812","question":"What is confused with semi-trailer truck born on 1977-2-1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1936841 wdt:P1889 ?answer . ?answer wdt:P569 ?x FILTER ( contains ( YEAR ( ?x ) , '1977' ) ) }","paraphrases":["What is confounded with semi-trailer truck born on 1977-2-1?"],"info":{}}
{"id":"train_2813","question":"McGill University is affiliated to which other college ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q201492 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q189004 }","paraphrases":["Which other college is connected to McGill University?"],"info":{}}
{"id":"train_2816","question":"For what subject did The Deer Hunter receive the Academy Award for Best Picture?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q201674 p:P166 ?s . ?s ps:P166 wd:Q102427 . ?s pq:P805 ?value }","paraphrases":["What was the subject of the Academy Award for Best Picture that was received by The Deer Hunter?"],"info":{}}
{"id":"train_2818","question":"Which is the Companies House ID for BBC?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9531 wdt:P2622 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2819","question":"What are the specialty which start with the letter visagie","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1047113 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'visagie' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the specialty that begins with the visagie letter?"],"info":{}}
{"id":"train_2820","question":"What is the outcome of Hamad bin Khalifa Al Thani that which has been coined Univision?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57360 wdt:P793 ?answer . ?answer wdt:P61 wd:Q731824 }","paraphrases":["What is the result of the coined Univision by Hamad bin Khalifa Al Thani?"],"info":{}}
{"id":"train_2821","question":"Which piece that contains the favorite player Plautus was written by Richard II?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q649562 wdt:P50 ?answer . ?answer wdt:P737 wd:Q47160 }","paraphrases":["Which piece that contains the favorite participant Plautus was written via Richard II?"],"info":{}}
{"id":"train_2822","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12204 wdt:P2293 ?answer . ?answer wdt:P644 ?x FILTER ( contains ( ?x , '103109431' ) ) }","paraphrases":["What it is?"],"info":{}}
{"id":"train_2823","question":"What are the mode of transport that starts with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q334166 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the mode of transport that begins with the letter v"],"info":{}}
{"id":"train_2824","question":"At what institution was Josef Mengele educated and in what did he major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q57109 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["Where did Josef Mengele go to college and what was his major?"],"info":{}}
{"id":"train_2825","question":"Did Holly Holm compete in bantamweight?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2414305 wdt:P2094 wd:Q948780 }","paraphrases":["Was Holly Holm in the competition of bantamweight?"],"info":{}}
{"id":"train_2826","question":"Which point in time for zibo has twinned administrative body as Gwangju ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q198370 p:P190 ?s . ?s ps:P190 wd:Q42069 . ?s pq:P585 ?value }","paraphrases":["When did zibo has twinned administrative body as Gwangju ?"],"info":{}}
{"id":"train_2829","question":"What is list of works for Charlie Chaplin ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q882 wdt:P1455 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2834","question":"Tell me the award received by Arthur Smith Woodward in 1924?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q542973 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1924' ) ) }","paraphrases":["In 1924, Arthur Smith Woodard received what award?"],"info":{}}
{"id":"train_2835","question":"tell  me social service that name has the word social in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16605260 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'social' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know social benefit that title has the word social in it"],"info":{}}
{"id":"train_2838","question":"Tell me the festival which starts with the letter v!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q132241 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the celebration which begins with the letter v!"],"info":{}}
{"id":"train_2839","question":"Who is nominated for Javier Bardem in Nation Society of Film Critics Award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q134895 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q21866939 }","paraphrases":[],"info":{}}
{"id":"train_2840","question":"What metropolis is the sister city of Bern?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q70 . ?sbj wdt:P31 wd:Q200250 }","paraphrases":["What city is the sister city of Bern?"],"info":{}}
{"id":"train_2843","question":"Tell me the security agency which starts with the letter s!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3238445 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which security agency starts with the letter s"],"info":{}}
{"id":"train_2844","question":"Which company sings the Star-Spangled Banner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P85 wd:Q44696 . ?sbj wdt:P31 wd:Q783733 }","paraphrases":["Which company sings the Star-Spangled Standard?"],"info":{}}
{"id":"train_2847","question":"What species can reproduce extremely quickly whose family is arachnids?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P3492 ?obj . ?ent wdt:P703 wd:Q15978631 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What arachnid can reproduce very quickly?"],"info":{}}
{"id":"train_2848","question":"Is the standard enthalpy of formation for ethanol less than -333.12?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q153 wdt:P3078 ?obj filter ( ?obj < -333.12 ) }","paraphrases":["Is the standard enthalpy of arrangement for ethanol less than -333.12?"],"info":{}}
{"id":"train_2850","question":"Who attempted to murder Guy Fawkes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q13898 wdt:P607 ?obj . ?obj wdt:P31 wd:Q4818169 }","paraphrases":["Who endeavored to kill Fellow Fawkes?"],"info":{}}
{"id":"train_2851","question":"Flavor Fav is a member of what group, and a citizen of which country?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q388785 wdt:P463 ?ans_1 . wd:Q388785 wdt:P27 ?ans_2 }","paraphrases":["What country is Flavor Fav a citizen of, and what group is he a member of?"],"info":{}}
{"id":"train_2853","question":"Does Chris Martin play the guitar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q712860 wdt:P1303 wd:Q6607 }","paraphrases":["Can Chris Martin play the guitar?"],"info":{}}
{"id":"train_2854","question":"Who played Kunta Kinte in Roots?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1247168 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q636142 }","paraphrases":["What Actor/Actress played Kunta Kinte in the show Roots?"],"info":{}}
{"id":"train_2856","question":"How many seats are in prefectural assembly?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q28362371 . ?ent wdt:P1342 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["In a prefectural assembly, how many seats are there?"],"info":{}}
{"id":"train_2858","question":"When did Nicolas Jean-de-Dieu Soult gain the position of head of France's government?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q296023 p:P39 ?s . ?s ps:P39 wd:Q15135541 . ?s pq:P580 ?value }","paraphrases":["On what date did Nicolas Jean-de-Dieu Soult become the head of France's govenment?"],"info":{}}
{"id":"train_2859","question":"How does the heart connect with arteries in the human body?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1072 wdt:P2789 wd:Q9655 . wd:Q1072 wdt:P2789 wd:Q23852 }","paraphrases":["How do the arteries in the human body connect with the heart?"],"info":{}}
{"id":"train_2860","question":"When will United States Representative, Jeanette Rankin's, term end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q232407 p:P39 ?s . ?s ps:P39 wd:Q13218630 . ?s pq:P582 ?value }","paraphrases":["When will the term of Jeanette Rankin, United States Representative, end?"],"info":{}}
{"id":"train_2861","question":"The memory capacity of the Nokia X is 409.6, correct?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q15299648 wdt:P2928 ?obj filter ( ?obj = 409.6 ) }","paraphrases":["Is the memory capacity of the Nokia X 409.6>"],"info":{}}
{"id":"train_2863","question":"Was the number of casualties of the King's Cross fire equal to 100?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q58395 wdt:P1590 ?obj filter ( ?obj = 100 ) }","paraphrases":["Did 100 people die during the King's Cross Fire?"],"info":{}}
{"id":"train_2864","question":"When did Vicente Guerroro end his time as President of Mexico?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q315618 p:P39 ?s . ?s ps:P39 wd:Q628004 . ?s pq:P582 ?value }","paraphrases":["What date was the end of Vincete Guerroro's term as President of Mexico?"],"info":{}}
{"id":"train_2865","question":"What is the taxonomic rank of the blue whale?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q42196 wdt:P105 ?obj . ?obj wdt:P31 wd:Q427626 }","paraphrases":[],"info":{}}
{"id":"train_2866","question":"Which government enterprise operates Airbus A330s?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P121 wd:Q6478 . ?sbj wdt:P31 wd:Q270791 }","paraphrases":[],"info":{}}
{"id":"train_2867","question":"What international association football clubs cup uses the UEFA Champions League Anthem and starts with the letter \"c\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34542757 . ?sbj wdt:P85 wd:Q1453101 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What worldwide affiliation football clubs glass utilizes the UEFA Champions League Anthem and begins with the letter \"c\"?"],"info":{}}
{"id":"train_2868","question":"Which is the chronology which starts with the letter t?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q130788 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the chronology which begins with the letter t?"],"info":{}}
{"id":"train_2869","question":"When did Pau Gasol receive the gold Medal of Work Merit in Spain?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q193052 p:P166 ?s . ?s ps:P166 wd:Q39946570 . ?s pq:P585 ?value }","paraphrases":["When did Pau Gasol get the gold Decoration of Work Justify in Spain?"],"info":{}}
{"id":"train_2871","question":"Did Al Capone follow the religious beliefs of the Meikite Greek Catholic Church?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q80048 wdt:P140 wd:Q64885 }","paraphrases":["Were Al Capone's religious beliefs that of the Meikite Greek Catholic Church?"],"info":{}}
{"id":"train_2873","question":"Dilma Rousseff received what award in the year 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q40722 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["In 2015, what award did Dilma Rousseff receive?"],"info":{}}
{"id":"train_2874","question":"Tell me the mathematical model that contains the word theory in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q486902 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'theory' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the numerical demonstrate that contains the word hypothesis in their name"],"info":{}}
{"id":"train_2877","question":"Is the minimal incubation period of Ebola in humans more or less than 1.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q51993 wdt:P3488 ?obj filter ( ?obj < 1.6 ) }","paraphrases":["Is the negligible brooding period of Ebola in people more or less than 1.6?"],"info":{}}
{"id":"train_2878","question":"What is ForaDeJogo ID for Eusébio ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q162043 wdt:P3046 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2879","question":"I want to know what are the characters from the most famous book Wolfgang Amadeus Mozart?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q254 wdt:P800 ?X . ?X wdt:P674 ?answer }","paraphrases":["I need to know what are the characters from the foremost popular book Wolfgang Amadeus Mozart?"],"info":{}}
{"id":"train_2880","question":"What was Angela Markel's academic degree and doctoral thesis at the German Academy of Sciences at Berlin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q567 p:P69 ?s . ?s ps:P69 wd:Q49738 . ?s pq:P512 ?value1 . ?s pq:P1026 ?value2 }","paraphrases":["What was the academic and doctoral thesis of Angela Markel at Berlin's German Academy of Sciences?"],"info":{}}
{"id":"train_2881","question":"Who was Gale Sondergaard married to until 1971-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q233845 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1971' ) ) }","paraphrases":["Having his married finished on 1971-1-1, who was Gale Sondergarrd?"],"info":{}}
{"id":"train_2882","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q42365 . ?sbj wdt:P31 wd:Q7725634 }","paraphrases":["n/a"],"info":{}}
{"id":"train_2883","question":"What did The Garden of Earthly Delights depict of Iconclass notation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q321303 wdt:P1257 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2884","question":"tell  me American football team that home venue Lambeau Field  name has the  the word bay in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17156793 . ?sbj wdt:P115 wd:Q860790 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'bay' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tell me American soccer group that domestic venue Lambeau Field title has the the word bay in it"],"info":{}}
{"id":"train_2885","question":"What is extended from and written by The Man with Two Faces?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7750132 wdt:P144 ?X . ?X wdt:P50 ?answer }","paraphrases":["What is expanded from and composed by The Man with Two Faces?"],"info":{}}
{"id":"train_2887","question":"What is the numeric writing system that starts with the letter 'n'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q140774 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the numerical writing system starting with the letter ' n'?'"],"info":{}}
{"id":"train_2888","question":"What is the compulsory education minimum for the Indian reservation of Telangana?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q677037 wdt:P131 ?answer . ?answer wdt:P3270 ?x FILTER ( contains ( ?x , '6.0' ) ) }","paraphrases":["What is the obligatory training minimal for the Indian reservation of Telangana?"],"info":{}}
{"id":"train_2889","question":"Name the G-type major prioritized star body in the Uranus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P398 wd:Q324 . ?sbj wdt:P31 wd:Q5864 }","paraphrases":["Title the G-type major prioritized star body within the Uranus"],"info":{}}
{"id":"train_2890","question":"Who is the {religious identity} for {manifestation of} of {atheism}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1557 wd:Q7066 . ?sbj wdt:P31 wd:Q4392985 }","paraphrases":["Who is the {devout personality} for {appearance of} of {secularism}"],"info":{}}
{"id":"train_2892","question":"What medication would you use as a drug to treat asthma?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q35869 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q12140 }","paraphrases":["In the treatment of asthma, what medication would you use?"],"info":{}}
{"id":"train_2893","question":"What is the name of the ranch where Ronald Reagan lived?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9960 wdt:P551 ?obj . ?obj wdt:P31 wd:Q509028 }","paraphrases":["What was the ranch Ronald Reagan lived on called?"],"info":{}}
{"id":"train_2894","question":"Who is the {local coat of arms} for {coat of arms} of {Jerusalem}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1218 wdt:P237 ?obj . ?obj wdt:P31 wd:Q480260 }","paraphrases":["Who is the {nearby coat of arms} for {coat of arms} of {Jerusalem}"],"info":{}}
{"id":"train_2895","question":"What company operates and manufactures Airbus_A380?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q5830 wdt:P137 ?ans_1 . wd:Q5830 wdt:P176 ?ans_2 }","paraphrases":["Who is the operating manufacturer of the Airbus A380?"],"info":{}}
{"id":"train_2896","question":"When did Rachel Carson receive the Presidential Medal of Freedom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q100948 p:P166 ?s . ?s ps:P166 wd:Q17144 . ?s pq:P585 ?value }","paraphrases":["When was the Presidential Medal of Freedom given to Rachel Carson?"],"info":{}}
{"id":"train_2897","question":"What { partner } of { Kirsten Dunst } is { start time } { 2002 - 0 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q76478 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["Give me the name of the { partner } of {Kristen Dunst } with {start time } {2002 - 0 }."],"info":{}}
{"id":"train_2898","question":"Which chemical tanker has the largest payload mass?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15254 . ?ent wdt:P4519 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which chemical tanker has the greatest weight of payload?"],"info":{}}
{"id":"train_2899","question":"What is  the twin town of Chiba that has  shires in Shengze?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170616 wdt:P190 ?answer . ?answer wdt:P150 wd:Q13821942 }","paraphrases":["What is Chiba's twin town with shires in Shengze?"],"info":{}}
{"id":"train_2900","question":"What tournament takes place in Indore?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P276 wd:Q66616 . ?sbj wdt:P31 wd:Q17299750 }","paraphrases":["What competition takes put in Indore?"],"info":{}}
{"id":"train_2901","question":"What isn't of Dave March's thats biological sex is male?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q753476 wdt:P1889 ?answer . ?answer wdt:P21 wd:Q6581097 }","paraphrases":["What isn't of Dave March's thats organic sex is male?"],"info":{}}
