{"id":"train_9900","question":"Which is the animation technique of the facet of 3D animation software and contains the word animation in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3516833 . ?sbj wdt:P1269 wd:Q23442766 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'animation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the activity method of the feature of 3D movement program and contains the word activity in it's name?"],"info":{}}
{"id":"train_9903","question":"what career did newton Morton choice.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20984526 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["what career did newton Morton choice."],"info":{}}
{"id":"train_9904","question":"What is part of the administrative unit of Cascade Range, which includes the rural cities of Wahkiakum County?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4558 wdt:P131 ?answer . ?answer wdt:P150 wd:Q484015 }","paraphrases":["What is portion of the authoritative unit of Cascade Extend, which incorporates the rustic cities of Wahkiakum County?"],"info":{}}
{"id":"train_9905","question":"Who is the {anion} for {conjugate base} of {sulfate ion}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4149 wd:Q172290 . ?sbj wdt:P31 wd:Q107968 }","paraphrases":["Who is the {anion} for {conjugate base} of {sulfate particle}"],"info":{}}
{"id":"train_9906","question":"When did series of Star Wars Episode V: The Empire Strikes Back and follows?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q181795 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["When did arrangement of Star Wars Scene V: The Realm Strikes Back and follows?"],"info":{}}
{"id":"train_9907","question":"With states of the Golyanovo District, what is the seat of the KGB?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q80919 wdt:P159 ?answer . ?answer wdt:P150 wd:Q2365753 }","paraphrases":["With states of the Golyanovo Area, what is the situate of the KGB?"],"info":{}}
{"id":"train_9908","question":"How many {lot range} are to/by {Atlas Quite a little } ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P4552 wd:Q130135 }","paraphrases":["Which is the number of lot ranges at Atlas Quite a little?"],"info":{}}
{"id":"train_9913","question":"Conjugate base of sulfate ion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4149 wd:Q172290 }","paraphrases":[],"info":{}}
{"id":"train_9914","question":"Which is the nation of Nineteen Eighty-Four for present work of the Nineteen Eighty-Four?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q208460 . ?sbj wdt:P31 wd:Q14752002 }","paraphrases":[],"info":{}}
{"id":"train_9915","question":"what is day in year for periodic occurrence for easter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P837 wd:Q21196 }","paraphrases":[],"info":{}}
{"id":"train_9920","question":"Tell me about the river located in or next to body of water in Munich.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1726 wdt:P206 ?obj . ?obj wdt:P31 wd:Q4022 }","paraphrases":[],"info":{}}
{"id":"train_9921","question":"What was the epidemic in Sierra Leone that had the least number of cases?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q44512 . ?ent wdt:P1603 ?obj . ?ent wdt:P17 wd:Q1044 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What epidemic had the least number of cases in Sierra Leone?"],"info":{}}
{"id":"train_9922","question":"What character in Ben-Hur was played by the voice actor Jean-Claude Michel?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q180098 p:P725 ?s . ?s ps:P725 wd:Q3165115 . ?s pq:P453 ?value }","paraphrases":["Jean Claude Michel played what character in Ben-Hur?"],"info":{}}
{"id":"train_9924","question":"What commandment starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1497090 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What commandment begins with the letter \"t\"?"],"info":{}}
{"id":"train_9926","question":"Who is the life partner of the brother Janet Auchincloss Rutherfurd?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10305226 wdt:P3373 ?X . ?X wdt:P26 ?answer }","paraphrases":["Who is the life associate of the brother Janet Auchincloss Rutherfurd?"],"info":{}}
{"id":"train_9927","question":"What are the {signs} that {led to} {Aldrin}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q409054 wdt:P1542 ?X . ?X wdt:P780 ?answer }","paraphrases":["What are the {signs} that {driven to} {Aldrin}?"],"info":{}}
{"id":"train_9929","question":"What is the alphabet of Sumeria that has been discovered by Sumerians?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36790 wdt:P282 ?answer . ?answer wdt:P61 wd:Q656043 }","paraphrases":["What is the Sumerian alphabet that the Sumerians discovered?"],"info":{}}
{"id":"train_9931","question":"When did Óscar de la Renta Fiallo have citizenship in the Dominican Republic?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q288029 p:P27 ?s . ?s ps:P27 wd:Q786 . ?s pq:P580 ?value }","paraphrases":["When did Óscar de la Renta Fiallo received citizenship in the Dominican Republic?"],"info":{}}
{"id":"train_9932","question":"What is the desired interest rate of the Federal Reserve?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q53536 wdt:P2661 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9933","question":"Tell me who translated the Tractatus Logico-Philosophicus.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q655717 wdt:P655 ?X . ?X wdt:P101 ?answer }","paraphrases":["By whom is the Tractatus Logico-Philosophicus translated?"],"info":{}}
{"id":"train_9935","question":"Amtrak operates which train service?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q23239 wdt:P121 ?obj . ?obj wdt:P31 wd:Q15141321 }","paraphrases":["Amtrak works which train administration?"],"info":{}}
{"id":"train_9936","question":"When did Allen Iverson begin playing for the Philadelphia 76ers?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q190094 p:P54 ?s . ?s ps:P54 wd:Q138089 . ?s pq:P580 ?value }","paraphrases":["At what time did Allen Iverson begin playing for the Philadelphia 76ers?"],"info":{}}
{"id":"train_9938","question":"Tell me the musical duo that contains the word yazoo in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9212979 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yazoo' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the musical duet in their name that contains the word yazoo"],"info":{}}
{"id":"train_9939","question":"Name the tributary that flows form the harbour at Guangzhou","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16572 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["What is the tributary flowing from Guangzhou harbour?"],"info":{}}
{"id":"train_9940","question":"What is the rank of food made from artichoke?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23041430 wdt:P1582 ?X . ?X wdt:P105 ?answer }","paraphrases":["How was food made using artichoke ranked?"],"info":{}}
{"id":"train_9941","question":"how much facet is needed for gravity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q11412 wdt:P1269 ?obj }","paraphrases":["What amount of facet is required for gravity?"],"info":{}}
{"id":"train_9942","question":"What position did  Valery Giscard d'Estaing hold on 5-21-1989?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2124 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1981' ) ) }","paraphrases":["On May 21, 1989, what role did Valery Giscard d'Estaing have?"],"info":{}}
{"id":"train_9943","question":"Who are the inhabitants of the sovereign state of Ulhasnagar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q460222 wdt:P17 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Who are the occupants of the imperial state of Ulhasnagar?"],"info":{}}
{"id":"train_9946","question":"Is it true that the compulsory education for the minimum age in Hungary equals to 3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28 wdt:P3270 ?obj filter ( ?obj = 3 ) }","paraphrases":["Is 3 the minimum age for compulsory education in Hungary?"],"info":{}}
{"id":"train_9947","question":"When did Tokyo become the twin city of Moscow?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1490 p:P190 ?s . ?s ps:P190 wd:Q649 . ?s pq:P580 ?value }","paraphrases":["Tell me when Tokyo became Moscow's twin city."],"info":{}}
{"id":"train_9948","question":"What is the narrative time described by the work of William Weatherall Wilkins?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27477095 wdt:P1441 ?X . ?X wdt:P2408 ?answer }","paraphrases":["Give me the name of  narrative time explained by the work of William Weatherall Wilkins"],"info":{}}
{"id":"train_9949","question":"When did Pierre-Auguste Renoir end his residence in Limoges?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q39931 p:P551 ?s . ?s ps:P551 wd:Q45656 . ?s pq:P582 ?value }","paraphrases":["On what date did Pierre-Auguste Renoir discontinue his stay in Limoges?"],"info":{}}
{"id":"train_9950","question":"Where did Artemisia Gentileschi work on 1-1-1610?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q212657 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1610' ) ) }","paraphrases":["On which place Artemisia Gentileschi work on 1-1-1610?"],"info":{}}
{"id":"train_9951","question":"Which was the working place established by Eric Johnston?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5386837 wdt:P108 ?X . ?X wdt:P112 ?answer }","paraphrases":["Which was the working put built up by Eric Johnston?"],"info":{}}
{"id":"train_9952","question":"who deity in fictional work for sibling of wonder woman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q338430 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q17624054 }","paraphrases":["who god in anecdotal work for kin of ponder woman?"],"info":{}}
{"id":"train_9954","question":"What is located on the Southern Alps island at a geolocation of -43.9833?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q206650 wdt:P5130 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-43.9833' ) ) }","paraphrases":["What is located on the Southern Alps island at a geolocation of -43.9833?"],"info":{}}
{"id":"train_9955","question":"What is the website for E.M. Forster?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q189119 wdt:P1896 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9958","question":"What is butane's upper flammable limit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q134192 wdt:P2203 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9959","question":"For what John O.Aalberg was nominated for in It's a Wonderful Life?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q204191 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q1699086 }","paraphrases":["Which award was John O. Aalberg short-listed for in It's a Wonderful Life?"],"info":{}}
{"id":"train_9961","question":"What is the Revised Hepburn romanization for Jun Maeda, name in native language as 麻枝 准?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q683407 p:P1559 ?s . ?s ps:P1559 ?x filter ( contains ( ?x , '麻枝 准' ) ) . ?s pq:P2125 ?value }","paraphrases":["The Revised Hepburn romanization of Jun Maeda is what?"],"info":{}}
{"id":"train_9963","question":"is it true that the HD 113538 c of the M sin i equals 0.36?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1252981 wdt:P2051 ?obj filter ( ?obj = 0.36 ) }","paraphrases":["Can you tell me if .36 is what the HD 113538 c of the M sin I equals?"],"info":{}}
{"id":"train_9964","question":"What books did Charles Dickens write?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5686 wdt:P1455 ?obj . ?obj wdt:P31 wd:Q1631107 }","paraphrases":["Charles Dickens wrote which books?"],"info":{}}
{"id":"train_9970","question":"When did educated at of Robert J. Shiller and academic degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q338151 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["When did taught at of Robert J. Shiller and scholastic degree?"],"info":{}}
{"id":"train_9971","question":"WHICH IS THE MOTIVATION PARTY OF WARSAW PACT INVASION OF CZECHOSLOVAKIA","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1773668 wdt:P710 ?X . ?X wdt:P1451 ?answer }","paraphrases":["WHICH IS THE Inspiration PARTY OF WARSAW Agreement Intrusion OF CZECHOSLOVAKIA"],"info":{}}
{"id":"train_9972","question":"What is the percentage of people that died on March 22nd, 1798?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5448002 wdt:P127 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( YEAR ( ?x ) , '1798' ) ) }","paraphrases":["What is the percentage of people on March 22, 1798 who died?"],"info":{}}
{"id":"train_9973","question":"What is Assam's legislative and executive body?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1164 wdt:P194 ?ans_1 . wd:Q1164 wdt:P208 ?ans_2 }","paraphrases":["Name the legislative and executive body of Assam."],"info":{}}
{"id":"train_9975","question":"When was The Matrix awarded the National Film Registry?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q83495 p:P166 ?s . ?s ps:P166 wd:Q823422 . ?s pq:P585 ?value }","paraphrases":["When was The Matrix inducted into the National Film Registry?"],"info":{}}
{"id":"train_9977","question":"What is the academic major of Charles Laughton at Royal Academy of Dramatic Art and when did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q55264 p:P69 ?s . ?s ps:P69 wd:Q523926 . ?s pq:P812 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["While attending the Royal Academy of Dramatic Art what was Charles Laughton's Major and what was the date that he finished?"],"info":{}}
{"id":"train_9980","question":"What is the literary work that stars The Cider House Rules?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q648977 wdt:P161 ?X . ?X wdt:P800 ?answer }","paraphrases":["What is the scholarly work that stars The Cider House Rules?"],"info":{}}
{"id":"train_9981","question":"When was Jean Renoir nominated for the BAFTA Award for Best Film?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q50713 p:P1411 ?s . ?s ps:P1411 wd:Q139184 . ?s pq:P585 ?value }","paraphrases":["Tell me the year Jean Renoir notimated for the BAFTA Award for Best Film."],"info":{}}
{"id":"train_9982","question":"In 1943, Alf Ramsey was member of which sports team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q311029 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1943' ) ) }","paraphrases":["In 1943, Alf Ramsey was an individual from which sports team?"],"info":{}}
{"id":"train_9983","question":"Is it true that the fiscal/tax revenue of Daguioman is less than 40873085.264?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28044 wdt:P3087 ?obj filter ( ?obj < 40873085.264 ) }","paraphrases":["Is 40873085.264 greater than the fiscal/tax revenue of Daguioman?"],"info":{}}
{"id":"train_9984","question":"What is the trend studied by Dardanus of Athens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2661420 wdt:P1066 ?X . ?X wdt:P135 ?answer }","paraphrases":["Mention the trend worked at by Dardanus of Athens."],"info":{}}
{"id":"train_9985","question":"Which greek deity appears as Artemis","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4675 wd:Q39503 . ?sbj wdt:P31 wd:Q22989102 }","paraphrases":["What greek god appears as Artemis?"],"info":{}}
{"id":"train_9987","question":"What actor in Downtown Abbey is of male gender?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83071 wdt:P161 ?answer . ?answer wdt:P21 wd:Q6581097 }","paraphrases":["Who was the male actor in Downtown Abbey"],"info":{}}
{"id":"train_9988","question":"Please tell me the number of games and goals scored by John Charles of the Hereford United F.C.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q312404 p:P54 ?s . ?s ps:P54 wd:Q18516 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["Please inform me the variety of games and dreams scored with the aid of John Charles of the Hereford United F.C."],"info":{}}
{"id":"train_9991","question":"What award did Bobby Darin receive in the year 1960?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q311267 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1960' ) ) }","paraphrases":["Name the award received by Bobby Darin in 1960?"],"info":{}}
{"id":"train_9992","question":"Who was the spouse of Gower Champion in 1973?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3112833 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1973' ) ) }","paraphrases":["In 1973, what was the name of the Gower Champion's spouse?"],"info":{}}
{"id":"train_9993","question":"For what was Adam Levine of Maroon 5 nominated for at the 2019 Grammy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q203871 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["Adam Levine (Maroon 5) was nominated for what at the 2019 Grammys?"],"info":{}}
{"id":"train_9994","question":"Who is the first minister of Hama?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q173545 wdt:P190 ?X . ?X wdt:P6 ?answer }","paraphrases":["Give me the name of the first minister of Hama."],"info":{}}
{"id":"train_9995","question":"which railway company in transport have least operating income?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q249556 . ?ent wdt:P3362 ?obj . ?ent wdt:P452 wd:Q3565868 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Name the railway company that has the lowest income."],"info":{}}
{"id":"train_9996","question":"What is Judaism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P140 wd:Q9268 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is Judaism?"],"info":{}}
{"id":"train_9997","question":"Tell me about member of sports team of Lionel Messi and number of matches played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q615 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["Tell me about member of sports crew of Lionel Messi and quantity of fits played?"],"info":{}}
{"id":"train_9999","question":"What is the  material  developed by McAfee VirusScan ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1629915 wdt:P178 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What material did McAfee VirusScan develop?"],"info":{}}
{"id":"train_10000","question":"What is the Gaming-history identifier of Xbox?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q132020 wdt:P4806 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10002","question":"when did Minduagas happened in 1251-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q242436 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1251' ) ) }","paraphrases":["When did Minduagas occur?"],"info":{}}
{"id":"train_10003","question":"Where did Akhenaten die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q81794 wdt:P20 ?obj . ?obj wdt:P31 wd:Q755017 }","paraphrases":["Where was the death of Akhenaten?"],"info":{}}
{"id":"train_10008","question":"Who was the head of government of Poznań in 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q268 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["Give me the name of the person who headed government of Poznań in 2014?"],"info":{}}
{"id":"train_10009","question":"Which is the French National Assembly Lobbyist ID for SNCF?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q13646 wdt:P3281 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10010","question":"What is the { time point } for { Peter Jennings } as { Disney Legends }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q354540 p:P166 ?s . ?s ps:P166 wd:Q1150306 . ?s pq:P585 ?value }","paraphrases":["When did Peter Jennings become a Disney Legend?"],"info":{}}
{"id":"train_10012","question":"Please tell me the number of games played and sets scored by Roberto Carlos when he was a member of Fenerbahçe football team.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q429039 p:P54 ?s . ?s ps:P54 wd:Q6601875 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["If it's not too much trouble let me know the number of diversions played and sets scored by Roberto Carlos when he was a part of Fenerbahçe football group."],"info":{}}
{"id":"train_10014","question":"What is the dredger with the highest payload mass?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5810820 . ?ent wdt:P4519 ?obj . ?ent wdt:P31 wd:Q5810820 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What's the highest payload mass dredger?"],"info":{}}
{"id":"train_10015","question":"What is the career of Andrzej Boguslawski that has Q48460 and is 410.92?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4759583 wdt:P106 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '410.92' ) ) }","paraphrases":["What is the career of Andrzej Boguslawski that has Q48460 and is 410.92?"],"info":{}}
{"id":"train_10016","question":"What is the post of Clement Attlee and when he was sworn in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q129006 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What is the post of Compassionate Attlee and when he was sworn in?"],"info":{}}
{"id":"train_10017","question":"Tell me the road bridge which contains the word viaduct in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q537127 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'viaduct' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the street bridge which contains the word viaduct in it's name?"],"info":{}}
{"id":"train_10018","question":"What country in the Western Hemisphere has a village named Ingeniero Moneta?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35798 wdt:P1001 ?answer . ?answer wdt:P150 wd:Q16302002 }","paraphrases":["Which country has a village called Ingeniero Moneta in the Western Hemisphere?"],"info":{}}
