{"id":"train_12322","question":"Andrew Fisher is the head of how many governments?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P6 wd:Q314016 }","paraphrases":["How many governments is Andrew Fisher head of?"],"info":{}}
{"id":"train_12324","question":"How many different forms of murder are there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1889 wd:Q132821 }","paraphrases":["What is the total number of types of murders?"],"info":{}}
{"id":"train_12325","question":"When did Louis Beel become Prime Minister of the Netherlands?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q55 p:P6 ?s . ?s ps:P6 wd:Q735519 . ?s pq:P580 ?value }","paraphrases":["Louis Beel became Prime Minister of the Netherlands when?"],"info":{}}
{"id":"train_12326","question":"What is McKesson Corporation subsidiary portion that is 75.9?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q570473 p:P355 ?s . ?s ps:P355 ?obj . ?s pq:P1107 ?x filter ( contains ( ?x , '75.9' ) ) }","paraphrases":["What portion of the McKesson Corporation subsidiary is 75.9?"],"info":{}}
{"id":"train_12329","question":"Which is the jurisdiction that applies to the jurisdiction of the Member states of the United Nations and that contains the word council in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q471855 . ?sbj wdt:P1001 wd:Q160016 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'council' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the ward that applies to the ward of the Part states of the Joined together Countries which contains the word committee in it's name?"],"info":{}}
{"id":"train_12330","question":"What is the taxon source of the coral's body?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1672 wd:Q171446 . ?sbj wdt:P31 wd:Q16521 }","paraphrases":["What is the coral's coral's taxon source?"],"info":{}}
{"id":"train_12331","question":"Where did Dietrich Bonhoeffer get educated starting in 1923?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q76326 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1923' ) ) }","paraphrases":["In 1923, where did Dietrich Bonhoeffer go to school?"],"info":{}}
{"id":"train_12332","question":"Who are the cast members of Die Hard","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q105598 wdt:P161 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who are Die Hard's cast members?"],"info":{}}
{"id":"train_12333","question":"Which is etymology of Planck length, that plays piano?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207387 wdt:P138 ?answer . ?answer wdt:P1303 wd:Q5994 }","paraphrases":["Which is historical underpinnings of Planck length, that plays piano?"],"info":{}}
{"id":"train_12334","question":"What is in the category competition of Wladimir Klitschko ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q18797 wdt:P2094 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12335","question":"What happens in the college that Roberto Bergersen attended?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3436845 wdt:P69 ?X . ?X wdt:P131 ?answer }","paraphrases":["What occurs in the school that Roberto Bergersen visited?"],"info":{}}
{"id":"train_12336","question":"Is the number of spans of the Talbot Memorial Bridge more than 3.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q304582 wdt:P1314 ?obj filter ( ?obj > 3.6 ) }","paraphrases":["Is the number of ranges of the Talbot Dedication Bridge more than 3.6?"],"info":{}}
{"id":"train_12337","question":"wich means{facet of} in {history of Japan} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1269 wd:Q130436 }","paraphrases":[],"info":{}}
{"id":"train_12339","question":"When did Salvador have the population of 2.44311e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36947 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '2.44311e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["In what year did El Salvador have a population of 2,443,110?"],"info":{}}
{"id":"train_12340","question":"Which is {target} of {article} {COMINFIL} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1023998 wdt:P805 ?X . ?X wdt:P533 ?answer }","paraphrases":["Which is {target} of {article} {COMINFIL} ?"],"info":{}}
{"id":"train_12342","question":"Is the Spherical vase with a raised mouth (DP 0123) have a horizontal depth which is smaller than 35.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q59390762 wdt:P5524 ?obj filter ( ?obj < 35.2 ) }","paraphrases":["Does the round vase have a width which is less than 35.2?"],"info":{}}
{"id":"train_12344","question":"What is the first name of John Lothrop Motley, that is the equivalent of Gianni?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q689281 wdt:P735 ?answer . ?answer wdt:P460 wd:Q18393856 }","paraphrases":["What is the first title of John Lothrop Motley, that is the equal of Gianni?"],"info":{}}
{"id":"train_12345","question":"How many Targets are by banks?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P533 wd:Q22687 }","paraphrases":["Banks have how many targets?"],"info":{}}
{"id":"train_12346","question":"Are Tom Brady and Cam Newton quarterbacks?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q313381 wdt:P413 wd:Q591678 }","paraphrases":["Tell me whether Tom Brady and Cam Newton are quarterbacks"],"info":{}}
{"id":"train_12347","question":"Which is the Zee Cine Awards for the winner of Anil Kapoor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1346 wd:Q313956 . ?sbj wdt:P31 wd:Q184349 }","paraphrases":["Which is the Zee Cine Grants for the champ of Anil Kapoor?"],"info":{}}
{"id":"train_12348","question":"What is the  Dana 8th edition of halite ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q5314 wdt:P714 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12350","question":"What language replaced Middle English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q36395 wdt:P1366 ?obj . ?obj wdt:P31 wd:Q34770 }","paraphrases":["What dialect supplanted Center English?"],"info":{}}
{"id":"train_12352","question":"What is in the voivodeship of canals of Amsterdam, that has Q48460 is 2--492352?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q340013 wdt:P131 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '2--492352' ) ) }","paraphrases":["What is in the voivodeship of canals of Amsterdam, that has Q48460 is 2--492352?"],"info":{}}
{"id":"train_12353","question":"does the ridmit nimdia elo rating equal to 1322?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7332994 wdt:P1087 ?obj filter ( ?obj = 1322 ) }","paraphrases":["Is the ridmit nimdia elo's rating 1322?"],"info":{}}
{"id":"train_12357","question":"Who was born in Wem and starred in The Hitchhiker's Guide to the Galaxy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3521267 wdt:P161 ?answer . ?answer wdt:P19 wd:Q301082 }","paraphrases":["Who was born in Wem and featured within The Hitchhiker's Direct to the Galaxy?"],"info":{}}
{"id":"train_12359","question":"What what is ethnic group  native language Indigenous languages of the Americas and also which starts with letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41710 . ?sbj wdt:P103 wd:Q51739 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the ethnic group native language of the Americas and what begins with letter c"],"info":{}}
{"id":"train_12362","question":"Does the total valid votes of the Catalan regional election in 2015 equal 230.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44999074 wdt:P1697 ?obj filter ( ?obj = 230.4 ) }","paraphrases":["Does the whole substantial votes of the Catalan territorial race in 2015 rise to 230.4?"],"info":{}}
{"id":"train_12364","question":"How many papers drafted by Montreal Canadiens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P647 wd:Q188143 }","paraphrases":["Montreal Canadiens drafted how many papers?"],"info":{}}
{"id":"train_12366","question":"What is Wednesday in Welsh?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q128 p:P138 ?s . ?s ps:P138 ?obj . ?s pq:P407 wd:Q9309 }","paraphrases":["How do you say Wednesday in Welsh?"],"info":{}}
{"id":"train_12367","question":"When did Armenia become a member of the World Trade Organization?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q399 p:P463 ?s . ?s ps:P463 wd:Q7825 . ?s pq:P580 ?value }","paraphrases":["When did Armenia join the World Trade Organization?"],"info":{}}
{"id":"train_12368","question":"What was the pre-Gregorian calendar birth date of Xenophon?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q129772 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["What was Xenophon's birthday before the Gregorian calendar?"],"info":{}}
{"id":"train_12369","question":"Who are Timur's child and father?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q8462 wdt:P22 ?ans_1 . wd:Q8462 wdt:P40 ?ans_2 }","paraphrases":["Who is the child and father of Timur?"],"info":{}}
{"id":"train_12370","question":"Which is the protein that is encoded by INS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P702 wd:Q21163221 . ?sbj wdt:P31 wd:Q8054 }","paraphrases":["Which is the protein that's encoded by INS?"],"info":{}}
{"id":"train_12372","question":"What was the population of Aalborg on January 1, 2012?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q25410 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2012' ) ) }","paraphrases":["How many people lived in Aalborg on January 1, 2012?"],"info":{}}
{"id":"train_12373","question":"Is it true Herbert Marcuse and Friedrich Engels were founders of Marxism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7264 wdt:P61 wd:Q60030 . wd:Q7264 wdt:P61 wd:Q34787 }","paraphrases":["Did Herbert Marcuse and Friedrich Engels found Marxism?"],"info":{}}
{"id":"train_12376","question":"Does Harvard University's Endowment equal 39,200,000,000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13371 wdt:P6589 ?obj filter ( ?obj = 39200000000 ) }","paraphrases":["Does 39,200,000,000 equal the Harvard University's Endowment?"],"info":{}}
{"id":"train_12377","question":"Is the frequency of the BorWin alpha equal to 0.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q823183 wdt:P2144 ?obj filter ( ?obj = 0.0 ) }","paraphrases":["Is the BorWin alpha frequency equal to 0.0?"],"info":{}}
{"id":"train_12379","question":"Is the beer color of India Pale Ale more than 8.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1543214 wdt:P6089 ?obj filter ( ?obj > 8.0 ) }","paraphrases":["Is 8.0 less than the beer color of India Pale Ale?"],"info":{}}
{"id":"train_12380","question":"When did All Nippon Airways start using Boeing 767?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q204284 p:P121 ?s . ?s ps:P121 wd:Q6423 . ?s pq:P580 ?value }","paraphrases":["From what day did the Boeing 767 start being used by All Nippon Airways?"],"info":{}}
{"id":"train_12381","question":"which is instance of tablet computer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P31 wd:Q155972 }","paraphrases":[],"info":{}}
{"id":"train_12382","question":"What work of Frank Matcham that is located at coordinates 51.5149 -0.140806?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1443739 wdt:P800 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '51.5149 -0.140806' ) ) }","paraphrases":["What work of Frank Matcham that is located at coordinates 51.5149 -0.140806?"],"info":{}}
{"id":"train_12384","question":"What was Faroe Island's population in 2004?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4628 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["Faroes Island population in 2004 was what?"],"info":{}}
{"id":"train_12387","question":"Which characters are in Star Wars Episode V: The Empire Strikes Back?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q181795 . ?sbj wdt:P31 wd:Q15831596 }","paraphrases":["Which characters are in Star Wars Scene V: The Domain Strikes Back?"],"info":{}}
{"id":"train_12388","question":"Is the area of Vilshana-Slobidka equal to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4334372 wdt:P2046 ?obj filter ( ?obj = 0 ) }","paraphrases":["Does Vilshana-Slobidka equal 0 area?"],"info":{}}
{"id":"train_12390","question":"Who is Jane Fonda's spouse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41142 wdt:P451 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Jane Fonda's husband?"],"info":{}}
{"id":"train_12392","question":"What is the independence referendum with the most votes received?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1219394 . ?ent wdt:P1111 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the autonomy submission with the foremost votes received?"],"info":{}}
{"id":"train_12393","question":"Tell me aircraft family whose name has the word wapiti in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15056993 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wapiti' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose  me aircraft family whose name has the word wapiti in it."],"info":{}}
{"id":"train_12394","question":"What disease is treated by niacin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q134658 wdt:P2175 ?obj . ?obj wdt:P31 wd:Q12136 }","paraphrases":["What disease does Niacin treat?"],"info":{}}
{"id":"train_12395","question":"Walnut is a material used by how many?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P186 wd:Q208021 }","paraphrases":["How many people use walnut material?"],"info":{}}
{"id":"train_12396","question":"Who owns YouTube as well as the parent agency Alphabet Inc?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q866 wdt:P127 ?answer . ?answer wdt:P749 wd:Q20800404 }","paraphrases":["Who owns both YouTube and parent agency Alphabet Inc?"],"info":{}}
{"id":"train_12398","question":"St. Joseph the patron saint of which municipality in Guatemala?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P417 wd:Q128267 . ?sbj wdt:P31 wd:Q1872284 }","paraphrases":["St. Joseph the supporter holy person of which region in Guatemala?"],"info":{}}
{"id":"train_12399","question":"Which is full work available at The Adventures of Tom Sawyer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q326914 wdt:P953 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12400","question":"When did William D. Becker stop being head of government for St. Louis?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q38022 p:P6 ?s . ?s ps:P6 wd:Q8007429 . ?s pq:P582 ?value }","paraphrases":["At what point was William D. Becker  no longer the head of government for St. Louis?"],"info":{}}
{"id":"train_12401","question":"What award did Harry Mulisch receive in 1993?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q927 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1993' ) ) }","paraphrases":["Harry Mulisch received which award in 1993?"],"info":{}}
{"id":"train_12402","question":"What are dog breed which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q39367 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are races of dogs starting with the letter w"],"info":{}}
{"id":"train_12403","question":"WHICH IS THE BRANCH OF PHYSICS THAT CONTAINS THE WORD THERMODYNAMICS IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4162444 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'thermodynamics' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE BRANCH OF PHYSICS THAT CONTAINS THE WORD THERMODYNAMICS IN THEIR NAME"],"info":{}}
{"id":"train_12405","question":"Who was a nominee for the Academy Award for Best Director?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q208632 p:P1411 ?s . ?s ps:P1411 wd:Q103360 . ?s pq:P2453 ?value }","paraphrases":["Who was nominated for Best Director?"],"info":{}}
{"id":"train_12406","question":"What { replaced } for { Livorno } has { head of government } like { Nicola Badaloni }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6761 p:P6 ?s . ?s ps:P6 wd:Q3876122 . ?s pq:P1366 ?value }","paraphrases":["Who replaced Nicola Badaloni as the Livorno head of state?"],"info":{}}
{"id":"train_12407","question":"How many official residences are in Los Angeles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P263 wd:Q65 }","paraphrases":["What is the number of official residences in Los Angeles?"],"info":{}}
{"id":"train_12408","question":"What is the starting time for Aleksandr Lyapunov who has educated as Saint Petersburg State University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q310788 p:P69 ?s . ?s ps:P69 wd:Q27621 . ?s pq:P580 ?value }","paraphrases":["What is the beginning time for Aleksandr Lyapunov who has taught as Holy person Petersburg State University?"],"info":{}}
{"id":"train_12409","question":"tell  me open content founded by Larry Sanger  starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1293664 . ?sbj wdt:P112 wd:Q185 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me open content founded by Larry Sanger begins with w"],"info":{}}
{"id":"train_12410","question":"How many goals scored and matches played did Robert Lewandowski achieve as a member of the Poland under-21 football team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q151269 p:P54 ?s . ?s ps:P54 wd:Q1780231 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["How numerous objectives scored and matches played did Robert Lewandowski accomplish as a part of the Poland under-21 football team?"],"info":{}}
{"id":"train_12413","question":"Who is the leader of the KGB?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P598 wd:Q80919 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the pioneer of the KGB?"],"info":{}}
{"id":"train_12414","question":"Tell me the birthday of the executive power of Hiroshima.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34664 wdt:P6 ?X . ?X wdt:P569 ?answer }","paraphrases":["Let me know the birthday of the official control of Hiroshima."],"info":{}}
{"id":"train_12415","question":"What is the Die Hard film series","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q105598 wdt:P179 ?obj . ?obj wdt:P31 wd:Q24856 }","paraphrases":["Tell me about the Die Hard movie series."],"info":{}}
{"id":"train_12416","question":"Who is {head of state} of {Umayyad Caliphate} whose is {end time} is {724-0-0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8575586 p:P35 ?s . ?s ps:P35 ?obj . ?s pq:P582 ?x filter ( contains ( ?x , '724-0-0' ) ) }","paraphrases":["Who is {head of state} of {Umayyad Caliphate} whose is {conclusion time} is {724-0-0} ?"],"info":{}}
{"id":"train_12417","question":"Who is the stadium operator for Clemson University","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P137 wd:Q631066 . ?sbj wdt:P31 wd:Q483110 }","paraphrases":["Give me the name of the stadium operator for Clemson University."],"info":{}}
{"id":"train_12421","question":"The United Nations Educational, Scientific and Cultural Organization was created by how many?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P170 wd:Q7809 }","paraphrases":["How many nations found United Nations Educational, Scientific and Cultural Organization ?"],"info":{}}
{"id":"train_12423","question":"which civil war starts with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8465 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which gracious war begins with the letter w"],"info":{}}
{"id":"train_12426","question":"Which city of the United States that is enclave within of Los Angeles.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P501 wd:Q65 . ?sbj wdt:P31 wd:Q1093829 }","paraphrases":["Which U.S. city is an enclave within Los Angeles."],"info":{}}
{"id":"train_12427","question":"What is the chrysanthemum taxonomic type?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q59882 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 }","paraphrases":["Into which taxonomic type would chrysanthemums be categorized?"],"info":{}}
{"id":"train_12429","question":"When did Valentina Tereshkova receive the Order of Lenin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q44371 p:P166 ?s . ?s ps:P166 wd:Q185493 . ?s pq:P585 ?value }","paraphrases":["When was the Order of Lenin awarded to Valentina Tereshkova?"],"info":{}}
{"id":"train_12431","question":"When was the study of Tuberculosis published and written by who?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q12204 wdt:P1433 ?ans_1 . wd:Q12204 wdt:P2579 ?ans_2 }","paraphrases":["Which author published the study of Tuberculosis and in what year?"],"info":{}}
{"id":"train_12434","question":"In what country is Sindh located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q37211 wdt:P131 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["Which country is Sindh in?"],"info":{}}
{"id":"train_12435","question":"what are the public holidays in awitzerland which start with the letter f","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q671354 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What Switzerland holidays starts with \"f\"?"],"info":{}}
{"id":"train_12436","question":"What country in the Russian empire  did Fyodor Dostoyevsky die in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q991 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q34266 }","paraphrases":["Fyodor Dostoyevsky died in what country in the Russian empire?"],"info":{}}
{"id":"train_12437","question":"Mention the supplementary award received by Bob Barker for MTV Movie Award for Best Fight besides the year in which he collected the prize.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q381178 p:P166 ?s . ?s ps:P166 wd:Q734036 . ?s pq:P1706 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["What award did Bob Barker win for the MTV Movie award for Best Fight?"],"info":{}}
