{"id":"train_1096","question":"What are the comics character which start with the letter viper","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1114461 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'viper' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE COMIC CHARACTER START WITH THE LETTER VIPER"],"info":{}}
{"id":"train_1098","question":"Who are the children and siblings of Alan Alda?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q310394 wdt:P3373 ?ans_1 . wd:Q310394 wdt:P40 ?ans_2 }","paraphrases":["Name the immediate family of Alan Alda."],"info":{}}
{"id":"train_1099","question":"How many sponsors are for Juventus F.C.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q1422 wdt:P859 ?obj }","paraphrases":["Which is the number of sponsors that are for Juventus F.C.?"],"info":{}}
{"id":"train_1100","question":"Does the elevation above sea level of the Beemster equal 4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9900 wdt:P2044 ?obj filter ( ?obj = -4 ) }","paraphrases":["Is 4 the number of feet Beemster is above sea level?"],"info":{}}
{"id":"train_1101","question":"Who is Nicole Richie's mother?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P25 wd:Q232495 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What women is Nicole Richie's mother?"],"info":{}}
{"id":"train_1102","question":"What is the type of procedure for the taxonomy of Durio","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2309085 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 }","paraphrases":["What is the sort of strategy for the scientific categorization of Durio"],"info":{}}
{"id":"train_1103","question":"Who is the  {political party} for {member of political party} of {Fidel Castro}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11256 wdt:P102 ?obj . ?obj wdt:P31 wd:Q7278 }","paraphrases":["What political party had Fidel Castro as a member?"],"info":{}}
{"id":"train_1104","question":"Which FPGA prototype open source hardware has the highest voltage?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q159172 . ?ent wdt:P2436 ?obj . ?ent wdt:P366 wd:Q5426992 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Tell me which FPGA prototype open source hardware has the highest voltage."],"info":{}}
{"id":"train_1105","question":"Name a basilica of the Italian Gothic architecture style that starst with letter D","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q120560 . ?sbj wdt:P149 wd:Q2245489 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a basilica of the Italian Gothic architecture fashion that starst with letter D"],"info":{}}
{"id":"train_1106","question":"What is in the  airline hub of Qantas ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q32491 wdt:P113 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1108","question":"Tell me public company whose name has the word yandex in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891723 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yandex' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know open company whose title has the word yandex in it."],"info":{}}
{"id":"train_1110","question":"Is the lighthouse range of South Channel Pile Light less than 2.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7566786 wdt:P2929 ?obj filter ( ?obj < 2.4 ) }","paraphrases":["Is the South Channel Pile Light's lighthouse range less than 2.4?"],"info":{}}
{"id":"train_1111","question":"What was Carol Ann Duffy nominated for in 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q237994 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["Which Nominations did Carol Anne Duffy for in 2011"],"info":{}}
{"id":"train_1112","question":"What genre of music is in the series titled Bound?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q50845803 wdt:P179 ?X . ?X wdt:P136 ?answer }","paraphrases":["What class of music is within the arrangement titled Bound?"],"info":{}}
{"id":"train_1113","question":"In 1939, what country did Marlene Dietrich become a citizen of?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4612 p:P27 ?s . ?s ps:P27 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1939' ) ) }","paraphrases":["Which country became a citizen of Marlene Dietrich in 1939?"],"info":{}}
{"id":"train_1114","question":"Which is the cuisine for the veganism cuisine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q181138 wdt:P2012 ?obj . ?obj wdt:P31 wd:Q1778821 }","paraphrases":["What food is used in a vegan diet?"],"info":{}}
{"id":"train_1115","question":"WHat does biology study ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q420 wdt:P2578 ?obj . ?obj wdt:P31 wd:Q937228 }","paraphrases":["What topics are covered in biology?"],"info":{}}
{"id":"train_1116","question":"When was William Golding awarded the Nobel Prize in Literature and how much did he get for it ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q44183 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P2121 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["When did William Golding win the literary Nobel Prize and how much did he win?"],"info":{}}
{"id":"train_1117","question":"When did Ernest Renan become a member of the Hungarian Academy of Sciences?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q157155 p:P463 ?s . ?s ps:P463 wd:Q265058 . ?s pq:P580 ?value }","paraphrases":["On what date did Ernest Renan become a member of the Hungarian Academy of Sciences?"],"info":{}}
{"id":"train_1120","question":"What is the sign for February in Catalan Sign Language?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q109 p:P2919 ?s . ?s ps:P2919 ?obj . ?s pq:P407 wd:Q35768 }","paraphrases":["In Catalan Sign Language, how do you sign February?"],"info":{}}
{"id":"train_1122","question":"Tell me about the life of Jesus Christ.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3342 wd:Q302 . ?sbj wdt:P31 wd:Q22704077 }","paraphrases":["Let me know around the life of Jesus Christ."],"info":{}}
{"id":"train_1125","question":"What is the unemployment rate of the candidate on the Eastern Front?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23908696 wdt:P710 ?X . ?X wdt:P1198 ?answer }","paraphrases":["What is the unemployment rate?"],"info":{}}
{"id":"train_1128","question":"Is the total expenditure of the Central Catholic High School 4169127.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5060518 wdt:P2402 ?obj filter ( ?obj = 4169127.6 ) }","paraphrases":["Is Central Catholic High School's total expenditure 4169127.6?"],"info":{}}
{"id":"train_1129","question":"Where does Gloria Estefan work and where did her formation occur?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q184697 wdt:P937 ?ans_1 . wd:Q184697 wdt:P740 ?ans_2 }","paraphrases":["Where does Gloria Estefan work and where did her formation occur?"],"info":{}}
{"id":"train_1131","question":"How many space missions did Yury Romanenko complete?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q446720 wdt:P450 ?obj }","paraphrases":["Yuri Romanenko has done several flights How many?\n "],"info":{}}
{"id":"train_1132","question":"Tell me  the mantra that contains the word mantra in their name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131510 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'mantra' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose to me the mantra that contains the word mantra in their name."],"info":{}}
{"id":"train_1135","question":"When did Alexander Graham Bell divorce from Mabel Gardiner Hubbard?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q34286 p:P26 ?s . ?s ps:P26 wd:Q6721445 . ?s pq:P582 ?value }","paraphrases":["Around what time did Alexander Graham Bell separate from Mabel Gardiner Hubbard?"],"info":{}}
{"id":"train_1137","question":"What award did Alvaro Siza Vieira receive in 1988?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q251365 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1988' ) ) }","paraphrases":["What was Alvaro Siza Viera awarded in 1988?"],"info":{}}
{"id":"train_1138","question":"Tell me circumstellar disk whose name has the word belt in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3235978 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'belt' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me circumstellar disk whose name has the word belt in it."],"info":{}}
{"id":"train_1140","question":"Which is the category for films shot at the location of A Coruña?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q8757 wdt:P1740 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1142","question":"Tell me excipient whose name has the word xylitol in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902638 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'xylitol' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know excipient whose title has the word xylitol in it."],"info":{}}
{"id":"train_1143","question":"what is mineral species distributed by ccs  and also which starts with letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55076514 . ?sbj wdt:P556 wd:Q473227 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is mineral species distributed by ccs and also which begins with letter p"],"info":{}}
{"id":"train_1146","question":"How many people have a facet of their Suriname?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1269 wd:Q730 }","paraphrases":["Suriname face how many people have this face?\n "],"info":{}}
{"id":"train_1148","question":"What fictional universe did Green Lantern take place in and who create Green Lantern?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q32884 wdt:P1080 ?ans_1 . wd:Q32884 wdt:P170 ?ans_2 }","paraphrases":["Who created Green Lantern, and which fictional universe did it take place in?"],"info":{}}
{"id":"train_1150","question":"In what theatrical field was Allen Ginsberg employed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6711 wdt:P106 ?answer . ?answer wdt:P425 wd:Q17172848 }","paraphrases":["In what dramatic field was Allen Ginsberg employed?"],"info":{}}
{"id":"train_1151","question":"What episode preceded Opie's Newspapers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51231142 wdt:P155 ?X . ?X wdt:P179 ?answer }","paraphrases":["What scene gone before Opie's Newspapers?"],"info":{}}
{"id":"train_1153","question":"Does Lauren Bacall belong to Arab and Ashkenzai Jews ethnical groups?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q104000 wdt:P172 wd:Q35323 . wd:Q104000 wdt:P172 wd:Q34069 }","paraphrases":["Is Lauren Bacall an Arab and Ashkenzai Jew?"],"info":{}}
{"id":"train_1155","question":"Is the time index of the Thout more than 0.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q577200 wdt:P4895 ?obj filter ( ?obj > 0.8 ) }","paraphrases":["Is the Thout's time index more than 0.8?"],"info":{}}
{"id":"train_1158","question":"What awards has Loretta Lynn won?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1346 wd:Q272931 . ?sbj wdt:P31 wd:Q618779 }","paraphrases":["What were Loretta Lynn's awards?"],"info":{}}
{"id":"train_1161","question":"Which county seat of Lan Xang has STD code of 071?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q853477 wdt:P36 ?answer . ?answer wdt:P473 ?x FILTER ( contains ( ?x , '071' ) ) }","paraphrases":["Which province situate of Lan Xang has STD code of 071?"],"info":{}}
{"id":"train_1165","question":"What part of the Jubba River has a coordinate location of 4.1783333333333 by 42.08?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q138491 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '4.1783333333333 42.08' ) ) . ?s pq:P518 ?value }","paraphrases":["The coordinate location of 4.1783333333333 by 42.08 is located on what part of the Jubba River?"],"info":{}}
{"id":"train_1166","question":"Which award was Kiefer Sutherland nominated for in 2002?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q103946 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["What award, in 2002, was Kiefer Sutherland nominated for?"],"info":{}}
{"id":"train_1168","question":"Is the electronegativity of the selenium equal to 2.55?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q876 wdt:P1108 ?obj filter ( ?obj = 2.55 ) }","paraphrases":["Is selenium's electronegativity 2.55?"],"info":{}}
{"id":"train_1170","question":"Name the church monument where Paul was the patron saint","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P417 wd:Q9200 . ?sbj wdt:P31 wd:Q16970 }","paraphrases":["Title the church landmark where Paul was the supporter holy person"],"info":{}}
{"id":"train_1176","question":"In what historical period was Ancient Rome set ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1747689 wdt:P2348 ?obj . ?obj wdt:P31 wd:Q11514315 }","paraphrases":["In what chronicled period was Antiquated Rome set ?"],"info":{}}
{"id":"train_1178","question":"What are the analytic function which start with the letter function","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215084 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'function' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the analytic function which begin with the letter function"],"info":{}}
{"id":"train_1179","question":"What Arctic oscillation blizzard had the lowest level of precipitation ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q205418 . ?ent wdt:P3036 ?obj . ?ent wdt:P31 wd:Q674041 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What blizzard of Arctic oscillation had the lowest precipitation level?"],"info":{}}
{"id":"train_1182","question":"Which is the AlloCiné person ID for Leslie Howard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q156178 wdt:P1266 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1184","question":"Which is the Daum Encyclopedia ID for Brexit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7888194 wdt:P5184 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1189","question":"What is the monument with the highest luminous intensity whose heritage designation is Rijksmonument?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4989906 . ?ent wdt:P3041 ?obj . ?ent wdt:P1435 wd:Q916333 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What monument with the highest recorded luminosity values has a heritage designation in Rijksmonument?"],"info":{}}
{"id":"train_1190","question":"What playing range does the alto saxophone have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q445275 wdt:P2343 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1192","question":"What field does Fernand Maillaud work in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3069252 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["What field does Fernand Maillaud work in?"],"info":{}}
{"id":"train_1193","question":"Which polytheistic religion did the Etruschi follow?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q17161 wdt:P140 ?obj . ?obj wdt:P31 wd:Q9163 }","paraphrases":["Which polytheistic religion did the Etruschi follow?"],"info":{}}
{"id":"train_1196","question":"Who is the player that participated in Barbora Spotakova?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6419 wdt:P1344 ?X . ?X wdt:P710 ?answer }","paraphrases":["Who is the player that taken an interest in Barbora Spotakova?"],"info":{}}
{"id":"train_1200","question":"What tree is in the Quebec provincial logo?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q176 p:P2238 ?s . ?s ps:P2238 ?obj . ?s pq:P518 wd:Q10884 }","paraphrases":["Name the tree that is in the Quebec provincial logo."],"info":{}}
{"id":"train_1202","question":"Which is the domain of subset?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q177646 wdt:P1568 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1203","question":"For what song did Kid Cudi receive the Grammy Award for Best Rap/Sung Performance?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q299138 p:P166 ?s . ?s ps:P166 wd:Q1542172 . ?s pq:P1706 ?value }","paraphrases":["Which was the song that gave Kid Cudi the Grammy Award for Best Rap/Song Performance?"],"info":{}}
{"id":"train_1205","question":"In which language of work or name do heart has a pronunciation audio as Ru-сердце.ogg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1072 p:P443 ?s . ?s ps:P443 ?x filter ( contains ( ?x , 'Ru-сердце.ogg' ) ) . ?s pq:P407 ?value }","paraphrases":["Ruсердце.ogg means heart in what language of work or name?"],"info":{}}
{"id":"train_1206","question":"Which religious book is represented in Melchizedek's work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q219395 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q179461 }","paraphrases":["Which devout book is spoken to in Melchizedek's work?"],"info":{}}
{"id":"train_1207","question":"How many platforms does Tomb Raider have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q270503 wdt:P400 ?obj }","paraphrases":["How many consoles can Tomb Raider be played on?"],"info":{}}
{"id":"train_1208","question":"Which is the LIPID MAPS ID for abscisic acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q332211 wdt:P2063 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1210","question":"Does Iowa have the nickname the Hawkeye State?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1546 p:P1449 ?s . ?s ps:P1449 ?x filter ( contains ( ?x , 'The Hawkeye State' ) ) . ?s pq:P805 ?value }","paraphrases":["Is Iowa known as the Hawkeye State?"],"info":{}}
{"id":"train_1211","question":"Name an online dictionary written by John Simpson that contains the word \"dictionnary\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3327521 . ?sbj wdt:P50 wd:Q6257950 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dictionary' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an on line dictionary written by way of John Simpson that includes the phrase \"dictionnary\" in its name"],"info":{}}
{"id":"train_1212","question":"Is the fee of Ueno Zoo equal to 300?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q162722 wdt:P2555 ?obj filter ( ?obj = 300 ) }","paraphrases":["Does it cost 300 to go to Ueno Zoo?"],"info":{}}
{"id":"train_1213","question":"Which is the statue for the foundational text of Soviet Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q15180 wdt:P457 ?obj . ?obj wdt:P31 wd:Q820655 }","paraphrases":[],"info":{}}
{"id":"train_1214","question":"Which is the academic major and the academic degree of John Updike who was educated at the Harvard University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q105756 p:P69 ?s . ?s ps:P69 wd:Q13371 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What did John Updike major in?"],"info":{}}
{"id":"train_1215","question":"What is killed by Harry Potter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P157 wd:Q3244512 }","paraphrases":[],"info":{}}
{"id":"train_1217","question":"How many employers are there for Edward Snowden?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q13424289 wdt:P108 ?obj }","paraphrases":["Edward Snowden worked for what number of employers?"],"info":{}}
{"id":"train_1218","question":"Why did Jeremy Corbyn end his position as Member of the 56th Parliament of the United Kingdom and when was he elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q291169 p:P39 ?s . ?s ps:P39 wd:Q30524718 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["Why did Jeremy Corbyn end his function as Member of the 56th Parliament of the United Kingdom and when was he elected in?"],"info":{}}
{"id":"train_1219","question":"What award did Gwendoly Brooks receive in 1994?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q270715 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["Gwendoly Brooks received an award in 1994, what was the award for?"],"info":{}}
{"id":"train_1220","question":"The conjugate acid of water has a monoanion of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4147 wd:Q283 . ?sbj wdt:P31 wd:Q55523986 }","paraphrases":["The conjugate corrosive of water incorporates a monoanion of?"],"info":{}}
{"id":"train_1221","question":"Which is the summit of the highest point of Shanghai?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8686 wdt:P610 ?obj . ?obj wdt:P31 wd:Q207326 }","paraphrases":["Which summit is Shanghai's highest point?"],"info":{}}
{"id":"train_1222","question":"What is the medium used by textile artists?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10988986 wdt:P1056 ?X . ?X wdt:P186 ?answer }","paraphrases":["Textile artists use what medium?"],"info":{}}
{"id":"train_1223","question":"What is the CPI inflation rate of the endemic to of  the Indian cuisine ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192087 wdt:P2341 ?X . ?X wdt:P1279 ?answer }","paraphrases":["What is the CPI expansion rate of the endemic to of the Indian cooking ?"],"info":{}}
{"id":"train_1224","question":"Who is {club manager} of {actress} of {WrestleMania III} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q50817 wdt:P161 ?X . ?X wdt:P286 ?answer }","paraphrases":["Who is {club supervisor} of {on-screen character} of {WrestleMania III} ?"],"info":{}}
{"id":"train_1225","question":"How many people are head of the government for {German Democratic Republic} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q16957 wdt:P6 ?obj }","paraphrases":["For the German Democratic Republic, how many people are head of the government?"],"info":{}}
{"id":"train_1227","question":"What award did Hume Cronyn recieve in 1964?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q395205 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1964' ) ) }","paraphrases":["In 1964, Hume Cronyn won which award?"],"info":{}}
{"id":"train_1228","question":"Which is Agassiz checklist number for Danaus plexippus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q212398 wdt:P1744 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1229","question":"Captain Gerry Brisson plays for what?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q746901 wdt:P54 ?X . ?X wdt:P634 ?answer }","paraphrases":["Captain Gerry Brisson plays for what?"],"info":{}}
