{"id":"train_10490","question":"Which is the ISHOF swimmer ID for Johnny Weissmuller?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q151284 wdt:P3691 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10492","question":"Is it true ethanol has a role as a solvent and a GABA reuptake inhibitor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q153 wdt:P2868 wd:Q146505 . wd:Q153 wdt:P2868 wd:Q5512768 }","paraphrases":["Does ethanol have a role as a solvent and a GABA reuptake inhibitor?"],"info":{}}
{"id":"train_10493","question":"Which man founded LaVeyan Satanism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q256223 wdt:P112 ?answer . ?answer wdt:P21 wd:Q6581097 }","paraphrases":["Which man founded the satanism of LaVeyan?"],"info":{}}
{"id":"train_10494","question":"Where is the grave that commemorates Ulysses S. Grant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P547 wd:Q34836 . ?sbj wdt:P31 wd:Q173387 }","paraphrases":["Where is the grave that commemorates Ulysses S. Allow?"],"info":{}}
{"id":"train_10495","question":"What are Hon Hai Precision Industry's total assets for 12-23-2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q463094 p:P2403 ?s . ?s ps:P2403 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["What are Hon Hai Precision Industry's absolute resources for 12-23-2016?"],"info":{}}
{"id":"train_10497","question":"Who was the discoverer or inventor of the Trapezium Cluster, that worked in the physics field?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14031 wdt:P61 ?answer . ?answer wdt:P101 wd:Q413 }","paraphrases":["Who was the Trapezium Cluster discoverer or inventor working in the field of physics?"],"info":{}}
{"id":"train_10502","question":"During what time was George Canning a citizen of Great Britain?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q219731 p:P27 ?s . ?s ps:P27 wd:Q161885 . ?s pq:P1534 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["What years was George Canning a Great Britain citizen?"],"info":{}}
{"id":"train_10505","question":"At what instance Chaitanya Mahaprabhu had his birth in the year 1486?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q870262 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( YEAR ( ?x ) , '1486' ) ) . ?s pq:P31 ?value }","paraphrases":["Tell me when Chaitanya Mahaprabhu was born."],"info":{}}
{"id":"train_10506","question":"Tell me notation whose name has the word symbol  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2001982 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'symbol' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me documentation whose title has the word image in it."],"info":{}}
{"id":"train_10507","question":"Fernando de Noronha is coextensive with what?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3403 wd:Q175057 }","paraphrases":[],"info":{}}
{"id":"train_10510","question":"Which is the excipient which is an active ingredient in Sclerosol and that contains the word talc in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902638 . ?sbj wdt:P3780 wd:Q47522115 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'talc' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the excipient which is an lively ingredient in Sclerosol and that incorporates the phrase talc in it is name?"],"info":{}}
{"id":"train_10511","question":"What is the etymology of Bayes' theorem, that contains a death dated on 1761-4-17?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q182505 wdt:P138 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( YEAR ( ?x ) , '1761' ) ) }","paraphrases":["What is the etymology of Bayes' theorem, that incorporates a demise dated on 1761-4-17?"],"info":{}}
{"id":"train_10512","question":"What is the award received by Nawaz Shari by the replacement of Ghulam Mustafa Jatoi?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q134068 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q2039548 }","paraphrases":["When Ghulam Mustafa Jatoi stepped down, what prize did Nawaz Shari receive instead?"],"info":{}}
{"id":"train_10514","question":"When did Billy Hughes held the position of Prime Minister of Australia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q152666 p:P39 ?s . ?s ps:P39 wd:Q319145 . ?s pq:P580 ?value }","paraphrases":["When the Prime Minister of Australia was Billy Hughes, what year was it?"],"info":{}}
{"id":"train_10515","question":"Is Matthew McConaughey a citizen of the United States of America?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q188955 wdt:P27 wd:Q30 }","paraphrases":["Is Matthew McConaughey a US citizen?"],"info":{}}
{"id":"train_10516","question":"Which is the discovery that the inventor of CERN made?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P61 wd:Q42944 . ?sbj wdt:P31 wd:Q753297 }","paraphrases":["Which is the revelation that the creator of CERN made?"],"info":{}}
{"id":"train_10519","question":"Does Johnny Depp have Christoph as another forename that is said to be different from Johnny?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37175 wdt:P735 ?answer . ?answer wdt:P460 wd:Q17689481 }","paraphrases":["Does Johnny Depp have Christoph as another forename that's said to be diverse from Johnny?"],"info":{}}
{"id":"train_10521","question":"sadjif","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q242542 p:P27 ?s . ?s ps:P27 wd:Q174193 . ?s pq:P582 ?value }","paraphrases":["n/a"],"info":{}}
{"id":"train_10523","question":"\"Which participants of the Battle of Leuthen, had a brother named Francis I, Holy Roman Emperor?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q313435 wdt:P710 ?answer . ?answer wdt:P3373 wd:Q151075 }","paraphrases":["\"Which members of the Fight of Leuthen, had a brother named Francis I, Heavenly Roman Emperor?\""],"info":{}}
{"id":"train_10524","question":"What is the quantity of foot-pound whose measurement is mass?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q730251 wdt:P111 ?answer . ?answer wdt:P1880 wd:Q11423 }","paraphrases":["What is the infertility treatment, the one that has a each day dose of 40.0?"],"info":{}}
{"id":"train_10525","question":"When was Harold Macmillan elected as a member of the 38th UK Parliament and what was the cause for the end of his membership?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q128985 p:P39 ?s . ?s ps:P39 wd:Q41582597 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["On what date was Harold Macmillan elected to the 38th UK Parliament and what was the reason his membership ended?"],"info":{}}
{"id":"train_10526","question":"What award did Boris Yeltsin receive on January 30th, 1981?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q34453 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1981' ) ) }","paraphrases":["Boris Yeltsin received this award on January 30th, 1981?"],"info":{}}
{"id":"train_10527","question":"How many matches did Fritz Walter play and for what team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q22717 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["How many matches and for what team did Fritz Walter play?"],"info":{}}
{"id":"train_10530","question":"When was Leoluca Orlando the head of Palermo?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2656 p:P6 ?s . ?s ps:P6 wd:Q703503 . ?s pq:P582 ?value }","paraphrases":["At which point in time was Leoluca Orlando the head of Palermo?"],"info":{}}
{"id":"train_10531","question":"When did Paul Hindemith begin studying at Hoch Conservatory?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q57244 p:P69 ?s . ?s ps:P69 wd:Q466029 . ?s pq:P580 ?value }","paraphrases":["Hoch Conservatory accepted Paul Hindemith as a student what year?"],"info":{}}
{"id":"train_10532","question":"Are {Wyatt_Earp} {sibling}  {Virgil Earp} and {James Earp} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44616 wdt:P3373 wd:Q931824 . wd:Q44616 wdt:P3373 wd:Q3806537 }","paraphrases":["Was Wyatt, Virgil and James all brothers?"],"info":{}}
{"id":"train_10533","question":"What is personal best for Valerie Adams ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q6357 wdt:P2415 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10535","question":"What is the impassivity of cement?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q45190 wdt:P1295 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10536","question":"When was Natalia Makarova nominated for the Laurence Olivier Award for Best Actress in a Musical?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q267796 p:P1411 ?s . ?s ps:P1411 wd:Q6500775 . ?s pq:P585 ?value }","paraphrases":["Regarding the nominations of Natalia Makarova for the Laurence Olivier award as a Best actress, when did it happen?"],"info":{}}
{"id":"train_10537","question":"Which is the double administrative body, of Nagasaki's governing county seat.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q38234 wdt:P190 ?obj . ?obj wdt:P31 wd:Q62049 }","paraphrases":["Which is the twofold regulatory body, of Nagasaki's administering district seat."],"info":{}}
{"id":"train_10539","question":"What are theGreco-Roman mysteries which start with the letter M","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q505821 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are theGreco-Roman secrets which begin with the letter M"],"info":{}}
{"id":"train_10540","question":"\"Where was the place of activity for Erich Von dem Bach-Zelewski, that was on lake in the Westhafen Canal ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57267 wdt:P937 ?answer . ?answer wdt:P206 wd:Q1532109 }","paraphrases":["Where was the area of recreation for Erich Von dem Bach-Zelewski, that was once on lake in the Westhafen Canal ?"],"info":{}}
{"id":"train_10541","question":"Who is the {executive director} of {shareholder} of {Broadcast.com}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4972055 wdt:P127 ?X . ?X wdt:P169 ?answer }","paraphrases":["Who is { shareholder }'s { executive director } of { Broadcast.com }?"],"info":{}}
{"id":"train_10542","question":"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27594933 wdt:P128 ?X . ?X wdt:P2293 ?answer }","paraphrases":["?"],"info":{}}
{"id":"train_10544","question":"Which is the single execution of an artwork as the exemplar of The Great Wave off Kanagawa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1574 wd:Q252485 . ?sbj wdt:P31 wd:Q28912688 }","paraphrases":["Which is the SI inferred unit for the measured physical amount of the warm conductivity?"],"info":{}}
{"id":"train_10545","question":"when did  member  of coined molybdenum ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1053 wdt:P61 ?X . ?X wdt:P463 ?answer }","paraphrases":["when did member of coined molybdenum ?"],"info":{}}
{"id":"train_10546","question":"Tell me the series by Rama.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q160213 wdt:P179 ?obj . ?obj wdt:P31 wd:Q20937557 }","paraphrases":["Let me know the arrangement by Rama."],"info":{}}
{"id":"train_10547","question":"When did Evonne Goolagong Cawley receive the Companion of the Order of Australia award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q228559 p:P166 ?s . ?s ps:P166 wd:Q9680541 . ?s pq:P585 ?value }","paraphrases":["What date did Evonne Goolagong Cawley received the Companion of the Order of Australia award?"],"info":{}}
{"id":"train_10548","question":"What is the court with highest judicial authority in Hong Kong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8646 wdt:P209 ?obj . ?obj wdt:P31 wd:Q190752 }","paraphrases":["What is the court with most elevated legal specialist in Hong Kong?"],"info":{}}
{"id":"train_10550","question":"what is the danger of asthma according to Genome-wide association study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q35869 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q1098876 }","paraphrases":["Genome-wide says this is the danger of asthma."],"info":{}}
{"id":"train_10554","question":"Which is Dennis Rodman's team that is funded by Mr,Submarin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q201608 wdt:P54 ?answer . ?answer wdt:P859 wd:Q37189902 }","paraphrases":["Which is Dennis Rodman's group that's supported by Mr,Submarin?"],"info":{}}
{"id":"train_10557","question":"Tell me spaceport whose name has the word station in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q194188 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'station' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know spaceport whose title has the word station in it."],"info":{}}
{"id":"train_10558","question":"Does Jan Tscichold said the same as Juan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q455232 wdt:P735 ?answer . ?answer wdt:P460 wd:Q475210 }","paraphrases":["Is Jan Tscichold saying the same thing as Juan?"],"info":{}}
{"id":"train_10559","question":"What is the parent company of American Broadcasting Company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P749 wd:Q169889 . ?sbj wdt:P31 wd:Q658255 }","paraphrases":["Which company is the parent of American Broadcasting Company?"],"info":{}}
{"id":"train_10562","question":"John Diefenbaker is the incumbent for what public office held by Justin Trudeau?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3099714 wdt:P39 ?answer . ?answer wdt:P1308 wd:Q128614 }","paraphrases":["John Diefenbaker is the incumbent for what public workplace held by way of Justin Trudeau?"],"info":{}}
{"id":"train_10567","question":"What's the height for the best pole vault and where did it take place for athlete Igor Potapovich?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q2330636 . ?s pq:P276 ?value1 . ?s pq:P2048 ?value2 }","paraphrases":["What's the stature for the most excellent post vault and where did it take put for competitor Igor Potapovich?"],"info":{}}
{"id":"train_10569","question":"When did Jude Law receive the Theatre World Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q160432 p:P166 ?s . ?s ps:P166 wd:Q1131356 . ?s pq:P585 ?value }","paraphrases":["What was the date on which Jude Law received the Theatre World Award?"],"info":{}}
{"id":"train_10570","question":"How many newspapers are formatted as magazines?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3912 wd:Q41298 }","paraphrases":["How many newspapers are laid out the same as magazines?"],"info":{}}
{"id":"train_10571","question":"When was Eberhard Umbach the director of the Karlsruhe Institute of Technology?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q309988 p:P1037 ?s . ?s ps:P1037 wd:Q77995 . ?s pq:P580 ?value }","paraphrases":["When was the Karlsruhe Institute of Technology directed by Eberhard Umbach?"],"info":{}}
{"id":"train_10572","question":"What is Actorenregister ID for Utrecht University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q221653 wdt:P3273 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10574","question":"What is the population of Almería at register office?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q10400 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }","paraphrases":["how many people in registeroffice at Almeria?"],"info":{}}
{"id":"train_10575","question":"Which is the direction relative to location of west?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P654 wd:Q679 }","paraphrases":[],"info":{}}
{"id":"train_10579","question":"Does Boston have a City Council?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q100 wdt:P194 wd:Q4947808 }","paraphrases":["Is there a City Council in Boston?"],"info":{}}
{"id":"train_10580","question":"Name a city in Netherlands that contain the word \"zwolle \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2039348 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zwolle' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a city in Netherlands that contain \"zwolle \" in its name"],"info":{}}
{"id":"train_10581","question":"Name a movie directed by Ang Lee","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P57 wd:Q160726 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Name a movie by Ang Lee"],"info":{}}
{"id":"train_10583","question":"Which is the inferior planet with maximum albedo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3901935 . ?ent wdt:P4501 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the smallest planet with the most albedo?"],"info":{}}
{"id":"train_10584","question":"What country does Zinedine Zidane play sports for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1835 wdt:P1532 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10586","question":"What does physically interact with adenosine triphosphate as an agonist?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q80863 p:P129 ?s . ?s ps:P129 ?obj . ?s pq:P2868 wd:Q389934 }","paraphrases":["Adenosine triphosphate interacts with what as an agonist?"],"info":{}}
{"id":"train_10587","question":"How is Uranium produced?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1098 wdt:P2079 ?obj . ?obj wdt:P31 wd:Q55076514 }","paraphrases":["How is Uranium produced?"],"info":{}}
{"id":"train_10588","question":"How is Barbara W. Tuchman related to Henry Morgenthau?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q59112 p:P1038 ?s . ?s ps:P1038 wd:Q47946 . ?s pq:P1039 ?value }","paraphrases":["How are Barbara W. Tuchman and Henry Morgenthau related to each other?"],"info":{}}
{"id":"train_10590","question":"What was the nomination received by Anjelica Huston, but had a prizewinner of Mira Sorvino?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190998 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q212026 }","paraphrases":["What was once the nomination obtained via Anjelica Huston, but had a prizewinner of Mira Sorvino?"],"info":{}}
{"id":"train_10591","question":"What is the {death place} of {Karl von Frisch} that {has the cities} of {Altstadt-Lehel}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q60060 wdt:P20 ?answer . ?answer wdt:P150 wd:Q971198 }","paraphrases":["What is the {passing put} of {Karl von Frisch} that {has the cities} of {Altstadt-Lehel}?"],"info":{}}
{"id":"train_10592","question":"What develops from gynoecium?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3094 wd:Q588964 }","paraphrases":[],"info":{}}
{"id":"train_10593","question":"What multiple starts with the letter \"h\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1055293 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What multiple does the letter \"h\" start with?"],"info":{}}
{"id":"train_10594","question":"What is the relative level of taxon of Piper mollipilosum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18036791 wdt:P171 ?X . ?X wdt:P427 ?answer }","paraphrases":["Piper mollipilosum has what relative level of taxation?"],"info":{}}
{"id":"train_10595","question":"who champ of awards of Joyce Carol Oates ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q217557 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["who champ of awards of Joyce Carol Oates ?"],"info":{}}
{"id":"train_10596","question":"What was the population of Iasi in 1910?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q46852 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1912' ) ) }","paraphrases":["The population of lasi in 1910 was?"],"info":{}}
{"id":"train_10597","question":"Where in the state of Louisiana was Jared Leto born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q484523 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1588 }","paraphrases":["Name the town in Louisiana where Jared Leto was born."],"info":{}}
{"id":"train_10598","question":"Who is {member of} {coined} {Köppen climate classification} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q124095 wdt:P61 ?X . ?X wdt:P463 ?answer }","paraphrases":["Who is {part of} {coined} {Köppen climate classification} ?"],"info":{}}
{"id":"train_10600","question":"Who are the disciples of Christiaan Huygens who were informed by Maimonides?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q39599 wdt:P802 ?answer . ?answer wdt:P737 wd:Q127398 }","paraphrases":["Who are the devotees of Christiaan Huygens who were educated by Maimonides?"],"info":{}}
{"id":"train_10601","question":"What time did Aarhus serve as an adminstrative body at Rostock?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q25319 p:P190 ?s . ?s ps:P190 wd:Q2861 . ?s pq:P580 ?value }","paraphrases":["When did Aarhus serve as a Rostock administrator?"],"info":{}}
{"id":"train_10602","question":"Who co-founded the Inge Morath?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q112033 wdt:P463 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who co-founded the Inge Morath?"],"info":{}}
{"id":"train_10603","question":"Which is the color of the red wine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1827 wdt:P462 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10606","question":"The parent taxon of a Nematoda belongs to what taxonomic ranking?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5185 wdt:P171 ?X . ?X wdt:P105 ?answer }","paraphrases":["What is the taxonomic ranking of the parent taxon of Nematoda?"],"info":{}}
{"id":"train_10612","question":"What is Alan Shepard's spaceflight?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1029 wd:Q174979 . ?sbj wdt:P31 wd:Q5916 }","paraphrases":["What is Alan Shepard's spaceflight?"],"info":{}}
{"id":"train_10613","question":"Who is the doctoral student of Martin Weitzman supervisor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q591572 wdt:P184 ?X . ?X wdt:P185 ?answer }","paraphrases":["Who is Martin Weitzman's supervisor's doctoral student?"],"info":{}}
{"id":"train_10614","question":"Which is the zenith of the jurisdiction of Citizens United v. Federal Election Commission?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1092602 wdt:P1001 ?X . ?X wdt:P610 ?answer }","paraphrases":["Which is the pinnacle of the ward of Citizens Joined together v. Government Race Commission?"],"info":{}}
