{"id":"train_18662","question":"Where does the Kaveri River meet the ocean?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q216239 wdt:P403 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18663","question":"Who is the executive power within Montreuil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q193370 wdt:P47 ?X . ?X wdt:P6 ?answer }","paraphrases":["Who is the official control inside Montreuil?"],"info":{}}
{"id":"train_18664","question":"Does the Harish-Chandra Research Institute have a student count equal to 63.2","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1505093 wdt:P2196 ?obj filter ( ?obj = 63.2 ) }","paraphrases":["Harish-Chandra Research Institute has more or fewer than 63 students?"],"info":{}}
{"id":"train_18665","question":"When did Indiana have a population of 5.19367e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1415 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '5.19367e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["Indiana had of population of 5.19367e+06 during when?"],"info":{}}
{"id":"train_18666","question":"Which administrative divisions of Madagascar is next to Antananarivo Province?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1019 wdt:P150 ?answer . ?answer wdt:P47 wd:Q489821 }","paraphrases":["Which Madagascar administrative divisions are next to the Province of Antananarivo?"],"info":{}}
{"id":"train_18667","question":"What award did Edwin Hubble receive on January 1st, 1939?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43027 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1939' ) ) }","paraphrases":["On January 1st, 1939 which was the award given the Edwin Hubble."],"info":{}}
{"id":"train_18669","question":"What year did Juan Manuel Santos, known as Manuel receive the Nobel Peace Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q57311 p:P735 ?s . ?s ps:P735 wd:Q11113719 . ?s pq:P1545 ?value }","paraphrases":["Give the year Juan Manual Santos, known as Manuel, received the Nobel Peace Prize."],"info":{}}
{"id":"train_18670","question":"New Amsterdam is an American medical drama television series, based on the book Twelve ... New Amsterdam follows Dr. Max Goodwin as he becomes the medical .... Dr. Frome works with a father whose son experiences hallucinations of a .... a breakthrough for the genre – though that may be enough for medical drama ...","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5398426 . ?ent wdt:P3740 ?obj . ?ent wdt:P136 wd:Q2975633 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["New Amsterdam is a medical drama based on the book 'Twelve' that follows a Dr. Max Goodwin. However, a notable Dr. Iggy Frome works with a hallucinatory patient's father-- somewhat a breakthrough for the genre."],"info":{}}
{"id":"train_18671","question":"What municipality shares a border with Ottawa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1930 wdt:P47 ?obj . ?obj wdt:P31 wd:Q15210668 }","paraphrases":["What district offers a border with Ottawa?"],"info":{}}
{"id":"train_18672","question":"Which is the Paris Faculty of Letters professor ID 1909-1939 for Georges Lefebvre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q663862 wdt:P5544 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18674","question":"Show me the film studio that starts with the letter v.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15773317 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Appear me the film studio that begins with the letter v."],"info":{}}
{"id":"train_18675","question":"Mention the qualifying degree and the major specialization course in which Lloyd Shapley graduated from the Princeton University","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q244739 p:P69 ?s . ?s ps:P69 wd:Q21578 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["What degree and major specialization did Lloyd Shapley graduate from Princeton University with?"],"info":{}}
{"id":"train_18676","question":"Who is the initiated member of the team of Udo Lattek?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q290870 wdt:P54 ?X . ?X wdt:P571 ?answer }","paraphrases":["Who is the started part of the group of Udo Lattek?"],"info":{}}
{"id":"train_18677","question":"At 1997-0-0, what is Louis Gosett nominated for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q329719 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1997' ) ) }","paraphrases":["What award was Louis Gosett nominated for in 1997?"],"info":{}}
{"id":"train_18678","question":"What bookkeeping system starts with the letter s?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60158614 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What bookkeeping framework begins with the letter s?"],"info":{}}
{"id":"train_18679","question":"Is the average gradient of the Ublianka equal 21?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9364310 wdt:P2198 ?obj filter ( ?obj = 21 ) }","paraphrases":["21 may be the average gradient of the Ublianka."],"info":{}}
{"id":"train_18681","question":"Java uses what sofware engine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P408 wd:Q251 }","paraphrases":[],"info":{}}
{"id":"train_18682","question":"Does John Denver's music belong to folk and electric folk genre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q105460 wdt:P136 wd:Q235858 . wd:Q105460 wdt:P136 wd:Q2614533 }","paraphrases":["Can the music of John Denver be classified in the folk/electric folk category?"],"info":{}}
{"id":"train_18683","question":"What is the birthplace of Go-Daigo, whose mayor is Daisaku Kadokawa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q313942 wdt:P19 ?answer . ?answer wdt:P6 wd:Q917498 }","paraphrases":["What is Go - Daigo's birthplace, Daisaku Kadokawa's mayor?"],"info":{}}
{"id":"train_18684","question":"What is the diplomatic relation of Finland whose inflation rate of consumer price index is 12.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q33 wdt:P530 ?answer . ?answer wdt:P1279 ?x FILTER ( contains ( ?x , '12.0' ) ) }","paraphrases":["What is the political connection of Finland whose expansion rate of buyer cost record is 12.0?"],"info":{}}
{"id":"train_18687","question":"Is the right ascension of the Orion Nebula equal to 83.818662?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13903 wdt:P6257 ?obj filter ( ?obj = 83.818662 ) }","paraphrases":["What is the right ascension of the Orion Nebula?"],"info":{}}
{"id":"train_18689","question":"Who fought against Scipio Africanus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2253 wdt:P607 ?X . ?X wdt:P710 ?answer }","paraphrases":["Scipio Africanus fought against whom?"],"info":{}}
{"id":"train_18690","question":"Who sponsors the FC Bayern Munich?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q15789 wdt:P859 ?obj }","paraphrases":["Who is the sponsor of FC Bayern Munich?"],"info":{}}
{"id":"train_18694","question":"Tell me a legal status that begins with the letter s.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2628882 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know a legitimate status that starts with the letter s."],"info":{}}
{"id":"train_18695","question":"What are the subject of international law which start with the letter n","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1896989 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which  subject of international law is start with the letter n?"],"info":{}}
{"id":"train_18696","question":"What is the tribute of the shore of Faial Island?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q657187 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["What is the tribute of the shore of Faial Island?"],"info":{}}
{"id":"train_18697","question":"What position was held by Tancredo Neves on 3-23-1962?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q273264 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1962' ) ) }","paraphrases":["Give me the name of the position held by Tancredo Neves on 3-23-1962?"],"info":{}}
{"id":"train_18698","question":"What is the operating income of SAP SE in 2017?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q552581 p:P3362 ?s . ?s ps:P3362 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2017' ) ) }","paraphrases":["In 2017, what is the operating income of SAP SE?"],"info":{}}
{"id":"train_18699","question":"Name an Italian Opera played for the first time at Teatro La Fenice that contains the word \"la\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q785522 . ?sbj wdt:P4647 wd:Q223942 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'la' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an Italian Opera played for the first time at Teatro La Fenice that contains the phrase \"la\" in its name"],"info":{}}
{"id":"train_18700","question":"Is Kim Basinger a singer and a model?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q131380 wdt:P106 wd:Q4610556 . wd:Q131380 wdt:P106 wd:Q177220 }","paraphrases":["Does Kim Basinger model and sing?"],"info":{}}
{"id":"train_18703","question":"What Ancient Greek unit of volume has the biggest conversion to standard units ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q607056 . ?ent wdt:P2442 ?obj . ?ent wdt:P111 wd:Q39297 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Ancient Greek unit of volume has is greater than the standard of units?"],"info":{}}
{"id":"train_18704","question":"Where are The Band's cat films shot?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q600344 wdt:P740 ?X . ?X wdt:P1740 ?answer }","paraphrases":["Where are The Band's cat movies shot?"],"info":{}}
{"id":"train_18705","question":"Who was Walter Raleigh's father?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q189144 wdt:P22 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Give me the name of Walter Raleigh's father"],"info":{}}
{"id":"train_18707","question":"What is the cast of Moses?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9077 wdt:P1441 ?X . ?X wdt:P161 ?answer }","paraphrases":["What's Moses ' cast?"],"info":{}}
{"id":"train_18708","question":"How much piña colada is used to make white rum?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q745886 p:P186 ?s . ?s ps:P186 wd:Q26869768 . ?s pq:P1114 ?value }","paraphrases":["How much pina colada is needed for white rum?"],"info":{}}
{"id":"train_18709","question":"The inflation rate of Belize is?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q242 wdt:P1279 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18711","question":"What is David Foster's record label?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q77112 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 }","paraphrases":["What is David Foster's record label?"],"info":{}}
{"id":"train_18713","question":"What is the  conflict  landscape of Sakata Kanetom Eating at Home ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18688258 wdt:P180 ?X . ?X wdt:P607 ?answer }","paraphrases":["What is Sakata Kanetom Home Eating Conflict Landscape?"],"info":{}}
{"id":"train_18715","question":"Name the  unit of measurement followed by per mille that contains the word \"percentage\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47574 . ?sbj wdt:P156 wd:Q181011 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'percentage' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the unit of measurement followed by per mille that includes the word \"percentage\" in its title"],"info":{}}
{"id":"train_18716","question":"Who was the leader of the Weimar republic ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41304 wdt:P6 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was the pioneer of the Weimar republic ?"],"info":{}}
{"id":"train_18717","question":"Who is {famous for} of {writers} of {To the Christian Nobility of the German Nation} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2492149 wdt:P50 ?X . ?X wdt:P800 ?answer }","paraphrases":["Who is {popular for} of {scholars} of {To the Christian Respectability of the German Country} ?"],"info":{}}
{"id":"train_18718","question":"who is born at partner town of Nadya A.R. ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6958032 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["who is born at accomplice town of Nadya A.R. ?"],"info":{}}
{"id":"train_18720","question":"What is the version number of the edition of Abhigyanashakuntalam ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q320594 wdt:P747 ?X . ?X wdt:P393 ?answer }","paraphrases":["Specify the version number of Abhigyanashakuntalam edition."],"info":{}}
{"id":"train_18721","question":"Is the disease burden of laryngeal cancer equal to 2749816?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q852423 wdt:P2854 ?obj filter ( ?obj = 2749816 ) }","paraphrases":["Does the disease burden of laryngeal cancer equal 2749816?"],"info":{}}
{"id":"train_18722","question":"What is { represented by } of { Henry Moore } that is { a role for an object } is { copyright holder }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q151097 p:P1875 ?s . ?s ps:P1875 ?obj . ?s pq:P3831 wd:Q29014674 }","paraphrases":["Which copyrights holds Henry Moore?"],"info":{}}
{"id":"train_18724","question":"Who is the owner of the Barbie enterprise?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1830 wd:Q167447 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["Who is the Barbie company's owner?"],"info":{}}
{"id":"train_18725","question":"What is tracklist of Pet Sounds that has series ordinal is B5?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q212863 p:P658 ?s . ?s ps:P658 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , 'B5' ) ) }","paraphrases":["which as a tracklist of Pet Sounds that has series ordinal is B5?"],"info":{}}
{"id":"train_18727","question":"Name the closest interacting galaxy from Earth whose constellation is known as Cetus.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q644507 . ?ent wdt:P2583 ?obj . ?ent wdt:P59 wd:Q8839 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["what is the closest interacting galaxy to Earth?"],"info":{}}
{"id":"train_18728","question":"What species are held by the affiliates of the Greater Los Angeles Zoo Assocation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q54555957 wdt:P1416 ?X . ?X wdt:P1990 ?answer }","paraphrases":["What species are held by the members of the More noteworthy Los Angeles Zoo Assocation?"],"info":{}}
{"id":"train_18730","question":"Which subtopic of the history of technology is the study of technique?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q465352 wdt:P1269 ?answer . ?answer wdt:P2578 wd:Q2695280 }","paraphrases":["Which subtopic of the records of technology is the find out about of technique?"],"info":{}}
{"id":"train_18731","question":"What is Q48460 the field study of Madhava Sangamagrama?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q115590 wdt:P101 ?X . ?X wdt:P1036 ?answer }","paraphrases":["What is Q48460 the field consider of Madhava Sangamagrama?"],"info":{}}
{"id":"train_18733","question":"What is the emitted sound from the women's college target group?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3660535 wdt:P2360 ?X . ?X wdt:P4733 ?answer }","paraphrases":["What is the transmitted sound from the women's college target bunch?"],"info":{}}
{"id":"train_18736","question":"When was Denzel Washington nominated for Best Actor at the Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42101 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P805 ?value }","paraphrases":["In what year did the Academy Awards have Denzel Washington nominated for best actor?"],"info":{}}
{"id":"train_18737","question":"Who is the executive director of the parent company of True Corporation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3268422 wdt:P749 ?X . ?X wdt:P169 ?answer }","paraphrases":["Who is the government director of the dad or mum agency of True Corporation?"],"info":{}}
{"id":"train_18740","question":"When did the marriage of Anaïs Nin and Rupert Pole end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q220018 p:P26 ?s . ?s ps:P26 wd:Q7380347 . ?s pq:P582 ?value }","paraphrases":["When did the matrimony of Anais Nin and Rupert Pole terminate?"],"info":{}}
{"id":"train_18741","question":"What type of judge was Edmund Barton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1594 wd:Q23342 }","paraphrases":[],"info":{}}
{"id":"train_18743","question":"Which is the season of 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4908 wd:Q199 }","paraphrases":[],"info":{}}
{"id":"train_18744","question":"What in Fejér County has its farthest eastern point at 47.95394972 22.89653778?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q187693 wdt:P131 ?answer . ?answer wdt:P1334 ?x FILTER ( contains ( ?x , '47.95394972 22.89653778' ) ) }","paraphrases":["What in Fejér County has its farthest jap factor at 47.95394972 22.89653778?"],"info":{}}
{"id":"train_18745","question":"WHICH IS THE BRAND WITH THE MAXIMUM SCALE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q431289 . ?ent wdt:P1752 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What product has the biggest scale?"],"info":{}}
{"id":"train_18746","question":"Where is Bonn located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q586 wdt:P150 ?obj . ?obj wdt:P31 wd:Q2983893 }","paraphrases":["Where is Bonn located?"],"info":{}}
{"id":"train_18747","question":"What was Irene Worth nominated for in the year 1977?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q188389 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1977' ) ) }","paraphrases":["What award was Irene Worth nominated for in 1977?"],"info":{}}
{"id":"train_18748","question":"What is the eponym of Jupiter that has a child body called Chaldene?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q651336 wdt:P138 ?answer . ?answer wdt:P398 wd:Q17035 }","paraphrases":["What is the eponym of Jupiter that features a child body called Chaldene?"],"info":{}}
{"id":"train_18749","question":"What borders Osaka Prefecture where the twin town is Special Region of Yogyakarta?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q122723 wdt:P47 ?answer . ?answer wdt:P190 wd:Q3741 }","paraphrases":["What borders Osaka Prefecture the place the twin town is Special Region of Yogyakarta?"],"info":{}}
{"id":"train_18750","question":"What works of the film director of Finian's Rainbow?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1198750 wdt:P57 ?X . ?X wdt:P800 ?answer }","paraphrases":["What works of the film executive of Finian's Rainbow?"],"info":{}}
{"id":"train_18751","question":"DOES THE NUMBER OF SPOILT VOTES OF ARIQUEMES MAYORAL ELECTION 2016 GREATER THAN 2168.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q61868928 wdt:P5044 ?obj filter ( ?obj > 2168.0 ) }","paraphrases":["DOES THE NUMBER OF SPOILT VOTES OF ARIQUEMES MAYORAL Race 2016 More prominent THAN 2168.0"],"info":{}}
{"id":"train_18752","question":"What what is  intelligence agency manager/director Alex Younger  and which that starts with i","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47913 . ?sbj wdt:P1037 wd:Q18208520 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is brain company manager/director Alex Younger and which that starts offevolved with i"],"info":{}}
{"id":"train_18754","question":"What position was Lee Teng-hui the fourth holder of?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q315528 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '4' ) ) }","paraphrases":["Lee Teng-hue the 4th held what position?"],"info":{}}
{"id":"train_18756","question":"What are the former building or structure which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19860854 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the previous building or structure which begin with the letter t"],"info":{}}
{"id":"train_18757","question":"Which is closed on for Wednesday?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3026 wd:Q128 }","paraphrases":[],"info":{}}
{"id":"train_18758","question":"Tell me about position held of Tony Abbott and elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q348577 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["Tell me about Tony Abbott's position and his election?"],"info":{}}
{"id":"train_18759","question":"Which is the major religious group that Jesus Christ is worshiped from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q302 wdt:P1049 ?obj . ?obj wdt:P31 wd:Q6957341 }","paraphrases":["Jesus Christ is worshiped for by which major religious group?"],"info":{}}
{"id":"train_18760","question":"Name the river with maximim Strahler number?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4022 . ?ent wdt:P1548 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Title the stream with maximim Strahler number?"],"info":{}}
{"id":"train_18761","question":"Which art prize derives its name from Salzburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P138 wd:Q34713 . ?sbj wdt:P31 wd:Q1792571 }","paraphrases":["Salzburg lends its name to what art prize?"],"info":{}}
{"id":"train_18762","question":"Mention the television series featured by executive producer John Oliver.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1431 wd:Q1701254 . ?sbj wdt:P31 wd:Q5398426 }","paraphrases":["Specify the tv arrangement highlighted by official maker John Oliver."],"info":{}}
{"id":"train_18765","question":"How many connecting lines go to Glasgow Subway?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P81 wd:Q506290 }","paraphrases":["Glasgow Subway contains how many connecting lines?"],"info":{}}
{"id":"train_18768","question":"Mention the year span and the reason of service elimination of Anthony Eden during serving as Member of the 37th Parliament of the United Kingdom","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q128995 p:P39 ?s . ?s ps:P39 wd:Q41582593 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["How long did Anthony Eden serve in the UK Parliament?"],"info":{}}
