{"id":"train_16970","question":"Is the periapsis of the 2202 Pele equal to 1.1148513?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q124413 wdt:P2244 ?obj filter ( ?obj = 1.1148513 ) }","paraphrases":["Is the periapsis of the 2202 Pele break even with to 1.1148513?"],"info":{}}
{"id":"train_16971","question":"What is the city council of Osaka?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1001 wd:Q35765 . ?sbj wdt:P31 wd:Q3154693 }","paraphrases":["What is the name of the city council located in Osaka?"],"info":{}}
{"id":"train_16972","question":"Who was Marcel Proust's most famous student ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7199 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was Marcel Proust's most popular understudy ?"],"info":{}}
{"id":"train_16975","question":"For what award was Jocelyn Bell Burnell given in the year 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q233974 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["Which award did Jocelyn Bell Burnell receive in 2014?"],"info":{}}
{"id":"train_16977","question":"Is the individual tax rate of  Netherlands equal to \n43.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q55 wdt:P2834 ?obj filter ( ?obj = 43.8 ) }","paraphrases":["What is the individual tax rate in the Netherlands?"],"info":{}}
{"id":"train_16978","question":"What physical quantity measures temperature and has the word \"planck\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2394680 . ?sbj wdt:P111 wd:Q11466 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'planck' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What physical quantity measures temperature and has the word \"planck\" in its name?"],"info":{}}
{"id":"train_16979","question":"What is the prize money Tobias Asser received with is Nobel Peace Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q216872 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P2121 ?value }","paraphrases":["What prize money did Tobias Asser receive from his Nobel Peace Prize?"],"info":{}}
{"id":"train_16980","question":"Name the Han dynasty capital city with a twin town called Plovdiv.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7209 wdt:P36 ?answer . ?answer wdt:P190 wd:Q459 }","paraphrases":["Title the Han line capital city with a twin town called Plovdiv."],"info":{}}
{"id":"train_16981","question":"Tell me medical procedure whose name has the word venipuncture in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q796194 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'venipuncture' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know therapeutic method whose title has the word venipuncture in it."],"info":{}}
{"id":"train_16982","question":"WHICH ARE THE AUDIO AND VIDEO INTERFACES AND CONNECTORS THAT STARTS WITH Y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1153429 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH ARE THE Sound AND VIDEO Interfacing AND CONNECTORS THAT Begins WITH Y"],"info":{}}
{"id":"train_16983","question":"Andrew Lloyd Webber composed which musical?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P86 wd:Q180975 . ?sbj wdt:P31 wd:Q2743 }","paraphrases":["Andrew Lloyd Webber composed which musical?"],"info":{}}
{"id":"train_16984","question":"Is the Emperor Gaozu of Han buried in the Yanta District?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7210 wdt:P20 ?answer . ?answer wdt:P150 wd:Q1358596 }","paraphrases":["Is the Sovereign Gaozu of Han buried within the Yanta Locale?"],"info":{}}
{"id":"train_16987","question":"Who is the father of Mukesh Ambani","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P22 wd:Q298547 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the dad of Mukesh Ambani"],"info":{}}
{"id":"train_16988","question":"When did Charles Grey, 2nd Earl Grey, end his position as the Secretary of State for Foreign and Commonwealth Affairs?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q294662 p:P39 ?s . ?s ps:P39 wd:Q1371091 . ?s pq:P582 ?value }","paraphrases":["When did Charles Grey, 2nd Earl of Grey, Retire from the position of Secratary of State for Foreign and Common Wealth Affairs?"],"info":{}}
{"id":"train_16990","question":"When did Hakeem Olajuwon win the NBA All-Defensive Team award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q273256 p:P166 ?s . ?s ps:P166 wd:Q1465181 . ?s pq:P585 ?value }","paraphrases":["Give me the date that Hakeem Olajuwon win the NBA All-Defensive Team award."],"info":{}}
{"id":"train_16991","question":"Lake Tanganyika is endemic to what?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P183 wd:Q5511 }","paraphrases":[],"info":{}}
{"id":"train_16994","question":"was anne frank's religion Judaism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4583 wdt:P140 wd:Q9268 }","paraphrases":["Treatment of hepatitis C virus: the first decade. Interferon alfa therapy emerged as an early treatment option for patients with chronic hepatitis C. ... However, ribavirin can induce reversible hemolytic anemia, and combination therapy with a ribavirin/interferon regimen is not tolerated as well as interferon is alone."],"info":{}}
{"id":"train_16995","question":"Which is the license to broadcast to Billings?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1408 wd:Q166304 }","paraphrases":[],"info":{}}
{"id":"train_16996","question":"How did Eros have Nyx as a mother?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q121973 p:P25 ?s . ?s ps:P25 wd:Q131203 . ?s pq:P1013 ?value }","paraphrases":["How did Eros have Nyx as a mother?"],"info":{}}
{"id":"train_16997","question":"What time does Fawlty Towers, whose producer is John Howard Davies start?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q212731 p:P162 ?s . ?s ps:P162 wd:Q772224 . ?s pq:P580 ?value }","paraphrases":["When did Fawlty Towers, produced by John Howard Davies start?"],"info":{}}
{"id":"train_16998","question":"What colo are Jennifer Aniston's eyes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q32522 wdt:P1340 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16999","question":"Is Rod Stewart's children Sean Stewart and Ruby Stewart?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q182655 wdt:P40 wd:Q7441455 . wd:Q182655 wdt:P40 wd:Q7376392 }","paraphrases":["Are Sean Stewart and Ruby Steward the children of Rod Stewart?"],"info":{}}
{"id":"train_17000","question":"Which is the General council of the legislative body of Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q90 wdt:P194 ?obj . ?obj wdt:P31 wd:Q1398920 }","paraphrases":["Which is the Common committee of the administrative body of Paris?"],"info":{}}
{"id":"train_17001","question":"Which Class IB flammable liquid ester has the lowest vapor pressure?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P2119 ?obj . ?ent wdt:P31 wd:Q101487 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What Class IB flammable liquid ester possesses the vapor pressure that is lowest?"],"info":{}}
{"id":"train_17003","question":"What is the political alignment of Zionism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1387 wd:Q42388 }","paraphrases":[],"info":{}}
{"id":"train_17004","question":"Texas Tech University is located at what street address?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1423756 wdt:P969 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17005","question":"What is the canonisation status of the patron saint of zoos?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43501 wdt:P417 ?X . ?X wdt:P411 ?answer }","paraphrases":["What is the zoo patron saint's canonization status?"],"info":{}}
{"id":"train_17008","question":"Which is the Sambafoot player ID for Pelé?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12897 wdt:P3668 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17009","question":"In Jan. 1st, 801 AD, what is the sourcing circumstance for Al-Kindi?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q179759 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( ?x , '801-1-1' ) ) . ?s pq:P1480 ?value }","paraphrases":["How was sourcing for Al-Kindi in 801 AD?"],"info":{}}
{"id":"train_17010","question":"How many devices operating systems are iOS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P306 wd:Q48493 }","paraphrases":["What number of iOS operating systems are there?"],"info":{}}
{"id":"train_17011","question":"What is the symbol of Turdus migratorius?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2238 wd:Q460967 }","paraphrases":[],"info":{}}
{"id":"train_17015","question":"who was nominated for pulp fiction in 1994-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q104123 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["pulp fiction nominees for 1994?"],"info":{}}
{"id":"train_17016","question":"Was Sylvester Stallone a film producer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q40026 wdt:P106 wd:Q3282637 }","paraphrases":["Did Sly Stallone ever produce films?"],"info":{}}
{"id":"train_17017","question":"What level of court is the Supreme Court of the United States?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4884 wd:Q11201 }","paraphrases":[],"info":{}}
{"id":"train_17018","question":"What is the domain of the disciple of Al-Khalil ibn Ahmad al-Farahidi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q293515 wdt:P802 ?X . ?X wdt:P101 ?answer }","paraphrases":["Al-Khalil ibn Ahmad al-Farahidi is in what domain?"],"info":{}}
{"id":"train_17021","question":"What are the coordinates for the river source of Moselle?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1667 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }","paraphrases":["On what coordinates is the river source of Moselle ?"],"info":{}}
{"id":"train_17022","question":"Which kind of music was written for Shadows and Light?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11307710 wdt:P86 ?X . ?X wdt:P136 ?answer }","paraphrases":["What was the style of music written for Shadows and Light?"],"info":{}}
{"id":"train_17024","question":"When did educated at of Janet Yellen and point in time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q263725 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["When did taught at of Janet Yellen and point in time?"],"info":{}}
{"id":"train_17026","question":"Who is Julia Gillard's partner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P451 wd:Q41563 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is Julia Gillard's accomplice?"],"info":{}}
{"id":"train_17027","question":"What is the sovereign state that the American Revolutionary War took place?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q40949 wdt:P276 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["The American Revolutionary War took place in which sovereign state?"],"info":{}}
{"id":"train_17029","question":"How many participants did Nursultan Nazarbayev have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P710 wd:Q57394 }","paraphrases":["Which is the number of the participants that Nursultan Nazarbayev have?"],"info":{}}
{"id":"train_17031","question":"Did Saving Private Ryan have the cast members Matt Damon and Harve Presnell?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q165817 wdt:P161 wd:Q175535 . wd:Q165817 wdt:P161 wd:Q1395333 }","paraphrases":["Were Matt Damon and Harve Presnell the cast members of Saving Private Ryan?"],"info":{}}
{"id":"train_17032","question":"Who is the contestant to be the successor of \"Warning by the Devil's Fire\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3025433 wdt:P156 ?X . ?X wdt:P161 ?answer }","paraphrases":["Who is the contender to be the successor of \"Caution by the Devil's Fire\"?"],"info":{}}
{"id":"train_17033","question":"When did Oswald Mosley get elected in as a member of Parliament?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q332400 p:P39 ?s . ?s ps:P39 wd:Q41582582 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }","paraphrases":["When did Oswald Mosley get chosen in as a part of Parliament?"],"info":{}}
{"id":"train_17034","question":"Was Idi Amin in the British Armed Forces and Uganda People's Defence Force?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q48231 wdt:P241 wd:Q275482 . wd:Q48231 wdt:P241 wd:Q1075380 }","paraphrases":["Is it true that Idi Amin was in the British Armed Forces and Uganda People's Defence Force?"],"info":{}}
{"id":"train_17035","question":"What is the relationship between Vaclav Havel and Dagmar Havlova?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36233 p:P1038 ?s . ?s ps:P1038 wd:Q5107449 . ?s pq:P1039 ?value }","paraphrases":["What was the relationship between Vaclav Havel and Dagmar Havlova?"],"info":{}}
{"id":"train_17036","question":"Where does Tim Burton work and who is his spouse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q56008 wdt:P108 ?ans_1 . wd:Q56008 wdt:P26 ?ans_2 }","paraphrases":["Who is the spouse of Tim Burton and where does he work?"],"info":{}}
{"id":"train_17038","question":"What is the audio pronunciation of the language signed by Hippolyte Bayard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q559668 wdt:P1412 ?X . ?X wdt:P443 ?answer }","paraphrases":["What is the sound articulation of the dialect marked by Hippolyte Bayard?"],"info":{}}
{"id":"train_17041","question":"Who is the {human} for {founded by} of {Indian National Congress}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10225 wdt:P112 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who founded the Indian National Congress?"],"info":{}}
{"id":"train_17042","question":"What and where did Daniel McFadden study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q312560 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["What and where did Daniel McFadden study?"],"info":{}}
{"id":"train_17043","question":"What are the athletic conference which start with the letter n","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2992826 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the athletic conference which begin with the letter n"],"info":{}}
{"id":"train_17045","question":"What is the Q48460 of faith of Kazakh Khanate ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1433867 wdt:P140 ?X . ?X wdt:P1036 ?answer }","paraphrases":["What is the Q48460 of confidence of Kazakh Khanate ?"],"info":{}}
{"id":"train_17046","question":"What are the spiritual practice which start with the letter M","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2270606 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the spiritual practice which begin with the letter M"],"info":{}}
{"id":"train_17047","question":"What are the honors of Mike Nichols, whose victor is Alfred Hitchcock?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51537 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q7374 }","paraphrases":["What are the respects of Mike Nichols, whose victor is Alfred Hitchcock?"],"info":{}}
{"id":"train_17048","question":"Which is {location of birth} {consecrated by} {Dieudonné Nzapalainga} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1224285 wdt:P1598 ?X . ?X wdt:P19 ?answer }","paraphrases":["Which is {area of birth} {sanctified by} {Dieudonné Nzapalainga} ?"],"info":{}}
{"id":"train_17051","question":"What is the citation venue of the single evolutionary origin of chlorinated auxin that provides a phylogenetically informative trait in the Fabaceae?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41541995 wdt:P2860 ?X . ?X wdt:P1433 ?answer }","paraphrases":["What is the quotation scene of the single developmental root of chlorinated auxin that gives a phylogenetically instructive characteristic within the Fabaceae?"],"info":{}}
{"id":"train_17052","question":"Which are the foods traditionally associated with Easter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q21196 wdt:P868 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17053","question":"What was the award received by Mikhail Zharov during the point in time of 1967-10-27?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q764546 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1967' ) ) }","paraphrases":["Name the award received by Mikhail Zharov October 10, 1967."],"info":{}}
{"id":"train_17057","question":"Where did Jessica Alba get married where Cash Garner Warren was the spouse?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q44077 p:P26 ?s . ?s ps:P26 wd:Q924620 . ?s pq:P2842 ?value }","paraphrases":["At what place did Jessica Alba get married when she became Cash Garner's spouse?"],"info":{}}
{"id":"train_17058","question":"what is born at is in the region of opava district?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q155695 wdt:P19 ?answer . ?answer wdt:P131 wd:Q838320 }","paraphrases":["what is born at is within the locale of opava area?"],"info":{}}
{"id":"train_17059","question":"Tell me stellar wind  whose name has the word solar in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q654396 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'solar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know stellar wind whose title has the word sun powered in it."],"info":{}}
{"id":"train_17060","question":"The Gregorian calendar is based on what and is the main regulatory text for who?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q12138 wdt:P92 ?ans_1 . wd:Q12138 wdt:P144 ?ans_2 }","paraphrases":["What is the Gregorian calendar based on and who is the main regulatory text for?"],"info":{}}
{"id":"train_17061","question":"How many properties are owned by The Coca-Cola Company} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P127 wd:Q3295867 }","paraphrases":["Which properties does the Coca-Cola Company own?"],"info":{}}
{"id":"train_17062","question":"Which is the next Magnesium element that is followed after Aluminium?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q660 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P156 wd:Q663 }","paraphrases":["What Magnesium element comes after Aluminum?"],"info":{}}
{"id":"train_17067","question":"Who directed Neon Genesis Evangelion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q662 wdt:P57 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who coordinated Neon Beginning Evangelion?"],"info":{}}
{"id":"train_17068","question":"What is different to Medes who is Bayreuth and has admin HQ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8735 wdt:P1889 ?answer . ?answer wdt:P159 wd:Q3923 }","paraphrases":["What is distinctive to Medes who is Bayreuth and has admin HQ?"],"info":{}}
{"id":"train_17069","question":"What space velocity starts with the letter \"v\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4234997 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What space speed begins with the letter \"v\"?"],"info":{}}
{"id":"train_17070","question":"What was Barbara Stanwyck nominated for for Double Indememnity?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q478209 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q94002 }","paraphrases":["Which was Barbara Stanwyck nominated for for Double Indememnity?"],"info":{}}
{"id":"train_17071","question":"Did Nancy Pelosi participated in the Inauguration of John F. Kennedy and efforts to impeach George W. Bush?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q170581 wdt:P793 wd:Q6013770 . wd:Q170581 wdt:P793 wd:Q3326788 }","paraphrases":["Did Nancy Pelosi participate in both the inauguration of John F. Kennedy and the efforts to impeach George W. Bush?"],"info":{}}
{"id":"train_17073","question":"Tell me human migration whose name has the word uruguayan in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q177626 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'uruguayan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know human relocation whose title has the word uruguayan in it."],"info":{}}
{"id":"train_17077","question":"Which is the EuroTour golf player ID of Arnold Palmer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9434 wdt:P3521 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17079","question":"Who was the Hans Memling that was born in 1435?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q106851 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( YEAR ( ?x ) , '1435' ) ) . ?s pq:P31 ?value }","paraphrases":["In 1435 Hans Memling was born, what was he noted for?"],"info":{}}
{"id":"train_17080","question":"What was Mali's population in 1973?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q912 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1973' ) ) }","paraphrases":["Give me the population of Mali in 1973?"],"info":{}}
{"id":"train_17081","question":"Tell me nutrient whose name has the word vitamin in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q181394 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vitamin' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the nutrient the name of which contains the word vitamin."],"info":{}}
{"id":"train_17082","question":"What is the mains plug type that's been replaced in the Union of South Africa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q193619 wdt:P1366 ?X . ?X wdt:P2853 ?answer }","paraphrases":["What is the mains plug sort that's been supplanted within the Union of South Africa?"],"info":{}}
{"id":"train_17086","question":"Who is the chairwoman of Mossad, whose member party is the Israeli Labor Party?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34216 wdt:P488 ?answer . ?answer wdt:P102 wd:Q210703 }","paraphrases":["Who is the chairwoman of Mossad, whose member party is the Israeli Labor Party?"],"info":{}}
{"id":"train_17088","question":"\"Who is {husband} of {Michael Curtiz}, whose {first name} is {Lucy} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51491 wdt:P26 ?answer . ?answer wdt:P735 wd:Q13365715 }","paraphrases":["\"Who is {spouse} of {Michael Curtiz}, whose {to begin with title} is {Lucy} ?\""],"info":{}}
