{"id":"train_9389","question":"What is the speed of sound of liquid mercury?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q925 p:P2075 ?s . ?s ps:P2075 ?obj . ?s pq:P515 wd:Q11435 }","paraphrases":["What is the speed of sound of fluid mercury?"],"info":{}}
{"id":"train_9390","question":"What is the main food source and the locomotion means of Orangutan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q41050 wdt:P1034 ?ans_1 . wd:Q41050 wdt:P3512 ?ans_2 }","paraphrases":["Name the main food source of the orangutan, along with its means of travel."],"info":{}}
{"id":"train_9391","question":"What is the wavelength of 2MASS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1454942 wdt:P2808 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9392","question":"What is the perimeter of Kahoolawe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q224086 wdt:P2547 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9394","question":"How many have received the award of baron?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P166 wd:Q165503 }","paraphrases":["The award of baron has been received by how many people?"],"info":{}}
{"id":"train_9395","question":"What arrondissement is the Waikato Region, the highest judicial authority in the Supreme Court of New Zealand?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q139918 wdt:P131 ?answer . ?answer wdt:P209 wd:Q1355832 }","paraphrases":["What arrondissement is the Waikato Locale, the most noteworthy legal specialist within the Incomparable Court of Unused Zealand?"],"info":{}}
{"id":"train_9396","question":"What is the maximum lifetime of isotope of neutronium?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12525553 . ?ent wdt:P2645 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Is there a maximum lifetime of isotope of neutronium?"],"info":{}}
{"id":"train_9397","question":"WHO IS THE POLITICAL LEADER OF ROBERT BORRIE?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7342220 wdt:P102 ?X . ?X wdt:P488 ?answer }","paraphrases":["WHO IS THE POLITICAL Pioneer OF ROBERT BORRIE?"],"info":{}}
{"id":"train_9398","question":"What position did Benedict XVI hold, and who was his successor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q2494 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P156 ?value1 . }","paraphrases":["What role did Benedict XVI hold, and who was once his successor?"],"info":{}}
{"id":"train_9403","question":"What language was spoken by Nathaniel Hawthorne that has a grammatical person in the third-person neuter singular?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q69339 wdt:P1412 ?answer . ?answer wdt:P5110 wd:Q52433289 }","paraphrases":["What dialect was talked by Nathaniel Hawthorne that incorporates a syntactic individual within the third-person fix singular?"],"info":{}}
{"id":"train_9404","question":"Is the lowest atmospheric pressure of the Typhoon Nina greater than 1092.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q134484 wdt:P2532 ?obj filter ( ?obj > 1092.0 ) }","paraphrases":["Is 1092.0 greater than the lowest atmospheric pressure of the Typhoon Nina?"],"info":{}}
{"id":"train_9406","question":"Who is the characters Bowser as it is shown?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q845864 wdt:P1441 ?X . ?X wdt:P674 ?answer }","paraphrases":["Who is the characters Bowser because it is shown?"],"info":{}}
{"id":"train_9410","question":"WHICH IS THE F TYPE ,AON SEQUENCE WITH THE MOST ABOLUTE MAGNITUDE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1353952 . ?ent wdt:P1457 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["what  is the f type, AON sequence with the most abolute magnitude"],"info":{}}
{"id":"train_9412","question":"Is it true that the operating income of the AeroLogic is less than 9840000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q381509 wdt:P3362 ?obj filter ( ?obj < 9840000.0 ) }","paraphrases":["Is the operating income of the AeroLogic less than 9840000?"],"info":{}}
{"id":"train_9413","question":"Tell me which is the reference model that starts with the letter m!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q356674 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know which is the reference show that begins with the letter m!"],"info":{}}
{"id":"train_9414","question":"What are the social philosophy which start with the letter eugenics","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q180592 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'eugenics' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the social logic which begin with the letter eugenics"],"info":{}}
{"id":"train_9415","question":"What Uranus moon was developed by David C. Jewitt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q324 wdt:P398 ?answer . ?answer wdt:P61 wd:Q382992 }","paraphrases":["What Uranus moon was created by David C. Jewitt?"],"info":{}}
{"id":"train_9416","question":"What network uses Internet Protocol version 4","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2283 wd:Q11103 . ?sbj wdt:P31 wd:Q15836568 }","paraphrases":["What arrange employments Web Convention adaptation 4"],"info":{}}
{"id":"train_9417","question":"Which musician of Deck the Hallas awarded the nomination for MTV Video Music Award in Online Artist catagory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2287842 wdt:P175 ?answer . ?answer wdt:P1411 wd:Q821166 }","paraphrases":["Which artist of Deck the Hallas granted the designation for MTV Video Music Grant in Online Craftsman catagory?"],"info":{}}
{"id":"train_9420","question":"Who is the{film} for {distributor} of {20th Century Fox}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P750 wd:Q434841 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Who is the{film} for {wholesaler} of {20th Century Fox}"],"info":{}}
{"id":"train_9421","question":"Is the mortality rate of Finland 163.3","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q24175139 wdt:P2844 ?obj filter ( ?obj = 163.3 ) }","paraphrases":["Is Finland's mortality rate 163.3?"],"info":{}}
{"id":"train_9423","question":"What was the time when Henan had Zhengzhou as its capital?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43684 p:P36 ?s . ?s ps:P36 wd:Q30340 . ?s pq:P580 ?value }","paraphrases":["When did Henan have Ahengzhou as its capital?"],"info":{}}
{"id":"train_9424","question":"Nigel Farage was employed by whom and until when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q318471 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who did Nigel Farage work for and when did he quit?"],"info":{}}
{"id":"train_9425","question":"What is editor for  Catherine II of Russia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P98 wd:Q36450 }","paraphrases":[],"info":{}}
{"id":"train_9426","question":"Is the annual energy output of Walney Wind Farm equal to 1300?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1330226 wdt:P4131 ?obj filter ( ?obj = 1300 ) }","paraphrases":["Is the yearly vitality yield of Walney Wind Cultivate rise to to 1300?"],"info":{}}
{"id":"train_9427","question":"Who is the chairman of the member of Gordon S. Wood?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5585778 wdt:P463 ?X . ?X wdt:P488 ?answer }","paraphrases":["Which member of Gordon S. Wood is the chairman?"],"info":{}}
{"id":"train_9429","question":"what are the mineral species that contains the word zoisite  in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55076514 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zoisite' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the mineral species that contains the word zoisite in it"],"info":{}}
{"id":"train_9430","question":"I want to know what are the stories of the languages of Sara Montiel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q268587 wdt:P1412 ?X . ?X wdt:P2184 ?answer }","paraphrases":["I need to know what are the stories of the dialects of Sara Montiel?"],"info":{}}
{"id":"train_9431","question":"Who is Joe Dimaggio's brother?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q297142 p:P3373 ?s . ?s ps:P3373 ?obj . ?s pq:P1039 wd:Q10861465 }","paraphrases":["Give the name of Joe Dimaggio's brother."],"info":{}}
{"id":"train_9432","question":"Did Glen Campbell have the record label Motown and Liberty Records?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q162667 wdt:P264 wd:Q43327 . wd:Q162667 wdt:P264 wd:Q1392321 }","paraphrases":["Was Glen Cambell the owner of record label Motown and Liberty Records?"],"info":{}}
{"id":"train_9433","question":"who is the father and child of Vince_McMahon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q44430 wdt:P22 ?ans_1 . wd:Q44430 wdt:P40 ?ans_2 }","paraphrases":["Who is Vince McMahon's male parent and offspring?"],"info":{}}
{"id":"train_9435","question":"What is Taiga the continent of,  and which is 46.0 7.0 and has wgs-84 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q69564 wdt:P30 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '46.0 7.0' ) ) }","paraphrases":["What is Taiga the continent of, and which is 46 7.0 and has wgs-84 ?"],"info":{}}
{"id":"train_9436","question":"What is the headquarters of Ghent University, whose telephone prefix is 09?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1137665 wdt:P159 ?answer . ?answer wdt:P473 ?x FILTER ( contains ( ?x , '09' ) ) }","paraphrases":["What is the central command of Ghent College, whose phone prefix is 09?"],"info":{}}
{"id":"train_9437","question":"Which is the religious text that follows the Exodus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9190 wdt:P155 ?obj . ?obj wdt:P31 wd:Q179461 }","paraphrases":["Which is the devout content that takes after the Exodus?"],"info":{}}
{"id":"train_9438","question":"tell me hindu deity starts with y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q979507 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know hindu god begins with y"],"info":{}}
{"id":"train_9439","question":"Is the lower flammable limit of styrene less than 1.08?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28917 wdt:P2202 ?obj filter ( ?obj < 1.08 ) }","paraphrases":["Is the low end flammability of styrene less than 1.08?"],"info":{}}
{"id":"train_9440","question":"When did Charles VII of France King of France","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q133372 p:P39 ?s . ?s ps:P39 wd:Q18384454 . ?s pq:P580 ?value }","paraphrases":["Charles VII of France was King during what time period?"],"info":{}}
{"id":"train_9441","question":"\"What is {made by} of {Cthulhu}, which has {floruit start} is {1897-0-0} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12038 wdt:P170 ?answer . ?answer wdt:P2031 ?x FILTER ( contains ( YEAR ( ?x ) , '1897' ) ) }","paraphrases":["\"What is {made by} of {Cthulhu}, which has {floruit begin} is {1897-0-0} ?\""],"info":{}}
{"id":"train_9442","question":"Henry II of France wore what kind of plate armor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q132545 wdt:P3828 ?obj . ?obj wdt:P31 wd:Q3391846 }","paraphrases":["What kind of plate armor did Henry II of France wear?"],"info":{}}
{"id":"train_9443","question":"What is the language from which Liwyatan is translated to Leviathan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q192677 p:P1705 ?s . ?s ps:P1705 ?obj . ?s pq:P2440 ?x filter ( contains ( ?x , 'Liwyāṯān' ) ) }","paraphrases":["Which language was used to translate Liwyatan to Leviathan?"],"info":{}}
{"id":"train_9445","question":"What is the  translation of birth name of Averroes?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q39837 p:P1477 ?s . ?s ps:P1477 ?obj . ?s pq:P2440 ?x filter ( contains ( ?x , 'Abū l-Walīd Muhammad ibn Ahmad ibn Rushd' ) ) }","paraphrases":["What is the interpretation of original name of Averroes?"],"info":{}}
{"id":"train_9447","question":"What award did Earl Warren receive in the year 1969?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q311197 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1969' ) ) }","paraphrases":["Which award  did Earl Warren win in the year 1969?"],"info":{}}
{"id":"train_9449","question":"Tell me about the dialects of Tagalog.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4913 wd:Q34057 . ?sbj wdt:P31 wd:Q33384 }","paraphrases":["Let me know around the lingos of Tagalog."],"info":{}}
{"id":"train_9452","question":"What is the diplomatic relation of the basin countries of the Black Sea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q166 wdt:P205 ?X . ?X wdt:P530 ?answer }","paraphrases":["What diplomatic relations do the basin countries have?"],"info":{}}
{"id":"train_9453","question":"What significant event is proportionate to 0.001 Russian ruble?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41044 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P1107 ?x filter ( contains ( ?x , '0.001' ) ) }","paraphrases":["0.001 Russian ruble is proportionate to which other significant event?"],"info":{}}
{"id":"train_9454","question":"WHICH IS THE POINT GROUP PG QUARTZ","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q43010 wdt:P589 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9455","question":"What is position held of Constans II that is replaces of Heraklonas ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41613 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q31513 }","paraphrases":["Costans II held what position that replaces of Heraklonas"],"info":{}}
{"id":"train_9457","question":"Is the date of birth for Christoper Columbus 1451-10-31?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7322 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1326 ?x filter ( contains ( YEAR ( ?x ) , '1451' ) ) }","paraphrases":["What day was Christopher Columbus born?"],"info":{}}
{"id":"train_9458","question":"When did Maurice Sendak receive the Astrid Lindgren Memorial Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q314771 p:P166 ?s . ?s ps:P166 wd:Q430035 . ?s pq:P585 ?value }","paraphrases":["Maurice Sendak received the Astrid Lingdren Memorial Award when?"],"info":{}}
{"id":"train_9459","question":"How many matches did Jock Stein play for what team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q355378 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["How numerous matches did Muscle head Stein play for what team?"],"info":{}}
{"id":"train_9460","question":"Which is the YSO ID for Lesotho?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1013 wdt:P2347 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9461","question":"Who performed the role of fictional human for Ben Affleck}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P175 wd:Q483118 . ?sbj wdt:P31 wd:Q15632617 }","paraphrases":["What was the name of the person who performed the fictional human role for Ben Affleck?"],"info":{}}
{"id":"train_9464","question":"Which automobile marque has the highest assets?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q17412622 . ?ent wdt:P2403 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What car marque has the greatest assets?"],"info":{}}
{"id":"train_9465","question":"Name the mainland territorial place of Australia for substituting the Northern Territory","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3235 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q14192234 }","paraphrases":["Title the terrain regional put of Australia for substituting the Northern Territory"],"info":{}}
{"id":"train_9468","question":"What are the universal library which start with the letter I","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2495568 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the universal library that begins with the letter I"],"info":{}}
{"id":"train_9469","question":"Tell me what human migration starts with the letter u.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q177626 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me what the letter u begins with human migration."],"info":{}}
{"id":"train_9472","question":"Who invented the Hamiltonian mechanics that consisted the members of National Academy of Science?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q477921 wdt:P61 ?answer . ?answer wdt:P463 wd:Q270794 }","paraphrases":["Who concocted the Hamiltonian mechanics that comprised the individuals of National Foundation of Science?"],"info":{}}
{"id":"train_9474","question":"What language does Miriam Makeba speak, that has a French influence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q146256 wdt:P1412 ?answer . ?answer wdt:P737 wd:Q150 }","paraphrases":["What language does Miriam Makeba speak, that has a French influence?"],"info":{}}
{"id":"train_9480","question":"What is the name of a data structure that starts with the letter t.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q175263 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a information structure that begins with the letter t."],"info":{}}
{"id":"train_9481","question":"In the denomination of Sikhism, What is Martha's sainthood status?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q232453 wdt:P411 ?answer . ?answer wdt:P140 wd:Q9316 }","paraphrases":["In the denomination of Sikhism, What is Martha's sainthood status?"],"info":{}}
{"id":"train_9483","question":"Which is the birthplace of Alexander Nevsky, that has STD code 48535 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q174044 wdt:P19 ?answer . ?answer wdt:P473 ?x FILTER ( contains ( ?x , '48535' ) ) }","paraphrases":["What is the birthplace of Alexander Nevsky, that has STD code 48535?"],"info":{}}
{"id":"train_9485","question":"Who is the mother of Herod the Great, who bore him as Herod Antipas?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q51672 p:P40 ?s . ?s ps:P40 wd:Q192950 . ?s pq:P25 ?value }","paraphrases":["Who was Herod the Great's mom?"],"info":{}}
{"id":"train_9486","question":"Is the electric dipole moment of acetic acid equal to 1.74?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47512 wdt:P2201 ?obj filter ( ?obj = 1.74 ) }","paraphrases":["Is the electric dipole minute of acidic corrosive break even with to 1.74?"],"info":{}}
{"id":"train_9488","question":"Tell me the most notable work of Christopher Hitchens and also the publisher.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P123 ?value1 . }","paraphrases":["Let me know the foremost outstanding work of Christopher Hitchens additionally the distributer."],"info":{}}
{"id":"train_9489","question":"Which {artist} {precedes} by {Die, Die My Darling} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2337653 wdt:P156 ?X . ?X wdt:P175 ?answer }","paraphrases":["Which {craftsman} {goes before} by {Pass on, Pass on My Dear} ?"],"info":{}}
{"id":"train_9491","question":"What is in the borough of Berlin U-Bahn whose inhabitants are 6000.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q68646 wdt:P131 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '6000.0' ) ) }","paraphrases":["What is within the borough of Berlin U-Bahn whose tenants are 6000.0?"],"info":{}}
{"id":"train_9493","question":"What is the Wikimedia list page for The Thinker","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P360 wd:Q18003128 . ?sbj wdt:P31 wd:Q13406463 }","paraphrases":["What is The Thinker's Wikimedia List Page"],"info":{}}
{"id":"train_9494","question":"Which is the heart pulse found in the species of glycerol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132501 wdt:P703 ?X . ?X wdt:P3395 ?answer }","paraphrases":["Which is the heart beat found within the species of glycerol?"],"info":{}}
{"id":"train_9495","question":"What is Art UK collection ID for National Gallery?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q180788 wdt:P1751 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9496","question":"Does the president hold the office that is the head of the government?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1313 wd:Q30461 }","paraphrases":["Is the president the head of the government?"],"info":{}}
{"id":"train_9502","question":"Name a country involved in Korean War","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1344 wd:Q8663 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["What was one of the countries involved in the Korean War?"],"info":{}}
{"id":"train_9503","question":"Which is the fruit which contains the word pomelo in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3314483 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pomelo' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the natural product which contains the word pomelo in it's title?"],"info":{}}
{"id":"train_9507","question":"Thomas Aquinas holds which position relating to his occupation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9438 wdt:P106 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["WHICH POSITION THOMAS AQUINAS HOLDS RELATED TO HIS OCCUPATION"],"info":{}}
{"id":"train_9509","question":"What works did the sculptor Ebenezer Scrooge do?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q626756 wdt:P170 ?X . ?X wdt:P800 ?answer }","paraphrases":["What works did the stone carver Ebenezer Penny pincher do?"],"info":{}}
{"id":"train_9515","question":"What was the attempted murder method used against Henry Clay Frick?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q93709 wdt:P509 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What was the endeavored kill strategy utilized against Henry Clay Frick?"],"info":{}}
{"id":"train_9517","question":"Who received the X-Men top dog nomination?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q106182 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who got the X-Men big enchilada selection?"],"info":{}}
{"id":"train_9518","question":"What astronaut mission of human spaceflight did Christa McAuliffe do?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q229674 wdt:P450 ?obj . ?obj wdt:P31 wd:Q752783 }","paraphrases":["Christa McAuliffe was an astronaut on which mission of human spaceflight?"],"info":{}}
{"id":"train_9519","question":"When did Kevin Garnett receive the NBA Most Valuable Player Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q189240 p:P166 ?s . ?s ps:P166 wd:Q222047 . ?s pq:P585 ?value }","paraphrases":["When did Kevin Garnett get the NBA Most Profitable Player Award?"],"info":{}}
