{"id":"train_20055","question":"Which school is Harry Glicken's alma mater and is located at 35.7133?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1452793 wdt:P69 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '35.7133' ) ) }","paraphrases":["Which faculty is Harry Glicken's alma mater and is located at 35.7133?"],"info":{}}
{"id":"train_20057","question":"Name the official designation held by Bashar al-Assad","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1308 wd:Q44329 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["Name Bashar al - Assad's official designation"],"info":{}}
{"id":"train_20058","question":"What number was Guadalupe Victoria President of Mexico?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q311425 p:P39 ?s . ?s ps:P39 wd:Q628004 . ?s pq:P1545 ?value }","paraphrases":["How many presidents preceded Guadalupe Victoria President of Mexico?"],"info":{}}
{"id":"train_20059","question":"What forename of John Henry Anderson's is the same as Gian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3809328 wdt:P735 ?answer . ?answer wdt:P460 wd:Q1522259 }","paraphrases":["What forename of John Henry Anderson's is the same as Gian?"],"info":{}}
{"id":"train_20060","question":"which class of instruments starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1254773 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which instrument class begins with s"],"info":{}}
{"id":"train_20061","question":"What are the ship type which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2235308 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the transport sort which begin with the letter w"],"info":{}}
{"id":"train_20062","question":"Was Jennifer Hudson in the running for the Academy Award for Best Actor and the NAACP Image Award for Outstanding Duo or Group?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q192410 wdt:P1411 wd:Q103916 . wd:Q192410 wdt:P1411 wd:Q17011874 }","paraphrases":["Was Jennifer Hudson within the running for the Foundation Grant for Best On-screen character and the NAACP Picture Grant for Extraordinary Pair or Gather?"],"info":{}}
{"id":"train_20063","question":"What work was Mary Magdalene involved in and at where did she die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q63070 wdt:P1441 ?ans_1 . wd:Q63070 wdt:P20 ?ans_2 }","paraphrases":["What line of work was Mary Magdalene involved in when she died?"],"info":{}}
{"id":"train_20065","question":"What subordinate companies does Dassault of Rafale hold?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190973 wdt:P137 ?X . ?X wdt:P355 ?answer }","paraphrases":["What subordinate companies does Dassault of Rafale hold?"],"info":{}}
{"id":"train_20067","question":"For what piece of work was Viola Davis nominated for a Tony Award for Best Featured Actress in a Play?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q229181 p:P1411 ?s . ?s ps:P1411 wd:Q627778 . ?s pq:P805 ?value }","paraphrases":["Viola Davis was given consideration for a Tony Award for Best Featured Actress in which theatrical production?"],"info":{}}
{"id":"train_20068","question":"Name a high-altitude German aircraft.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11436 . ?ent wdt:P2254 ?obj . ?ent wdt:P17 wd:Q183 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Give me the name of a high-altitude German aircraft."],"info":{}}
{"id":"train_20072","question":"Which products are made by Pilatus P-5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2094865 wdt:P176 ?X . ?X wdt:P1056 ?answer }","paraphrases":["Which products do Pilatus P-5 produce?"],"info":{}}
{"id":"train_20074","question":"How many runways are at Charles de Gaulle Airport in Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q46280 wdt:P529 ?obj }","paraphrases":["Charles de Gaulle Airport has how many airstrips?"],"info":{}}
{"id":"train_20075","question":"At the start time of 1174-1-1, what was the noble title of Saladin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8581 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1174' ) ) }","paraphrases":["What was the noble title of Saladin beginning at the time of 1174-1-1?"],"info":{}}
{"id":"train_20076","question":"WHICH IS THE TYPE OF BUSINESS ENTITY IN THE USA THAT APPLIES TO JURISDICTION IN UNITED STATES OF AMERICA AND THAT STARTS WITH C","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q57653825 . ?sbj wdt:P1001 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE TYPE OF BUSINESS ENTITY IN THE USA THAT APPLIES TO JURISDICTION IN UNITED STATES OF AMERICA AND THAT STARTS WITH C"],"info":{}}
{"id":"train_20077","question":"Name the tour in Teatro Colón with the most representations ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q14957229 . ?ent wdt:P5027 ?obj . ?ent wdt:P276 wd:Q827401 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the tour with the most performances at the Teatro Colón?"],"info":{}}
{"id":"train_20078","question":"Who is the suspect of the Battle of Bouvines, whose gender identity is male?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q830626 wdt:P710 ?answer . ?answer wdt:P21 wd:Q6581097 }","paraphrases":["Who is the suspect of the Fight of Bouvines, whose sexual orientation character is male?"],"info":{}}
{"id":"train_20080","question":"What medication works on Chickenpox?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2175 wd:Q44727 . ?sbj wdt:P31 wd:Q12140 }","paraphrases":["What medicine works on Chickenpox?"],"info":{}}
{"id":"train_20081","question":"What website starts with the letter \"z\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q35127 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["List the wevsite that starts with the letter \"z\"."],"info":{}}
{"id":"train_20082","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P425 wd:Q2736 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["N/A"],"info":{}}
{"id":"train_20084","question":"Which is coextensive with of Brasília?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2844 wdt:P3403 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20086","question":"What position Rafael Correa was elected in Ecuadorian general election, 2009?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q19581 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 wd:Q2635828 }","paraphrases":["Give the position Rafael Correa was elected to in the Ecuadorian general election in 2009."],"info":{}}
{"id":"train_20087","question":"What was the population of Fortaleza in 1991?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43463 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1991' ) ) }","paraphrases":["What was Fortaleza's population in 1991?"],"info":{}}
{"id":"train_20088","question":"Which company {manages} {Boeing 707} for which the {holding company} is {United Continental Holdings}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6394 wdt:P137 ?answer . ?answer wdt:P749 wd:Q871700 }","paraphrases":["Which company {oversees} {Boeing 707} for which the {holding company} is {Joined together Mainland Holdings}?"],"info":{}}
{"id":"train_20092","question":"What are the 4 safety classification labels for hydrogen sulfide under the NFPA Fire regulations?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q170591 p:P4952 ?s . ?s ps:P4952 ?obj . ?s pq:P994 ?x filter ( contains ( ?x , '4' ) ) }","paraphrases":["According to the NFPA Fire regulations, what are the four safety classification labels for hydrogen sulfide?"],"info":{}}
{"id":"train_20093","question":"Who is the father of Amitabh Bachchan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9570 wdt:P22 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Amitabh Bachchan is the son of which man?"],"info":{}}
{"id":"train_20094","question":"What country is The Star-Spangled Banner connect to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44696 wdt:P495 ?obj . ?obj wdt:P31 wd:Q43702 }","paraphrases":["What nation is The Star-Spangled Pennant interface to?"],"info":{}}
{"id":"train_20095","question":"TELL ME THE TERM THAT STARTS WITH V","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1969448 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know THE TERM THAT Begins WITH V"],"info":{}}
{"id":"train_20096","question":"What is the mantra created by Vishvamitra that contains the word \"Gayatri\" in its title?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q131510 . ?sbj wdt:P170 wd:Q2773345 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'gayatri' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the mantra created through Vishvamitra that includes the phrase \"Gayatri\" in its title?"],"info":{}}
{"id":"train_20097","question":"Ebola is caused by what taxon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q51993 wdt:P828 ?obj . ?obj wdt:P31 wd:Q16521 }","paraphrases":["Ebola is brought about by what taxon?"],"info":{}}
{"id":"train_20098","question":"$3.95 per usage day, with a maximum rate of $19.75","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7814330 . ?ent wdt:P2555 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What has a $3.95 usage per day, with a maximum rate of $19.75?"],"info":{}}
{"id":"train_20100","question":"How many media works has Angela Lansbury voice acted in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P725 wd:Q206856 }","paraphrases":["In how many media works has Angela Lansbury voice acted in?"],"info":{}}
{"id":"train_20101","question":"WHICH IS THE NATIONAL SPORTS TEAM THAT IN THE COUNTRY OF AUSTRALIA WHICH STARTS WITH T","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1194951 . ?sbj wdt:P17 wd:Q408 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE NATIONAL SPORTS TEAM THAT IN THE COUNTRY OF AUSTRALIA WHICH BEGINS WITH T"],"info":{}}
{"id":"train_20102","question":"Which tram-train, with the maximum capacity, is normally used as ERROR1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q844054 . ?ent wdt:P3872 ?obj . ?ent wdt:P3438 wd:Q1487246 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which tram - train is normally used as ERROR1 with the maximum capacity?"],"info":{}}
{"id":"train_20103","question":"Is it true that the compression ratio of the Renault 4P equals to 5.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3425006 wdt:P1247 ?obj filter ( ?obj = 5.8 ) }","paraphrases":["Is the compression radio of the Renault 4P exactly 5.8?"],"info":{}}
{"id":"train_20105","question":"Is the maximum age for compulsory education in Egypt equal to 14?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q79 wdt:P3271 ?obj filter ( ?obj = 14 ) }","paraphrases":["Does Egypt have a maximum age for compulsory education of 14?"],"info":{}}
{"id":"train_20107","question":"Tell me which is the world day that contains the word nations in it's name!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2558684 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'nations' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me which is the world day that contains the phrase international locations in it's name!"],"info":{}}
{"id":"train_20108","question":"In the sport of professional wrestling, what is the championship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P641 wd:Q131359 . ?sbj wdt:P31 wd:Q1079023 }","paraphrases":["Within the don of proficient wrestling, what is the championship?"],"info":{}}
{"id":"train_20110","question":"In he year 1986, what award did Sviatoslav Richter receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q124890 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1986' ) ) }","paraphrases":["WHAT WAS SVIATOSLAV RICHTER SHORT LISTED FOR IN 1986?"],"info":{}}
{"id":"train_20116","question":"Which is the adjacent station of Govan subway station?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4503373 wdt:P197 ?X . ?X wdt:P81 ?answer }","paraphrases":["Which is the adjoining station of Govan metro station?"],"info":{}}
{"id":"train_20118","question":"In which film do you expect most average shot length?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11424 . ?ent wdt:P2208 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which movie will have the longest shot on average?"],"info":{}}
{"id":"train_20120","question":"Neon Genesis Evangelion is based on what Manga?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q662 wdt:P144 ?obj . ?obj wdt:P31 wd:Q8274 }","paraphrases":["Neon Beginning Evangelion is based on what Manga?"],"info":{}}
{"id":"train_20121","question":"Over what period was the Ryukyu Kingdom a vassal state?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q28025 p:P31 ?s . ?s ps:P31 wd:Q1371288 . ?s pq:P580 ?value }","paraphrases":["During which period of time was the Ryukyu Kingdom a vassal state?"],"info":{}}
{"id":"train_20122","question":"Is it true that the flattening of the Sun equals to 0.000009?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q525 wdt:P1102 ?obj filter ( ?obj = 0.000009 ) }","paraphrases":["Is it genuine that the straightening of the Sun rises to to 0.000009?"],"info":{}}
{"id":"train_20123","question":"What Author has a Physics book written by him / her, who's favorite player is Democritus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1051198 wdt:P50 ?answer . ?answer wdt:P737 wd:Q41980 }","paraphrases":["What author has a book written by him / her on physics, who is Democritus ' favorite player?"],"info":{}}
{"id":"train_20125","question":"What state borders Qualcomm?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q544847 wdt:P17 ?X . ?X wdt:P47 ?answer }","paraphrases":["What state borders Qualcomm?"],"info":{}}
{"id":"train_20126","question":"Is the the boiler pressure of Norfolk and Western Railway class J more than 360?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q16980724 wdt:P5071 ?obj filter ( ?obj > 360.0 ) }","paraphrases":["Is the the kettle weight of Norfolk and Western Railroad lesson J more than 360?"],"info":{}}
{"id":"train_20129","question":"What is Moon Jae-in's position ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q21001 wdt:P39 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["What job position does Moon Jae-in hold?"],"info":{}}
{"id":"train_20131","question":"Which disease has the longest incubation period and whose primary symptoms include abdominal pain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12136 . ?ent wdt:P3488 ?obj . ?ent wdt:P780 wd:Q183425 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which sickness has the longest incubation period and whose primary signs and symptoms encompass belly pain?"],"info":{}}
{"id":"train_20132","question":"In what year did Antoine de Saint-Exupery receive the National Book Award for Nonfiction?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2908 p:P166 ?s . ?s ps:P166 wd:Q3873147 . ?s pq:P585 ?value }","paraphrases":["Give me the year Antoine de Saint-Exupery received the National Book Award for Nonfiction."],"info":{}}
{"id":"train_20133","question":"What is the anatomically connects with the esophagus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q173710 wdt:P2789 ?obj . ?obj wdt:P31 wd:Q4936952 }","paraphrases":["What is the anatomically interfaces with the esophagus"],"info":{}}
{"id":"train_20134","question":"What is the COSPAR ID for New Horizons?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q48461 wdt:P247 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20135","question":"Who is the {sibling} and the {child} of {Jerry_Van_Dyke} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q927631 wdt:P3373 ?ans_1 . wd:Q927631 wdt:P40 ?ans_2 }","paraphrases":["Who is related to Jerry Van Dyke?"],"info":{}}
{"id":"train_20136","question":"What city is the twinned administration for Nagasaki?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q38234 wdt:P190 ?obj . ?obj wdt:P31 wd:Q1637706 }","paraphrases":["What city is the twinned organization for Nagasaki?"],"info":{}}
{"id":"train_20137","question":"What public office does John Jay hold?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q310847 wdt:P39 ?obj . ?obj wdt:P31 wd:Q17279032 }","paraphrases":["WHICH PUBLIC OFFICE DO JOHN JAY HOLD"],"info":{}}
{"id":"train_20138","question":"What major and degree did Park Geun-hye receive at Sogang University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q138048 p:P69 ?s . ?s ps:P69 wd:Q374457 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What did Park Geun-hye major in at Sogang University?"],"info":{}}
{"id":"train_20139","question":"Tell me about sovereign state for diplomatic relation of Soviet Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q15180 wdt:P530 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_20140","question":"Is the isospin z-component of the antineutron equal to 0.5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q156530 wdt:P1127 ?obj filter ( ?obj = 0.5 ) }","paraphrases":["Is the antineutron's isospin z - component equal to 0.5?"],"info":{}}
{"id":"train_20142","question":"What is Pete Conrad's backup or reserve team or crew?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3015 wd:Q213076 }","paraphrases":[],"info":{}}
{"id":"train_20144","question":"Name a movie with Omar Sharif","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P161 wd:Q170515 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["What movie is Omar Sharif in?"],"info":{}}
{"id":"train_20145","question":"What is {tribute to} {before} of {Daizen-ji} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11433636 wdt:P155 ?X . ?X wdt:P825 ?answer }","paraphrases":["What is {tribute to} {some time recently} of {Daizen-ji} ?"],"info":{}}
{"id":"train_20147","question":"Inform us about the maximum total reserves of the country?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q6256 . ?ent wdt:P2134 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Tell me about the maximum total reserves of the country?"],"info":{}}
{"id":"train_20148","question":"Is the genre for Radiohead rock music and experimental rock?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44190 wdt:P136 wd:Q11399 . wd:Q44190 wdt:P136 wd:Q1641839 }","paraphrases":["Is experimental rock the genre for Radiohead?"],"info":{}}
{"id":"train_20151","question":"How many hair colors are orange?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1884 wd:Q39338 }","paraphrases":["What is the approximate number of hair colors that are orange?"],"info":{}}
{"id":"train_20152","question":"What are the religious text which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179461 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the religious text that begins with the letter t"],"info":{}}
{"id":"train_20153","question":"Which company owns the American Broadcasting Company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P749 wd:Q169889 . ?sbj wdt:P31 wd:Q10689397 }","paraphrases":[],"info":{}}
{"id":"train_20154","question":"What's Pete Townshend's lyrics song?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P676 wd:Q26933 . ?sbj wdt:P31 wd:Q7366 }","paraphrases":["What's Pete Townshend's verses song?"],"info":{}}
{"id":"train_20158","question":"What magnetic moment is an antonym of 'electron hole'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q651050 wdt:P461 ?X . ?X wdt:P2069 ?answer }","paraphrases":["Name the magnetic moment that is an antonym of electron hole.."],"info":{}}
{"id":"train_20159","question":"Is the flash point of picric acid equal to 302?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q189298 wdt:P2128 ?obj filter ( ?obj = 302 ) }","paraphrases":["Is the streak point of picric corrosive rise to to 302?"],"info":{}}
{"id":"train_20160","question":"What are the martial arts which start with the letter tangsudo","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11417 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tangsudo' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the martial arts which begin with the letter tangsudo"],"info":{}}
{"id":"train_20161","question":"Do LA and Santa Monica share a border?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q65 wdt:P47 wd:Q47164 }","paraphrases":["Is a border shared by LA and Santa Monica?"],"info":{}}
{"id":"train_20162","question":"What is the currency for the Weimar Republic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41304 wdt:P38 ?obj . ?obj wdt:P31 wd:Q8142 }","paraphrases":["What is the cash for the Weimar Republic?"],"info":{}}
{"id":"train_20163","question":"What's the study of natural language processing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q30642 wdt:P2578 ?obj }","paraphrases":["Which is the study of natural language processing?"],"info":{}}
{"id":"train_20164","question":"What is {end time} and {start time} of {{Boeing 747} has {operator} as {Air Algérie}} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24284065 wdt:P276 ?X . ?X wdt:P1990 ?answer }","paraphrases":["Time of operation of Air Algerie Boeing 747?"],"info":{}}
{"id":"train_20165","question":"What is part of constellation to parent body of HD 74156 c ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1074570 wdt:P397 ?X . ?X wdt:P59 ?answer }","paraphrases":["Which is part of constellation to parent body of HD 74156c?"],"info":{}}
{"id":"train_20166","question":"When did Magdeburg have an area of 201.01?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1733 p:P2046 ?s . ?s ps:P2046 ?x filter ( contains ( ?x , '201.01' ) ) . ?s pq:P585 ?value }","paraphrases":["The area of Magdeburg was 201.01 in what time period?"],"info":{}}
{"id":"train_20167","question":"Name E. Coli's strain with the highest optimum viable temperature","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q855769 . ?ent wdt:P3253 ?obj . ?ent wdt:P171 wd:Q25419 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the name of the strain of E. Coli that has the highest optimum viable \ntemperature?"],"info":{}}
{"id":"train_20168","question":"Were John Nash and William Winder architects of the Buckingham Palace?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q42182 wdt:P84 wd:Q309905 . wd:Q42182 wdt:P84 wd:Q746043 }","paraphrases":["Did John Nash and William Winder serve as architects for Buckingham Palace?"],"info":{}}
