{"id":"train_21050","question":"What are theprovincial or territorial capital city in Canada which start with the letter yellowknife","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21507383 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yellowknife' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are theprovincial or regional capital city in Canada which begin with the letter yellowknife"],"info":{}}
{"id":"train_21052","question":"Mention the predecessor and the successor of Louis the Pious while being recognized as king of Franks","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Specify the forerunner and the successor of Louis the Devout whereas being recognized as lord of Franks"],"info":{}}
{"id":"train_21054","question":"what is fusional language of typology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9240 wdt:P4132 ?answer . ?answer wdt:P461 wd:Q318917 }","paraphrases":["what is fusional dialect of typology?"],"info":{}}
{"id":"train_21055","question":"Did Hamlet create the characters Gertrude and The Ghost?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41567 wdt:P674 wd:Q546616 . wd:Q41567 wdt:P674 wd:Q1813659 }","paraphrases":["Was it Hamlet that created the characters of Gertrude and The Ghost?"],"info":{}}
{"id":"train_21056","question":"Where was Willem Frederick Herman’s born, Varna is its partner town.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q437771 wdt:P19 ?answer . ?answer wdt:P190 wd:Q6506 }","paraphrases":["Where was Willem Frederick Herman’s born, Varna is its partner town."],"info":{}}
{"id":"train_21057","question":"Which is the municipality for twinned administrative body of Great Manchester in Germany?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q23099 . ?sbj wdt:P31 wd:Q262166 }","paraphrases":["Which is the district for twinned authoritative body of Awesome Manchester in Germany?"],"info":{}}
{"id":"train_21058","question":"Does the block size of the KASUMI equal 64","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1718415 wdt:P2599 ?obj filter ( ?obj = 64 ) }","paraphrases":["Does the square measure of the KASUMI rise to 64"],"info":{}}
{"id":"train_21060","question":"What is Hannibal's birthdate on the Gregorian Calendar?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q36456 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["Tell me Hannibal's birthdate on the Gregorian Calendar."],"info":{}}
{"id":"train_21062","question":"Is the minimum number of players of the New Super Mario Bros. Wii equal 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q170410 wdt:P1872 ?obj filter ( ?obj = 1 ) }","paraphrases":["How many players are needed for the New Super mario brothers wiI?"],"info":{}}
{"id":"train_21063","question":"What was Microsoft's total revenue in 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2283 p:P2139 ?s . ?s ps:P2139 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["What was Microsoft's total income in 2011?"],"info":{}}
{"id":"train_21067","question":"What are the association football stadium which start with the letter uhlenkrugstadion","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1154710 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'uhlenkrugstadion' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the affiliation football stadium which begin with the letter uhlenkrugstadion"],"info":{}}
{"id":"train_21069","question":"Who is the {actor} in {Triumph of Will} who has {blue} eyes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q156497 wdt:P161 ?answer . ?answer wdt:P1340 wd:Q17122834 }","paraphrases":["Who is the {on-screen character} in {Triumph of Will} who has {blue} eyes?"],"info":{}}
{"id":"train_21070","question":"Who is the defendant for Brown v. Board of Education?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q875738 wdt:P1591 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21072","question":"When was Anthony Munoz joined as a member to USC Trojans football team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q504859 p:P54 ?s . ?s ps:P54 wd:Q7866357 . ?s pq:P580 ?value }","paraphrases":["at the point when was anthony munoz joined as a memeber in the usa trojans footbal crew?"],"info":{}}
{"id":"train_21073","question":"What is the place of formation of Shinto, whose extreme west is 24.449444444444 122.93361111111?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q812767 wdt:P740 ?answer . ?answer wdt:P1335 ?x FILTER ( contains ( ?x , '24.449444444444 122.93361111111' ) ) }","paraphrases":["What is the place of formation of Shinto, whose severe west is 24.449444444444 122.93361111111?"],"info":{}}
{"id":"train_21076","question":"What are the national anthem which start with the letter n","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23691 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which national anthems start with \"n\"?"],"info":{}}
{"id":"train_21078","question":"What is the doctrine of Thomas Aquinas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9438 wdt:P135 ?obj . ?obj wdt:P31 wd:Q117850 }","paraphrases":["What doctrine did Thomas Aquinas follow?"],"info":{}}
{"id":"train_21080","question":"Which is the Christian denomination of the office held by head of the organisation of Pope of the Coptic Orthodox Church of Alexandria and starts with the letter a?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q879146 . ?sbj wdt:P2388 wd:Q58451 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the Christian office denomination held by the head of the Alexandrian Coptic Orthodox Church's Pope's organization and begins with the letter a?"],"info":{}}
{"id":"train_21082","question":"who is the member of Kenny Dalglish sports team and how many points/goals/set did they score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q187198 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }","paraphrases":["who is the part of Kenny Dalglish sports group and how numerous points/goals/set did they score?"],"info":{}}
{"id":"train_21083","question":"Which {political party} is {Nicolas Sarkozy} {member of}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q329 wdt:P102 ?obj . ?obj wdt:P31 wd:Q7278 }","paraphrases":["Which political party does Nicolas Sarkozy belong to?"],"info":{}}
{"id":"train_21086","question":"How many countries of citizenship are by Equatorial Guinea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P27 wd:Q983 }","paraphrases":["Which is the number of countries of citizenship that are by Equatorial Guinea?"],"info":{}}
{"id":"train_21090","question":"WHO ACTS AS THE CHAIRPERSON OF PALANG DHARMA PARTY?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1127750 wdt:P488 ?X . ?X wdt:P607 ?answer }","paraphrases":["WHO ACTS AS THE CHAIRPERSON OF PALANG DHARMA PARTY?"],"info":{}}
{"id":"train_21092","question":"When did Zurich have a population of 361,488?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q72 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '361488.0' ) ) . ?s pq:P585 ?value }","paraphrases":["When did Zurich have a populace of 361,488?"],"info":{}}
{"id":"train_21093","question":"Who became Secretary-General of the United Nations on 10th April 1953?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q81066 p:P1308 ?s . ?s ps:P1308 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1953' ) ) }","paraphrases":["On April 10, 1953, who became Secretary General (UN)?"],"info":{}}
{"id":"train_21095","question":"Name the city in India led by the Amritsar Municipal Corporation that starts with letter A","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6936225 . ?sbj wdt:P797 wd:Q58942508 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the town in India led by using the Amritsar Municipal Corporation that starts with letter A"],"info":{}}
{"id":"train_21096","question":"Which Chulalongkorn University is located in Thailand?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q855730 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P642 wd:Q869 }","paraphrases":["Where in Thailand is Chulalongkornn University locat3ed?"],"info":{}}
{"id":"train_21097","question":"Which Class IC flammable liquid has the most no-observed-adverse-effect level?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009056 . ?ent wdt:P2717 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What Class IC liquid that is flammable has the highest level of 'no observed adverse effect'?"],"info":{}}
{"id":"train_21099","question":"In which year Bob Dylan received the Grammy Lifetime Achievement Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q392 p:P166 ?s . ?s ps:P166 wd:Q935843 . ?s pq:P585 ?value }","paraphrases":["Bob Dylan received the Grammy Lifetime Achievement Award in which year?"],"info":{}}
{"id":"train_21101","question":"What what is Latin phrase partially coincident with by  course which that starts with letters c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3062294 . ?sbj wdt:P1382 wd:Q600134 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is Latin phrase partially coincident with by means of direction which that begins with letters c"],"info":{}}
{"id":"train_21105","question":"Who is the {government building} for {headquarters location} of {United States Environmental Protection Agency}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q460173 wdt:P159 ?obj . ?obj wdt:P31 wd:Q16831714 }","paraphrases":["What's the name of the US EPA headquarters building?"],"info":{}}
{"id":"train_21106","question":"Which political party elected Aung San Suu Kyi as secretary general?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3975 wd:Q36740 . ?sbj wdt:P31 wd:Q7278 }","paraphrases":["Aung San Suu Kyi was elected secretary general by which political party?"],"info":{}}
{"id":"train_21108","question":"What is engine configuration of diesel engine ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1002 wd:Q174174 }","paraphrases":[],"info":{}}
{"id":"train_21109","question":"What are the languiod class which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28923954 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the languiod course which begin with the letter v"],"info":{}}
{"id":"train_21110","question":"What are the lawn game which start with the letter T","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6503676 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["The letter T what are the lawn game that start with it"],"info":{}}
{"id":"train_21111","question":"Who is the partner city of Cologne whose government is headed by Willy Demeyer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q365 wdt:P190 ?answer . ?answer wdt:P6 wd:Q2355048 }","paraphrases":["Who is the accomplice city of Cologne whose government is headed by Willy Demeyer?"],"info":{}}
{"id":"train_21113","question":"What is the history of the continent containing the country of Yemen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q805 wdt:P30 ?X . ?X wdt:P2184 ?answer }","paraphrases":["Describe the history of the continent in which the country of Yemen is."],"info":{}}
{"id":"train_21115","question":"Who is licensed to broadcast to CBS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q43380 wdt:P1408 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21116","question":"when exactly did Mauritius have an inflation rate of 2.8?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1027 p:P1279 ?s . ?s ps:P1279 ?x filter ( contains ( ?x , '2.8' ) ) . ?s pq:P585 ?value }","paraphrases":["Do you know the year when Mauritius had an inflation rate of 2.8?"],"info":{}}
{"id":"train_21118","question":"Where in Hafnium are there 43324 children out of school?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1119 wdt:P189 ?answer . ?answer wdt:P2573 ?x FILTER ( contains ( ?x , '43324.0' ) ) }","paraphrases":["Where in Hafnium are there 43324 children out of school?"],"info":{}}
{"id":"train_21119","question":"Is the minimum explosive concentration of the sucrose greater than 36.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4027534 wdt:P2204 ?obj filter ( ?obj > 36.0 ) }","paraphrases":["Is 36.0 the explosive concentration of sucrose?"],"info":{}}
{"id":"train_21120","question":"WHAT ARE THE AIRCRAFT COMPONENT WHICH START WITH THE LETTER T.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28816538 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE COMPONENT AIRCRAFT WHICH START WITH THE LETTER T."],"info":{}}
{"id":"train_21121","question":"Where did Theoderic the Great die that has the partner town of Dubrovnik?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q105105 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1722 }","paraphrases":["Where did Theoderic the Extraordinary pass on that has the accomplice town of Dubrovnik?"],"info":{}}
{"id":"train_21122","question":"When did James Madison graduate from Princeton University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11813 p:P69 ?s . ?s ps:P69 wd:Q21578 . ?s pq:P582 ?value }","paraphrases":["When did James Madison complete Princeton University?"],"info":{}}
{"id":"train_21123","question":"What is the pronunciation of the Asian word Tamil?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q48 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q5885 }","paraphrases":["How do you say the Asian word Tamil?"],"info":{}}
{"id":"train_21124","question":"Who follows the noble Saladin of the emir of Damascus and who does he follow?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q8581 p:P97 ?s . ?s ps:P97 wd:Q54493575 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["The noble Saladin of the emir of Damascus follows and is followed by whom?"],"info":{}}
{"id":"train_21125","question":"What are theAmerican football team which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17156793 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What American football team starts with the letter 'w'?"],"info":{}}
{"id":"train_21126","question":"Does the File Transfer Protocol port equal 20?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q42283 wdt:P1641 ?obj filter ( ?obj = 20 ) }","paraphrases":["Does the Record Exchange Convention harbour rise to 20?"],"info":{}}
{"id":"train_21127","question":"who is the member of Alan Shearer sports team and how many points/goals/set  did they score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q483583 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }","paraphrases":["Who is the sports team member of Alan Shearer and how many points / goals / sets have they scored?"],"info":{}}
{"id":"train_21128","question":"who study of sculptor of pressure volume diagram ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q311318 wdt:P170 ?X . ?X wdt:P101 ?answer }","paraphrases":["who consider of stone worker of weight volume graph"],"info":{}}
{"id":"train_21129","question":"Who are the members of BJP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P102 wd:Q10230 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Name the member of BJP."],"info":{}}
{"id":"train_21130","question":"What are the geological process which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11827301 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the geographical handle which begin with the letter s"],"info":{}}
{"id":"train_21132","question":"The conjugate base of water requires which polyatomic anion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q283 wdt:P4149 ?obj . ?obj wdt:P31 wd:Q55511438 }","paraphrases":["Which polyatomic anion is required for the conjugate base of water?"],"info":{}}
{"id":"train_21136","question":"What position held by Thomas Brackett Reed in 1895-12-2?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2094078 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1895' ) ) }","paraphrases":["What job did Thomas Brackett Reed perform during 1895-12-2?"],"info":{}}
{"id":"train_21137","question":"What lake is Kenneth Ruffing's work located on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6390652 wdt:P937 ?X . ?X wdt:P206 ?answer }","paraphrases":["What lake is Kenneth Ruffing's work found on?"],"info":{}}
{"id":"train_21139","question":"Is Amphetamine a significant drug interaction of procarbazine and moclobemide ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q179452 wdt:P769 wd:Q418656 . wd:Q179452 wdt:P769 wd:Q421934 }","paraphrases":["Is Amphetamine created by the combination of procarbazine and moclobemide?"],"info":{}}
{"id":"train_21140","question":"Which is the Hindu deity that is in mount of Nandi and starts with the letter s?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q979507 . ?sbj wdt:P3091 wd:Q841255 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the Hindu deity that is in mount of Nandi and starts offevolved with the letter s?"],"info":{}}
{"id":"train_21141","question":"How many native labels are given to Ursa minor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q10478 wdt:P1705 ?obj }","paraphrases":["Which is the number of the native labels given to Ursa minor?"],"info":{}}
{"id":"train_21142","question":"What is the subitem of an oxygen cycle that has an oxidation state of -2.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1140866 wdt:P1269 ?answer . ?answer wdt:P1121 ?x FILTER ( contains ( ?x , '-2.0' ) ) }","paraphrases":["What is the subitem of an oxygen cycle that has an oxidation state of -2.0?"],"info":{}}
{"id":"train_21144","question":"who institute of the Russian Academy of Sciences for studies of Russian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2578 wd:Q7737 . ?sbj wdt:P31 wd:Q4201890 }","paraphrases":["Who began the Russian Studies at Russian Academy of Science?"],"info":{}}
{"id":"train_21147","question":"What are the logographic writing system  which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3953107 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the logographic composing framework which begin with the letter s"],"info":{}}
{"id":"train_21148","question":"Larry Flynt is the publisher of which periodical?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P123 wd:Q223839 . ?sbj wdt:P31 wd:Q41298 }","paraphrases":["Larry Flynt is the distributer of which periodical?"],"info":{}}
{"id":"train_21149","question":"Which dependency of Norway with a weather station as a capital has the longest coastline ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5260616 . ?ent wdt:P5141 ?obj . ?ent wdt:P36 wd:Q190107 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the dependency of Norway with the longest coastline and a weather station as a capital?"],"info":{}}
{"id":"train_21150","question":"What literary genre did Vaino Linna specialize in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q311037 wdt:P800 ?X . ?X wdt:P136 ?answer }","paraphrases":["What scholarly sort did Vaino Linna specialize in?"],"info":{}}
{"id":"train_21151","question":"Genere","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11824 wdt:P136 ?answer . ?answer wdt:P170 wd:Q4421425 }","paraphrases":["Genere"],"info":{}}
{"id":"train_21153","question":"Where are the counties of citizens of Fakir Musafar located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q326337 wdt:P27 ?X . ?X wdt:P150 ?answer }","paraphrases":["Where are the citizens of the counties of Fakir Musafar located?"],"info":{}}
{"id":"train_21155","question":"What is the science that studies mountains called?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8502 wdt:P2579 ?X . ?X wdt:P2578 ?answer }","paraphrases":["What is the science that considers mountains called?"],"info":{}}
{"id":"train_21156","question":"What is used to make Sazerac?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q921623 p:P186 ?s . ?s ps:P186 ?obj . ?s pq:P1114 ?x filter ( contains ( ?x , '1.0' ) ) }","paraphrases":["Which is used to make Sazerac?"],"info":{}}
{"id":"train_21157","question":"What is Q48460 in reference to the planetary system Laniakea Supercluster?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17863945 wdt:P397 ?X . ?X wdt:P1036 ?answer }","paraphrases":["What is Q48460 in reference to the planetary framework Laniakea Supercluster?"],"info":{}}
{"id":"train_21158","question":"Was the official name of the birth place of Cesar Cui Вильно ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q208546 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P1448 ?x filter ( contains ( ?x , 'Вильно' ) ) }","paraphrases":["What is the official name of the location where Cesar Cui Вильно was born?"],"info":{}}
{"id":"train_21159","question":"Name a conflict that starts with the letter \"w\".","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q180684 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which conflict starts with the letter \"w\""],"info":{}}
{"id":"train_21160","question":"Name the Language of origin of The Onion, that has its native to England.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q618236 wdt:P407 ?answer . ?answer wdt:P2341 wd:Q21 }","paraphrases":["Give me the name of the origin The Onion to England."],"info":{}}
{"id":"train_21161","question":"Is the ranking of pete sampras greater than 1.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9446 wdt:P1352 ?obj filter ( ?obj > 1.2 ) }","paraphrases":["Is the positioning of pete sampras more noteworthy than 1.2?"],"info":{}}
