{"id":"train_22928","question":"What nonprofit organization starts with n, and has English as its official language.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q163740 . ?sbj wdt:P37 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What nonprofit agency begins with n, and has English as its respectable language."],"info":{}}
{"id":"train_22929","question":"Who is the{WWE programs} for {production company} of {WWE}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P272 wd:Q35339 . ?sbj wdt:P31 wd:Q35769 }","paraphrases":["Who are the { WWE programs } for the { WWE } manufacturer?"],"info":{}}
{"id":"train_22939","question":"Tell me operating system whose name has the word windows in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9135 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'windows' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What operating system uses Windows?"],"info":{}}
{"id":"train_22944","question":"Tell me recurring tournament whose name has the word world in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15259995 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose to me soil type whose name has the word vertisol in it."],"info":{}}
{"id":"train_22945","question":"How is pie created?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13360264 wdt:P2079 ?X . ?X wdt:P276 ?answer }","paraphrases":["How is pie created?"],"info":{}}
{"id":"train_22946","question":"What are the historic house museum which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2087181 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the notable house exhibition hall which begin with the letter t"],"info":{}}
{"id":"train_22949","question":"Who is in the cast members of The X Files","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2744 wdt:P161 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is within the cast individuals of The X Files"],"info":{}}
{"id":"train_22951","question":"Mention the symbolic representation of Beehive Cluster in terms of the constellation","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13760 wdt:P59 ?X . ?X wdt:P913 ?answer }","paraphrases":["Mention the symbolic illustration of Beehive Cluster in phrases of the constellation"],"info":{}}
{"id":"train_22958","question":"tell me least squares method that starts with i","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q74304 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know slightest squares strategy that begins with i"],"info":{}}
{"id":"train_22963","question":"Which is the title of the head of government where Frederico García Lorca lived in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41408 wdt:P551 ?X . ?X wdt:P1313 ?answer }","paraphrases":["Which is the title of the head of government where Frederico García Lorca lived in?"],"info":{}}
{"id":"train_22971","question":"At what angle from the vertical is the Leaning TOwer of PIza","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q39054 wdt:P4183 ?answer }","paraphrases":[],"info":{}}
{"id":"train_22975","question":"What condition starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q813912 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What condition starts with the letter \"t\"?"],"info":{}}
{"id":"train_22983","question":"Which is the play whose narrative location is Helsingør and contains the word hamlet in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25379 . ?sbj wdt:P840 wd:Q26881 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hamlet' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the play whose narrative area is Helsingør and carries the word hamlet in it's name?"],"info":{}}
{"id":"train_22985","question":"Name a skyscraper that contains the word \" world\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11303 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a high rise that contains the word \" world\" in its name"],"info":{}}
{"id":"train_22987","question":"What are the municipality of Brazil which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3184121 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ó' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which municipality of Brazil starts with the letter s"],"info":{}}
{"id":"train_22990","question":"Tell me isq derived quantity whose name has the word velocity in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q30337763 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'velocity' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know isq inferred amount whose title has the word speed in it."],"info":{}}
{"id":"train_22991","question":"Tell me the most notable work of Christopher Hitchens and also the publisher.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P123 ?value1 . }","paraphrases":["Tell me Christopher Hitchens ' most remarkable work and also the publisher."],"info":{}}
{"id":"train_22995","question":"Tell me the number of patron saints of Thomas the Apostle.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P417 wd:Q43669 }","paraphrases":["How many patron saints of Thomas the Apostle are there?"],"info":{}}
{"id":"train_22997","question":"DOES THE STALL SPEED OF THE ATR 72 LESS THAN 166.4","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q219764 wdt:P6510 ?obj filter ( ?obj < 166.4 ) }","paraphrases":["Does ATR 72 have a stall speed lower than 166.4?"],"info":{}}
{"id":"train_22998","question":"WHAT ARE THE OCCURRENCE THAT STARTS WITH W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1190554 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What occurence begins with W?"],"info":{}}
{"id":"train_23013","question":"WHICH IS THE LITERAR GENRE THAT DISJOINT UNION OF LIST VALUES AS QUALIFIERS AND WHICH CONTAINS THE WORD DICTIONARY IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223393 . ?sbj wdt:P2738 wd:Q23766486 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dictionary' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE LITERAR GENRE THAT DECOUPLE  UNION OF LIST VALUES AS QUALIFIERS AND WHICH CONTAINS THE WORD DICTIONARY IN THEIR NAME"],"info":{}}
{"id":"train_23018","question":"What are the city which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q515 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the city which begin with the letter w"],"info":{}}
{"id":"train_23021","question":"Who is the  {protein} for {physically interacts with} of {diazepam}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P129 wd:Q210402 . ?sbj wdt:P31 wd:Q8054 }","paraphrases":["Which protein interacts with diazepam?"],"info":{}}
{"id":"train_23022","question":"Who is the{human} for {partner} of {Kate Winslet}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P451 wd:Q202765 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is Kate Winslet's partner?"],"info":{}}
{"id":"train_23027","question":"Tell me international parliament whose name has the word parliament in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6054776 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'parliament' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the name of the international parliament in it"],"info":{}}
{"id":"train_23032","question":"What are the character encoding which start with the letter Y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q184759 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the character encoding which begin with the letter Y"],"info":{}}
{"id":"train_23033","question":"Who is the {lake} for {located in or next to body of water} of {Seattle}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5083 wdt:P206 ?obj . ?obj wdt:P31 wd:Q23397 }","paraphrases":["Who is the { lake } for { in or near the water body } of { Seattle }"],"info":{}}
{"id":"train_23037","question":"What is the award winning book of J.R.R. Tolkien and book.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q892 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What is the grant winning book of J.R.R. Tolkien and book."],"info":{}}
{"id":"train_23038","question":"tell me public holiday that contains the name has  word samiljeol in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1197685 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'samiljeol' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which public holiday starts with the name samiljeol."],"info":{}}
{"id":"train_23050","question":"Name city where many movies are shot that contains the word \"Karachi\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q200250 . ?sbj wdt:P1740 wd:Q19359121 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'karachi' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name metropolis where many films are shot that contains the phrase \"Karachi\" in its identify"],"info":{}}
{"id":"train_23052","question":"Name a fruit that contains Citrullus lanatus that contains the word \"watermelon\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1364 . ?sbj wdt:P1582 wd:Q17507129 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'watermelon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a fruit that contains Citrullus lanatus that contains the phrase \"watermelon\" in its name"],"info":{}}
{"id":"train_23053","question":"Mention the place where human burial is possible in Granada.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P119 wd:Q8810 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Say the put where human burial is conceivable in Granada."],"info":{}}
{"id":"train_23058","question":"WHat brain region that supplies superior cerebellar artery contains the word \"cerebellum\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620186 . ?sbj wdt:P2286 wd:Q707592 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'cerebellum' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat brain region providing superior cerebellar artery contains in its name the word \"cerebellum?\""],"info":{}}
{"id":"train_23064","question":"WHAT IS BVMC WORK ID FOR FALL OF CONSTANTINOPLE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q160077 wdt:P3976 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23074","question":"Which is the military casualty classification for Karl Dönitz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q76437 wdt:P1347 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23075","question":"Who has child of Æthelred the Unready who is the sister of Alfred Aetheling?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q183499 wdt:P40 ?answer . ?answer wdt:P3373 wd:Q35618 }","paraphrases":["Who has child of Æthelred the Unready who is the sister of Alfred Aetheling?"],"info":{}}
{"id":"train_23083","question":"Name a country who is diplomatic towards the Russian Empire.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P530 wd:Q34266 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":[],"info":{}}
{"id":"train_23084","question":"Name the domain where Oscar Wisting got the participation for.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q553187 wdt:P1344 ?X . ?X wdt:P710 ?answer }","paraphrases":["Name the domain where Oscar Wisting acquired the participation for."],"info":{}}
{"id":"train_23085","question":"Tell me famine whose name has the word turnip in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q168247 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'turnip' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which famine name starts with the word turnip."],"info":{}}
{"id":"train_23086","question":"Who wrote the script to \"The fault in Our Stars","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14704171 wdt:P1877 ?X . ?X wdt:P737 ?answer }","paraphrases":["Who composed the script to \"The blame in Our Stars"],"info":{}}
{"id":"train_23088","question":"Tell memineral variety whose name has the word zeiringite in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q429795 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zeiringite' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell memineral assortment whose title has the word zeiringite in it."],"info":{}}
{"id":"train_23090","question":"What are the unary operation that starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q657596 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the unary operation that begins with s"],"info":{}}
{"id":"train_23094","question":"haverfordwest wasn't birth place of Christian_bale","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q45772 wdt:P19 wd:Q990103 }","paraphrases":["Christian Bale was not born in Haverford West?"],"info":{}}
{"id":"train_23098","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8251 wdt:P179 ?obj . ?obj wdt:P31 wd:Q13406463 }","paraphrases":["n/a"],"info":{}}
{"id":"train_23103","question":"WHAT IS CAGEMATCH WORK ID OF DENNIS RODMAN","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q201608 wdt:P2728 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23108","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55401 wdt:P20 ?answer . ?answer wdt:P1705 ?x FILTER ( contains ( ?x , '京都市' ) ) }","paraphrases":["What is it?"],"info":{}}
{"id":"train_23114","question":"Who is the doctoral adviser of Richard Dawkins","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44461 wdt:P184 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the doctoral counsel of Richard Dawkins"],"info":{}}
{"id":"train_23115","question":"What current country used to be the Ottoman Empire","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1365 wd:Q12560 . ?sbj wdt:P31 wd:Q1323642 }","paraphrases":["What current nation utilized to be the Footrest Realm"],"info":{}}
{"id":"train_23132","question":"Tell me  art form whose name has the word sculpture in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56055944 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sculpture' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know craftsmanship shape whose title has the word form in their name"],"info":{}}
{"id":"train_23136","question":"What are the atmosphere which start with the letter b","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q427085 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the radiometric dating which begin with the letter d"],"info":{}}
{"id":"train_23139","question":"Tell me type of quantum particle whose name has the word σ0 in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22675015 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'σ0' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me type of quantum particle whose identify has the phrase σ0 in it."],"info":{}}
{"id":"train_23143","question":": What are the family of isomeric compounds which start with the letter x","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15711994 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":[": What are the family of isomeric compounds which begin with the letter x"],"info":{}}
{"id":"train_23172","question":"Name the color film with the fewest episodes .","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11424 . ?ent wdt:P1113 ?obj . ?ent wdt:P462 wd:Q22006653 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which colorized film has the least episodes?"],"info":{}}
{"id":"train_23182","question":"What what ismunicipality of Spain contains settlement Bobadilla and also which that starts with g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2074737 . ?sbj wdt:P1383 wd:Q5730865 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What does Spain's municipality contain Bobadilla settlement and what does it begin with?"],"info":{}}
{"id":"train_23185","question":"Name a science award conferred by Columbia Universit that starts with letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11448906 . ?sbj wdt:P1027 wd:Q49088 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a science award conferred with the aid of Columbia Universit that starts offevolved with letter P"],"info":{}}
{"id":"train_23198","question":"What are the skills that contains the word sensitivity in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1413287 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sensitivity' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the skills in their name that contain the word sensitivity?"],"info":{}}
{"id":"train_23203","question":"What are the card game which start with the letter uno","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q142714 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'uno' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the card amusement which begin with the letter uno"],"info":{}}
{"id":"train_23207","question":"Tell me the Sports-Reference.com Olympic athlete ID of Serena Williams.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11459 wdt:P1447 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23211","question":"What academic degree starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q189533 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH ACADEMIC DEGREE STARTS BY THE LETTER T"],"info":{}}
{"id":"train_23214","question":"When did Victor Hugo become a member of the Académie française, and who followed him?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q535 p:P463 ?s . ?s ps:P463 wd:Q161806 . ?s pq:P580 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["When did Victor Hugo come to be a member of the Académie française, and who observed him?"],"info":{}}
{"id":"train_23222","question":"Which is the second language of Wilhelm von","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q77888 wdt:P1412 ?answer . ?answer wdt:P1705 ?x FILTER ( contains ( ?x , 'Lingua latina' ) ) }","paraphrases":["Which is the moment dialect of Wilhelm von"],"info":{}}
{"id":"train_23233","question":"Mention the source composition of sweetbread.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49951 wdt:P1582 ?X . ?X wdt:P1672 ?answer }","paraphrases":["What is sweetbread made of?"],"info":{}}
{"id":"train_23241","question":"What is IUCN taxon ID FOR Pistacia vera","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q36071 wdt:P627 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23242","question":"Who is graduated from Georges Dumézil whose parent company is Centre de Recherches sur la Pensée Antique?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q310590 wdt:P69 ?answer . ?answer wdt:P355 wd:Q33121131 }","paraphrases":["Who is graduated from Georges Dumézil whose parent company is Middle de Recherches sur la Pensée Collectible?"],"info":{}}
{"id":"train_23244","question":"WHat is the classification scheme that contains the word \"type \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5962346 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'type' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat is the classification scheme containing in its name the word \"type\""],"info":{}}
{"id":"train_23252","question":"WHat medie ruled by Susan Wojcicki contains the word \"Youtube\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11033 . ?sbj wdt:P169 wd:Q55183 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'youtube' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat medie dominated via Susan Wojcicki incorporates the word \"Youtube\" in its identify ?"],"info":{}}
{"id":"train_23255","question":"Who is Natsume Sōseki's granddaughter?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q180903 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q19756330 }","paraphrases":["What is the name of the granddaughter of Natsume Soseki?"],"info":{}}
{"id":"train_23256","question":"What are the cryptocurrency which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13479982 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the cryptocurrency which begin with the letter z"],"info":{}}
