{"id":"train_20293","question":"What is the state of belligerents of Muslim conquest of the Maghreb?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q925960 wdt:P710 ?X . ?X wdt:P35 ?answer }","paraphrases":["In the Muslim conquest of the Maghreb, what is the state of belligerents?"],"info":{}}
{"id":"train_20297","question":"\"Which is {nomination received} of {Andy Murray}, that has {winners} is {Juan Pablo Montoya} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10125 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q172744 }","paraphrases":["\"Which is {nomination received} of {Andy Murray}, that has {winners} is {Juan Pablo Montoya} ?\""],"info":{}}
{"id":"train_20299","question":"What is a PNG's Kaitai Struct format gallery ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q178051 wdt:P4460 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20302","question":"What is the Hepatitis B gene?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q6853 wdt:P2293 ?obj . ?obj wdt:P31 wd:Q7187 }","paraphrases":["What is another name for the Hepatitis B gene?"],"info":{}}
{"id":"train_20305","question":"In flash point 162.0 what was the determination method for kerosene?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q76904 p:P2128 ?s . ?s ps:P2128 ?x filter ( contains ( ?x , '162.0' ) ) . ?s pq:P459 ?value }","paraphrases":["Which was the determination method for kerosene in flash point 162.0?"],"info":{}}
{"id":"train_20306","question":"Do the trolleybuses in Cremona have a voltage less than 480?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3933659 wdt:P2436 ?obj filter ( ?obj < 480.0 ) }","paraphrases":["Is 480 greater than the voltage that trolleybuses in Cremona have?"],"info":{}}
{"id":"train_20307","question":"which is portrayed by famous work of weng qingxi","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15936419 wdt:P800 ?X . ?X wdt:P175 ?answer }","paraphrases":["which is depicted by popular work of weng qingxi"],"info":{}}
{"id":"train_20312","question":"What are the Number of points,goals,and set scored and number of matches played by Dixie Dean,a member of sports team in Tranmere Rovers F.C?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q316323 p:P54 ?s . ?s ps:P54 wd:Q19637 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["State the number of points, goals, and set scored and number of matches played by Dixie Dean, a member of the sports team in Tranmere Rovers F.C."],"info":{}}
{"id":"train_20315","question":"Name a participant of the American Revolutionary War.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q40949 wdt:P710 ?obj . ?obj wdt:P31 wd:Q43702 }","paraphrases":[],"info":{}}
{"id":"train_20316","question":"What significant event in December of 1972 involved Harrison Schmitt?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q108886 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1972' ) ) }","paraphrases":["In December 1972 Harrison Schmitt was involved in which significant event?"],"info":{}}
{"id":"train_20318","question":"what is chartered company of public company in legal form and also which starts with letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162157 . ?sbj wdt:P1454 wd:Q891723 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is chartered company of public company in legal form and also which begins with letter c"],"info":{}}
{"id":"train_20319","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q4087 wdt:P4149 ?obj . ?obj wdt:P31 wd:Q107968 }","paraphrases":["n/a"],"info":{}}
{"id":"train_20320","question":"What time is it in Friuli- Venezia Guila which has a time zone of UTC 2:00?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1250 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value }","paraphrases":["Which is the time in Friuli-Venezia Guila in the time zone of UTC 2:00?"],"info":{}}
{"id":"train_20322","question":"What are the historical ethnical group that starts with the letter 'x'","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4204501 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the chronicled ethnical gather that begins with the letter 'x'"],"info":{}}
{"id":"train_20325","question":"Name a salad that contain the word \"yam\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9266 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yam' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which salad contains the word \"yam\""],"info":{}}
{"id":"train_20326","question":"Who follows Berengar 1 of Italy as monarch of Italy","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q274606 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Who follows Berengar 1 of Italy as Monarch?"],"info":{}}
{"id":"train_20327","question":"When was Utrecht located in Zuyderzée?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q803 p:P131 ?s . ?s ps:P131 wd:Q231168 . ?s pq:P580 ?value }","paraphrases":["When did Utrecht become part of Zuyderzee?"],"info":{}}
{"id":"train_20328","question":"What character in Twin Peaks was played by Michael Ontkean?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2085 p:P161 ?s . ?s ps:P161 wd:Q1343162 . ?s pq:P453 ?value }","paraphrases":["Who did Michael Ontkean play in Twin Peaks?"],"info":{}}
{"id":"train_20329","question":"What's located in the administrative unit of Banjarmasin that has arrondissements in Barito Kuala.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14182 wdt:P131 ?answer . ?answer wdt:P150 wd:Q14172 }","paraphrases":["What's positioned in the administrative unit of Banjarmasin that has arrondissements in Barito Kuala."],"info":{}}
{"id":"train_20331","question":"What is the label that represented Sonny Rollins in 1939?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q299208 wdt:P264 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1939' ) ) }","paraphrases":["What is the name that spoken to Sonny Rollins in 1939?"],"info":{}}
{"id":"train_20333","question":"Which significant event did Nicholas II of Russia and his spouse do?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q40787 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P26 ?value1 . }","paraphrases":["Which noteworthy occasion did Nicholas II of Russia and his life partner do?"],"info":{}}
{"id":"train_20335","question":"who named for the classical mechanics,that has craft of philosopher?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11397 wdt:P138 ?answer . ?answer wdt:P106 wd:Q4964182 }","paraphrases":["who named for the classical mechanics,that has create of rationalist?"],"info":{}}
{"id":"train_20336","question":"What was Cyprus's inflation rate in 1987?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q229 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1987' ) ) }","paraphrases":["The inflation rate of Cyprus in 1987 was?"],"info":{}}
{"id":"train_20339","question":"Is Theresa May's family name Brasier?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q264766 wdt:P734 wd:Q25223697 }","paraphrases":["Is the family name Brasier related to Theresa May?"],"info":{}}
{"id":"train_20340","question":"What was Indiana Jones performed in the Young Indiana Jones and the Treasure of the Peacock's Eye?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q148659 p:P175 ?s . ?s ps:P175 ?obj . ?s pq:P642 wd:Q1968868 }","paraphrases":["Which was Indiana Jones performance in the Young Indiana Jones and the Treasure of the Peacock's Eye?"],"info":{}}
{"id":"train_20342","question":"What is the official language of Hildegard of Bingen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q70991 wdt:P1412 ?obj . ?obj wdt:P31 wd:Q34770 }","paraphrases":["What is the official dialect of Hildegard of Bingen?"],"info":{}}
{"id":"train_20343","question":"When did military rank for officeholder of Salman of Saudi Arabia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1308 wd:Q367825 . ?sbj wdt:P31 wd:Q56019 }","paraphrases":[],"info":{}}
{"id":"train_20344","question":"WHO IS THE AGENT TOOK PART INHENDRAN","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1393679 wdt:P1344 ?X . ?X wdt:P710 ?answer }","paraphrases":["WHO IS THE AGENT TOOK PART INHENDRAN"],"info":{}}
{"id":"train_20346","question":"What weapon model has the highest pressure?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15142894 . ?ent wdt:P2077 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which model weapon has the pressure that is the highest?"],"info":{}}
{"id":"train_20348","question":"Who is the member of the as directed by the {Dolores Claiborne} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1236347 wdt:P57 ?X . ?X wdt:P463 ?answer }","paraphrases":["Who is the part of the as coordinated by the {Dolores Claiborne} ?"],"info":{}}
{"id":"train_20349","question":"How many of you are licensed to teach?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1408 wd:Q2132 }","paraphrases":["How many people have a license to teach?"],"info":{}}
{"id":"train_20350","question":"Where was Charles Stewart Parnell elected as a Member of the 22nd Parliament of the United Kingdom, and why did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q317436 p:P39 ?s . ?s ps:P39 wd:Q41582565 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["What place was Charles Steward Parnell voted in as an MP in the Uk, and for how long did he serve?"],"info":{}}
{"id":"train_20351","question":"Which is the PRONOM software identifier of Windows XP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11248 wdt:P2749 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20352","question":"How many {material are used} for {fiber} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P186 wd:Q161 }","paraphrases":["Fiber contains how many materials?"],"info":{}}
{"id":"train_20354","question":"Was Batman partner Diana Prince?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2695156 wdt:P451 wd:Q5271277 }","paraphrases":["Were DIana Prince and Batman partners?"],"info":{}}
{"id":"train_20355","question":"What unions does the European Parliament participate in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P194 wd:Q8889 . ?sbj wdt:P31 wd:Q3623811 }","paraphrases":["What unions does the European Parliament take an interest in?"],"info":{}}
{"id":"train_20357","question":"Who edited the HBW and BirdLife International Illustrated Checklist of the Birds of the World?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q25936179 wdt:P747 ?X . ?X wdt:P98 ?answer }","paraphrases":["Who altered the HBW and BirdLife Worldwide Outlined Checklist of the Winged creatures of the World?"],"info":{}}
{"id":"train_20358","question":"Name a steel bridge besigned by Joseph Strauss that  starts with letter B","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12042110 . ?sbj wdt:P84 wd:Q261174 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a metal bridge besigned by way of Joseph Strauss that starts with letter B"],"info":{}}
{"id":"train_20360","question":"Name a county in England used for many movie shootings that  starts with letter H","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1138494 . ?sbj wdt:P1740 wd:Q8458113 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a county in England used for many movie shootings that starts offevolved with letter H"],"info":{}}
{"id":"train_20361","question":"Was the Empire State Building built in 1986-6-25","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9188 p:P1435 ?s . ?s ps:P1435 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1986' ) ) }","paraphrases":["When was the Empire State Building built?"],"info":{}}
{"id":"train_20362","question":"which direction is Bruno Latour?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P560 wd:Q355237 }","paraphrases":[],"info":{}}
{"id":"train_20363","question":"which agricultural deity that contains the saturn in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24284226 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'saturn' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which rural divinity that contains the saturn in their name"],"info":{}}
{"id":"train_20366","question":"Which is the openMLOL author ID of Ralph Richardson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q381285 wdt:P3762 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20367","question":"What is the tropical cyclone with the highest cost of damage whose topic's main category is Category:Hurricane Sandy ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q8092 . ?ent wdt:P2630 ?obj . ?ent wdt:P910 wd:Q8528870 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the tropical cyclone with the best cost of harm whose topic's predominant category is Category:Hurricane Sandy ?"],"info":{}}
{"id":"train_20368","question":"Who is the financial backer of Irish Wikibooks?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q33109683 wdt:P137 ?X . ?X wdt:P859 ?answer }","paraphrases":["Who is the budgetary sponsor of Irish Wikibooks?"],"info":{}}
{"id":"train_20369","question":"Tell me the retail chain which starts with letter z!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q507619 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the retail chain which begins with letter z!"],"info":{}}
{"id":"train_20370","question":"Where did Henry and Nancy Kissinger get married?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q66107 p:P26 ?s . ?s ps:P26 wd:Q6962785 . ?s pq:P2842 ?value }","paraphrases":["Where did the marriage between Henry and Nancy Kissinger take place?"],"info":{}}
{"id":"train_20372","question":"Who is the daughter of Iskandar Thani?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4264509 wdt:P26 ?X . ?X wdt:P22 ?answer }","paraphrases":["Give me the name of the daughter of Iskandar Thani."],"info":{}}
{"id":"train_20373","question":"What is position angle of east ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q684 wdt:P2211 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20374","question":"Which acid anhydride containing oxygen has the lowest thermal conductivity ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q423118 . ?ent wdt:P2068 ?obj . ?ent wdt:P527 wd:Q629 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Inside the administrative locale of Volary, which Acer pseudoplatanus has the humblest border?"],"info":{}}
{"id":"train_20375","question":"what is in the BIBSYS ID of Lili Elbe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1140735 wdt:P1015 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20376","question":"When did Bob Hoe received his award as Library of Congress Living Legend?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q94081 p:P166 ?s . ?s ps:P166 wd:Q6542686 . ?s pq:P580 ?value }","paraphrases":["At what time did Bob Hoe given an award as a Library of Congress Living Legend?"],"info":{}}
{"id":"train_20377","question":"What is the postal code for Cardiff University, whose headquarters is in Cardiff?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1035745 p:P159 ?s . ?s ps:P159 wd:Q10690 . ?s pq:P281 ?value }","paraphrases":["What is Cardiff University's postal code?"],"info":{}}
{"id":"train_20379","question":"Which  is contributing factor of gemstone ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1479 wd:Q83437 }","paraphrases":[],"info":{}}
{"id":"train_20381","question":"What is found in species of aldosterone, that has the vernacular name of Човек?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184564 wdt:P703 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'Човек' ) ) }","paraphrases":["What is found in species of aldosterone, that has the vernacular title of Човек?"],"info":{}}
{"id":"train_20382","question":"tell me mythical human-animal hybird statrs with p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20902363 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know legendary human-animal hybird statrs with p"],"info":{}}
{"id":"train_20384","question":"tell me missionary society that starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20746389 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["disclose to me preacher society that begins with s"],"info":{}}
{"id":"train_20388","question":"What is the city located in the administrative entity of Golden Horde","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q79965 . ?sbj wdt:P31 wd:Q515 }","paraphrases":["What is the city found within the regulatory substance of Brilliant Crowd"],"info":{}}
{"id":"train_20390","question":"What is the {garrison} of {Die Welt} that {has municipalities} in {Friedrichshain-Kreuzberg}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q29872 wdt:P159 ?answer . ?answer wdt:P150 wd:Q158893 }","paraphrases":["What is the {battalion} of {Pass on Welt} that {has regions} in {Friedrichshain-Kreuzberg}?"],"info":{}}
{"id":"train_20391","question":"IS THE TOTAL PRODUCED OF DR CLASS E 15 EQUALS 1","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q477293 wdt:P1092 ?obj filter ( ?obj = 1 ) }","paraphrases":["IS The Full Delivered OF DR Lesson E 15 Breaks even with 1"],"info":{}}
{"id":"train_20392","question":"What is the {capital} of England, it {is in the administrative unit} of {Kingdom of Wessex}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21 wdt:P36 ?answer . ?answer wdt:P131 wd:Q105313 }","paraphrases":["What is the {capital} of England, it {is in the administrative unit} of {Kingdom of Wessex}?"],"info":{}}
{"id":"train_20393","question":"What should not be confused with sandal, which is located at a map point of 59.6321?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131704 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '59.6321' ) ) }","paraphrases":["What is located at a map point of 59.6321, and should not be confused with sandal?"],"info":{}}
{"id":"train_20394","question":"Is the operating income of Burger Kind 363,000,000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q177054 wdt:P3362 ?obj filter ( ?obj = 363000000 ) }","paraphrases":["Is Burger Kind's operating budget 363,000,000?"],"info":{}}
{"id":"train_20395","question":"When did Leonidas of Rhodes receive the award as winner of stadion at the ancient Olympic Games?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1066776 p:P166 ?s . ?s ps:P166 wd:Q23906217 . ?s pq:P585 ?value }","paraphrases":["What year did Leonidas of Rhodes receive the award as winner of stadion at the ancient Olympic Games?"],"info":{}}
{"id":"train_20396","question":"who replaces for Philippe Pétain has position held as Deputy Prime Minister of France ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5721 p:P39 ?s . ?s ps:P39 wd:Q19018261 . ?s pq:P1365 ?value }","paraphrases":["Give me the name of the person that will replace Philippe Pétain as Deputy Prime Minister of France."],"info":{}}
{"id":"train_20400","question":"Who is the {play} for {depicted by} of {Richard III of England}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q133028 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q25379 }","paraphrases":["When Richard III of England put on a play, who was it for?"],"info":{}}
{"id":"train_20401","question":"What was \"Crouching Tiger, Hidden Dragon\" nominated for on the 73rd Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q273978 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q751924 }","paraphrases":["nominated for the 73rd Academy Awards, what was the \"Crouching Tiger, Hidden Dragon\"?"],"info":{}}
{"id":"train_20402","question":"What is Petronas Towers architect called","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q83063 wdt:P84 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What is the architect of Petronas Towers?"],"info":{}}
{"id":"train_20403","question":"Which birth city of Zhu Hi has administrative divisions in Yimen Country?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9397 wdt:P19 ?answer . ?answer wdt:P150 wd:Q1200704 }","paraphrases":["Which birth city of Zhu Howdy has regulatory divisions in Yimen Country?"],"info":{}}
{"id":"train_20404","question":"What has outcome of the computer simulation, a place held computer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q925667 wdt:P1542 ?answer . ?answer wdt:P276 wd:Q68 }","paraphrases":["What has outcome of the computer simulation, a place held computer?"],"info":{}}
{"id":"train_20405","question":"How much original language of work is done by Indonesians?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P364 wd:Q9240 }","paraphrases":["Which is the number of the original language works done by the Indonesians?"],"info":{}}
{"id":"train_20406","question":"What was the twinned administrative body of Cagliari starting in 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1897 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["Explain and name the twinned administrative body of Cagliari starting in 2011."],"info":{}}
{"id":"train_20407","question":"Which political party was Imre Nagy a member in 1948?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q177917 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1948' ) ) }","paraphrases":["Name the political party that Imre Nagy was a member of in 1948."],"info":{}}
{"id":"train_20411","question":"How many siblings did Edward III of England have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q129247 wdt:P3373 ?obj }","paraphrases":["What is the number of Siblings Edward III of England  has?"],"info":{}}
{"id":"train_20412","question":"Tell me stellar classification whose name has the word type in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179600 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'type' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know stellar classification whose title has the word sort in it."],"info":{}}
