{"id":"train_5734","question":"Isaac Fawkes, also known as Isaach, is known by what personal name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6076303 wdt:P735 ?answer . ?answer wdt:P460 wd:Q30231991 }","paraphrases":["Isaac Fawkes, additionally regarded as Isaach, is known through what private name?"],"info":{}}
{"id":"train_5735","question":"Which is the character role of Luciano Pavarotti?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q37615 wdt:P453 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5736","question":"Which is the doctoral thesis of Dorothy Hodgkin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7487 wdt:P1026 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5737","question":"What is the daughter that has kids} of Halaevalu Mataʻaho ʻAhomeʻe ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3711224 wdt:P40 ?X . ?X wdt:P22 ?answer }","paraphrases":["What is the meaning of the daughter that has kids} of Halaevalu Mata'aho 'Ahome'e?"],"info":{}}
{"id":"train_5739","question":"What is Jacinda Adern's official title?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1308 wd:Q3606816 . ?sbj wdt:P31 wd:Q294414 }","paraphrases":["What is Jacinda Adern's official title?"],"info":{}}
{"id":"train_5740","question":"What determination method Washington uses for its population 1.14199e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1223 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '1.14199e+06' ) ) . ?s pq:P459 ?value }","paraphrases":["How does Washington determine its population of 1.14199e+06?"],"info":{}}
{"id":"train_5741","question":"What was Joseph's occupation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q128267 wdt:P106 ?obj . ?obj wdt:P31 wd:Q2207288 }","paraphrases":["Where did Joseph work?"],"info":{}}
{"id":"train_5742","question":"Tom Brady plays what position on which team?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q313381 wdt:P54 ?ans_1 . wd:Q313381 wdt:P413 ?ans_2 }","paraphrases":["what team Tom Brady plays and which position?"],"info":{}}
{"id":"train_5746","question":"When did landlocked country for currency of Russian ruble?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P38 wd:Q41044 . ?sbj wdt:P31 wd:Q123480 }","paraphrases":[],"info":{}}
{"id":"train_5747","question":"Thessaloniki is part of what region?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q17151 . ?sbj wdt:P31 wd:Q3301053 }","paraphrases":["Thessaloniki is portion of what region?"],"info":{}}
{"id":"train_5751","question":"Which is the cipM poet ID of John Cage?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q180727 wdt:P5393 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5752","question":"Who was Kim Basinger's husband until 2002?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131380 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["Who was the spouse for Kim Basinger until 2002?."],"info":{}}
{"id":"train_5754","question":"What books were illustrated by William Blake?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P110 wd:Q41513 . ?sbj wdt:P31 wd:Q571 }","paraphrases":["What books were outlined by William Blake?"],"info":{}}
{"id":"train_5755","question":"Tell me firearm whose name has the word shotgun in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12796 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'shotgun' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me firearm whose name has the word shotgun in it."],"info":{}}
{"id":"train_5756","question":"What are the ancient city which start with the letter zemar","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15661340 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zemar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the antiquated city which begin with the letter zemar"],"info":{}}
{"id":"train_5757","question":"which is the {type of kinship} for {Jesse Louis Lasky} whose {relative} as {Samuel Goldwyn} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1384661 p:P1038 ?s . ?s ps:P1038 wd:Q72579 . ?s pq:P1039 ?value }","paraphrases":["What is the type of relationship between Jesse Louis Lasky and Samuel Goldwyn?"],"info":{}}
{"id":"train_5760","question":"Where is the location of the river source for the Hudson River?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3140 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }","paraphrases":["Where is the source of the Hudson River?"],"info":{}}
{"id":"train_5761","question":"who is the Vidhan Sabha for legislative body of Assam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1164 wdt:P194 ?obj . ?obj wdt:P31 wd:Q3091020 }","paraphrases":["What is the name of the Vidhan Sabha for the legislative body of Assam?"],"info":{}}
{"id":"train_5762","question":"Wikipedia is the operator of what foundation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q52 wdt:P137 ?obj . ?obj wdt:P31 wd:Q157031 }","paraphrases":["What foundation is operated by Wikipedia?"],"info":{}}
{"id":"train_5764","question":"What was Gerry Adams position held that cause the dissolution of parliament?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q76139 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1534 wd:Q741182 }","paraphrases":["Which was the position that Gerry Adams held that caused the dissolution of parliament?"],"info":{}}
{"id":"train_5765","question":"Was Billy Joel a member of the Billy Joel Band?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q194333 wdt:P463 wd:Q4912802 }","paraphrases":["Did the Billy Joel Band include Billy Joel as a member?"],"info":{}}
{"id":"train_5768","question":"WHICH IS THE SPACE PROGRAM THAT CONTAINS THE WORD SPACE IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60054001 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'space' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE SPACE PROGRAM THAT CONTAINS THE WORD SPACE IN THEIR NAME"],"info":{}}
{"id":"train_5770","question":"tell me railway tunnel that contains the word tunel in the name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1311958 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tünel' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["et me know railroad burrow that contains the word tunel within the name"],"info":{}}
{"id":"train_5772","question":"What are the thunder god which start with the letter zeus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q842697 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zeus' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the thunder god which begin with the letter zeus"],"info":{}}
{"id":"train_5774","question":"Who is the organizer of FIFA World Cup?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q19317 wdt:P664 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5776","question":"What country is located in the administrative territorial entity of Khyber Pakhtunkhwa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q183314 wdt:P131 ?obj . ?obj wdt:P31 wd:Q6256 }","paraphrases":["What nation is found within the authoritative regional substance of Khyber Pakhtunkhwa?"],"info":{}}
{"id":"train_5782","question":"When is {diplomatic relation} {comes from} {Hunger} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1062365 wdt:P495 ?X . ?X wdt:P530 ?answer }","paraphrases":["When would it be appropriate to perform diplomatic relation related to Hunger?"],"info":{}}
{"id":"train_5784","question":"Who are the alumnus of Chris Burden whose Carnegie Classification of Institutions of Higher Education is exclusively undergraduate four-year?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q720832 wdt:P69 ?answer . ?answer wdt:P2643 wd:Q23623476 }","paraphrases":["Who are Chris Burden's alumnus whose Carnegie Classification of Higher Education Institutions is exclusively a four - year undergraduate?"],"info":{}}
{"id":"train_5786","question":"swimranking.net ryan lochte id is","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q201517 wdt:P2640 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5788","question":"How was the population of Iloilo City confirmed to be 334,539?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q459787 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '334539.0' ) ) . ?s pq:P459 ?value }","paraphrases":["how was it confirmed that the population of Iloilo City is 334,539?"],"info":{}}
{"id":"train_5790","question":"What is the Official name of Lahore?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11739 wdt:P1448 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5792","question":"What is the form of government of the country William Kidd was born in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26558 wdt:P27 ?X . ?X wdt:P122 ?answer }","paraphrases":["What is the shape of government of the nation William Kidd was born in?"],"info":{}}
{"id":"train_5794","question":"What was China previous dynasty before Yuan ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1366 wd:Q7313 . ?sbj wdt:P31 wd:Q50068795 }","paraphrases":["What was China past tradition some time recently Yuan ?"],"info":{}}
{"id":"train_5796","question":"Tell me about the state in the Confederation of the Rhine located in the administrative territorial entity of Weimar Republic.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q41304 . ?sbj wdt:P31 wd:Q26879769 }","paraphrases":[],"info":{}}
{"id":"train_5798","question":"What are the outflows of Lake Albert that are tributaries of Kidepo River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q125888 wdt:P201 ?answer . ?answer wdt:P974 wd:Q4788736 }","paraphrases":["What are the outflows of Lake Albert that are tributaries of Kidepo River?"],"info":{}}
{"id":"train_5799","question":"What what is project objective of project or mission nuclear weapon and also which starts with letter m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q170584 . ?sbj wdt:P3712 wd:Q12802 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the project objective of a project or mission nuclear weapon that begins with alphabet M."],"info":{}}
{"id":"train_5800","question":"Tell me about noble title of Pepin the Short and follows","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q81212 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["et me know almost respectable title of Pepin the Brief and takes after"],"info":{}}
{"id":"train_5801","question":"when did Sara Northup Hollister and L. Ron Hubbard divorce?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q216896 p:P26 ?s . ?s ps:P26 wd:Q7421728 . ?s pq:P582 ?value }","paraphrases":["Sara Northup Hollister and L. Ron Hubbard divorced in what year?"],"info":{}}
{"id":"train_5802","question":"What is the population of Aleutian Islands in the year 2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q119285 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["Which is the population of Aleutian Islands in the year 2000?"],"info":{}}
{"id":"train_5807","question":"What is Watt based on the way to measure the physical quantity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q25236 wdt:P111 ?ans_1 . wd:Q25236 wdt:P144 ?ans_2 }","paraphrases":["What physical quantity is the Watt based on?"],"info":{}}
{"id":"train_5808","question":"Which is {member of} {sovereign state} of {province of China} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1615742 wdt:P17 ?X . ?X wdt:P463 ?answer }","paraphrases":["Which is {part of} {majestic state} of {territory of China} ?"],"info":{}}
{"id":"train_5810","question":"When was Nnamdi Azikiwe the President of Nigeria?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q181782 p:P39 ?s . ?s ps:P39 wd:Q500282 . ?s pq:P582 ?value }","paraphrases":["What was the time period during which Nnamdi Azikiwe was the President of Nigeria?"],"info":{}}
{"id":"train_5811","question":"What portable computer had MS-DOS as the operating system?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P306 wd:Q47604 . ?sbj wdt:P31 wd:Q1820120 }","paraphrases":["MS-DOS was the operating system for which portable computer?"],"info":{}}
{"id":"train_5813","question":"When did Eduardo Frei Ruiz-Tagle receive an award as Lagun Onari?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q326 p:P166 ?s . ?s ps:P166 wd:Q3381638 . ?s pq:P585 ?value }","paraphrases":["In what year did Eduardo Frei Ruiz-Tagle accept an award under the name Lagun Onari?"],"info":{}}
{"id":"train_5814","question":"Which is the novella that contains the word švabica in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q149537 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'švabica' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the novella that incorporates the phrase švabica in it's name?"],"info":{}}
{"id":"train_5815","question":"When did PewDiePie receive the Shorty Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q13423853 p:P166 ?s . ?s ps:P166 wd:Q7502282 . ?s pq:P585 ?value }","paraphrases":["When was PewDiePie awarded the Shorty Awards?"],"info":{}}
{"id":"train_5816","question":"which freedom starts with d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5500839 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which opportunity begins with d"],"info":{}}
{"id":"train_5818","question":"For what period is La Marseillaise valid as the French anthem?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q142 p:P85 ?s . ?s ps:P85 wd:Q41180 . ?s pq:P1264 ?value }","paraphrases":["The French anthem La Marseillaise was valid during what time period?"],"info":{}}
{"id":"train_5819","question":"How many things did Isambard Kingdom Brunel design?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P287 wd:Q207380 }","paraphrases":["What is the number of things Isambard Kingdom Brunel Designed?"],"info":{}}
{"id":"train_5820","question":"WHAT IS THE CULTURAL HISTORY OF CHINA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2184 wd:Q82972 . ?sbj wdt:P31 wd:Q3502482 }","paraphrases":["WHAT IS THE Social HISTORY OF CHINA?"],"info":{}}
{"id":"train_5821","question":"Who is the participant that's not cooperative in the depiction of the Statue of the Viscount Slim?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21451665 wdt:P180 ?X . ?X wdt:P607 ?answer }","paraphrases":["Who is the participant that's not cooperative in the depiction of the Statue of the Viscount Slim?"],"info":{}}
{"id":"train_5822","question":"Is Houston the twinned administrative body of Luanda and Guayaquil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q16555 wdt:P190 wd:Q3897 . wd:Q16555 wdt:P190 wd:Q43509 }","paraphrases":["Is it true that Houston is the twinned administrative body of Luanda and Guayaquil?"],"info":{}}
{"id":"train_5824","question":"At what private university did the employer of Linus Pauling work in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q48983 wdt:P108 ?obj . ?obj wdt:P31 wd:Q902104 }","paraphrases":["Linus Pauling worked at what private university?"],"info":{}}
{"id":"train_5825","question":"What are the list of characters for the Doctor Who} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q34316 wdt:P1881 ?obj }","paraphrases":["Give me the names of the list of characters for the Doctor Who movie."],"info":{}}
{"id":"train_5826","question":"Which is the license plate code for Greece?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41 wdt:P395 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5827","question":"Who is {disciple} and {supervisor} of {David Ward-Steinman} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5240827 wdt:P1066 ?X . ?X wdt:P802 ?answer }","paraphrases":["Who is David Ward - Steinman's { disciple } and { supervisor }?"],"info":{}}
{"id":"train_5828","question":"What show with Matt Lauer won the Daytime Emmy Award for Outstanding Morning Program and when did it happen?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q1100609 p:P166 ?s . ?s ps:P166 wd:Q5243450 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["What show with Matt Lauer gained the Daytime Emmy Award for Outstanding Morning Program and when did it happen?"],"info":{}}
{"id":"train_5829","question":"Is the focal length of the large binocular telescope 14.808?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q845304 wdt:P2151 ?obj filter ( ?obj = 14.808 ) }","paraphrases":["Is it true that the focal length of the large binocular telescope equals 14.808?"],"info":{}}
{"id":"train_5830","question":"Who is the alumna of wives of Rebecca West?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q236669 wdt:P26 ?X . ?X wdt:P69 ?answer }","paraphrases":["Who is the alumna of spouses of Rebecca West?"],"info":{}}
{"id":"train_5832","question":"What diseases does psychotherapy study?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2579 wd:Q183257 . ?sbj wdt:P31 wd:Q12136 }","paraphrases":["What illnesses does psychotherapy study?"],"info":{}}
{"id":"train_5833","question":"Which isotope of lead has the least mass excess which decays to thallium-185?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1372384 . ?ent wdt:P2160 ?obj . ?ent wdt:P816 wd:Q18883276 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which lead isotope has the least excess mass declining to thallium-185?"],"info":{}}
{"id":"train_5838","question":"Name the Burial Plot referance for Claude Bernard who was burried in Pere Lachaise cemetery?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q208230 p:P119 ?s . ?s ps:P119 wd:Q311 . ?s pq:P965 ?value }","paraphrases":["Claude Bernard was buried in Per Lechaise Cemetary on which burial plot reference?"],"info":{}}
{"id":"train_5839","question":"Tell me what follows the Lion King series for the Walt Disney Animation Studios films.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q36479 p:P179 ?s . ?s ps:P179 wd:Q6603742 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Tell me what follows the Lion King series for the Walt Disney Animation Studios films."],"info":{}}
{"id":"train_5840","question":"How many wears for Michael Jordan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q41421 wdt:P3828 ?obj }","paraphrases":["Which is the number of wears for Michael Jordan?"],"info":{}}
{"id":"train_5844","question":"Is the target interest rate of the Bank of Israel equal to 0.08?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q244411 wdt:P2661 ?obj filter ( ?obj = 0.08 ) }","paraphrases":["Does the Bank of Israel target an interest rate of 0.08?"],"info":{}}
{"id":"train_5846","question":"Which is the test method for intelligence quotient?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q170277 wdt:P4988 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5849","question":"Did Roe v. Wade cite the Muskrat v. United States?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q300950 wdt:P2860 wd:Q175958 }","paraphrases":["Is it true that Roe v. Wade cite the Muskrat v. United States?"],"info":{}}
{"id":"train_5850","question":"tell me about moon of saturn starts with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1972 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know almost moon of saturn begins with the letter t"],"info":{}}
{"id":"train_5853","question":"Which is the fictional universe of the fictional universe described in Star Trek?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1445 wd:Q1092 . ?sbj wdt:P31 wd:Q559618 }","paraphrases":["Which is the anecdotal universe of the anecdotal universe portrayed in Star Trek?"],"info":{}}
{"id":"train_5856","question":"Who is the chairperson of Coptic Orthodox Church of Alexandria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q198998 wdt:P488 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Give me the name of the chairperson for the Orthodox Church of Alexandria."],"info":{}}
{"id":"train_5857","question":"What {on the shore of} the {Mid-Atlantic Ridge}, is a {tributary} of the {Albemarle Sound}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207313 wdt:P206 ?answer . ?answer wdt:P974 wd:Q1441345 }","paraphrases":["What {on the shore of} the {Mid-Atlantic Ridge}, is a {tributary} of the {Albemarle Sound}"],"info":{}}
{"id":"train_5860","question":"where is the located in the administrative territorial entity and who is the category of associated people of Hollywood?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q34006 wdt:P131 ?ans_1 . wd:Q34006 wdt:P1792 ?ans_2 }","paraphrases":["Where is the administrative territorial entity located and who is the category of associated people of Hollywood?"],"info":{}}
{"id":"train_5861","question":"When did Pavel Nakhimov receive the Order of St. George, 2nd class award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q345365 p:P166 ?s . ?s ps:P166 wd:Q14905807 . ?s pq:P585 ?value }","paraphrases":["In what year did Pavel Nakhimov obtain the second class award in the Order of St. George?"],"info":{}}
{"id":"train_5864","question":"who won by of prize received of john le carré ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q209641 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["who won by of prize gotten of john le carré ?"],"info":{}}
{"id":"train_5866","question":"What is the god worshipped by Jehovah's Witnesses that contains the word \"yahweh\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q190 . ?sbj wdt:P1049 wd:Q35269 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yahweh' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the god venerated by Jehovah's Witnesses that contains \"yahweh\" in its name ?"],"info":{}}
{"id":"train_5869","question":"how many charges does nuremberg trials have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q80130 wdt:P1595 ?obj }","paraphrases":["What is the total number of charges that  the Nuremberg Trials have?"],"info":{}}
{"id":"train_5870","question":"Which brand is located in Barcelona?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q1492 . ?sbj wdt:P31 wd:Q431289 }","paraphrases":["Which brand is found in Barcelona?"],"info":{}}
