{"id":"train_10616","question":"What political party is Julian Assange a member of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q360 wdt:P102 ?obj . ?obj wdt:P31 wd:Q7278 }","paraphrases":["What political party is Julian Assange a part of?"],"info":{}}
{"id":"train_10617","question":"Where is the population with 1 star and with the maximum temperature at childastronomical body 341958) Chrétien?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3592493 . ?ent wdt:P2076 ?obj . ?ent wdt:P398 wd:Q25397081 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Where is the populace with 1 star and with the greatest temperature at childastronomical body 341958) Chrétien?"],"info":{}}
{"id":"train_10618","question":"what is the statement is subject  for Donald Trump has significant event as inauguration ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q22686 p:P793 ?s . ?s ps:P793 wd:Q1417098 . ?s pq:P805 ?value }","paraphrases":["What is the statement that was the subject for Donald Trump's inauguration?"],"info":{}}
{"id":"train_10619","question":"What award did Joseph E. Stiglitz receive at the start of 1979?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q18430 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1979' ) ) }","paraphrases":["In 1979 Joseph E. Stiglitz received what award?"],"info":{}}
{"id":"train_10620","question":"Sevastopol is located on what peninsula?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7525 wdt:P706 ?obj . ?obj wdt:P31 wd:Q34763 }","paraphrases":["Sevastopol is found on what promontory?"],"info":{}}
{"id":"train_10624","question":"Is the base salary of George Stephenson more than 240.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q133614 wdt:P3618 ?obj filter ( ?obj > 240.0 ) }","paraphrases":["Is the base compensation of George Stephenson more than 240.0?"],"info":{}}
{"id":"train_10626","question":"What were the continents involved during the Cold War","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8683 wdt:P710 ?X . ?X wdt:P30 ?answer }","paraphrases":["Name the continents involved in the Cold War."],"info":{}}
{"id":"train_10630","question":"What are the Christian denomination which start with the letter united","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q879146 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'united' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Christian group which begin with the letter united"],"info":{}}
{"id":"train_10632","question":"What credit institution starts with the letter \"w\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q730038 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["With the letter \"w,\" which credit institution starts?"],"info":{}}
{"id":"train_10633","question":"When Nazareth Araújo won, which round of voting had the most participants?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q24097670 . ?ent wdt:P5043 ?obj . ?ent wdt:P991 wd:Q47502977 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which round of voting had the most participants when Nazareth Araújo won?"],"info":{}}
{"id":"train_10634","question":"Is the population in Szezecin 407811.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q393 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '407811.0' ) ) . ?s pq:P585 ?value }","paraphrases":["What is the population in Szezecin?"],"info":{}}
{"id":"train_10635","question":"What is MYmovies actor ID of Adrien Brody?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q104514 wdt:P4779 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10636","question":"What is the Belgium symbol for highest alcohol by volume?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q167270 . ?ent wdt:P2665 ?obj . ?ent wdt:P495 wd:Q31 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["In Belgium, what is the symbol for highest alcohol by volume?"],"info":{}}
{"id":"train_10637","question":"How many movements made for the {futurism} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P135 wd:Q131221 }","paraphrases":["Influenced by Filippo Tommaso Marinetti, Balla adopted the Futurist style, creating a pictorial depiction of light, movement and speed. He was signatory to the Futurist Manifesto in 1910. He also taught Umberto Boccioni.Feb 5, 2019"],"info":{}}
{"id":"train_10638","question":"Is it true that the visitors per year of Paul-Raymond Museum equals to 882?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3329306 wdt:P1174 ?obj filter ( ?obj = 882 ) }","paraphrases":["Is it genuine that the guests per year of Paul-Raymond Exhibition hall breaks even with to 882?"],"info":{}}
{"id":"train_10639","question":"What champ nomination did Stephen Hendry receive?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q295201 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What champ assignment did Stephen Hendry get?"],"info":{}}
{"id":"train_10640","question":"What was Clint Eastwood nominated for at the 76th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43203 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q458646 }","paraphrases":["Which award was Clint Eastwood short-listed for at the 76th Academy Awards?"],"info":{}}
{"id":"train_10641","question":"What is {discretionary connection} of {starts} of {techno} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170611 wdt:P495 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is {optional association} of {begins} of {techno} ?"],"info":{}}
{"id":"train_10644","question":"Is the vehicles per thousand people of Berlin equal to 342?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q64 wdt:P5167 ?obj filter ( ?obj = 342 ) }","paraphrases":["Does Berlin have 342 vehicles for every thousand people?"],"info":{}}
{"id":"train_10645","question":"Which member was the next Académie des Beaux-Arts after Georges-Eugène Haussmann?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q191798 p:P463 ?s . ?s ps:P463 wd:Q337531 . ?s pq:P156 ?value }","paraphrases":["Who was the Académie des Beaux-Arts after Georges-Eugène Haussmann?"],"info":{}}
{"id":"train_10646","question":"who  is the professional wrestling promotion for replaces of WWE?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q35339 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q721067 }","paraphrases":["who is the proficient wrestling advancement for replaces of WWE?"],"info":{}}
{"id":"train_10647","question":"Which is the chromosome count for Down syndrome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q47715 wdt:P5230 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10648","question":"Was PHP influenced by C++ and PHP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q59 wdt:P737 wd:Q2407 . wd:Q59 wdt:P737 wd:Q59 }","paraphrases":["Did C++ and PHP influence PHP?"],"info":{}}
{"id":"train_10649","question":"When did position held of Arthur Balfour and elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q19008 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What position did Arthur Balfour hold and when was he elected into it?"],"info":{}}
{"id":"train_10650","question":"Which company released Commodore 64 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1056 wd:Q99775 . ?sbj wdt:P31 wd:Q1137109 }","paraphrases":["Which company discharged Commodore 64 ?"],"info":{}}
{"id":"train_10651","question":"Who is the boxer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P641 wd:Q32112 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Which person is the boxer?"],"info":{}}
{"id":"train_10654","question":"Is it true that the rate of fire of the 127/54 Compact equal 48.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1257331 wdt:P3792 ?obj filter ( ?obj = 48.0 ) }","paraphrases":["Is 48.0 the rate of fire of the 127/54 Compact?"],"info":{}}
{"id":"train_10657","question":"What is the country of origin for thrash metal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q483352 wdt:P495 ?obj }","paraphrases":["What country did thrash metal originate in?"],"info":{}}
{"id":"train_10659","question":"What award was given to Gerhart Hauptmann, and how much money did he win from it?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q43523 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }","paraphrases":["What award was once given to Gerhart Hauptmann, and how tons cash did he win from it?"],"info":{}}
{"id":"train_10660","question":"who language for indigenous to of khazars?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2341 wd:Q173282 . ?sbj wdt:P31 wd:Q34770 }","paraphrases":["What is the language of the khazars?"],"info":{}}
{"id":"train_10661","question":"When was Dizzee Rascal nominated for the Brit Award for British Breakthrough Act?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q366506 p:P1411 ?s . ?s ps:P1411 wd:Q16985318 . ?s pq:P585 ?value }","paraphrases":["When did Dizzee Rascal win British Breakthrough Act?"],"info":{}}
{"id":"train_10662","question":"When is the end and start time of Deodoro da Fonseca position as President of Brazil?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q200812 p:P39 ?s . ?s ps:P39 wd:Q5176750 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When is the conclusion and begin time of Deodoro da Fonseca position as President of Brazil?"],"info":{}}
{"id":"train_10667","question":"what is forensic technique starts with d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q456443 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What forensic technique begins with d"],"info":{}}
{"id":"train_10668","question":"Who gave the {co-founded by} of {has designer} of {RIM-116 Rolling Airframe Missile} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1060737 wdt:P287 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who gave the {co-founded by} of {has architect} of {RIM-116 Rolling Airframe Rocket} ?"],"info":{}}
{"id":"train_10669","question":"What is the plot of Jacques?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24565962 wdt:P1441 ?X . ?X wdt:P2079 ?answer }","paraphrases":["What happens plotwise in Jacques"],"info":{}}
{"id":"train_10670","question":"How many matches did Gordon Banks play for Stoke City F.C. and how many goals did he score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q213879 p:P54 ?s . ?s ps:P54 wd:Q18736 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How many goals did Gordon Banks score for Stoke City F.C., and in what number of matches?"],"info":{}}
{"id":"train_10672","question":"Name the anthology drama film with the lowest box office return ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q336144 . ?ent wdt:P2142 ?obj . ?ent wdt:P136 wd:Q130232 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which anthology drama film produced the lowest box office return?"],"info":{}}
{"id":"train_10673","question":"Is the atomic number of sulfur greater than 12.8","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q682 wdt:P1086 ?obj filter ( ?obj > 12.8 ) }","paraphrases":["Is the nuclear number of sulfur more prominent than 12.8"],"info":{}}
{"id":"train_10674","question":"Which is the 3D model of David?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q179900 wdt:P4896 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10675","question":"Where is the {venous drainage} and the {arterial supply} of {Clitoris} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q873072 wdt:P2289 ?ans_1 . wd:Q873072 wdt:P2286 ?ans_2 }","paraphrases":["Where is the {venous seepage} and the {blood vessel supply} of {Clitoris} ?"],"info":{}}
{"id":"train_10677","question":"Who replaced Frank Forde as Member of the Queensland Legislative Assembly?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q459146 p:P39 ?s . ?s ps:P39 wd:Q18526194 . ?s pq:P1365 ?value }","paraphrases":["When Frank Forde left as a member of the Queensland Legislative Assembly, who replaced him?"],"info":{}}
{"id":"train_10678","question":"When did the TV show Lassie originally air?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q289537 p:P449 ?s . ?s ps:P449 wd:Q1572845 . ?s pq:P585 ?value }","paraphrases":["The TV show \"Lassie\" originally ran when?"],"info":{}}
{"id":"train_10679","question":"Does the University of Oxford admit a rate of .0175?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q34433 wdt:P5822 ?obj filter ( ?obj = 0.175 ) }","paraphrases":["Is .0175 the acceptance rate at Oxford?"],"info":{}}
{"id":"train_10682","question":"Who are the inhabitants of endemism in Varanus komodoensis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4504 wdt:P183 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Who are the occupants of endemism in Varanus komodoensis?"],"info":{}}
{"id":"train_10684","question":"\"What is the treats disease of bismuth whose treatment is Trovafloxacin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q942 wdt:P2175 ?answer . ?answer wdt:P2176 wd:Q544393 }","paraphrases":["\"What is the treats disease of bismuth whose cure is Trovafloxacin?"],"info":{}}
{"id":"train_10685","question":"Tell me about the position of an employee at UNESCO.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P39 wd:Q7809 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What are some job requirements for an employee at UNESCO?"],"info":{}}
{"id":"train_10687","question":"How many highest point are scored by Ben Nevis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P610 wd:Q104674 }","paraphrases":["The points recorded by ben Nevis how many ?"],"info":{}}
{"id":"train_10689","question":"Is it true that the Sister member count equals 4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q223048 wdt:P2124 ?obj filter ( ?obj = 4 ) }","paraphrases":["Is 4 the value of the Sister member count?"],"info":{}}
{"id":"train_10690","question":"Where in Limpopo borough is the city of North West?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q134907 wdt:P131 ?answer . ?answer wdt:P150 wd:Q165956 }","paraphrases":["Where in Limpopo borough is the city of North West?"],"info":{}}
{"id":"train_10691","question":"What is named for Compton scattering which has the honorary title of \"X-ray badge\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q171516 wdt:P138 ?answer . ?answer wdt:P166 wd:Q2202680 }","paraphrases":["What is named for Compton scattering which has the honorary title of \"X-ray badge\"?"],"info":{}}
{"id":"train_10692","question":"WHat are the types of software that contain the word \"system\" in their name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28530532 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'system' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat are the sorts of computer program that contain the word \"framework\" in their title ?"],"info":{}}
{"id":"train_10693","question":"WHICH IS THE NEWSMAGAZINE THAT STARTS WITH W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1684600 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE NEWSMAGAZINE THAT Begins WITH W"],"info":{}}
{"id":"train_10694","question":"In which country Marilyn Chambers died at Santa Clarita?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q220693 p:P20 ?s . ?s ps:P20 wd:Q491132 . ?s pq:P17 ?value }","paraphrases":["What country did Marilyn Chambers die at Santa Clarita?"],"info":{}}
{"id":"train_10696","question":"What is the Jaw ISzDb film ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q189505 wdt:P3110 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10698","question":"What's the native label for congee?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q878624 wdt:P1705 ?obj }","paraphrases":["Which is the native label for congee?"],"info":{}}
{"id":"train_10700","question":"Who is {discoverer of} {big event} of {Najib Razak} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57675 wdt:P793 ?X . ?X wdt:P61 ?answer }","paraphrases":["The big event of Najib Razak was discovered by whom?"],"info":{}}
{"id":"train_10701","question":"What was the largest team that finished Yukon Quest who had Cody Strathe as a participant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2301224 . ?ent wdt:P2105 ?obj . ?ent wdt:P710 wd:Q18588261 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What was once the greatest group that completed Yukon Quest who had Cody Strathe as a participant?"],"info":{}}
{"id":"train_10702","question":"What journal is Darwin's abominable mystery: Insights from a supertree of the angiosperms cited from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24621983 wdt:P2860 ?X . ?X wdt:P1433 ?answer }","paraphrases":["What Darwin journal is Abominable Mystery from?"],"info":{}}
{"id":"train_10703","question":"When Cardiff has its population 346100.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q10690 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '346100.0' ) ) . ?s pq:P585 ?value }","paraphrases":["WHat year did Cardiff have a population of 346100"],"info":{}}
{"id":"train_10705","question":"What is the maximum vapor pressure of Galinstan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q675176 p:P2119 ?s . ?s ps:P2119 ?obj . ?s pq:P459 wd:Q10578722 }","paraphrases":["Galinstan can have a maximum vapor pressure of what?"],"info":{}}
{"id":"train_10706","question":"What minimum triangular number has an instance of which composite number?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q245102 . ?ent wdt:P1181 ?obj . ?ent wdt:P31 wd:Q50707 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What least triangular number has an occasion of which composite number?"],"info":{}}
{"id":"train_10707","question":"What is the executive and legislature body of Goa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1171 wdt:P208 ?ans_1 . wd:Q1171 wdt:P194 ?ans_2 }","paraphrases":["Name the executive and legislative body of Goa."],"info":{}}
{"id":"train_10709","question":"Are there fewer than 3.6 spans of the Kew Bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q371906 wdt:P1314 ?obj filter ( ?obj < 3.6 ) }","paraphrases":["Are there less than 3.6 ranges of the Kew Bridge?"],"info":{}}
{"id":"train_10710","question":"who is the {mother} for {Will Smith} that has {child} as {Willow Smith} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q40096 p:P40 ?s . ?s ps:P40 wd:Q298209 . ?s pq:P25 ?value }","paraphrases":["What is the name of the woman who mothered Willow Smith, with Will Smith?"],"info":{}}
{"id":"train_10711","question":"\"Which is {topic of} of {history of Alabama}, that has {has shires} is {Perry County} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5774933 wdt:P1269 ?answer . ?answer wdt:P150 wd:Q253538 }","paraphrases":["\"Which is {subject of} of {history of Alabama}, that has {has shires} is {Perry Province} ?\""],"info":{}}
{"id":"train_10713","question":"What is the diplomatic relationship of Karen Carpenter and the location of where she is buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1250861 wdt:P119 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is the relationship of Karen Carpenter and the location of where she is buried?"],"info":{}}
{"id":"train_10714","question":"What is the name of the library at the University of Oxford?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P127 wd:Q34433 . ?sbj wdt:P31 wd:Q7075 }","paraphrases":["What is the title of the library at the College of Oxford?"],"info":{}}
{"id":"train_10720","question":"What earthquake in Kamouraskas had the most aftershocks?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7944 . ?ent wdt:P2320 ?obj . ?ent wdt:P131 wd:Q178178 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Kamouraskas' earthquake has had the most aftershocks?"],"info":{}}
{"id":"train_10725","question":"What left office is from the temporal range start of Sturtian glaciation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1450075 wdt:P523 ?X . ?X wdt:P582 ?answer }","paraphrases":["What left office is from the temporal range begin of Sturtian glaciation?"],"info":{}}
{"id":"train_10729","question":"Gloria Estefan won the Latin Grammy Award for Best Tropical Song for what song?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q184697 p:P166 ?s . ?s ps:P166 wd:Q6496398 . ?s pq:P1346 ?value }","paraphrases":["What was the name of the Latin Grammy Award for Best Tropical Song that was sung by Gloria Estefan?"],"info":{}}
{"id":"train_10730","question":"What are the united states federal executive department which start with the letter d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q910252 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the federal executive departments of the United States that start with letter d."],"info":{}}
{"id":"train_10731","question":"Which is the Unicode hex codepoint for smiley?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11241 wdt:P4213 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10732","question":"What is the collection of astronomical objects with the smallest wavelength?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q605175 . ?ent wdt:P2808 ?obj . ?ent wdt:P31 wd:Q605175 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What collection of actronomical objects has the smallest wavelength?"],"info":{}}
{"id":"train_10733","question":"Is the Wikidata time precision of the minute equal to 13?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7727 wdt:P2803 ?obj filter ( ?obj = 13 ) }","paraphrases":["What is the time precision of Wikidata?"],"info":{}}
{"id":"train_10734","question":"Who is the statement is subject of for Julia Philips has award received as Academy Award for Best Picture","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2613709 p:P166 ?s . ?s ps:P166 wd:Q102427 . ?s pq:P805 ?value }","paraphrases":["What statement did Julia Philips make for best picture"],"info":{}}
{"id":"train_10735","question":"What is in action of Clarence Campbell, whose moveable object location is in Atlantic Ocean?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1095380 wdt:P607 ?answer . ?answer wdt:P276 wd:Q97 }","paraphrases":["What is in action of Clarence Campbell, whose portable object location is in Atlantic Ocean?"],"info":{}}
{"id":"train_10737","question":"What does the Ulysses S. Grant National Memorial in the United States commemorate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P547 wd:Q34836 . ?sbj wdt:P31 wd:Q1967454 }","paraphrases":["What does the Ulysses S. Allow National Dedication within the Joined together States commemorate?"],"info":{}}
