{"id":"train_475","question":"WHICH IS THE ASSOCIATION OF FOOTCLUB THAT STARTS WITH W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q476028 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["NAME THE ASSOCIATION OF FOOTCLUB THAT STARTS WITH THE LETTER W"],"info":{}}
{"id":"train_476","question":"Into how many editions has Othello been translated?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q26833 wdt:P747 ?obj . ?obj wdt:P31 wd:Q39811647 }","paraphrases":["Into how numerous versions has Othello been deciphered?"],"info":{}}
{"id":"train_479","question":"What team did Peter Schmeichel start playing for in 1984?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q182314 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["What team did Peter Schmeichel join in 1984?"],"info":{}}
{"id":"train_480","question":"Where is the name of the continent of the mountain belt in Mount Caywood?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6920087 wdt:P4552 ?X . ?X wdt:P30 ?answer }","paraphrases":["In the continent of the mountain belt in Mount Caywood, what is the name?"],"info":{}}
{"id":"train_485","question":"Is the toughness of Grivory GM-4H less than 7.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q57051271 wdt:P5520 ?obj filter ( ?obj < 7.2 ) }","paraphrases":["Is 7.2 greater than the toughness of Grivory GM-4H?"],"info":{}}
{"id":"train_487","question":"Name an unity of measure used for temperature that starts with letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2394680 . ?sbj wdt:P111 wd:Q11466 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a temperature unit that begins with the letter P"],"info":{}}
{"id":"train_489","question":"\"What is name of John Foster Dulles Latin script that has alphabet?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q223677 wdt:P735 ?answer . ?answer wdt:P282 wd:Q8229 }","paraphrases":["\"What is identify of John Foster Dulles Latin script that has alphabet?\""],"info":{}}
{"id":"train_490","question":"Is Ridley Scott the child of Luke Scott and Jordan Scott?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q56005 wdt:P40 wd:Q21066699 . wd:Q56005 wdt:P40 wd:Q452925 }","paraphrases":["Did Luke and Jordan Scott have a child named Ridley Scott?"],"info":{}}
{"id":"train_492","question":"who unit of density for measured by of density?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q29539 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q10387685 }","paraphrases":["who unit of thickness for measured by of density?"],"info":{}}
{"id":"train_495","question":"Which is Greek nymph which was the partner of Apollo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P451 wd:Q37340 . ?sbj wdt:P31 wd:Q3346693 }","paraphrases":["Which is Greek fairy which was the accomplice of Apollo?"],"info":{}}
{"id":"train_497","question":"Who was nominated for an Academy Award for  Best Sound Mixing in Gladiator?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q128518 p:P1411 ?s . ?s ps:P1411 wd:Q830079 . ?s pq:P2453 ?value }","paraphrases":["What are the nominations for an Academy Award for Best Sound Mixing in Gladiator?"],"info":{}}
{"id":"train_498","question":"What are the national sports team  which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1194951 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the national sports group which begin with the letter t"],"info":{}}
{"id":"train_504","question":"What was George Washington's military rank between 1774 and 1796?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23 p:P410 ?s . ?s ps:P410 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1796' ) ) }","paraphrases":["Which was the military rank of George Washington between 1774 and 1796?"],"info":{}}
{"id":"train_505","question":"What was Laurence Olivier nominated for at the 12th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q55245 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q508513 }","paraphrases":["Laurence Olivier was nominated for what at the 12th annual Academy Awards?"],"info":{}}
{"id":"train_509","question":"Name a Luther city that contain the word \"worms \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1547289 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'worms' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a Luther town in its name containing the word \"worms\""],"info":{}}
{"id":"train_511","question":"Is it true that the target interest rate of Central Bank of Azerbaijan equals to 5.25?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q190230 wdt:P2661 ?obj filter ( ?obj = 5.25 ) }","paraphrases":["What is the Central Bank of Azerbaijan's target interest rate?"],"info":{}}
{"id":"train_512","question":"Was Rupert Grint's occupation a actor and child actor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q19190 wdt:P106 wd:Q33999 . wd:Q19190 wdt:P106 wd:Q970153 }","paraphrases":["What was Rupert Grint's occupation as a child?"],"info":{}}
{"id":"train_514","question":"Which is stated in Tripitaka?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P248 wd:Q1321432 }","paraphrases":[],"info":{}}
{"id":"train_516","question":"What is the academic area of work of Viktor Bespalov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28792298 wdt:P108 ?X . ?X wdt:P101 ?answer }","paraphrases":["What is the scholarly region of work of Viktor Bespalov?"],"info":{}}
{"id":"train_519","question":"When did the marriage between Marilyn Monroe and James Dougherty end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q4616 p:P26 ?s . ?s ps:P26 wd:Q946783 . ?s pq:P582 ?value1 . ?s pq:P2842 ?value2 }","paraphrases":["When did Marilyn Monroe & James Dougherty separate?"],"info":{}}
{"id":"train_521","question":"Name a disease that starts with the letter Y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12136 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the name of the disease that starts with the letter Y?"],"info":{}}
{"id":"train_522","question":"What is on geographical feature of Greater Antilles whose continent is North America ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q128011 wdt:P706 ?answer . ?answer wdt:P30 wd:Q49 }","paraphrases":["What is the geography of the Greater Antilles in North America?"],"info":{}}
{"id":"train_523","question":"Ignatius of Loyola belongs to which Catholic order?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44281 wdt:P611 ?obj . ?obj wdt:P31 wd:Q391009 }","paraphrases":["Ignatius of Loyola has a place to which Catholic arrange?"],"info":{}}
{"id":"train_527","question":"Who was Jonas Salk's doctoral student?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q200101 wdt:P185 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was Jonas Salk's doctoral understudy?"],"info":{}}
{"id":"train_529","question":"What are the regions available on the coast of Lower Saxony?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1197 wdt:P150 ?answer . ?answer wdt:P206 wd:Q1882240 }","paraphrases":["What are the locales accessible on the coast of Lower Saxony?"],"info":{}}
{"id":"train_531","question":"Do the rural cities of Para have 13155 inhabitants?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q39517 wdt:P150 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '13155' ) ) }","paraphrases":["Do the country cities of Para have 13155 inhabitants?"],"info":{}}
{"id":"train_533","question":"What are the type of food or dish that contains the word torta in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19861951 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'torta' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What kind of food or dish does the word torta contain in its name?"],"info":{}}
{"id":"train_535","question":"Tell me literary genre whose name has the word vita in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223393 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vita' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me scholarly sort whose title has the word vita in it"],"info":{}}
{"id":"train_536","question":"Which equation do I use to measure horsepower ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q160857 wdt:P111 ?X . ?X wdt:P2534 ?answer }","paraphrases":["What equation should I use to measure horsepower?"],"info":{}}
{"id":"train_538","question":"What is the official language of Alice springs-Soverign state?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17872 wdt:P17 ?X . ?X wdt:P2936 ?answer }","paraphrases":["What is the official dialect of Alice springs-Soverign state?"],"info":{}}
{"id":"train_540","question":"What is native language for Vincent Auriol ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q158772 wdt:P103 ?answer }","paraphrases":[],"info":{}}
{"id":"train_541","question":"Name a memer of the Oracle Corporation","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P463 wd:Q19900 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Title a memer of the Prophet Enterprise"],"info":{}}
{"id":"train_542","question":"Name a musical composition by Dionysus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P674 wd:Q41680 . ?sbj wdt:P31 wd:Q207628 }","paraphrases":["Title a melodic composition by Dionysus"],"info":{}}
{"id":"train_543","question":"Who was the goddess Artemis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P460 wd:Q39503 . ?sbj wdt:P31 wd:Q205985 }","paraphrases":["Who was the goddess Artemis?"],"info":{}}
{"id":"train_546","question":"Which  is farthest north of place held by Balkans Campaign?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q789406 wdt:P276 ?X . ?X wdt:P1332 ?answer }","paraphrases":["Which is most remote north of put held by Balkans Campaign?"],"info":{}}
{"id":"train_547","question":"What is Jacinda Ardern's position ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1308 wd:Q3606816 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["What psoition does Jacinda Ardern's serve?"],"info":{}}
{"id":"train_548","question":"What category of people are in Odoacer","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q103333 wdt:P2348 ?X . ?X wdt:P1792 ?answer }","paraphrases":["What kinds of people live in Odoacer?"],"info":{}}
{"id":"train_549","question":"Which is dantai code for Kyōto Prefecture?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q120730 wdt:P429 ?answer }","paraphrases":[],"info":{}}
{"id":"train_550","question":"What topic of the history of Estonia has the inflation rate of consumer price index of 1.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q949423 wdt:P1269 ?answer . ?answer wdt:P1279 ?x FILTER ( contains ( ?x , '1.2' ) ) }","paraphrases":["What subject of the records of Estonia has the inflation price of customer charge index of 1.2?"],"info":{}}
{"id":"train_552","question":"Who gave the{route of administration} of {consequence} of {cyclohexane} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q211433 wdt:P1542 ?X . ?X wdt:P636 ?answer }","paraphrases":["Who gave the { administration route } of the { cyclohexane } consistency?"],"info":{}}
{"id":"train_553","question":"What is {religious affiliation} of {ethnicity} {Sirhan Sirhan} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q297112 wdt:P172 ?X . ?X wdt:P140 ?answer }","paraphrases":["What is {devout connection} of {ethnicity} {Sirhan Sirhan} ?"],"info":{}}
{"id":"train_556","question":"Where in Père Lachaise Cemetery is Jean-François Champollion buried?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q260 p:P119 ?s . ?s ps:P119 wd:Q311 . ?s pq:P965 ?value }","paraphrases":["Jean-Francois Champollion is deceased, and where are the remains?"],"info":{}}
{"id":"train_557","question":"What are the speakers of the working languages of the Kingdom of England?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q179876 wdt:P2936 ?X . ?X wdt:P1098 ?answer }","paraphrases":["What languages are spoken in the United Kingdom?"],"info":{}}
{"id":"train_560","question":"Is the power consumed by the World Space Observatory more than 1200?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2569316 wdt:P2791 ?obj filter ( ?obj > 1200.0 ) }","paraphrases":["Does the World Space Observatory consume for than 1200 in power"],"info":{}}
{"id":"train_561","question":"Is Vidhan Sabha executive body of Assam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1164 wdt:P208 ?obj . ?obj wdt:P31 wd:Q3091020 }","paraphrases":["Is Vidhan Sabha official body of Assam?"],"info":{}}
{"id":"train_562","question":"When was Vasily Chuikov awarded the Order of Lenin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q157594 p:P166 ?s . ?s ps:P166 wd:Q185493 . ?s pq:P585 ?value }","paraphrases":["When did Vasily Chuikov win the Order of Lenin?"],"info":{}}
{"id":"train_563","question":"Tell me fictional detective whose name has the word sam in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223638 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ארץ' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a fictional detective whose name includes the word sam."],"info":{}}
{"id":"train_565","question":"Tell me kinship whose name has the word uncle in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q171318 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'uncle' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know family relationship whose title has the word uncle in it."],"info":{}}
{"id":"train_566","question":"what are the painting which start with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3305213 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the portray which begin with the letter y"],"info":{}}
{"id":"train_567","question":"What Academy Award subject is Mercedes Ruehl nominated for as Best Supporting Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q232933 p:P1411 ?s . ?s ps:P1411 wd:Q106301 . ?s pq:P805 ?value }","paraphrases":["As Best Supporting Actress, what Academy Award subject is Mercedes Ruehl nominated for?"],"info":{}}
{"id":"train_568","question":"What number follows -2?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q204 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P155 wd:Q3827340 }","paraphrases":["-2 is followed by which number?"],"info":{}}
{"id":"train_569","question":"Was the thickness of the Bronze Age equal to .615?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q526178 wdt:P2610 ?obj filter ( ?obj = 0.615 ) }","paraphrases":["Is the thickness of the Bronze Age .615?"],"info":{}}
{"id":"train_570","question":"What what is gas giant child astronomical body by Enceladus and also which starts with letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q121750 . ?sbj wdt:P398 wd:Q3303 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is gas giant infant astronomical body by using Enceladus and additionally which starts with letter s"],"info":{}}
{"id":"train_571","question":"Is the Z scale scale 1:220?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1967226 wdt:P1752 ?obj filter ( ?obj = 220 ) }","paraphrases":["Is the ratio for the Z scale 1:220?"],"info":{}}
{"id":"train_576","question":"who county seat for  died in of Innokenty smoktunovsky ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q380250 wdt:P20 ?X . ?X wdt:P1376 ?answer }","paraphrases":["Who died in Innokenty smoktunovsky county seat?"],"info":{}}
{"id":"train_577","question":"What is the language official of World Baseball Softball Confederation whose typology is nominative–accusative language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11362472 wdt:P37 ?answer . ?answer wdt:P4132 wd:Q178435 }","paraphrases":["What is the dialect official of World Baseball Softball Confederation whose typology is nominative–accusative language?"],"info":{}}
{"id":"train_578","question":"When was the Arab League founded that shares a border with Ethiopia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7172 p:P47 ?s . ?s ps:P47 wd:Q115 . ?s pq:P580 ?value }","paraphrases":["What year was the Arab League founded?"],"info":{}}
{"id":"train_580","question":"Who is the  {human} for {doctoral advisor} of {Claude Shannon}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P184 wd:Q92760 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {doctoral advisor} of {Claude Shannon}"],"info":{}}
{"id":"train_584","question":"What award did Marie Curie receive in 1911?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7186 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1911' ) ) }","paraphrases":["In 1911 what award did Marie Curie receive?"],"info":{}}
{"id":"train_585","question":"What are the comic strip which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q838795 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the comic strip starting with the letter z?"],"info":{}}
{"id":"train_586","question":"Is the age of majority of the USA equal to t1410874016?","sparql":"ASK WHERE { wd:Q30 wdt:P2997 ?obj filter(?obj = t1410874016) } ","paraphrases":["What is the age of majority in the United States?"],"info":{}}
{"id":"train_587","question":"What is the political party in Catalonia with min number of representatives in an organization whose political alignment is left - wing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q25768329 . ?ent wdt:P1410 ?obj . ?ent wdt:P1387 wd:Q164597 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the smallest Catalonian left-wing political party?"],"info":{}}
{"id":"train_589","question":"which organization name starts with z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43229 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which organization title begins with z"],"info":{}}
{"id":"train_590","question":"Who is the {aircraft fleet} for {uses} of {airplane}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2283 wd:Q197 . ?sbj wdt:P31 wd:Q17372500 }","paraphrases":["Who is the {flying machine armada} for {employments} of {plane}"],"info":{}}
{"id":"train_591","question":"What is the genus with the highest chromosome count in the taxon rank?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P5230 ?obj . ?ent wdt:P105 wd:Q34740 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the genus with the highest chromosome count in taxon rank."],"info":{}}
{"id":"train_593","question":"what is mankinds collection of venice","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P195 wd:Q641 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["what is mankinds collection of venice"],"info":{}}
{"id":"train_594","question":"What award was Maria Montessori nominated for on January 1, 1950?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131117 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1950' ) ) }","paraphrases":["Which was the award that Maria Monessori got nominated for in 1950?"],"info":{}}
{"id":"train_595","question":"Does the height of the BMW i8 equal 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q796799 wdt:P2048 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is 1 the height of the BMW i8?"],"info":{}}
{"id":"train_597","question":"What family of vehicles starts with the letter \"v\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22999537 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the group of vehicles that start with the letter \"v\""],"info":{}}
{"id":"train_599","question":"Which protein interacts with oxytocin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P129 wd:Q169960 . ?sbj wdt:P31 wd:Q8054 }","paraphrases":["Which protein interatomic with oxytocin?"],"info":{}}
{"id":"train_600","question":"Which is the LTI Korea Library ID for Choe Chiwon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q487042 wdt:P4760 ?answer }","paraphrases":[],"info":{}}
{"id":"train_601","question":"What are the ancient civilization which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28171280 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the antiquated civilization which begin with the letter s"],"info":{}}
{"id":"train_602","question":"What's the name of a novel series that starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1667921 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a novel series that begins with \"t\"."],"info":{}}
{"id":"train_603","question":"What award did Gyorgy Ligeta receive on 2000-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q154331 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["Gyorgy Ligeta was what award in 2000?"],"info":{}}
{"id":"train_604","question":"What are the municipality of the Netherlands  which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2039348 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the region of the Netherlands which begin with the letter s"],"info":{}}
{"id":"train_607","question":"What is { safety classification and labeling } of { magnesium sulfate anhydrous } that is { NFPA Fire } is { 0 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q288266 p:P4952 ?s . ?s ps:P4952 ?obj . ?s pq:P994 ?x filter ( contains ( ?x , '0' ) ) }","paraphrases":["what safety classification and labeling of magnesium sulfate anhydrous exists?"],"info":{}}
