{"id":"train_5617","question":"What was the population of Melilla in 2016-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5831 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["How many people lived in Melilla as of 1/1/2016?"],"info":{}}
{"id":"train_5620","question":"What is the royal house of the manager of the Order of Saint John Bailiwick of Brandenburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4498889 wdt:P1037 ?X . ?X wdt:P53 ?answer }","paraphrases":["The Order of Saint John Bailiwick of Brandenburg royal house manager is?"],"info":{}}
{"id":"train_5621","question":"Did {Telangana} {contain administrative territorial entity} {Nalgonda District} and {Yadadri Bhuvanagiri district}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q677037 wdt:P150 wd:Q15384 . wd:Q677037 wdt:P150 wd:Q28169764 }","paraphrases":["Are Nalgonda and Yadadr Bhuvanagiri located in the Telangana Territory?"],"info":{}}
{"id":"train_5622","question":"Who is Henry the Lion's first cousin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q105378 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q41805519 }","paraphrases":["Who is the first cousin of Henry the Lion?"],"info":{}}
{"id":"train_5624","question":"What area in Sevastopol is disputed territory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7525 wdt:P706 ?obj . ?obj wdt:P31 wd:Q15239622 }","paraphrases":["What is the disputed territory in Sevastopol?"],"info":{}}
{"id":"train_5628","question":"Does Daft Punk perform in the genres of New Wave and Nu-Disco?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q185828 wdt:P136 wd:Q187760 . wd:Q185828 wdt:P136 wd:Q4045538 }","paraphrases":["Is Daft Punk included in the New Wave and Nu-Disco genre?"],"info":{}}
{"id":"train_5630","question":"What are the symptoms and medical tests needed to treat lung cancer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q47912 wdt:P780 ?ans_1 . wd:Q47912 wdt:P923 ?ans_2 }","paraphrases":["Let me know around course of action of Chrysler Building and takes after?"],"info":{}}
{"id":"train_5631","question":"Tell me the intelligence agency which has as parent organization the Foreign and Commonwealth Office and contains the word intelligence in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47913 . ?sbj wdt:P749 wd:Q358834 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'intelligence' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the brain business enterprise which has as mum or dad enterprise the Foreign and Commonwealth Office and carries the word Genius in it is name?"],"info":{}}
{"id":"train_5632","question":"Who is born at Tilda Swinton, which has a partner town of Baku?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q200534 wdt:P19 ?answer . ?answer wdt:P190 wd:Q9248 }","paraphrases":["Who is born at Tilda Swinton, which has a accomplice town of Baku?"],"info":{}}
{"id":"train_5633","question":"What commodity did the creators of the Logitech 3D mouse at Musée Bolo use?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q30177125 wdt:P170 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What product did the makers of the Logitech 3D mouse at Musée Bolo utilize?"],"info":{}}
{"id":"train_5635","question":"Biotin is used against which disease ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2176 wd:Q181354 . ?sbj wdt:P31 wd:Q12136 }","paraphrases":["Biotin is utilized against which infection ?"],"info":{}}
{"id":"train_5636","question":"Isiah Thomas plays for which country and plays which position?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q298512 wdt:P1532 ?ans_1 . wd:Q298512 wdt:P413 ?ans_2 }","paraphrases":["Isiah Thomas plays and plays which position for which country?"],"info":{}}
{"id":"train_5639","question":"What is the religious affiliation of Jin, who has a Universal Decimal Classification of 221.3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q912043 wdt:P140 ?answer . ?answer wdt:P1190 ?x FILTER ( contains ( ?x , '221.3' ) ) }","paraphrases":["What is the devout alliance of Jin, who includes a All inclusive Decimal Classification of 221.3?"],"info":{}}
{"id":"train_5640","question":"Is the total fertility rate of the Belize greater than 2.0632?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q242 wdt:P4841 ?obj filter ( ?obj > 2.0632 ) }","paraphrases":["Does Belize have a fertility rate higher than 2.0632?"],"info":{}}
{"id":"train_5642","question":"Which are the studies and the drugs used for treatment of Diabetes mellitus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q12206 wdt:P2579 ?ans_1 . wd:Q12206 wdt:P2176 ?ans_2 }","paraphrases":["What studies and drugs have been used to treat Diabetes mellitus?"],"info":{}}
{"id":"train_5644","question":"Who owned the Houston Chronicle on the 1st January 1937?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q595564 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1937' ) ) }","paraphrases":["On 1st January 1937, who owner the Houston Chronicle?"],"info":{}}
{"id":"train_5645","question":"WHat is the project involving nuclear weapons that contains the word \"manhattan\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q170584 . ?sbj wdt:P3712 wd:Q12802 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'manhattan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat is the venture involving nuclear weapons that incorporates the word \"manhattan\" in its identify ?"],"info":{}}
{"id":"train_5647","question":"Which is Star Wars Databank ID for Princess Leia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q51797 wdt:P3798 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5648","question":"What are the music genre which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188451 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the music class which begin with the letter s"],"info":{}}
{"id":"train_5649","question":"Name the constituent behind the Dewey Decimal Classification","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q48460 wdt:P126 ?obj . ?obj wdt:P31 wd:Q4539 }","paraphrases":["Name the Dewey Decimal Classification constituent"],"info":{}}
{"id":"train_5651","question":"Which award did Jacinto Benavente receive in the year 1922?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q83184 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1922' ) ) }","paraphrases":["In 1922 Jacinto Benavente won which award?"],"info":{}}
{"id":"train_5653","question":"Tell me about academic degree of Ludwig Wittgenstein and educated at?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q9391 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P69 ?value1 . }","paraphrases":["What can you tell me on where Ludwig Wittgenstein received his education and his academic degree?"],"info":{}}
{"id":"train_5654","question":"What is the creation date of the Daimler AG subsidiary company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27530 wdt:P355 ?X . ?X wdt:P571 ?answer }","paraphrases":["What is the creation date of the Daimler AG backup company?"],"info":{}}
{"id":"train_5655","question":"What is the native label of Izhevsk since 1984-12-27?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5426 p:P1705 ?s . ?s ps:P1705 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["SInce 1984-12-27 the native label of Izhevsk is?"],"info":{}}
{"id":"train_5657","question":"What position was Itamar Franco elected to in 1982?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q485946 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 wd:Q4958850 }","paraphrases":["In 1982 Itamar Franco was elected to what position?"],"info":{}}
{"id":"train_5658","question":"did mariah_carey belong to ethnic group of cubans","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41076 wdt:P172 wd:Q1195125 }","paraphrases":["Is Mariah Carey Cuban?"],"info":{}}
{"id":"train_5659","question":"Which is the elCinema film ID for The Godfather Part II?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q184768 wdt:P3135 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5661","question":"Which is the foods traditionally associated for Meleagris gallopavo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P868 wd:Q26844 }","paraphrases":[],"info":{}}
{"id":"train_5662","question":"What is Eason Chan youngster?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P40 wd:Q704041 }","paraphrases":[],"info":{}}
{"id":"train_5663","question":"When is John Betjeman most fertile?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q962308 wdt:P27 ?X . ?X wdt:P4841 ?answer }","paraphrases":["When is John Betjeman most fertile?"],"info":{}}
{"id":"train_5666","question":"What is \"Minecraft – Pocket Edition\"'s field of exercise ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6016926 wdt:P178 ?X . ?X wdt:P452 ?answer }","paraphrases":["What is \"Minecraft – Take Edition\"'s field of work out ?"],"info":{}}
{"id":"train_5667","question":"Which is the Fotografen.nl ID of Harold Eugene Edgerton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q475733 wdt:P3269 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5668","question":"What award did Gwen Stefani win with Eve?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q483379 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q239464 }","paraphrases":["Gwen Stefani won an award with Eve, what was it for?"],"info":{}}
{"id":"train_5673","question":"Who was Arthur Seyss-Inquart`s defender in the Nuremberg trials?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q80130 p:P1591 ?s . ?s ps:P1591 wd:Q650219 . ?s pq:P1593 ?value }","paraphrases":["Give me the name of the Arthur Seyss-Inquart`s defender in the Nuremberg trials?"],"info":{}}
{"id":"train_5674","question":"Who finished serving as the manager/director of the Organization for Security and Co-operation in Europe in the year 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q81299 p:P1037 ?s . ?s ps:P1037 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["The manager/director of Security and Co-operation in Europe was who for 2011?"],"info":{}}
{"id":"train_5677","question":"What are the ssociation football stadium which start with the letter U","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1154710 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the ssociation football stadium which begin with the letter U"],"info":{}}
{"id":"train_5680","question":"Where did Mashhur bin Abdulaziz Al Saud's father die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4549135 wdt:P22 ?X . ?X wdt:P20 ?answer }","paraphrases":["Where did Mashhur canister Abdulaziz Al Saud's father die?"],"info":{}}
{"id":"train_5682","question":"What is position held by Charles VIII of France who replaces Louis XI of France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q134452 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q8058 }","paraphrases":["What positin did Louis XI of France hold that Charles VIII of France took over?"],"info":{}}
{"id":"train_5683","question":"How was Vermont's population of 359,231 tabulated ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16551 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '359231.0' ) ) . ?s pq:P459 ?value }","paraphrases":["Explain how Vermont's population of 359,231 was determined."],"info":{}}
{"id":"train_5684","question":"Which populat TV series features Christine Prayon","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5398426 . ?ent wdt:P2896 ?obj . ?ent wdt:P161 wd:Q1083743 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Christine Prayon features in what popular TV Series?"],"info":{}}
{"id":"train_5685","question":"who sister town of born in of Huban Öztoprak ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16588877 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["who sister town of born in of Huban Öztoprak ?"],"info":{}}
{"id":"train_5686","question":"Of the iPad Minis, which table has the least memory capacity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q155972 . ?ent wdt:P2928 ?obj . ?ent wdt:P179 wd:Q145761 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Out of all the iPad Minis, which tablet has the lowest memory capacity?"],"info":{}}
{"id":"train_5687","question":"What is the most natural abundance of the isotope of cadmium that decays to palladium -106?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1321542 . ?ent wdt:P2374 ?obj . ?ent wdt:P816 wd:Q2541204 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the most herbal abundance of the isotope of cadmium that decays to palladium -106?"],"info":{}}
{"id":"train_5688","question":"To whom did Ingmar Bergman got married and when did it ended?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q43247 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who did Ingmar Bergman marry and when did they divorce?"],"info":{}}
{"id":"train_5690","question":"who is author of afterword of Nineteen Eighty-Four ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q208460 wdt:P2680 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5691","question":"Who was Ip Man's student?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q163830 wdt:P802 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was the student of Ip Man?"],"info":{}}
{"id":"train_5693","question":"Which is the video game of the series of Call of Duty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P179 wd:Q192156 . ?sbj wdt:P31 wd:Q7889 }","paraphrases":["Which is the video diversion of the arrangement of Call of Duty?"],"info":{}}
{"id":"train_5694","question":"what are the military rank which starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56019 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What military rank starts with the letter 's'?"],"info":{}}
{"id":"train_5695","question":"What are the moons of Pluto","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q339 wdt:P398 ?obj . ?obj wdt:P31 wd:Q184246 }","paraphrases":["What are the moons of Pluto"],"info":{}}
{"id":"train_5696","question":"What is the word for cattle in Tamil?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q830 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q5885 }","paraphrases":["In Tamil, what is the word for cattle?"],"info":{}}
{"id":"train_5697","question":"When did lmus have a population of 301624.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q63145 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '301624.0' ) ) . ?s pq:P585 ?value }","paraphrases":["In which year did Imus have a population of 301624?"],"info":{}}
{"id":"train_5699","question":"Which extrasolar planet within the constellation Aquarius has the smallest radius?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q44559 . ?ent wdt:P2120 ?obj . ?ent wdt:P59 wd:Q10576 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the name of the extrasolar planet with the smallest radius inside the Aquarius constellation?"],"info":{}}
{"id":"train_5700","question":"What are the aspect of histor which start with the letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17524420 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the viewpoint of histor which begin with the letter r"],"info":{}}
{"id":"train_5702","question":"\"Which is {uses language} of {Imre Kertész}, that has {AWLD status} is {1 safe} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q47755 wdt:P1412 ?answer . ?answer wdt:P1999 wd:Q20672086 }","paraphrases":["\"Which language of { Imre Kertész } is { 1 safe }, which has { AWLD status }?\""],"info":{}}
{"id":"train_5703","question":"How was it determined that Badalona has a population of 217210?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q15468 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '217210.0' ) ) . ?s pq:P459 ?value }","paraphrases":["Which was the way that it was determined that Badalona has a population of 217210?"],"info":{}}
{"id":"train_5705","question":"Is the member count of the Club of Rome 80.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q107569 wdt:P2124 ?obj filter ( ?obj = 80.0 ) }","paraphrases":["Are there 80 members belonging to the Club of Rome?"],"info":{}}
{"id":"train_5707","question":"Name the mesopotamian deity in Hittites culture.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2596 wd:Q5406 . ?sbj wdt:P31 wd:Q61961377 }","paraphrases":[],"info":{}}
{"id":"train_5710","question":"What is in the category of dessert?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2308 wd:Q182940 }","paraphrases":[],"info":{}}
{"id":"train_5712","question":"Is the fee of the Ueno Zoo greater than 240.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q162722 wdt:P2555 ?obj filter ( ?obj > 240.0 ) }","paraphrases":["Is 240.0 the fee of the Ueno Zoo?"],"info":{}}
{"id":"train_5713","question":"Which is {birthplace} {state} of {Victor Emmanuel I of Sardinia} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q175250 wdt:P19 ?X . ?X wdt:P17 ?answer }","paraphrases":["Which state was Victor Emmanuel I of Sardinia born?"],"info":{}}
{"id":"train_5714","question":"WHAT ARE COMIC GENRE WHICH START WITH THE LETTER N","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20087698 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE Comedian Class WHICH Begin WITH THE LETTER N"],"info":{}}
{"id":"train_5715","question":"What is the career of the creators of The Sims?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4897444 wdt:P170 ?X . ?X wdt:P106 ?answer }","paraphrases":["What is the career of the makers of The Sims?"],"info":{}}
{"id":"train_5716","question":"When was the population of Special Region of Yogyakarta 3,542,078?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3741 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '3542078' ) ) . ?s pq:P585 ?value }","paraphrases":["The Special Region of Yogyakarta had a population of 3,542,078 during what years?"],"info":{}}
{"id":"train_5717","question":"How many first aid measures are there for mercury poisoning?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q408089 wdt:P2239 ?obj }","paraphrases":["What is the total number of first aid measures that are available for mercury poisoning?"],"info":{}}
{"id":"train_5718","question":"Tell me railroad line whose name has the word schluff in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q728937 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'schluff' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me railroad line whose name has the word schluff in it."],"info":{}}
{"id":"train_5719","question":"Who is the fictional person that is present in the work of Macbeth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q130283 . ?sbj wdt:P31 wd:Q15632617 }","paraphrases":["Which fictional character is in Macbeth?"],"info":{}}
{"id":"train_5720","question":"Who is the person of the family of House of Medici?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P53 wd:Q170022 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Name the person of the family of House of Medici."],"info":{}}
{"id":"train_5722","question":"How many anthems are by God Save the Queen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P85 wd:Q40807 }","paraphrases":["What is the number of anthem that are by God Save the Queen?"],"info":{}}
{"id":"train_5723","question":"In which sovereign state did the Indian Independence Movement happen in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P793 wd:Q12444025 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_5725","question":"Which is National Gallery of Canada artist ID for Camille Pissarro?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q134741 wdt:P5368 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5727","question":"What country is Abuja the capitol of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q682691 wdt:P131 ?answer . ?answer wdt:P36 wd:Q3787 }","paraphrases":["What nation is Abuja the capitol of?"],"info":{}}
{"id":"train_5728","question":"Iggy Pop is a member of what band?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q182665 wdt:P463 ?obj . ?obj wdt:P31 wd:Q215380 }","paraphrases":["Iggy Pop may be a part of what band?"],"info":{}}
{"id":"train_5729","question":"How is Johanna Hiedler related to Adolf Hitler?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q352 p:P1038 ?s . ?s ps:P1038 wd:Q6216378 . ?s pq:P1039 ?value }","paraphrases":["What is the relationship between Adolf Hitler and Johanna Hiedler?"],"info":{}}
{"id":"train_5730","question":"What award did Nicolai Kryuchkov win on December 23, 1980?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1196388 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["Nicolari Kryuchkov which award win on December 23, 1980"],"info":{}}
{"id":"train_5731","question":"Tell me about position held of Vladimir Putin and manager/director?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q7747 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1037 ?value1 . }","paraphrases":["Tell me about position held of Vladimir Putin and manager/director?"],"info":{}}
{"id":"train_5732","question":"How many terrorists are in the terrorist group Hezbollah?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q41053 wdt:P3461 ?obj }","paraphrases":["Herbollah terrorist group contains how many terrorists?"],"info":{}}
{"id":"train_5733","question":"which is the {determination method} for {Montana} where {population} as {559456.0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1212 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '559456.0' ) ) . ?s pq:P459 ?value }","paraphrases":["which is the {assurance strategy} for {Montana} where {populace} as {559456.0} ?"],"info":{}}
