{"id":"train_10019","question":"What is the oxide relation to MIN(heat capacity) whose permanent duplicated item is ERROR1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q50690 . ?ent wdt:P2056 ?obj . ?ent wdt:P2959 wd:Q52634190 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the oxide relation to MIN(heat capacity) whose permanent duplicated item is ERROR1?\nhow is the oxide relation to MIN(heat capacity) whose permanent duplicated item is ERROR1?"],"info":{}}
{"id":"train_10020","question":"What county seat of Lilongwe is divided into the Lilongwe District?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3876 wdt:P1376 ?answer . ?answer wdt:P150 wd:Q1058453 }","paraphrases":["Which county seat is divided into the district of Lilongwe?"],"info":{}}
{"id":"train_10023","question":"Who is the  {legal case} for {defendant} of {Bill Cosby}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1591 wd:Q213512 . ?sbj wdt:P31 wd:Q2334719 }","paraphrases":["Who is the defendant for Bill Cosby's legal case?"],"info":{}}
{"id":"train_10025","question":"What was Yuri Lotman a member of starting 1977?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q360084 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1977' ) ) }","paraphrases":["Yuri Lotman joined what in 1977?"],"info":{}}
{"id":"train_10026","question":"What is the Wii Remote input method extension for Wii?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8079 wdt:P479 ?obj . ?obj wdt:P31 wd:Q44753009 }","paraphrases":["The input method extension for the Wii is what on the wii remote?"],"info":{}}
{"id":"train_10027","question":"Which is the sovereign state for the history topic of Australia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2184 wd:Q174825 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_10028","question":"For what did Marilyn Monroe win the Henrietta Award, and when did it happen?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q4616 p:P166 ?s . ?s ps:P166 wd:Q1534911 . ?s pq:P1346 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["For what did Marilyn Monroe win the Henrietta Award, and when did it happen?"],"info":{}}
{"id":"train_10029","question":"When was François Truffaut nominated for National Society of Film Critics Award for Best Screenplay?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q53002 p:P1411 ?s . ?s ps:P1411 wd:Q6978541 . ?s pq:P585 ?value }","paraphrases":["What year was Francois Truffaut's screenplay nominated by the National Society of Film Critics Award for Best Screenplay?"],"info":{}}
{"id":"train_10032","question":"Tell me non-metropolitan county whose name has the word worcestershire in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q769603 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'worcestershire' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me non-metropolitan county whose name has the phrase worcestershire in it."],"info":{}}
{"id":"train_10033","question":"When did Kevin Durant receive the All-NBA Team award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q29545 p:P166 ?s . ?s ps:P166 wd:Q674359 . ?s pq:P585 ?value }","paraphrases":["When was Kevin Durant awarded the All-NBA Team award?"],"info":{}}
{"id":"train_10036","question":"What is Rama and who follows it?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q160213 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What is Rama and who takes after it?"],"info":{}}
{"id":"train_10037","question":"Is the parity of the arsenic-84 equal to -1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q18844788 wdt:P1123 ?obj filter ( ?obj = -1 ) }","paraphrases":["Is the equality of the arsenic-84 rise to to -1?"],"info":{}}
{"id":"train_10038","question":"What are the first aid measures for mercury poisoning?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q408089 wdt:P2239 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10039","question":"Who was Max Planck's assistant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P184 wd:Q9021 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was Max Planck's assistant?"],"info":{}}
{"id":"train_10043","question":"Where are Attila's place of birth and place of death?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q36724 wdt:P19 ?ans_1 . wd:Q36724 wdt:P20 ?ans_2 }","paraphrases":["Where is the birthplace and place of death of Attila?"],"info":{}}
{"id":"train_10045","question":"What is the median lethal dose of aspirin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q18216 p:P2240 ?s . ?s ps:P2240 ?x filter ( contains ( ?x , '495.0' ) ) . ?s pq:P636 ?value }","paraphrases":["What is aspirin's median lethal dose?"],"info":{}}
{"id":"train_10046","question":"What is pronunciation of the word fish in American English?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q152 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q7976 }","paraphrases":["How do you pronounce the word fish in American English?"],"info":{}}
{"id":"train_10047","question":"What is the human with the highest Elo rating whose sport is chess?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1087 ?obj . ?ent wdt:P641 wd:Q718 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What human has the highest Elo rating in chess?"],"info":{}}
{"id":"train_10049","question":"What is the coordinates of southern basin countries of the Columbia River?Wh","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2251 wdt:P205 ?X . ?X wdt:P1333 ?answer }","paraphrases":["What are the co - ordinates of the Columbia River southern basin countries? Wh"],"info":{}}
{"id":"train_10050","question":"What is the name of a government agency that starts with the letter y.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q327333 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the name of a government organization that starts with the letter y."],"info":{}}
{"id":"train_10052","question":"Who is the candidate present with Tatiana Tarasova?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2491439 wdt:P1344 ?X . ?X wdt:P710 ?answer }","paraphrases":["Give me the name of the present candidate with Tatiana Tarasova."],"info":{}}
{"id":"train_10053","question":"Who is employed by Arthur E. Bryson at the CCIHE?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4798535 wdt:P108 ?X . ?X wdt:P2643 ?answer }","paraphrases":["Who is utilized by Arthur E. Bryson at the CCIHE?"],"info":{}}
{"id":"train_10054","question":"Does gonorrhea affect more than 654175.2 people?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q101896 wdt:P2854 ?obj filter ( ?obj > 654175.2 ) }","paraphrases":["Are more than 654175.2 more people affected by gonorrhea?"],"info":{}}
{"id":"train_10055","question":"What represents the famous Brose Partington?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4975395 wdt:P800 ?X . ?X wdt:P180 ?answer }","paraphrases":["What is the famous Brose Partington represented by?"],"info":{}}
{"id":"train_10056","question":"What is the Barbarian R.C. ID for Serge Blanco?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1322456 wdt:P4494 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10057","question":"What big band type of film was inaugurated on 1900-0-0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207378 wdt:P136 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1900' ) ) }","paraphrases":["What is the name of the big band film from the 1900's?"],"info":{}}
{"id":"train_10058","question":"Name an alcohol that contains the word \"ether\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q156 . ?sbj wdt:P4952 wd:Q2005334 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ether' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a liquor that contains \"ether\" in its name"],"info":{}}
{"id":"train_10059","question":"Tell me the historic county of England of the capital of Norwich and that contains the word norfolk in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1138494 . ?sbj wdt:P36 wd:Q130191 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'norfolk' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me Norwich's capital's historic county of England and that contains the word norfolk in its name?"],"info":{}}
{"id":"train_10060","question":"What's part of the I Second That Emotion series dubbed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1992298 wdt:P179 ?X . ?X wdt:P725 ?answer }","paraphrases":["Which part of the 'I Second That Emotion' series is dubbed?"],"info":{}}
{"id":"train_10061","question":"What kingdom starts with the letter \"z\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q417175 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What kingdom does the letter \"z\" begin with."],"info":{}}
{"id":"train_10065","question":"Mention the name of the person and the time period in which the award of Thelonious Monk was handed over to in terms of Grammy Lifetime Achievement Award","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q109612 p:P166 ?s . ?s ps:P166 wd:Q935843 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["Specify the title of the individual and the time period in which the grant of Thelonious Minister was given over to in terms of Grammy Lifetime Accomplishment Grant"],"info":{}}
{"id":"train_10066","question":"What team is Dino Zoff a member of and how many matches has he played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q180661 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["In what team Dino Zoff played and how many matches?"],"info":{}}
{"id":"train_10068","question":"What is the penis sexually homologous with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4545 wd:Q58 }","paraphrases":[],"info":{}}
{"id":"train_10070","question":"What are the seven deadly sins  which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q166502 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which seven deadly sin starts with \"s\"?"],"info":{}}
{"id":"train_10071","question":"How many programming languages are made by Perl?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P277 wd:Q42478 }","paraphrases":["Perl makes what number of programming languages?"],"info":{}}
{"id":"train_10072","question":"Palm Sunday is the feast day for which biblical episode?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P841 wd:Q42236 . ?sbj wdt:P31 wd:Q22704077 }","paraphrases":["Palm Sunday is the biblical episode's festival day?"],"info":{}}
{"id":"train_10073","question":"What are the educational stage which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18189 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'k' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the educational stage that begins with the letter s"],"info":{}}
{"id":"train_10074","question":"Name a film David Spade voice acted in.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P725 wd:Q298658 . ?sbj wdt:P31 wd:Q202866 }","paraphrases":[],"info":{}}
{"id":"train_10075","question":"Is it true that the male population of the Top Springs equal to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q18026 wdt:P1540 ?obj filter ( ?obj = 0 ) }","paraphrases":["What is the male population of Top Springs?"],"info":{}}
{"id":"train_10076","question":"Tell me  a private university whose name consist of the word university and whose scholarly publishing and academic resources coalition","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902104 . ?sbj wdt:P463 wd:Q647039 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'university' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a private university whose name is university and a coalition of academic and academic resources"],"info":{}}
{"id":"train_10077","question":"What is the birth place of John Perry Barlow?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q534428 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P1480 wd:Q21818619 }","paraphrases":["John Perry Barlow's birth place?"],"info":{}}
{"id":"train_10079","question":"What was the dialect used in the original \"The Last Blood\".","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14476441 wdt:P364 ?X . ?X wdt:P4913 ?answer }","paraphrases":["What dialect used in the original \"The Last Blood\"?"],"info":{}}
{"id":"train_10080","question":"What is the opening day of the school attended by Louis Brassin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1367651 wdt:P69 ?X . ?X wdt:P3025 ?answer }","paraphrases":["What is the opening day of the school gone to by Louis Brassin?"],"info":{}}
{"id":"train_10082","question":"What are the Bantu languages which start with the letter zulu","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33146 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zulu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Bantu languages which start with the letter zulu"],"info":{}}
{"id":"train_10083","question":"What Class IB flammable liquid has the highest ceiling exposure limit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009055 . ?ent wdt:P2405 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Class IB liquid has the highest exposure limit?"],"info":{}}
{"id":"train_10084","question":"What is the first name of Channing Tatum that is the same as Matthias?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q212064 wdt:P735 ?answer . ?answer wdt:P460 wd:Q4927273 }","paraphrases":["What is the first name of Channing Tatum that is the same as Matthias?"],"info":{}}
{"id":"train_10085","question":"VAT rate of 27%,","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q123480 . ?ent wdt:P2855 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["The VAT rate is 27%."],"info":{}}
{"id":"train_10088","question":"What was the residence of Oliver Heaviside born at 1889-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q154345 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1889' ) ) }","paraphrases":["What was the habitation of Oliver Heaviside conceived at 1889-0-0?"],"info":{}}
{"id":"train_10089","question":"What is the terminus of the Menai Bridge","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P559 wd:Q2655856 }","paraphrases":[],"info":{}}
{"id":"train_10091","question":"Who is the person that is depicted as Mona Lisa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12418 wdt:P180 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the individual that's portrayed as Mona Lisa?"],"info":{}}
{"id":"train_10092","question":"What are the season which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24384 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What seasons start with \"w\"?"],"info":{}}
{"id":"train_10093","question":"Tell me the citation of Childhood obesity: are we all speaking the same language?.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34729820 wdt:P2860 ?X . ?X wdt:P1433 ?answer }","paraphrases":["What is the citation of Childhood Obesity: Are We All Speaking the Same Language?"],"info":{}}
{"id":"train_10094","question":"What are the { replacements } for { Mohammad Mosaddegh } as { Prime Minister of Iran }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q123037 p:P39 ?s . ?s ps:P39 wd:Q13561063 . ?s pq:P1365 ?value }","paraphrases":["As { Mohammad Mosaddegh },{ Prime Minister of Iran }, what are the { replacements }?"],"info":{}}
{"id":"train_10095","question":"What is the prefecture of Japan that contains administrative territorial entity of Osaka","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P150 wd:Q35765 . ?sbj wdt:P31 wd:Q50337 }","paraphrases":["What is the prefecture of Japan that contains authoritative regional substance of Osaka"],"info":{}}
{"id":"train_10098","question":"What's the most common type of paper?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11472 p:P186 ?s . ?s ps:P186 ?obj . ?s pq:P5102 wd:Q28962312 }","paraphrases":["Which type of paper is the most prevalent?"],"info":{}}
{"id":"train_10099","question":"Where can beryllium be found, that has diplomatic relation in Romania?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q569 wdt:P189 ?answer . ?answer wdt:P530 wd:Q218 }","paraphrases":["Where can beryllium be found, that has political connection in Romania?"],"info":{}}
{"id":"train_10101","question":"How long it the Jurassic Park game take to complete?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2368168 wdt:P437 ?X . ?X wdt:P400 ?answer }","paraphrases":["How long does the game Jurassic Park take to finish?"],"info":{}}
{"id":"train_10103","question":"What is the BOA athlete ID for Alistair Brownlee","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q716308 wdt:P4490 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10104","question":"Which is the parent astronomical body for Beta Pictoris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P397 wd:Q582547 }","paraphrases":[],"info":{}}
{"id":"train_10106","question":"WHICH IS THE SUBSIDIARY COMPANY OF SHAREHOLDER IN THE ECONOMIST INTELLIGENCE UNIT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1063288 wdt:P127 ?X . ?X wdt:P355 ?answer }","paraphrases":["WHICH IS THE SUBSIDIARY COMPANY OF SHAREHOLDER IN THE ECONOMIST INTELLIGENCE UNIT"],"info":{}}
{"id":"train_10107","question":"What are the abnormally low values that start with letter U","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q54928607 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the abnormally low values that begin with letter U"],"info":{}}
{"id":"train_10108","question":"Which is the LRB contributor ID for Chimamanda Ngozi Adichie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q230141 wdt:P5502 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10110","question":"What is the legal state with the lowest VAT-rate whose head of state is {Horst Köhler} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4209223 . ?ent wdt:P2855 ?obj . ?ent wdt:P35 wd:Q2542 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Tell me the legal state with the lowest VAT-rate whose head of state is Horst Kohler."],"info":{}}
{"id":"train_10111","question":"Who gave the{academic discipline} of {mentor} of {Hermann Lotze} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57684 wdt:P1066 ?X . ?X wdt:P101 ?answer }","paraphrases":["Who gave { Hermann Lotze }'s { academic discipline }?"],"info":{}}
{"id":"train_10113","question":"What does electromagnetic waveguide physically interact with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q354724 wdt:P129 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10115","question":"Is the fiscal/tax revenue of Del Carmen greater than 55486688.456?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28735 wdt:P3087 ?obj filter ( ?obj > 55486688.456 ) }","paraphrases":["Does Del Carmen's fiscal / tax revenue exceed 55486688.456?"],"info":{}}
{"id":"train_10116","question":"On what date did Almohad begin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q199688 p:P571 ?s . ?s ps:P571 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["What was the date that Almohad began?"],"info":{}}
{"id":"train_10118","question":"Was Cristiano Ronaldo participant of División de Honor Juvenil de Fútbol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q11571 wdt:P1344 wd:Q2023337 }","paraphrases":["Was Cristiano Ronaldo in Division de Honor Juvenil de Futbol?"],"info":{}}
{"id":"train_10119","question":"Who gave the   {human population} of {continent} of {ghetto in Nazi-occupied Europe} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2583015 wdt:P30 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Which person gave the human population of continent for ghetto in Nazi-occupied Europe?"],"info":{}}
{"id":"train_10120","question":"What song is Andrew Lloyd Webber the composer of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P86 wd:Q180975 . ?sbj wdt:P31 wd:Q7366 }","paraphrases":["Andrew Lloyd Webber composed what song?"],"info":{}}
{"id":"train_10124","question":"Which is the possible medical findings of hypertension?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41861 wdt:P5131 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10125","question":"What is the anatomically connects with the esophagus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2789 wd:Q173710 . ?sbj wdt:P31 wd:Q4936952 }","paraphrases":["What is the anatomically interfaces with the esophagus"],"info":{}}
{"id":"train_10126","question":"Who is {is in the village of} of {borders} of {Terni} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8621 wdt:P47 ?X . ?X wdt:P131 ?answer }","paraphrases":["Who is {is within the town of} of {borders} of {Terni} ?"],"info":{}}
{"id":"train_10128","question":"What is said to be the same as ethnic cleaning has to be distinguished from massacre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q154278 wdt:P460 ?answer . ?answer wdt:P1889 wd:Q3199915 }","paraphrases":["What is said to be the equal as ethnic cleansing has to be distinguished from massacre?"],"info":{}}
{"id":"train_10129","question":"What is the featured work of loyalty by Cu Chulainn?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q211955 wdt:P945 ?X . ?X wdt:P1441 ?answer }","paraphrases":["what work features loyalty by Cu Chulainn?"],"info":{}}
{"id":"train_10131","question":"When did Annibale Carracci start teaching Antonio Marziale Carracci?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7824 p:P802 ?s . ?s ps:P802 wd:Q2624075 . ?s pq:P580 ?value }","paraphrases":["When did Antonio Marziale Carracci become Annibale Carracci's student."],"info":{}}
