{"id":"train_724","question":"Where Ruth Bernhard stoped working on 1953?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2177580 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1953' ) ) }","paraphrases":["What did Ruth Bernhard stop working on in 1953?"],"info":{}}
{"id":"train_726","question":"Who is the PhD candidate for Niels Bohr?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P185 wd:Q7085 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the PhD candidate for Niels Bohr?"],"info":{}}
{"id":"train_728","question":"Which is {position of head of government} of {service operator} {MiG-21} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q150609 wdt:P137 ?X . ?X wdt:P1313 ?answer }","paraphrases":["{Service Operator} {MiG-21} is what {position of head of government}?"],"info":{}}
{"id":"train_730","question":"What position did Ramsay MacDonald hold in the 37th Parliament of the United Kingdom and what was his cause?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q166646 p:P39 ?s . ?s ps:P39 wd:Q41582593 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["What job did Ramsay McDonald have in the parliament of the UK?"],"info":{}}
{"id":"train_732","question":"When did Lorin Maazel received the Grammy Award for Best Opera Recording?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q117710 p:P166 ?s . ?s ps:P166 wd:Q5593843 . ?s pq:P585 ?value }","paraphrases":["when did lorin Maazel receive a grammy award?"],"info":{}}
{"id":"train_733","question":"Where was Grace Hopper educated at in 1930?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11641 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1930' ) ) }","paraphrases":["What school did Grace Hopper attend in 1930?"],"info":{}}
{"id":"train_736","question":"What are Lee Friedlander's national diplomatic relations?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q711391 wdt:P27 ?X . ?X wdt:P530 ?answer }","paraphrases":["What are Lee Friedlander's national discretionary relations?"],"info":{}}
{"id":"train_738","question":"\"Who was the sister of Henry V, the Holy Roman Emperor during his death in the year of 1101-7-27\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q151707 wdt:P3373 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( YEAR ( ?x ) , '1101' ) ) }","paraphrases":["\"Who was the sister of Henry V, the Heavenly Roman Head amid his passing within the year of 1101-7-27\"?"],"info":{}}
{"id":"train_740","question":"Who was nominated for the Academy Award for Best Original Dramatic or Comedy Score for the film Casablanca?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132689 p:P1411 ?s . ?s ps:P1411 wd:Q22752868 . ?s pq:P2453 ?value }","paraphrases":["When the movie Casablanca was nominated for the Academy Award for Best Original Dramatic or Comedy Score, who was the nominee?"],"info":{}}
{"id":"train_742","question":"What are the coachwork type which start with the letter van","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15729598 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'van' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the coachwork sort which begin with the letter van"],"info":{}}
{"id":"train_744","question":"How many matches has Rinus Michels played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q2154479 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["How many matches has Rinus Michels played?"],"info":{}}
{"id":"train_746","question":"Which Class II combustible liquid has the highest median lethal concentration?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009057 . ?ent wdt:P2712 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What Class II flammable liquid has the greatest median dangerous concentration?"],"info":{}}
{"id":"train_747","question":"What are the weekly newspaper  which start with the letter e","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2305295 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'é' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the weekly newspapers whose first alphabet is e."],"info":{}}
{"id":"train_748","question":"Tell me the airline that starts with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q46970 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the carrier that begins with the letter p"],"info":{}}
{"id":"train_749","question":"What is JewAge person ID for Ludwig von Mises ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q84233 wdt:P4116 ?answer }","paraphrases":[],"info":{}}
{"id":"train_750","question":"Who is the owner of Hon Hai Precision Industry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q463094 wdt:P1830 ?answer }","paraphrases":[],"info":{}}
{"id":"train_751","question":"What Japanese TV series has the most number of seasons and was originally aired in Japanese?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21191019 . ?ent wdt:P2437 ?obj . ?ent wdt:P364 wd:Q5287 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Of all Japanese TV series originally aired in Japanese, which has the most seasons?"],"info":{}}
{"id":"train_752","question":"Tell me  security agency whose name has the word state in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3238445 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'state' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know security office whose title has the word state in it."],"info":{}}
{"id":"train_753","question":"Tolyatti has what OK TMO ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1341 wdt:P764 ?answer }","paraphrases":[],"info":{}}
{"id":"train_754","question":"Which son of Isaac has a son named Shuah?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q671872 wdt:P22 ?answer . ?answer wdt:P40 wd:Q369850 }","paraphrases":["Which Isaac son has a Shuah son?"],"info":{}}
{"id":"train_755","question":"When was Athens, Greece founded?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1524 p:P17 ?s . ?s ps:P17 wd:Q41 . ?s pq:P580 ?value }","paraphrases":["In what year was Athens, Greece founded?"],"info":{}}
{"id":"train_756","question":"What does it mean if you are convicted of desertion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1399 wd:Q633339 }","paraphrases":[],"info":{}}
{"id":"train_757","question":"Followers","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P155 wd:Q35497 . ?sbj wdt:P31 wd:Q839470 }","paraphrases":["Who are the followers?"],"info":{}}
{"id":"train_759","question":"What is the origin of Death Note's diplomatic relation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1834 wdt:P495 ?X . ?X wdt:P530 ?answer }","paraphrases":["What region did Death Note's diplomatic relation first take place?"],"info":{}}
{"id":"train_761","question":"Was Hirohito buried in Tokyo at the Mausoleum of the First Qin Emperor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q34479 wdt:P119 wd:Q1490 . wd:Q34479 wdt:P119 wd:Q910180 }","paraphrases":["Is the Mausoleum of the First Qin Emperor in Tokyo the burial place for Hirohito?"],"info":{}}
{"id":"train_763","question":"What is competitor War of the Triple Alliance's name in its original language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q58947 wdt:P710 ?X . ?X wdt:P1705 ?answer }","paraphrases":["What is competitor War of the Triple Alliance's title in its unique language?"],"info":{}}
{"id":"train_765","question":"What are the ring system  which start with the letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28951811 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the ring systems that begin with alphabet R."],"info":{}}
{"id":"train_766","question":"When did Saint Vincent and the Grenadines have a population of 108150?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q757 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '108150.0' ) ) . ?s pq:P585 ?value }","paraphrases":["During which Dates did Saint Vincent and the Grenadines have a population of 108150"],"info":{}}
{"id":"train_767","question":"What is the antonym of the profession's field of prosecutor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q600751 wdt:P425 ?X . ?X wdt:P461 ?answer }","paraphrases":["Name the antonym of the profession field of prosecutor."],"info":{}}
{"id":"train_768","question":"What represents the organization of the siblings of Louis Gigante?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6687246 wdt:P3373 ?X . ?X wdt:P1268 ?answer }","paraphrases":["The organization of the siblings of Louis Gigante is represented by what?"],"info":{}}
{"id":"train_769","question":"What team does Eric Cantona play for, and how many matches has he played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q170328 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["What crew does Eric Cantona play for, and how many fits has he played?"],"info":{}}
{"id":"train_770","question":"What is the date did Midway games publish the video game Pac-Man, and where was it published?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q173626 p:P123 ?s . ?s ps:P123 wd:Q149947 . ?s pq:P577 ?value1 . ?s pq:P291 ?value2 }","paraphrases":["When and on what date did Midway games publish the Pac-Man video game?"],"info":{}}
{"id":"train_772","question":"What what is separation process discoverer or inventor Zosimos of Panopolis  and which that starts with d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q898987 . ?sbj wdt:P61 wd:Q226868 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is division prepare pioneer or creator Zosimos of Panopolis and which that begins with d"],"info":{}}
{"id":"train_773","question":"Is Paul Gascoigne a member of a sports team?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q13002 wdt:P54 ?obj }","paraphrases":["What sports team is Paul Gascoigne a member of?"],"info":{}}
{"id":"train_775","question":"Name the Yukon quest with the minimum size of team at finish whose location is braeburn lodge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2301224 . ?ent wdt:P2105 ?obj . ?ent wdt:P276 wd:Q4955299 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which Yukon quest in Braeburn Lodge finished with the smallest size team?"],"info":{}}
{"id":"train_776","question":"What is the chemical compound of polyvinyl chloride?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q146368 wdt:P4600 ?obj . ?obj wdt:P31 wd:Q11173 }","paraphrases":["The chemical compound for polyvinyl chloride is what?"],"info":{}}
{"id":"train_778","question":"which magazine starts with z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41298 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which magazine begins with z"],"info":{}}
{"id":"train_781","question":"Where in the administrative territorial entity of Umbria was Monica Bellucci born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q81819 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1280 }","paraphrases":["In what area is the administrative territorial entity of Umbria, where Monica Bellucci was born?"],"info":{}}
{"id":"train_782","question":"WHAT Australia and Oceania ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q171826 wdt:P607 ?answer . ?answer wdt:P276 wd:Q55643 }","paraphrases":["WHAT Australia and Oceania ?"],"info":{}}
{"id":"train_792","question":"Tell me political party whose name has the word veritas in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7278 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'veritas' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me political party whose title has the word veritas in it."],"info":{}}
{"id":"train_793","question":"When Alec Guinness was nominated as Academy Award for Best Actor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q103894 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P585 ?value }","paraphrases":["In what year did Alex Guinness receive a Best Actor Oscar nomination?"],"info":{}}
{"id":"train_794","question":"What is the name of the administrative body for the capital of Mumbai","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1156 wdt:P190 ?obj . ?obj wdt:P31 wd:Q5119 }","paraphrases":["What is the administrative body's name for Mumbai capital?"],"info":{}}
{"id":"train_795","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1943555 wdt:P172 ?answer . ?answer wdt:P2184 wd:Q48999793 }","paraphrases":["It is what?"],"info":{}}
{"id":"train_796","question":"Who is {executive authority} of {play} {snowboard} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2000617 wdt:P641 ?X . ?X wdt:P797 ?answer }","paraphrases":["What major works are created by Ruth?"],"info":{}}
{"id":"train_797","question":"What electoral district does Member of the New Zealand House of Representatives Jacinda Ardern represent?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3606816 p:P39 ?s . ?s ps:P39 wd:Q18145518 . ?s pq:P768 ?value1 . ?s pq:P1268 ?value2 }","paraphrases":["What constituent area does Part of the Modern Zealand House of Agents Jacinda Ardern speak to?"],"info":{}}
{"id":"train_799","question":"What is the military rank of the colonel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P410 wd:Q104680 }","paraphrases":["For the colonel, what is the military rank?"],"info":{}}
{"id":"train_801","question":"What is the fictional analog of The Gingerbread Man?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q6616486 wdt:P1074 ?answer }","paraphrases":[],"info":{}}
{"id":"train_804","question":"What is graduated from Wendy Wasserstein located at street address of 160 Convent Ave, New York, NY, 10031?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q450050 wdt:P69 ?answer . ?answer wdt:P969 ?x FILTER ( contains ( ?x , '160 Convent Ave, New York, NY, 10031' ) ) }","paraphrases":["What is graduated from Wendy Wasserstein located at street tackle of a hundred and sixty Convent Ave, New York, NY, 10031?"],"info":{}}
{"id":"train_805","question":"Who are the members of BP and their chairperson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q152057 wdt:P463 ?ans_1 . wd:Q152057 wdt:P488 ?ans_2 }","paraphrases":["Who are the British Petroleum board members and who is the chair?"],"info":{}}
{"id":"train_807","question":"Who is {writer} of {bibliographic citation} of {Survey of human genes of retroviral origin: identification and transcriptome of the genes with coding capacity for complete envelope proteins} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24645644 wdt:P2860 ?X . ?X wdt:P50 ?answer }","paraphrases":["The bibliographic citation of The Survey of Human Genes of Retroviral Origin: Identification and Transcriptome of the Genes with Coding Capacity for Complete Envelope Proteins was written by whom?"],"info":{}}
{"id":"train_808","question":"Which is the {crystal system} who {discoverer or inventor} of {Titanium} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q716 wdt:P556 ?ans_1 . wd:Q716 wdt:P61 ?ans_2 }","paraphrases":["who invented titanum and what is the crystal system?"],"info":{}}
{"id":"train_809","question":"Tell me the number of points and games played by Brian Clough, member of the English national football team.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q207658 p:P54 ?s . ?s ps:P54 wd:Q47762 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["Tell me how many points and games Brian Clough, an English national football team member, has played."],"info":{}}
{"id":"train_810","question":"Where in the Soviet Union did Andrei Bely die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q212632 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q15180 }","paraphrases":["When Andrei Bely died, what was his location in the Soviet Union?"],"info":{}}
{"id":"train_814","question":"Who has surname as Mireille Mathieu and similar to Matias?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q71452 wdt:P734 ?answer . ?answer wdt:P460 wd:Q29905256 }","paraphrases":["Who has surname as Mireille Mathieu and comparable to Matias?"],"info":{}}
{"id":"train_816","question":"What does Pinocchio appear in the form of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q6502703 wdt:P4675 ?answer }","paraphrases":[],"info":{}}
{"id":"train_818","question":"When did Bono receive the TED Prize, and how much was he awarded as recipient?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q834621 p:P166 ?s . ?s ps:P166 wd:Q23014208 . ?s pq:P2121 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["When did Bono get the TED prize and how much did he get?"],"info":{}}
{"id":"train_819","question":"What is physiology comprised of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P642 wd:Q521 }","paraphrases":[],"info":{}}
{"id":"train_822","question":"Tell me recurring sporting event whose name has the word world in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18608583 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me habitual sporting event whose name has the word world in it."],"info":{}}
{"id":"train_825","question":"Who discovered the boron?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q618 wdt:P61 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who found the boron?"],"info":{}}
{"id":"train_828","question":"Which member of the Rabah Madjer sports team played 94 matches ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q431343 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter ( contains ( ?x , '94.0' ) ) }","paraphrases":["Which member of the Rabah Madjer sports team participated in 94 matches?"],"info":{}}
{"id":"train_829","question":"Tell me reference model whose name has the word model in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q356674 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'model' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know reference demonstrate whose title has the word show in it."],"info":{}}
{"id":"train_830","question":"Tell me theorem whose name has the word theorem in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q65943 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'theorem' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the theorem whose name has the word theorem in it?"],"info":{}}
{"id":"train_832","question":"Tell me the house cat that contains the word мyka in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q146 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'мyka' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the house cat that contains the word мyka in their title"],"info":{}}
{"id":"train_833","question":"TELL ME SEASON WHOSE NAME HAS THE WORD WINTER IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24384 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'winter' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know SEASON WHOSE Title HAS THE WORD WINTER IN IT."],"info":{}}
{"id":"train_834","question":"Which is the date of burial or cremation of Miloš Forman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q51525 wdt:P4602 ?answer }","paraphrases":[],"info":{}}
{"id":"train_835","question":"Which the {subject has role} and the {location of discovery} of {Iodine} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1103 wdt:P2868 ?ans_1 . wd:Q1103 wdt:P189 ?ans_2 }","paraphrases":["What does iodine do and where was it discovered?"],"info":{}}
{"id":"train_836","question":"DOES THE LITERATE POPULATION OF DHARAMPUR EQUALS 0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q60383142 wdt:P6499 ?obj filter ( ?obj = 0 ) }","paraphrases":["Are there any literate people in Dharampur?"],"info":{}}
{"id":"train_838","question":"Which is the organization that has it's headquarters located in Aachen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q1017 . ?sbj wdt:P31 wd:Q43229 }","paraphrases":["Which is the organization that has it's central command found in Aachen?"],"info":{}}
{"id":"train_839","question":"What mythical character that contains the word zau in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4271324 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zau' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What legendary character that contains the word zau in their name"],"info":{}}
{"id":"train_840","question":"Name a business division owned by Ford Motor Company","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44294 wdt:P199 ?obj . ?obj wdt:P31 wd:Q6881511 }","paraphrases":["Title a trade division claimed by Portage Engine Company"],"info":{}}
{"id":"train_842","question":"How many mothers did Eros have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q121973 wdt:P25 ?obj }","paraphrases":["Which is the number of mothers that Eros had?"],"info":{}}
{"id":"train_843","question":"What are the signs of Typhoid fever which can be treated with Dopamine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83319 wdt:P780 ?answer . ?answer wdt:P2176 wd:Q170304 }","paraphrases":["What are the symptoms of Typhoid fever which can be dealt with with Dopamine?"],"info":{}}
{"id":"train_846","question":"What is Mizoram?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3403 wd:Q1502 . ?sbj wdt:P31 wd:Q57156205 }","paraphrases":["Mizoram is what?"],"info":{}}
{"id":"train_847","question":"What branch of science starts with the letter \"v\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2465832 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What department of science begins with the letter \"v\"?"],"info":{}}
