{"id":"train_10971","question":"Name a broadsheet format newspaper that starts with letter T","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11032 . ?sbj wdt:P3912 wd:Q665319 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a broadsheet structure newspaper that starts with letter T"],"info":{}}
{"id":"train_10972","question":"\"What is the {personal name} of {Jan Swammerdam}, whose {audio language} is {Swedish} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q336794 wdt:P735 ?answer . ?answer wdt:P407 wd:Q9027 }","paraphrases":["\"What is the {individual title} of {Jan Swammerdam}, whose {sound dialect} is {Swedish} ?\""],"info":{}}
{"id":"train_10973","question":"What is the middle name of Lisa del Gioconda , that said to be different from Liesel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q153032 wdt:P735 ?answer . ?answer wdt:P460 wd:Q19689474 }","paraphrases":["What is the middle title of Lisa del Gioconda , that stated to be distinctive from Liesel?"],"info":{}}
{"id":"train_10975","question":"When was Dan Plato elected as the head of government of Cape Town?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5465 p:P6 ?s . ?s ps:P6 wd:Q379122 . ?s pq:P580 ?value }","paraphrases":["When was Dan Plato elected for his first term as person in charge of Cape Town"],"info":{}}
{"id":"train_10976","question":"Name a nonmetal discovered in England that contains the word \"oxygen\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19600 . ?sbj wdt:P189 wd:Q21 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'oxygen' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a nonmetal found in England that contains \"oxygen\" in its name"],"info":{}}
{"id":"train_10980","question":"What award did Maria Rojo receive in 1978?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q290301 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1978' ) ) }","paraphrases":["In 1978, which award did Maria Rojo win?"],"info":{}}
{"id":"train_10981","question":"What is the language of Paul V. Hindenburg, that is dative case?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2667 wdt:P1412 ?answer . ?answer wdt:P2989 wd:Q145599 }","paraphrases":["What is the dialect of Paul V. Hindenburg, that's dative case?"],"info":{}}
{"id":"train_10986","question":"Which is the original language of work for The Muppet Show?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2120540 wdt:P364 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10987","question":"Which is the television series episode which has Bruce Willis as cast member?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P161 wd:Q2680 . ?sbj wdt:P31 wd:Q21191270 }","paraphrases":["Which is the tv arrangement scene which has Bruce Willis as cast member?"],"info":{}}
{"id":"train_10989","question":"What is place served by transport hub for Fairbanks ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P931 wd:Q79638 }","paraphrases":[],"info":{}}
{"id":"train_10990","question":"Who is the graduate of the sculptor of Red & Black?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27894648 wdt:P170 ?X . ?X wdt:P69 ?answer }","paraphrases":["Name the graduate of the sculptor of Red & Black."],"info":{}}
{"id":"train_10991","question":"WHICH IS THE FILM WITH THE MAXIMUM BOX OFFICE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11424 . ?ent wdt:P2142 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which movie has the highest box office gross?"],"info":{}}
{"id":"train_10993","question":"What editions, developed by, Cascading Style Sheets, is in the World Wide Web Consortium?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q46441 wdt:P747 ?answer . ?answer wdt:P178 wd:Q37033 }","paraphrases":["What editions are in the World Wide Web Consortium, developed by Cascading Style Sheets?"],"info":{}}
{"id":"train_10994","question":"Which is the main regulatory text for Antarctic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1555938 wdt:P92 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10995","question":"Is the lower flammable limit of methanol equal to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q14982 wdt:P2202 ?obj filter ( ?obj = 6 ) }","paraphrases":["Is 0 equal to the lower flammable limit of methanol?"],"info":{}}
{"id":"train_10996","question":"What state is the Pope in charge of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q19546 wdt:P1001 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What state is the Pope in charge of?"],"info":{}}
{"id":"train_10997","question":"What time is it in Zhytomyr Oblast located in the UTC+3 time zone?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q40637 p:P421 ?s . ?s ps:P421 wd:Q6760 . ?s pq:P1264 ?value }","paraphrases":["If Zhytomyr Oblast is located in the UTC+3 time zone, what time is it now?"],"info":{}}
{"id":"train_10999","question":"Which camera is different from a still camera to catch taxon parent of eukaryote?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15328 wdt:P1889 ?answer . ?answer wdt:P171 wd:Q19088 }","paraphrases":["Which camera to catch eukaryote's taxon parent is different from a still camera?"],"info":{}}
{"id":"train_11001","question":"WHICH IS THE PARENT COMPANY OF SUPERIOR FORMATION OF ACADEMY FOR SPATIAL RESEARCH AND PLANNING","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q414327 wdt:P749 ?X . ?X wdt:P355 ?answer }","paraphrases":["Name the parent company of \"SUPERIOR FORMATION OF ACADEMY FOR SPATIAL RESEARCH AND PLANNING\"."],"info":{}}
{"id":"train_11003","question":"What government did Josip Broz Tito serve","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q9161 . ?sbj wdt:P31 wd:Q59281 }","paraphrases":["What government did Josip Broz Tito serve"],"info":{}}
{"id":"train_11004","question":"How many instruments are used in The Carnival of the Animals score?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q941724 wdt:P870 ?obj }","paraphrases":["The Carnival of the Animals score uses how many instruments?"],"info":{}}
{"id":"train_11005","question":"Is the number of representatives in an organization/legislature of the West Ham equal to 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q874463 wdt:P1410 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is there 1 representative in the organization/legislature of the West Ham?"],"info":{}}
{"id":"train_11006","question":"Which is the parent body of Enceladus, that have child body as Hyrrokkin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3303 wdt:P397 ?answer . ?answer wdt:P398 wd:Q18032 }","paraphrases":["Which is Enceladus ' parent body, having a child body like Hyrrokkin?"],"info":{}}
{"id":"train_11007","question":"Who is the  {operationalization} for {manifestation of} of {inertia}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1557 wd:Q122508 . ?sbj wdt:P31 wd:Q286017 }","paraphrases":["Who is the {operationalization} for {sign of} of {inertia}"],"info":{}}
{"id":"train_11008","question":"Which is the academic area of the PhD adviser of Vladimir Berkovich?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7938273 wdt:P184 ?X . ?X wdt:P101 ?answer }","paraphrases":["In which field of study does Vladimir Berkovich serve as a PhD advisor?"],"info":{}}
{"id":"train_11010","question":"For what position did Douglas Nicholls replace Mark Oliphant ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q447675 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q727443 }","paraphrases":["Douglas Nicholls replaced Mark Oliphant for what position?"],"info":{}}
{"id":"train_11011","question":"What are the provinces of Pakistan  that contain the word \"sindh\" in their name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15058985 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sindh' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which provinces of Pakistan contain the word sindh in their name"],"info":{}}
{"id":"train_11013","question":"What is the event location of the took part in of Florin Prunea ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1333942 wdt:P1344 ?X . ?X wdt:P276 ?answer }","paraphrases":["Where is the took part in Florin Prunea?"],"info":{}}
{"id":"train_11014","question":"What is the { start time } for { Arthur Wellesley, 1st Duke of Wellington } as { Prime Minister of the United Kingdom }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q131691 p:P39 ?s . ?s ps:P39 wd:Q14211 . ?s pq:P580 ?value }","paraphrases":["When was Arthur Wellesley, 1st Duke of Wellington, the Prime Minister of the UK?"],"info":{}}
{"id":"train_11018","question":"How many carries are by Canal du Midi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2505 wd:Q202494 }","paraphrases":["Which is the number of carries by Canal du Midi?"],"info":{}}
{"id":"train_11021","question":"WHICH IS THE EARTHQUAKE WITH THE MAXIMUM AFTERSHOCKS","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7944 . ?ent wdt:P2320 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["WHICH IS THE Seismic tremor WITH THE Greatest Consequential convulsions"],"info":{}}
{"id":"train_11022","question":"Who did Demi Lovato break-up with in 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41173 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["In 2016, what relationship did Demi Lovato end?"],"info":{}}
{"id":"train_11023","question":"Tell me the social networking service which starts with the letter y?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3220391 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me the social networking services which begins with the letter y?"],"info":{}}
{"id":"train_11025","question":"On a ruler, what are the symbols of measurement?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q104555 wdt:P2575 ?X . ?X wdt:P416 ?answer }","paraphrases":["What are the measurement symbols on a ruler?"],"info":{}}
{"id":"train_11030","question":"Name the feminine name behind the language work of Russian","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q7737 . ?sbj wdt:P31 wd:Q11879590 }","paraphrases":["Title the ladylike title behind the dialect work of Russian"],"info":{}}
{"id":"train_11032","question":"When was Molise part of the time zone UTC+02:00?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1443 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value }","paraphrases":["At what time was Molise part of the UTC +02:00 time zone?"],"info":{}}
{"id":"train_11033","question":"What are the mass media which start with the letter youtube","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11033 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'youtube' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the mass media that begin with the youtube letter?"],"info":{}}
{"id":"train_11036","question":"Which is different to liquorice , that played by Bride?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q138811 wdt:P1889 ?answer . ?answer wdt:P175 wd:Q913552 }","paraphrases":["How is the differents to liquorice, and the played by Bride"],"info":{}}
{"id":"train_11038","question":"What territory is claimed by the German Democratic Republic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q16957 wdt:P1336 ?obj . ?obj wdt:P31 wd:Q3024240 }","paraphrases":["What territory does the Democratic Republic of Germany claim?"],"info":{}}
{"id":"train_11039","question":"How many noble titles owned by {emir} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P97 wd:Q166382 }","paraphrases":["What is the number of noble titles given to the {emir}?"],"info":{}}
{"id":"train_11040","question":"Tell me the time which starts with the letter p!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11471 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me the time which begins with the letter p!"],"info":{}}
{"id":"train_11042","question":"What is the city location of Vladimir Lenin","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1394 wdt:P937 ?obj . ?obj wdt:P31 wd:Q174844 }","paraphrases":["What is the city area of Vladimir Lenin"],"info":{}}
{"id":"train_11043","question":"What is the location of burial of Gioseffo Zarlino, whose WHS criteria is iii?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q365805 wdt:P119 ?answer . ?answer wdt:P2614 wd:Q23038977 }","paraphrases":["What is Gioseffo Zarlino's burial location, whose WHS criteria is iii?"],"info":{}}
{"id":"train_11044","question":"Konig von Belgien Albert was nominated for what on 1-1-1922?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q55008046 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1922' ) ) }","paraphrases":["On 1-1-1922, what was Konig von Belgien Albert nominated for?"],"info":{}}
{"id":"train_11048","question":"What material is used in and indigenous to tequila?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q122195 wdt:P186 ?ans_1 . wd:Q122195 wdt:P2341 ?ans_2 }","paraphrases":["What are the ingredients in tequila?"],"info":{}}
{"id":"train_11050","question":"What is the feed-stock of a chair, with a mass of 55.935?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15026 wdt:P186 ?answer . ?answer wdt:P2067 ?x FILTER ( contains ( ?x , '55.935' ) ) }","paraphrases":["How is the feed-stock of a chair, with a mass of 55.935"],"info":{}}
{"id":"train_11052","question":"What method was used to determine that VAV2 is genetically associated with multiple sclerosis?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8277 p:P2293 ?s . ?s ps:P2293 wd:Q18032316 . ?s pq:P459 ?value }","paraphrases":["What method was used to determine the genetic association between VAV2 and multiple sclerosis?"],"info":{}}
{"id":"train_11053","question":"To whom did Anna Karina  got married and when did it ended?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q232113 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["To whom did Anna Karina got hitched and when did it ended?"],"info":{}}
{"id":"train_11058","question":"What what is Fibonacci number edition or translation of by Lexicon Forestale and also which starts with letter 1","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47577 . ?sbj wdt:P629 wd:Q62469935 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , '1' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is Fibonacci variety version or translation of by using Lexicon Forestale and also which begins with letter 1"],"info":{}}
{"id":"train_11059","question":"Which songwriter of Suite bergamasque died in Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1367599 wdt:P86 ?answer . ?answer wdt:P20 wd:Q90 }","paraphrases":["Who wrote the Suite bergmasaque and died in Paris?"],"info":{}}
{"id":"train_11063","question":"What position did Halford Mackinder hold in the Glasgow Camlachie district?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q299938 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 wd:Q5566762 }","paraphrases":["What was Halford Mackinder's title in regards to the Glasgow Camlachie district?"],"info":{}}
{"id":"train_11064","question":"In which year did André Previn received the Grammy Lifetime Achievement Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q155712 p:P166 ?s . ?s ps:P166 wd:Q935843 . ?s pq:P585 ?value }","paraphrases":["Tell me the year André Previn won the Lifetime Achievement Award at the Grammy's."],"info":{}}
{"id":"train_11066","question":"Is the electric charge of a proton greater than 1.92261194496e-19?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2294 wdt:P2200 ?obj filter ( ?obj > 1.92261194496e-19 ) }","paraphrases":["What is the electric charge of a proton?"],"info":{}}
{"id":"train_11067","question":"How many people were part of the Burma Campaign","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q221519 wdt:P276 ?X . ?X wdt:P1082 ?answer }","paraphrases":["What is the number of people who participated in the Burma Campaign?"],"info":{}}
{"id":"train_11068","question":"Name the capital city of the Empire of Japan.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q188712 wdt:P36 ?obj . ?obj wdt:P31 wd:Q515 }","paraphrases":[],"info":{}}
{"id":"train_11069","question":"What are the historical ethnical group which start with the letter xiongnu","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4204501 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'xiongnu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the historical ethnical group which begin with the letter xiongnu"],"info":{}}
{"id":"train_11073","question":"What software version of Perl was published on October 1st, 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q42478 p:P348 ?s . ?s ps:P348 ?obj . ?s pq:P577 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["On the date of October 1st, 2014 Perl published which version of their software?"],"info":{}}
{"id":"train_11074","question":"What is owned by the owners of Dalian Hexing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36340882 wdt:P1830 ?X . ?X wdt:P127 ?answer }","paraphrases":["What else do the owners of Dalian Hexing own?"],"info":{}}
{"id":"train_11075","question":"What are sculptors of quantum mechanics that have worked at Humboldt University of Berlin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q944 wdt:P170 ?answer . ?answer wdt:P108 wd:Q152087 }","paraphrases":["which are sculptors of the  quantum mechanics that have worked at Humboldt University of Berlin?"],"info":{}}
{"id":"train_11077","question":"What are the kingdom which start with the letter zakhara","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q417175 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zakhara' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the coachwork sort which begin with the letter van"],"info":{}}
{"id":"train_11079","question":"In how many fields did Simone de Beauvoir work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q7197 wdt:P101 ?obj }","paraphrases":["Simone de Beauvoir worked in how many fields?"],"info":{}}
{"id":"train_11081","question":"how many film crew members were needed for snow white and the seven dwarfs?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q134430 wdt:P3092 ?obj }","paraphrases":["What is the number of film crew members necessary for Snow White and the Seven Dwarfs?"],"info":{}}
{"id":"train_11082","question":"What is the consumer price index inflation rate for the state of Jambi Province?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2051 wdt:P17 ?X . ?X wdt:P1279 ?answer }","paraphrases":["What is the buyer cost file expansion rate for the state of Jambi Province?"],"info":{}}
{"id":"train_11085","question":"Give the mortality rate which has the strongest incidence in Finland.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q58702 . ?ent wdt:P2844 ?obj . ?ent wdt:P276 wd:Q33 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is Finland's largest mortality rate?"],"info":{}}
{"id":"train_11087","question":"What are the mineral acid that starts with the letter a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q408683 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the mineral corrosive that begins with the letter a"],"info":{}}
{"id":"train_11088","question":"Where is etymology of Poisson distribution, with the famous book called Poisson's equation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q205692 wdt:P138 ?answer . ?answer wdt:P800 wd:Q827688 }","paraphrases":["What is the etymology of Poisson distribution mentioned in the book called Poisson's equation?"],"info":{}}
{"id":"train_11089","question":"Name a military order that served the Holy Roman Emperor that contains the word \"knights\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q474717 . ?sbj wdt:P945 wd:Q181765 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'knights' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a military arrange that served the Sacred Roman Head that contains the word \"knights\" in its name"],"info":{}}
{"id":"train_11090","question":"Name a sport played on beaches that contains the word \"handball \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q349 . ?sbj wdt:P2416 wd:Q535116 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'handball' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name of a beach sport with the word \"handball\" in its name"],"info":{}}
{"id":"train_11093","question":"Is the number of seats of the Senate of Palau greater than 10.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q969494 wdt:P1342 ?obj filter ( ?obj > 10.8 ) }","paraphrases":["Does the Senate of Palau consist of more than 10.8 members?"],"info":{}}
{"id":"train_11097","question":"What is the lagoon with the lowest residence time of water whose country is Chile?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q187223 . ?ent wdt:P3020 ?obj . ?ent wdt:P17 wd:Q298 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What lagoon in Chile has the lowest residence time of water?"],"info":{}}
{"id":"train_11099","question":"which process starts with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3249551 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which process begins with the letter t"],"info":{}}
{"id":"train_11100","question":"Which is the temporal range end for Quaternary?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P524 wd:Q26185 }","paraphrases":[],"info":{}}
{"id":"train_11101","question":"Tell me the name of the diatomic nonmetal chemical with the lowest oxidation state.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19753344 . ?ent wdt:P1121 ?obj . ?ent wdt:P31 wd:Q11344 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the diatomic nonmetal chemical that has the lowest oxidation state?"],"info":{}}
{"id":"train_11103","question":"Is Triticum aestivum in Swedish?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q161098 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q9027 }","paraphrases":["Is aestivum Swedish for Triticum?"],"info":{}}
