{"id":"train_17195","question":"What award did Murray Gell-Mann receive in 1969?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q172840 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1969' ) ) }","paraphrases":["Give me the name of the 1969 award that Murray Gell-Mann won?"],"info":{}}
{"id":"train_17197","question":"What awards did Claude Simon Receive and when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q131549 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What grants did Claude Simon Get and when?"],"info":{}}
{"id":"train_17200","question":"What is the genetic association of Maleria","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2293 wd:Q12156 . ?sbj wdt:P31 wd:Q7187 }","paraphrases":["Name the genetic association of Maleria."],"info":{}}
{"id":"train_17202","question":"What is the {location} of {Nusrat Fateh Ali Khan}, with the {coordinates} of {-2.2525}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q299073 wdt:P264 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-2.2525' ) ) }","paraphrases":["What is the {area} of {Nusrat Fateh Ali Khan}, with the {facilitates} of {-2.2525}?"],"info":{}}
{"id":"train_17203","question":"What is Jefferson Davis ' federal state of citizenship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q162269 wdt:P27 ?obj . ?obj wdt:P31 wd:Q43702 }","paraphrases":["In which federal state does Jefferson Davis have citizenship?"],"info":{}}
{"id":"train_17204","question":"What type of human research was carried out during World War II?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2348 wd:Q362 . ?sbj wdt:P31 wd:Q1331083 }","paraphrases":["What sort of human inquire about was carried out amid World War II?"],"info":{}}
{"id":"train_17206","question":"Who is the character portrayed in 30 Rock by cast member Alec Baldwin portray?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q189350 p:P161 ?s . ?s ps:P161 wd:Q170572 . ?s pq:P453 ?value }","paraphrases":["Which is the character portrayed in 30 Rock by cast member Alec Baldwin?"],"info":{}}
{"id":"train_17207","question":"How many signatories were given for the Geneva Conference of 1954?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q482407 wdt:P1891 ?obj }","paraphrases":["How many signatories did the 1954 Geneva Conference receive?"],"info":{}}
{"id":"train_17208","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q105598 wdt:P840 ?obj . ?obj wdt:P31 wd:Q15720793 }","paraphrases":["n/a"],"info":{}}
{"id":"train_17210","question":"\"What Old English civilization is in the United Kingdom the province of?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42365 wdt:P2596 ?answer . ?answer wdt:P131 wd:Q145 }","paraphrases":["\"What Old English civilization is in the United Kingdom the province of?\""],"info":{}}
{"id":"train_17212","question":"What is Saxon Academy of Sciences member ID for Hans-Georg Gadamer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q76356 wdt:P3411 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17213","question":"For what reason Robert Burns Woodward was in nomination in the year 1960?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q232316 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1960' ) ) }","paraphrases":["Which was the reason that Robert Burns Woodward got a nomination in 1960?"],"info":{}}
{"id":"train_17215","question":"What award did Steve Wozniak receive in 1997?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q483382 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1997' ) ) }","paraphrases":["What honor was Steve Wozniak win in 1997?"],"info":{}}
{"id":"train_17216","question":"Who is the titleholder of award received of Linkin Park?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q261 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who is the titleholder of grant gotten of Linkin Park?"],"info":{}}
{"id":"train_17217","question":"What is the AFL Tables ID for Ron Barassi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3441366 wdt:P3547 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17219","question":"What country is Cluj-Napoca in, where Matthias Corvinus was born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q188634 p:P19 ?s . ?s ps:P19 wd:Q100188 . ?s pq:P17 ?value }","paraphrases":["Which is the country of birth of Matthias Corvinus?"],"info":{}}
{"id":"train_17220","question":"What are the public company which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891723 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the open company which begin with the letter t"],"info":{}}
{"id":"train_17221","question":"What competitor of Alfred Dellheim is present at Helmut Kohl?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2518 wdt:P1344 ?answer . ?answer wdt:P710 wd:Q16887934 }","paraphrases":["What competitor of Alfred Dellheim is display at Helmut Kohl?"],"info":{}}
{"id":"train_17223","question":"What city does the show \"Friends\" take place in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q79784 wdt:P840 ?obj . ?obj wdt:P31 wd:Q208511 }","paraphrases":["What city does the appear \"Companions\" take put in?"],"info":{}}
{"id":"train_17224","question":"What was Kenneth Branagh nominated Academy Award for Best Supporting Actor for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q55294 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P805 ?value }","paraphrases":["For what role did Kenneth Branagh receive the nomination for the Academy Award for Best Supporting Actor?"],"info":{}}
{"id":"train_17226","question":"What is the astronomical filter for Pinwheel Galaxy which has an apparent magnitude of 8.31?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q14371 p:P1215 ?s . ?s ps:P1215 ?x filter ( contains ( ?x , '8.31' ) ) . ?s pq:P1227 ?value }","paraphrases":["Which astronomical filter for Pinwheel Galaxy has an apparent magnitude of 8.31?"],"info":{}}
{"id":"train_17227","question":"Did Al Franken attend Harvard and Blake?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q319084 wdt:P69 wd:Q49123 . wd:Q319084 wdt:P69 wd:Q4924484 }","paraphrases":["Is Al Franken an alumnus of both Harvard and Blake?"],"info":{}}
{"id":"train_17228","question":"Which enterprise owns American Airlines?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1830 wd:Q32396 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["Which undertaking claims American Airlines?"],"info":{}}
{"id":"train_17229","question":"what is historical country of monarchy of basic form of government and also which starts with letter  sultanate","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3024240 . ?sbj wdt:P122 wd:Q7269 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sultanate' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is chronicled nation of government of essential shape of government additionally which begins with letter sultanate"],"info":{}}
{"id":"train_17232","question":"What are the opera which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1344 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which opera start with the lwtter Z"],"info":{}}
{"id":"train_17233","question":"What position did Sergey Bubka begin on May 14th, 2002?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q184556 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["What position did Sergey Bubka hold since May 14th, 2002?"],"info":{}}
{"id":"train_17234","question":"Can you let me know the inflation rate of consumer price index of the work location of Raja Ravi Varma?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q333453 wdt:P937 ?X . ?X wdt:P1279 ?answer }","paraphrases":["Can you tell me about the consumer price index inflation rate of Raja Ravi Varma's workplace?"],"info":{}}
{"id":"train_17237","question":"Which singer has had the greatest number of children?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1971 ?obj . ?ent wdt:P106 wd:Q177220 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the singer with the most off-spring."],"info":{}}
{"id":"train_17239","question":"What is the twinned administrative city of Chicago?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q1297 . ?sbj wdt:P31 wd:Q515 }","paraphrases":["What is the twinned regulatory city of Chicago?"],"info":{}}
{"id":"train_17241","question":"Which is the academic degree and academic major of Lionel Trilling who was educated at Columbia University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q1827287 p:P69 ?s . ?s ps:P69 wd:Q49088 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["Which is the academic diploma and educational principal of Lionel Trilling who was once trained at Columbia University?"],"info":{}}
{"id":"train_17242","question":"Who is the role model of Alan Hollingburst whose language native is English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q316048 wdt:P737 ?answer . ?answer wdt:P103 wd:Q1860 }","paraphrases":["Who is the part demonstrate of Alan Hollingburst whose dialect local is English?"],"info":{}}
{"id":"train_17243","question":"What is the geography of Yosemite Falls National Park?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q491677 wdt:P3018 ?answer . ?answer wdt:P2633 wd:Q5535275 }","paraphrases":["What is the geology of Yosemite Falls National Park?"],"info":{}}
{"id":"train_17248","question":"Which volcano has the most topographic isolation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q8072 . ?ent wdt:P2659 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the most isolated volcano?"],"info":{}}
{"id":"train_17249","question":"How many people are commissioned for {Works Progress Administration} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P88 wd:Q1200079 }","paraphrases":["The Works Progress Administration has how many people designated to work for it?"],"info":{}}
{"id":"train_17252","question":"What are the type of mathematical function that notation radical sign and which that starts with the letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47279819 . ?sbj wdt:P913 wd:Q11536248 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the type of mathematical characteristic that notation radical signal and which that starts with the letter r"],"info":{}}
{"id":"train_17253","question":"What are the colors of the members of Uwe Ronneburger ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2504690 wdt:P102 ?X . ?X wdt:P462 ?answer }","paraphrases":["What are the colors of the individuals of Uwe Ronneburger ?"],"info":{}}
{"id":"train_17254","question":"Which maximum block cipher describes the Performance Evaluation of DES and Blowfish Algorithms?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q543151 . ?ent wdt:P2599 ?obj . ?ent wdt:P1343 wd:Q21684051 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Describes the cipher block  Performance Evaluation DES and Blowfish Algorithms?"],"info":{}}
{"id":"train_17255","question":"What is the Douban film ID of Grease?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q267721 wdt:P4529 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17256","question":"What religion starts with the letter \"y\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9174 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What religion begins with the letter \"y\"?"],"info":{}}
{"id":"train_17258","question":"What group/organisation location does ZIP+4 falls in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q125603 wdt:P740 ?X . ?X wdt:P281 ?answer }","paraphrases":["What group/organisation area does ZIP+4 falls in?"],"info":{}}
{"id":"train_17259","question":"Give me a football club that starts with p, and where Jose Mourinho was the head coach.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q476028 . ?sbj wdt:P286 wd:Q79983 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me a football club that begins with p, and where Jose Mourinho was the head mentor."],"info":{}}
{"id":"train_17260","question":"Which  subsidiary company of developed by MP3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42591 wdt:P178 ?X . ?X wdt:P355 ?answer }","paraphrases":["MP3 was created by what subsidiary company?"],"info":{}}
{"id":"train_17261","question":"Tell me  occupation whose name has the word whistle blower in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12737077 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'whistleblower' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know occupation whose title has the word shriek blower in it."],"info":{}}
{"id":"train_17262","question":"What is astronomical filter for Messier object?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q14530 wdt:P1227 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17263","question":"What awards has champion Jack Nicholson won?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q39792 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What awards has been won by champion Jack Nicholson?"],"info":{}}
{"id":"train_17264","question":"What is in the shire of Anhui, where the title of the head of government is Premier of the People's Republic of China?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40956 wdt:P131 ?answer . ?answer wdt:P1313 wd:Q4122271 }","paraphrases":["What is in the shire of Anhui, the place the title of the head of authorities is Premier of the People's Republic of China?"],"info":{}}
{"id":"train_17265","question":"Name an aircraft model asembled in Hamburg that contains the word \"a320\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15056993 . ?sbj wdt:P1071 wd:Q1055 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'a320' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an aircraft mannequin asembled in Hamburg that incorporates the phrase \"a320\" in its identify"],"info":{}}
{"id":"train_17267","question":"Who is Television's inventor and what is its practice?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q289 wdt:P3095 ?ans_1 . wd:Q289 wdt:P61 ?ans_2 }","paraphrases":["Who invented the television and what is it's purpose?"],"info":{}}
{"id":"train_17269","question":"Who is the leader of Venice?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P608 wd:Q641 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the pioneer of Venice?"],"info":{}}
{"id":"train_17272","question":"What city became the capital of Jaipur in 1727?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q66485 p:P1376 ?s . ?s ps:P1376 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1727' ) ) }","paraphrases":["Which city was the Capital of Jaipur in the year 1727?."],"info":{}}
{"id":"train_17273","question":"What taxon is produced by coral?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q171446 wdt:P2849 ?obj . ?obj wdt:P31 wd:Q16521 }","paraphrases":["Coral is created by which taxon?"],"info":{}}
{"id":"train_17274","question":"Who are the sons of Maximilian I, Holy Roman Emperor, who died on 1557-5-4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q150726 wdt:P40 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( YEAR ( ?x ) , '1557' ) ) }","paraphrases":["Who are the children of Maximilian I, Sacred Roman Head, who kicked the bucket on 1557-5-4?"],"info":{}}
{"id":"train_17275","question":"What is the extreme point west next to Rome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q220 wdt:P47 ?X . ?X wdt:P1335 ?answer }","paraphrases":["What is the extraordinary point west another to Rome?"],"info":{}}
{"id":"train_17276","question":"What are the historical country which start with the letter russia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3024240 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'russia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the historical u . s . which begin with the letter russia"],"info":{}}
{"id":"train_17277","question":"Where did William Henry Harrison die and where was he buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q11869 wdt:P20 ?ans_1 . wd:Q11869 wdt:P119 ?ans_2 }","paraphrases":["In what place did William Henry Harrison pass away and where was he laid to rest?"],"info":{}}
{"id":"train_17280","question":"Tell me the republic that is the administrative territorial entity of Mizoram.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P150 wd:Q1502 . ?sbj wdt:P31 wd:Q7270 }","paraphrases":["Let me know the republic that's the regulatory regional substance of Mizoram."],"info":{}}
{"id":"train_17281","question":"Tell me where Jawaharlal Nehru was educated and what academic degree he holds.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q1047 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["Tell me the place Jawaharlal Nehru used to be skilled and what academic degree he holds."],"info":{}}
{"id":"train_17282","question":"When did Akseli Gallen-Kallela begin studying at the Academy of Fine Arts of Helsinki?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q170068 p:P69 ?s . ?s ps:P69 wd:Q2254584 . ?s pq:P580 ?value }","paraphrases":["In what year did Akseli Gallen-Kallela begin studying at the Academy of Fine Arts in Helsinki?"],"info":{}}
{"id":"train_17286","question":"What was a significant event of Ferdinand II of Aragon and where did it take place?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q12860 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P276 ?value1 . }","paraphrases":["What was a critical occasion of Ferdinand II of Aragon and where did it take put?"],"info":{}}
{"id":"train_17293","question":"Tell me the literary work of the edition of The thousand and one nights, commonly called, in England as the Arabian night's entertainments and that contains the word nights in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7725634 . ?sbj wdt:P747 wd:Q60674980 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'nights' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the literary work of the version of The thousand and one nights, usually called, in England as the Arabian night's entertainments and that includes the word nights in it is name?"],"info":{}}
{"id":"train_17294","question":"WHICH IS THE ILID OF DOG","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q144 wdt:P5063 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17295","question":"who is painter of dilbert that his last name is adams","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q726431 wdt:P170 ?answer . ?answer wdt:P734 wd:Q351735 }","paraphrases":["who is painter of dilbert that his final title is adams"],"info":{}}
{"id":"train_17298","question":"What is the working life museum with the lowest lighthouse range whose source of energy is rapeseed oil ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q10416961 . ?ent wdt:P2929 ?obj . ?ent wdt:P618 wd:Q10657384 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the lowest lighthouse range, whose energy source is rapeseed oil, of all the working life museums?"],"info":{}}
{"id":"train_17299","question":"Who is the co-founder of the university that Scott McCartney attended?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7436800 wdt:P69 ?X . ?X wdt:P112 ?answer }","paraphrases":["Scott McCartney attended a university co-founded by who?"],"info":{}}
{"id":"train_17301","question":"Which is the grammatical case of Telugu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q8097 wdt:P2989 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17303","question":"who actress of series of the deep dive ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28151367 wdt:P179 ?X . ?X wdt:P161 ?answer }","paraphrases":["What was the name of the actress who was in the series of the deep dive?"],"info":{}}
{"id":"train_17305","question":"What is the name of the Rutherford scattering that has Alexander William Bickerton as a mentor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q841185 wdt:P138 ?answer . ?answer wdt:P184 wd:Q4720367 }","paraphrases":["What is the name of the Rutherford scattering that has Alexander William Bickerton as a mentor?"],"info":{}}
{"id":"train_17306","question":"Mention the relative of Ike Turner","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q208871 wdt:P1038 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Specify the relative of Ike Turner"],"info":{}}
{"id":"train_17307","question":"Which artery supplies blood to the stomach?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1029907 wdt:P2286 ?obj . ?obj wdt:P31 wd:Q9655 }","paraphrases":["Which supply route supplies blood to the stomach?"],"info":{}}
{"id":"train_17309","question":"Which is the topic's main category for pottery?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P910 wd:Q11642 }","paraphrases":[],"info":{}}
{"id":"train_17313","question":"What is Esperanto's song anthem ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q143 wdt:P85 ?obj . ?obj wdt:P31 wd:Q7366 }","paraphrases":["What is Esperanto's tune song of devotion ?"],"info":{}}
{"id":"train_17314","question":"Does Bonar Law have any genetic association to ADH1B? and can you die from it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q166663 wdt:P509 ?answer . ?answer wdt:P2293 wd:Q17710244 }","paraphrases":["Does Bonar Law have any genetic association to ADH1B? and can you die from it?"],"info":{}}
{"id":"train_17315","question":"What public offices does the European Parliament direct?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2389 wd:Q8889 . ?sbj wdt:P31 wd:Q294414 }","paraphrases":["What open workplaces does the European Parliament direct?"],"info":{}}
{"id":"train_17316","question":"Which language families are studied by linguistics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2579 wd:Q8162 . ?sbj wdt:P31 wd:Q28923954 }","paraphrases":["What language groups are studied by linguistics?"],"info":{}}
{"id":"train_17317","question":"Which is the construction date of the development of JPEG?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2195 wdt:P178 ?X . ?X wdt:P571 ?answer }","paraphrases":["Which is the development date of the advancement of JPEG?"],"info":{}}
