{"id":"train_9275","question":"give me the coordinates of the river mouth of the river Ganges.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5089 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q1233637 }","paraphrases":["The Ganges (/ˈɡændʒiːz/ GAN-jeez), or Ganga (Hindustani: [ˈɡəŋɡaː]), is a trans-boundary river of the Indian subcontinent which flows through the nations of India and Bangladesh. The 2,525 km (1,569 mi) river rises in the western Himalayas in the Indian state of Uttarakhand, and flows south and east through the Gangetic Plain of North India. After entering West Bengal, it divides into two rivers: the Hooghly and the Padma River. The Hooghly, or Adi Ganga, flows through several districts of West Bengal and into the Bay of Bengal near Sagar Island. The other, the Padma, also flows into and through Bangladesh, and joins the Meghna river which ultimately empties into the Bay of Bengal.\n\nThe Ganges is one of the most sacred rivers to Hindus.[4] It is also a lifeline to millions of Indians who live along its course and depend on it for their daily needs. It is worshipped in Hinduism and personified as the goddess Gaṅgā.[5] It has also been important historically, with many former provincial or imperial capitals (such as [6] Kannauj, Kampilya, [6] Kara, Prayag or Allahabad, Kashi, Pataliputra or Patna, Hajipur, Munger, Bhagalpur, Baranagar, Murshidabad, Baharampur, Nabadwip, Saptagram and Kolkata) located on its banks.\n\nThe Ganges is highly polluted. Pollution threatens not only humans, but also more than 140 fish species, 90 amphibian species and the endangered Ganges river dolphin.[7] The Ganges is a major source of global ocean plastic pollution.[8] The levels of fecal coliform bacteria from human waste in the waters of the river near Varanasi are more than 100 times the Indian government's official limit.[7] The Ganga Action Plan, an environmental initiative to clean up the river, has been a major failure thus far,[a][b][9] due to rampant corruption, lack of will on behalf of the government and its bureaucracy, lack of technical expertise,[c] poor environmental planning,[d] and lack of support from religious authorities.[e]"],"info":{}}
{"id":"train_9276","question":"What member of the board of directors developed the Mac OS X 10.1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q478451 wdt:P178 ?X . ?X wdt:P3320 ?answer }","paraphrases":["Who was the member from the board of directors who developed the Mac Operational System version X 10.1?"],"info":{}}
{"id":"train_9277","question":"What has the higher taxon of Ulmus, is it the common name jilmovite?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131113 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'jilmovité' ) ) }","paraphrases":["Is the common name jilmovite the higher taxon of Ulmus?"],"info":{}}
{"id":"train_9278","question":"Tell me novella that starts with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q149537 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know novella that begins with the letter t"],"info":{}}
{"id":"train_9280","question":"Was Petra an administrative body in Mada'in Saleh and Leskovac?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5788 wdt:P190 wd:Q27356 . wd:Q5788 wdt:P190 wd:Q192606 }","paraphrases":["Did the administrative body in Mada'in Saleh and Leskovac include Petra?"],"info":{}}
{"id":"train_9281","question":"what is the life stance of Bantu People, that was established by Jesus Christ ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q173371 wdt:P140 ?answer . ?answer wdt:P112 wd:Q302 }","paraphrases":["what is the life position of Bantu Individuals, that was built up by Jesus Christ ?"],"info":{}}
{"id":"train_9283","question":"How many active ingredients are there in acetaminophen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q57055 wdt:P3780 ?obj }","paraphrases":["What is in acetaminophen?"],"info":{}}
{"id":"train_9284","question":"Tell me criterion of similarity whose name has the word number in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7250271 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'number' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know basis of closeness whose title has the word number in it."],"info":{}}
{"id":"train_9286","question":"When did Alfred Dreyfus receive the award of Officer of the Legion of Honour?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q171826 p:P166 ?s . ?s ps:P166 wd:Q10855195 . ?s pq:P580 ?value }","paraphrases":["In what year did Alfred Dreyfus Awarded Officer of the Legion."],"info":{}}
{"id":"train_9288","question":"What biological process is used for DNA replication","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q130996 wdt:P4774 ?obj . ?obj wdt:P31 wd:Q2996394 }","paraphrases":["What organic handle is utilized for DNA replication"],"info":{}}
{"id":"train_9289","question":"When did Theodoros Angelopoulos receive the Best Screenplay Award at Cannes Film Festival?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q55168 p:P166 ?s . ?s ps:P166 wd:Q978420 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["When was the Best Screenplay Award given to Theodoros Angelopoulos at the Cannes Film Festival"],"info":{}}
{"id":"train_9291","question":"Who was Louis Pasteur main influence ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P737 wd:Q529 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was Louis Pasteur fundamental impact ?"],"info":{}}
{"id":"train_9292","question":"Name a soft drink from North America that contains the word \" beer\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q147538 . ?sbj wdt:P495 wd:Q49 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'beer' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a smooth drink from North America that contains the phrase \" beer\" in its name"],"info":{}}
{"id":"train_9293","question":"When did Colarado have a population size of 939629.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1261 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '939629.0' ) ) . ?s pq:P585 ?value }","paraphrases":["none"],"info":{}}
{"id":"train_9294","question":"Can you tell me which dwarf planet with the largest argument of periapsis has a moon called Dysnomia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2199 . ?ent wdt:P2248 ?obj . ?ent wdt:P398 wd:Q102656 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which small plant with large periapsis has a moon Dysnomia?"],"info":{}}
{"id":"train_9296","question":"What is the date indium was scientifically established?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1094 wdt:P574 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9298","question":"Christopher Columbus is dedicated to how many?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P825 wd:Q7322 }","paraphrases":["How many is Christopher Columbus dedicated to?"],"info":{}}
{"id":"train_9300","question":"Who is the daughter of Louis IV, Holy Roman Emperor, that has a brother named Agnes of Bavaria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57161 wdt:P40 ?answer . ?answer wdt:P3373 wd:Q90224 }","paraphrases":["Who is the daughter of Louis IV, Holy Roman Emperor, that has a brother named Agnes of Bavaria?"],"info":{}}
{"id":"train_9303","question":"Marge Champion's given name is Celeste in which series ordinal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2617543 p:P735 ?s . ?s ps:P735 wd:Q3664222 . ?s pq:P1545 ?value }","paraphrases":["In which series ordinal is Marge Champion's given name Celeste?"],"info":{}}
{"id":"train_9306","question":"Did Socrates marry Xanthippe and Myrto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q913 wdt:P26 wd:Q233677 . wd:Q913 wdt:P26 wd:Q1956836 }","paraphrases":["Is it true that Socrates married Xanthippe and Myrto?"],"info":{}}
{"id":"train_9310","question":"Did Nancy Kerrigan represent the United States of America in sports ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q239988 wdt:P1532 wd:Q30 }","paraphrases":["Did Nancy Kerrigan ever represent the USA in a sport?"],"info":{}}
{"id":"train_9311","question":"Who is the student of Carl Friedrich Gauss?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q6722 wdt:P1066 ?ans_1 . wd:Q6722 wdt:P802 ?ans_2 }","paraphrases":["Who studied under Carl Friedrich Gauss?"],"info":{}}
{"id":"train_9313","question":"Tell me weekly newspaper whose name has the word es in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2305295 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'és' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know week after week daily paper whose title has the word es in it."],"info":{}}
{"id":"train_9315","question":"Which are the symptoms of intellectual disability?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P780 wd:Q183560 }","paraphrases":[],"info":{}}
{"id":"train_9316","question":"Where did John Flynn, Minister of New South Wales, deceased at?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q323080 wdt:P20 ?answer . ?answer wdt:P131 wd:Q3224 }","paraphrases":["Where did John Flynn, Serve of Unused South Ridges, expired at?"],"info":{}}
{"id":"train_9317","question":"What award was James Gandolfini nominated for in 2009?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q308722 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["In 2009, James Gandolfini was nominated to what award?"],"info":{}}
{"id":"train_9320","question":"What what is dead language has conjugation class Latin third conjungation and also which starts with letter i","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q45762 . ?sbj wdt:P5206 wd:Q54295441 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is useless language has conjugation type Latin 0.33 conjungation and additionally which starts offevolved with letter i"],"info":{}}
{"id":"train_9321","question":"Who is the judge of Nuremberg trials?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q80130 wdt:P1594 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9323","question":"What is the name of the awards confered by Youtube ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1027 wd:Q866 . ?sbj wdt:P31 wd:Q618779 }","paraphrases":["What is the title of the grants confered by Youtube ?"],"info":{}}
{"id":"train_9324","question":"For what was the inception of Baja California Sur in the year 1930?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q46508 p:P571 ?s . ?s ps:P571 ?x filter ( contains ( YEAR ( ?x ) , '1930' ) ) . ?s pq:P155 ?value }","paraphrases":["Which was the reason for inception of Baja California in 1930?"],"info":{}}
{"id":"train_9325","question":"dont get it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2024141 wdt:P517 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '521.1' ) ) }","paraphrases":["dont get it"],"info":{}}
{"id":"train_9327","question":"Tell me city of the united states whose name has the word washington in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1093829 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'washington' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the united states city whose name contains the word washington."],"info":{}}
{"id":"train_9328","question":"How many partnerships are with Autonomous University of Barcelona?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2652 wd:Q43452 }","paraphrases":["How many partnerships are with AUofB?"],"info":{}}
{"id":"train_9329","question":"Flickr is depends on software ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q103204 wdt:P1547 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9331","question":"What position did Just Fontaine play in 1950?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q192749 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1950' ) ) }","paraphrases":["Give me the position that Just Fontaine played in 1950."],"info":{}}
{"id":"train_9332","question":"Where is the administrative unit of {architecture of India}, whose {administrative centre} is {New Delhi}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q61050 wdt:P131 ?answer . ?answer wdt:P36 wd:Q987 }","paraphrases":["Where is India's administrative unit whose { administrative center } is { New Delhi }?"],"info":{}}
{"id":"train_9334","question":"How much is stated in Zaporizhzhya Oblast?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q171334 wdt:P248 ?obj }","paraphrases":["Zaporizhzhya Oblast provides what value?"],"info":{}}
{"id":"train_9335","question":"Dennis M. Ritchie developed which imperative programming language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P178 wd:Q45575 . ?sbj wdt:P31 wd:Q21562092 }","paraphrases":[],"info":{}}
{"id":"train_9336","question":"Who is the{SCO summit} for {participant of} of {Alexander Lukashenko}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2866 wdt:P1344 ?obj . ?obj wdt:P31 wd:Q30178840 }","paraphrases":["Who is the{SCO summit} for {member of} of {Alexander Lukashenko}"],"info":{}}
{"id":"train_9337","question":"Who studies professional canoeing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20856109 wdt:P3095 ?X . ?X wdt:P425 ?answer }","paraphrases":["Who thinks about proficient canoeing?"],"info":{}}
{"id":"train_9339","question":"Which recreational tool based on Control theory uses the principle of zero-sum game?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q156612 wdt:P2283 ?answer . ?answer wdt:P101 wd:Q6501221 }","paraphrases":["Which recreational tool based on Control theory uses the principle of zero-sum game?"],"info":{}}
{"id":"train_9340","question":"What is the name of the writing system of traditional Chinese characters?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P282 wd:Q178528 . ?sbj wdt:P31 wd:Q55692290 }","paraphrases":["What is the title of the composing framework of conventional Chinese characters?"],"info":{}}
{"id":"train_9341","question":"Name a kingdom where Romanian is spoken","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q7913 . ?sbj wdt:P31 wd:Q417175 }","paraphrases":["Name a kingdom that speaks Romanian"],"info":{}}
{"id":"train_9343","question":"Which is the tributary over the Pont Neuf?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q335277 wdt:P177 ?X . ?X wdt:P974 ?answer }","paraphrases":["Which is the tributary over the Pont Neuf?"],"info":{}}
{"id":"train_9344","question":"Which spacecraft Alan Shepard used in his astronaut mission?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q174979 wdt:P450 ?obj . ?obj wdt:P31 wd:Q7217761 }","paraphrases":["Which shuttle Alan Shepard utilized in his space explorer mission?"],"info":{}}
{"id":"train_9345","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1516634 wdt:P1269 ?answer . ?answer wdt:P1279 ?x FILTER ( contains ( ?x , '28.4' ) ) }","paraphrases":["What is it?"],"info":{}}
{"id":"train_9346","question":"What is the name of All_in_the_Family ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1048856 wdt:P407 ?ans_1 . wd:Q1048856 wdt:P495 ?ans_2 }","paraphrases":["Give me the name of All in the Family."],"info":{}}
{"id":"train_9347","question":"What is Jerry Sienfeld's  fictional company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P170 wd:Q215506 . ?sbj wdt:P31 wd:Q5446565 }","paraphrases":["What is Jerry Sienfeld's anecdotal company?"],"info":{}}
{"id":"train_9348","question":"Which ethnic group speaks Norwegian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q9043 . ?sbj wdt:P31 wd:Q41710 }","paraphrases":["Which ethnic bunch talks Norwegian?"],"info":{}}
{"id":"train_9349","question":"Which locomotive has the most cylinders?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q171043 . ?ent wdt:P1100 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which locomotive has the most cylinders?"],"info":{}}
{"id":"train_9350","question":"What was created in the headquarters of Dream Theater?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q162586 wdt:P740 ?X . ?X wdt:P457 ?answer }","paraphrases":["What was made within the central station of Dream Theater?"],"info":{}}
{"id":"train_9352","question":"Mention the year span and the electoral district area of John Gorton during serving as Member of the Australian House of Representatives","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q356411 p:P39 ?s . ?s ps:P39 wd:Q18912794 . ?s pq:P2715 ?value1 . ?s pq:P768 ?value2 }","paraphrases":["john gorton served as a member of the australian house of representatives in what electoral district area and for what years?"],"info":{}}
{"id":"train_9353","question":"Tell me religious belief whose name has the word pacha in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2728698 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pacha' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the religious belief whose name has the word pacha in it?"],"info":{}}
{"id":"train_9354","question":"What is the age of the oldest person to have an award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q618779 . ?ent wdt:P4135 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the age of the most seasoned individual to have an grant?"],"info":{}}
{"id":"train_9355","question":"How should you administer toluene ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15779 wdt:P1542 ?X . ?X wdt:P636 ?answer }","paraphrases":["How is toluene administered?"],"info":{}}
{"id":"train_9356","question":"What position in public office did Joko Widodo hold?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3318231 wdt:P39 ?obj . ?obj wdt:P31 wd:Q294414 }","paraphrases":["What was Joko Widodo's job position?"],"info":{}}
{"id":"train_9358","question":"who sister city of location born of Shawn Stasiak ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q999056 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["who sister city of area born of Shawn Stasiak ?"],"info":{}}
{"id":"train_9360","question":"Which planet orbits Io?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3123 wdt:P397 ?X . ?X wdt:P398 ?answer }","paraphrases":["What planet does Io orbit?"],"info":{}}
{"id":"train_9361","question":"Which is the proxy war for the event of the Cuban Missile Crisis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P793 wd:Q128160 . ?sbj wdt:P31 wd:Q864113 }","paraphrases":[],"info":{}}
{"id":"train_9363","question":"How many items can the cook operate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q156839 wdt:P121 ?obj }","paraphrases":["Which is the number of items that the cook can operate?"],"info":{}}
{"id":"train_9364","question":"Name a concept studied by sociology that starts with letter S","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q151885 . ?sbj wdt:P2579 wd:Q21201 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a notion studied with the aid of sociology that starts offevolved with letter S"],"info":{}}
{"id":"train_9365","question":"In what year did Robert Falcon Scott receive a Scheele Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q102527 p:P166 ?s . ?s ps:P166 wd:Q15303658 . ?s pq:P585 ?value }","paraphrases":["When did Robert Falcon Scott receive a Scheele Award?"],"info":{}}
{"id":"train_9368","question":"Which kinship has the strongest family relationship degree?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q171318 . ?ent wdt:P4500 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What kinship has the strongest degree of family relationship?"],"info":{}}
{"id":"train_9371","question":"Which is the pair of enantiomers which starts with the letter t?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55662747 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which is the pair of enantiomers which starts with letter t?"],"info":{}}
{"id":"train_9372","question":"Mention the superhero character played in X-Men","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P463 wd:Q128452 . ?sbj wdt:P31 wd:Q188784 }","paraphrases":["Name a member of the Marvel superhero team \"X-Men\""],"info":{}}
{"id":"train_9375","question":"What award did Dmitry Khvorostovsky achieve in 1991?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q333201 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1991' ) ) }","paraphrases":["What award was presented to Dmitry Khvorostovsky in 1991?"],"info":{}}
{"id":"train_9376","question":"Which muscle insertion is use over the rib?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3491 wd:Q196672 }","paraphrases":[],"info":{}}
{"id":"train_9377","question":"What is the location of death of Antonio Canova, whose category of associated people is the Category: People of Venice?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5547 wdt:P20 ?answer . ?answer wdt:P1792 wd:Q7234650 }","paraphrases":["What is the location of death of Antonio Canova, whose category of related people is the Category: People of Venice?"],"info":{}}
{"id":"train_9378","question":"WHICH IS THE CIVIC BUILDING THAT IN ARCHITECTUAL STYLE AND NEOCLASSICAL ACRCHITECTURE THAT STARTS WITH H","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q52177058 . ?sbj wdt:P149 wd:Q54111 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE CIVIC BUILDING THAT IN ARCHITECTUAL STYLE AND NEOCLASSICAL ACRCHITECTURE THAT STARTS WITH H"],"info":{}}
{"id":"train_9379","question":"did the vologda start their administration in 2009-12-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1957 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["did the vologda administration begin in 2009-12-1"],"info":{}}
{"id":"train_9380","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3568653 wdt:P735 ?answer . ?answer wdt:P793 wd:Q21142040 }","paraphrases":["What it is?"],"info":{}}
{"id":"train_9387","question":"Is 0 the the number of houses of the Schuleroch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2251145 wdt:P4080 ?obj filter ( ?obj = 0 ) }","paraphrases":["How many houses are located in Schuleroch?"],"info":{}}
{"id":"train_9388","question":"What was Edith Head statement received as Academy Award for Best Costume Design, Black-and-White?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q234961 p:P166 ?s . ?s ps:P166 wd:Q22120095 . ?s pq:P805 ?value }","paraphrases":["What statement did Edith Head give when she won for Best Costume Design, Black-and-White at the Academy Awards?"],"info":{}}
