{"id":"train_18536","question":"Who's birth place is Belgrade?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q960994 p:P19 ?s . ?s ps:P19 wd:Q3711 . ?s pq:P131 ?value }","paraphrases":["Give me the name of the person whose birth place is Belgrade."],"info":{}}
{"id":"train_18537","question":"Name a yearly celebration occuring during the winter solctice that contains the word \"yule\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q200538 . ?sbj wdt:P837 wd:Q207932 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yule' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a every year celebration occuring all through the iciness solctice that consists of the phrase \"yule\" in its name"],"info":{}}
{"id":"train_18538","question":"What is the role played by the characters in Crash Bandicoot N. Sane Trilogy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26698531 wdt:P674 ?X . ?X wdt:P2868 ?answer }","paraphrases":["What is the part played by the characters in Crash Bandicoot N. Normal Trilogy?"],"info":{}}
{"id":"train_18539","question":"What is Bérose ID for Ruth Benedict?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q228822 wdt:P5333 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18540","question":"What is in the commune of Taraba State that is also a member of Group on Earth Observations?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q463959 wdt:P131 ?answer . ?answer wdt:P463 wd:Q5611262 }","paraphrases":["What is within the commune of Taraba State that's moreover a part of Gather on Soil Observations?"],"info":{}}
{"id":"train_18541","question":"What is the specific cause of death of Lawrence Kohlberg, that was due to a breathing problem?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q311745 wdt:P509 ?answer . ?answer wdt:P828 wd:Q9530 }","paraphrases":["What is the specific motive of death of Lawrence Kohlberg, that was once due to a respiration problem?"],"info":{}}
{"id":"train_18543","question":"what is the significant event of Lewis and Clark Expedition?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P793 wd:Q505802 . ?sbj wdt:P31 wd:Q2543279 }","paraphrases":["Which event is the Lewis and Clark Expedition famous for?"],"info":{}}
{"id":"train_18546","question":"Name an European sport governing body that contains the word \"european\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11422536 . ?sbj wdt:P1001 wd:Q46 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'european' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title an European don administering body that contains the word \"european\" in its name"],"info":{}}
{"id":"train_18549","question":"What is the county seat of Jerusalem, whose name originates from the Tribe of Judah.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1218 wdt:P1376 ?answer . ?answer wdt:P138 wd:Q913564 }","paraphrases":["Name Jerusalem's county seat with a name originating from the Tribe of Judah."],"info":{}}
{"id":"train_18550","question":"What is the bell tower with the highest vertical angle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q200334 . ?ent wdt:P4183 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the steepest stairway into a bell tower?"],"info":{}}
{"id":"train_18551","question":"What are the space velocity which start with the letter velocity","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4234997 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'velocity' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the space speed which begin with the letter velocity"],"info":{}}
{"id":"train_18555","question":"Are the maximum sustained winds of Hurricane Liza less than 90.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q595469 wdt:P2895 ?obj filter ( ?obj < 90.0 ) }","paraphrases":["Were the maximum winds of Hurricane Liza slower than 90.0?"],"info":{}}
{"id":"train_18556","question":"What is runway of Heathrow Airport ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q8691 wdt:P529 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18558","question":"What is the CITES Species+ ID for the loggerhead sea turtle","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q192095 wdt:P2040 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18559","question":"What relative of Walter Gropius died in the town of Haifa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q61071 wdt:P20 ?answer . ?answer wdt:P190 wd:Q41621 }","paraphrases":["What relative of Walter Gropius passed on within the town of Haifa?"],"info":{}}
{"id":"train_18560","question":"What heptalogy starts with the letter \"s\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q614101 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the hepatalogy that starts with the letter s"],"info":{}}
{"id":"train_18561","question":"What is Jennifer Carpenter's role on Dexter?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23577 p:P161 ?s . ?s ps:P161 wd:Q230641 . ?s pq:P453 ?value }","paraphrases":["Who does Jennifer Carpenter play on Dexter?"],"info":{}}
{"id":"train_18562","question":"What country in Zürich did Hermann Weyl die in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q71029 p:P20 ?s . ?s ps:P20 wd:Q72 . ?s pq:P17 ?value }","paraphrases":["Which was the country where Hermann Weyl died in Zürich?"],"info":{}}
{"id":"train_18567","question":"Which is the animated film series that is distributed by Metro-Goldwyn-Mayer and contains the word jerry in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56884562 . ?sbj wdt:P750 wd:Q179200 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'jerry' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the animated film collection that is dispensed by using Metro-Goldwyn-Mayer and incorporates the word jerry in it's name?"],"info":{}}
{"id":"train_18568","question":"Did Spirited Away include the voice actors Mari Natsuki and Bunta Sugawara?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q155653 wdt:P725 wd:Q1190336 . wd:Q155653 wdt:P725 wd:Q1139492 }","paraphrases":["Are Mari Natsuki and Bunta Sugawara voice actors in Spirited Away?"],"info":{}}
{"id":"train_18569","question":"What positive emotion starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60539479 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What positive emotion begins with the letter \"t\"?"],"info":{}}
{"id":"train_18570","question":"What are thenonprofit organization which start with the letter videolan","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q163740 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'videolan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH ARE THENONPROFIT ORGANIZATION THAT BEGIN WITH THE LETTER VIDEOLAN"],"info":{}}
{"id":"train_18572","question":"How was Leon Trotsky assassinated?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q33391 p:P1196 ?s . ?s ps:P1196 ?obj . ?s pq:P805 wd:Q4468600 }","paraphrases":["Tell me how Leon Trotsky was killed."],"info":{}}
{"id":"train_18573","question":"Where is the terminus location of Confederation bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P609 wd:Q865076 }","paraphrases":[],"info":{}}
{"id":"train_18574","question":"What is written by the author of The Book of Disquiet, that has languages of expression is Portuguese.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2632627 wdt:P50 ?answer . ?answer wdt:P1412 wd:Q5146 }","paraphrases":["What is written by the creator of The Book of Disquiet, that has languages of expression is Portuguese."],"info":{}}
{"id":"train_18576","question":"“I have taken a decision, which was not easy for me, to resign as president,” Nazarbayev said in a nationwide TV address, flanked by his country’s blue and yellow flags, before signing a decree terminating his powers from March 20.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57394 wdt:P793 ?X . ?X wdt:P61 ?answer }","paraphrases":["“I have taken a choice, which was not simple for me, to leave as president,” Nazarbayev said in a across the country TV address, flanked by his country’s blue and yellow banners, some time recently marking a declare ending his powers from Walk 20."],"info":{}}
{"id":"train_18578","question":"What is the postal code of Chongqing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11725 wdt:P281 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18580","question":"What Spiegel im Spiegel composition has received the \"Honorary doctor of the university of Liege\" award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q517901 wdt:P86 ?answer . ?answer wdt:P166 wd:Q23700921 }","paraphrases":["What Spiegel im Spiegel composition has gotten the \"Privileged specialist of the college of Liege\" grant?"],"info":{}}
{"id":"train_18581","question":"The Rothschild family has what painting in their collection?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P195 wd:Q159386 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["The Rothschild family has what portray in their collection?"],"info":{}}
{"id":"train_18583","question":"Who is Wonder Woman's sibling?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q338430 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q15711870 }","paraphrases":[],"info":{}}
{"id":"train_18585","question":"Which gravitational-wave detector founded by Kip S. Thorne has the longest wavelength of sensitivity ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2302080 . ?ent wdt:P3737 ?obj . ?ent wdt:P112 wd:Q323320 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the gravitational wave detector with the longest wavelength of sensitivity discovered by Kip S."],"info":{}}
{"id":"train_18586","question":"Name the active ingredient in amoxicillin.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q201928 wdt:P3780 ?obj . ?obj wdt:P31 wd:Q28885102 }","paraphrases":["Title the dynamic fixing in amoxicillin."],"info":{}}
{"id":"train_18587","question":"Which is charted in Like a Rolling Stone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q214430 wdt:P2291 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18590","question":"who contestant of part of series of thats the guy ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14942595 wdt:P179 ?X . ?X wdt:P161 ?answer }","paraphrases":["who contender of portion of arrangement of thats the fellow ?"],"info":{}}
{"id":"train_18592","question":"Which modern language has the largest number of speakers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1288568 . ?ent wdt:P1098 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the most spoken modern language?"],"info":{}}
{"id":"train_18594","question":"When and for what did Jean-Luc Godard receive an Honorary César?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q53001 p:P166 ?s . ?s ps:P166 wd:Q727282 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["When and for what did Jean-Luc Godard obtain an Honorary César?"],"info":{}}
{"id":"train_18598","question":"How does the Phoenician alphabet work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q26752 wdt:P407 ?obj . ?obj wdt:P31 wd:Q34049 }","paraphrases":["How does the Phoenician letter set work?"],"info":{}}
{"id":"train_18601","question":"How many drugs are used to treat anemia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q5445 wdt:P2176 ?obj }","paraphrases":["Did u listed number of drugs used to treat anemia?"],"info":{}}
{"id":"train_18603","question":"What position was occupied by John A. Macdonald and is now held by Alexander Mackenzie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q128702 wdt:P39 ?answer . ?answer wdt:P1308 wd:Q128708 }","paraphrases":["What function used to be occupied via John A. Macdonald and is now held through Alexander Mackenzie?"],"info":{}}
{"id":"train_18604","question":"Who is the {human} for {notable work} of {Flatiron Building}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P800 wd:Q220728 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {outstanding work} of {Flatiron Building}"],"info":{}}
{"id":"train_18605","question":"Who is the mother of Charlemagne, and when did she have Giesela?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q946829 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["When did Charlemagne's mother give birth to Giesela and what is her name?"],"info":{}}
{"id":"train_18606","question":"tell me thunder god starts with z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q842697 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know thunder god begins with z"],"info":{}}
{"id":"train_18609","question":"Tell me the holiday that starts with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1445650 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the occasion that begins with the letter w"],"info":{}}
{"id":"train_18610","question":"Where and when did William Holden die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q95002 wdt:P509 ?ans_1 . wd:Q95002 wdt:P20 ?ans_2 }","paraphrases":["List the location and time when William Holden died."],"info":{}}
{"id":"train_18611","question":"WHICH IS THE UNIT OF VOLUME THAT STARTS WITH C","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1302471 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ć' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE UNIT OF VOLUME THAT Begins WITH C"],"info":{}}
{"id":"train_18612","question":"WHO IS THE COMPETITOR OF BARBARA HEPWORTH?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q234109 wdt:P1344 ?X . ?X wdt:P710 ?answer }","paraphrases":["WHO IS THE COMPETITOR OF BARBARA HEPWORTH?"],"info":{}}
{"id":"train_18613","question":"What films has Francis Ford Coppola been the executive producer of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1431 wd:Q56094 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["What movies has Francis Portage Coppola been the official maker of?"],"info":{}}
{"id":"train_18614","question":"Name the mononanion for the conjugate base of nitric acid.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q83320 wdt:P4149 ?obj . ?obj wdt:P31 wd:Q55523986 }","paraphrases":["Title the mononanion for the conjugate base of nitric acid."],"info":{}}
{"id":"train_18615","question":"Tell me which is the software company which starts with the letter x?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1058914 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE SOFTWARE COMPANY THAT STARTS WITH THE LETTER X"],"info":{}}
{"id":"train_18616","question":"Who wrote the screenplay for Vyasa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P58 wd:Q330521 }","paraphrases":[],"info":{}}
{"id":"train_18620","question":"Tell me the binary star that constellation Canis Major and which that starts with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q50053 . ?sbj wdt:P59 wd:Q10538 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the parallel star that group of stars Canis Major and which that begins with the letter s"],"info":{}}
{"id":"train_18621","question":"Is Aleida Guevara's father Che Guevara?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5809 wdt:P40 wd:Q438288 }","paraphrases":["Is Che Guevara's daughter Aleida Guevara?"],"info":{}}
{"id":"train_18625","question":"What is Saturn V's space lasunch vehicle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P375 wd:Q54363 }","paraphrases":[],"info":{}}
{"id":"train_18630","question":"In which state do most native Americans live?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P172 wd:Q49297 . ?sbj wdt:P31 wd:Q43702 }","paraphrases":["In which state do most local Americans live?"],"info":{}}
{"id":"train_18631","question":"How many screen writers are there for Raging Bull?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q220780 wdt:P58 ?obj }","paraphrases":["For Raging Bull, how many screen writers were there?"],"info":{}}
{"id":"train_18633","question":"West Azarbijan Province, which has boroughs, is in the parish of Kerman Province.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q165352 wdt:P131 ?answer . ?answer wdt:P150 wd:Q134411 }","paraphrases":["West Azarbijan Area, which has boroughs, is within the ward of Kerman Territory."],"info":{}}
{"id":"train_18634","question":"Is Steve Harvey's ethnic group the Igbo people?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2347009 wdt:P172 wd:Q244157 }","paraphrases":["Is the Igbo people Steve Harvey's ethnic group?"],"info":{}}
{"id":"train_18635","question":"What is the material produced of the works by Gosta Bystedt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5591474 wdt:P108 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What is the fabric created of the works by Gosta Bystedt?"],"info":{}}
{"id":"train_18636","question":"Tell me economic indicator whose name has the word soil in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1167393 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'soil' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know financial marker whose title has the word soil in it."],"info":{}}
{"id":"train_18637","question":"What painting of The Starry Night has borders in Noves?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q45585 wdt:P180 ?answer . ?answer wdt:P47 wd:Q474034 }","paraphrases":["What portray of The Starry Night has borders in Noves?"],"info":{}}
{"id":"train_18638","question":"Tell me religious behaviour whose name has the word zakāt in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2110808 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zakāt' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know devout conduct whose title has the word zakāt in it."],"info":{}}
{"id":"train_18639","question":"Which  is discoverer or inventor of Lee de Forest ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P61 wd:Q354863 }","paraphrases":[],"info":{}}
{"id":"train_18641","question":"What is the sport  that is played in Madden NFL, that has instruments played and penalty flags?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1883234 wdt:P641 ?answer . ?answer wdt:P2283 wd:Q583235 }","paraphrases":["What is the don that's played in Anger NFL, that has disobedient played and punishment flags?"],"info":{}}
{"id":"train_18642","question":"What countries are part of the European Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q458 wdt:P150 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What nations are portion of the European Union?"],"info":{}}
{"id":"train_18643","question":"What award did Hilary Mantel receive on 1-1-2009?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q465700 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["Hilary Mantel received which award on 1-1-2009?"],"info":{}}
{"id":"train_18645","question":"When did Tony Blair become the Leader of the Labour Party?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9545 p:P39 ?s . ?s ps:P39 wd:Q3615378 . ?s pq:P580 ?value }","paraphrases":["What year did Tony Blair become President of the Labour Party?"],"info":{}}
{"id":"train_18647","question":"Who is the member of political party of United Russia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P102 wd:Q151469 }","paraphrases":[],"info":{}}
{"id":"train_18648","question":"what is the landscape of venus callipyge, which is equivalent of aphrodite","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q618521 wdt:P180 ?answer . ?answer wdt:P460 wd:Q35500 }","paraphrases":["what is the panorama of venus callipyge, which is equal of aphrodite"],"info":{}}
{"id":"train_18649","question":"IS THE UNITS SOLD OF THE VIRTUAL BOY IS LESS THAN 924000.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q164651 wdt:P2664 ?obj filter ( ?obj < 924000.0 ) }","paraphrases":["IS THE UNITS SOLD OF THE VIRTUAL BOY IS LESS THAN 924000.0"],"info":{}}
{"id":"train_18650","question":"How many people born in the {Andhra Pradesh} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P19 wd:Q1159 }","paraphrases":["This is a list of notable people from Andhra Pradesh, India, throughout history. .... Telugu origin, born in Tamil Nadu; Manepalli Narayana Rao Venkatachaliah ...\n‎Independence advocates · ‎Musicians and dancers · ‎Literature · ‎Award winners\nPeople also search for"],"info":{}}
{"id":"train_18653","question":"What was Sigrid Undset nominated for on January 1st, 1928?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q80889 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1928' ) ) }","paraphrases":["January 1st, 1928 marks the day Sigrid Undset became a nominee for which award?"],"info":{}}
{"id":"train_18655","question":"What award did Hugh Lofting receive in 1923?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q560015 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1923' ) ) }","paraphrases":["Hugh Lofting was awarded what in 1923?"],"info":{}}
{"id":"train_18656","question":"Where is the brigade for commander of Stonewall Jackson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q216124 wdt:P598 ?obj . ?obj wdt:P31 wd:Q102356 }","paraphrases":["Where is the brigade for commander of Stonewall Jackson?"],"info":{}}
{"id":"train_18657","question":"What is the partner city in which John Smith died in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q228024 wdt:P20 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the accomplice city in which John Smith kicked the bucket in?"],"info":{}}
{"id":"train_18658","question":"Does the Alexa rank of Samsung equal 339?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q20716 wdt:P1661 ?obj filter ( ?obj = 339 ) }","paraphrases":["Is 339 the Alexa rank of Samsung?"],"info":{}}
{"id":"train_18661","question":"What is the seat of Frankfurter Allgemeine Zeitung, that is adjacent to Wetteraukreis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10184 wdt:P159 ?answer . ?answer wdt:P47 wd:Q7910 }","paraphrases":["What is the seat of Frankfurter Allgemeine Zeitung, that is adjacent to Wetteraukreis?"],"info":{}}
