{"id":"train_7291","question":"What is the human population or location of narrative or white teeth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q866980 wdt:P840 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Name the human population, or the location of narrative, of white teeth."],"info":{}}
{"id":"train_7292","question":"What areas are located in the administrative territorial entity and are located in the time zone of The Bronx?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q18426 wdt:P131 ?ans_1 . wd:Q18426 wdt:P421 ?ans_2 }","paraphrases":["What areas are located in the time zone of The Bronx and in the administrative territory entity?"],"info":{}}
{"id":"train_7293","question":"what is declaration of independent distributed by james wilson and also which starts with letter d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1464916 . ?sbj wdt:P1891 wd:Q365181 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is declaration of independent distributed by james wilson and also which begins with letter d"],"info":{}}
{"id":"train_7294","question":"Oscar Niemeyer died in Rio de Janeiro, which is located in what country?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q134165 p:P20 ?s . ?s ps:P20 wd:Q8678 . ?s pq:P17 ?value }","paraphrases":["The death of Oscar Niemeyer occurred in Rio De Janeiro, in which country?"],"info":{}}
{"id":"train_7296","question":"\"Who was the member of John William Strutt, 3rd Baron Rayleigh, proceeded in Berlin-Brandenburg Academy of Sciences and Humanities\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83297 wdt:P463 ?answer . ?answer wdt:P156 wd:Q219989 }","paraphrases":["\"Who was the part of John William Strutt, 3rd Aristocrat Rayleigh, continued in Berlin-Brandenburg Foundation of Sciences and Humanities\"?"],"info":{}}
{"id":"train_7297","question":"What was the position held by Louis Philippe I, later replaced by Casimir-Louis-Victurnien de Rochechouart de Mortemart?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7771 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q2756699 }","paraphrases":["What position was held by Louis Philippe I, and then Casimir-Louis-Victurnien De Rochechouart de Mortemart?"],"info":{}}
{"id":"train_7298","question":"Is the spin quantum number of samarium-144 equal to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1862339 wdt:P1122 ?obj filter ( ?obj = 0 ) }","paraphrases":["Is the turn quantum number of samarium-144 rise to to 0?"],"info":{}}
{"id":"train_7299","question":"Where was the royal house of life partner of Stephen Tennant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7610665 wdt:P451 ?X . ?X wdt:P53 ?answer }","paraphrases":["Where was the illustrious house of life accomplice of Stephen Tennant?"],"info":{}}
{"id":"train_7300","question":"What are the resource which start with the letter N","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1554231 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the asset which begin with the letter N"],"info":{}}
{"id":"train_7301","question":"What is the {next job holder} in {West Germany} that is a {member of} an {Asian Development Bank}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q713750 wdt:P1366 ?answer . ?answer wdt:P463 wd:Q188822 }","paraphrases":["What is the {following work holder} in {West Germany} that's a {part of} an {Asian Improvement Bank}?"],"info":{}}
{"id":"train_7304","question":"How many people are convicted of drug possession?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1399 wd:Q1259959 }","paraphrases":["Drug possession convictions effect how many people?"],"info":{}}
{"id":"train_7305","question":"When Michael Ellis DeBakey was awarded as Lomonosov Gold Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q335003 p:P166 ?s . ?s ps:P166 wd:Q1340199 . ?s pq:P585 ?value }","paraphrases":["On what date was Michael Ellis DeBakey awarded the Lomonosov Gold Medal?"],"info":{}}
{"id":"train_7306","question":"When did Fridtjof Nansen recieve the Nobel Peace Prize and how much prize money was awarded?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q72292 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P585 ?value1 . ?s pq:P2121 ?value2 }","paraphrases":["When did Fridtjof Nansen recieve the Nobel Peace Prize and how much prize cash was awarded?"],"info":{}}
{"id":"train_7307","question":"What is the Nationlamuseum Sweden artist ID for Jean Arp","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q153739 wdt:P2538 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7309","question":"The Dreamers' was originally written in the language of what state?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q822946 wdt:P364 ?X . ?X wdt:P17 ?answer }","paraphrases":["The Dreamers' was initially composed within the dialect of what state?"],"info":{}}
{"id":"train_7310","question":"What painting depicts Barack Obama","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P180 wd:Q76 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["What is Barack Obama's picture?"],"info":{}}
{"id":"train_7312","question":"Where did Professor Mohammad Mosaddegh of the University of Paris go to school?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q123037 wdt:P69 ?answer . ?answer wdt:P4195 wd:Q7997009 }","paraphrases":["Where did Teacher Mohammad Mosaddegh of the College of Paris go to school?"],"info":{}}
{"id":"train_7313","question":"What is the ortholog of AVP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P684 wd:Q12009087 }","paraphrases":[],"info":{}}
{"id":"train_7314","question":"Is it true that the unemployment rate of south africa is less than 32.64?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q258 wdt:P1198 ?obj filter ( ?obj < 32.64 ) }","paraphrases":["Is the unemployment rate of South Africa less than 32.64?"],"info":{}}
{"id":"train_7315","question":"Which is the Songfacts artist ID of Lou Reed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q189080 wdt:P5287 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7316","question":"How many connecting lines are there for the Channel Tunnel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q10257 wdt:P81 ?obj }","paraphrases":["The Channel Tunnel has what number of connecting lines?"],"info":{}}
{"id":"train_7317","question":"What is the Zero-marking language that starts with letter I ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34770 . ?sbj wdt:P4132 wd:Q17141330 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the Zero-marking language that starts with letter I ?"],"info":{}}
{"id":"train_7318","question":"Give me the countable set with the lower limit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q185478 . ?ent wdt:P5447 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["As a member of the Chicago Bulls team, how many games did Michael Jordan play and how many points did he score?"],"info":{}}
{"id":"train_7322","question":"Which {uses} the {developer} of {Internet_Protocol} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q8795 wdt:P2283 ?ans_1 . wd:Q8795 wdt:P178 ?ans_2 }","paraphrases":["Which { uses } the { Internet Protocol } developer?"],"info":{}}
{"id":"train_7323","question":"Was Thomas Edison a citizen of the United States of America?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q8743 wdt:P27 wd:Q30 }","paraphrases":["What country was Thomas Edison a citizen of?"],"info":{}}
{"id":"train_7325","question":"Who preceded chairwoman Michael Aresco in the Big East Conference in 2013?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7820700 wdt:P1365 ?answer . ?answer wdt:P488 wd:Q16150145 }","paraphrases":["Who preceded chairwoman Michael Aresco in the Big East Conference in 2013?"],"info":{}}
{"id":"train_7326","question":"Who is the child of Walter Raleigh?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q189144 wdt:P40 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What was the name of Walter Raleigh's kid?"],"info":{}}
{"id":"train_7327","question":"How many allegiance to the Empire of Japan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P945 wd:Q188712 }","paraphrases":["Which is the number of allegiances to the Empire of Japan?"],"info":{}}
{"id":"train_7328","question":"Tell me me a Norse deity whose name consist of the word \"tyr\" and whose worshipped by Norse mythology","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16513881 . ?sbj wdt:P1049 wd:Q128285 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tyr' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a Northern deity whose name is \"tyr\" and whose name is adorned by Northern mythology"],"info":{}}
{"id":"train_7329","question":"what party does mauricio marci like","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q561837 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q7278 }","paraphrases":["what party does mauricio marci like"],"info":{}}
{"id":"train_7331","question":"Name a theater in Russia that performs in Russian.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q7737 . ?sbj wdt:P31 wd:Q24354 }","paraphrases":["Title a theater in Russia that performs in Russian."],"info":{}}
{"id":"train_7335","question":"How many people where on Tour at 2013-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q288 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["Number of people on tour Jan 2013?"],"info":{}}
{"id":"train_7337","question":"At what point in time did the Red Sea Governorate have a population of 288,661?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q30831 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '288661.0' ) ) . ?s pq:P585 ?value }","paraphrases":["What year did the Red Sea Governorate reach a population of 288,661?"],"info":{}}
{"id":"train_7338","question":"What what is high speed train track gauge BY 1435 mm track gauge that starts with LETTERS V","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13402959 . ?sbj wdt:P1064 wd:Q1999572 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is tall speed prepare track gage BY 1435 mm track gage that begins with LETTERS V"],"info":{}}
{"id":"train_7339","question":"Which award was received by Pieter van den Hoogenband for participating in Swimming at the 2004 Summer Olympics – Men's 100 metre freestyle?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q298723 p:P1344 ?s . ?s ps:P1344 wd:Q727687 . ?s pq:P166 ?value }","paraphrases":["What award did Pieter van den Hoogenband win for swimming in the Men's 100 metre freestyle at the 2004 Summer Olympics?"],"info":{}}
{"id":"train_7341","question":"Does the 9820 Hempel have an orbital inclination greater than 0.21512?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q538466 wdt:P2045 ?obj filter ( ?obj > 0.21512 ) }","paraphrases":["Is the orbital inclination of the 9820 Hempel greater than 0.211512?"],"info":{}}
{"id":"train_7342","question":"Which is the democratic republic that applies to jurisdiction of U.S. Declaration of Independence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q127912 wdt:P1001 ?obj . ?obj wdt:P31 wd:Q5255892 }","paraphrases":["Which is the law based republic that applies to ward of U.S. Assertion of Independence?"],"info":{}}
{"id":"train_7343","question":"When did Fredrich Bessel win the Gold Medal of the Royal Astronomical Society?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q75845 p:P166 ?s . ?s ps:P166 wd:Q753072 . ?s pq:P585 ?value }","paraphrases":["What year did Fredrich Bessel with the Royal Astronomical Society Gold Metal?"],"info":{}}
{"id":"train_7345","question":"What is the position did William Henry Bragg have in the Royal Society, start and end date?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q133747 p:P39 ?s . ?s ps:P39 wd:Q55713110 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["What is the start and end date of the position did William Henry Bragg have?"],"info":{}}
{"id":"train_7346","question":"Mention the person responsible for heading the chairperson-ship of Social Democratic Party of Germany","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q49768 wdt:P488 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Specify the individual capable for heading the chairperson-ship of Social Equitable Party of Germany"],"info":{}}
{"id":"train_7348","question":"What job does Jean-Antoine-Nicolas de Caritat de Condorcet have and when did he retire?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q201477 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["What job does Jean-Antoine-Nicolas de Caritat de Condorcet have and when did he retire?"],"info":{}}
{"id":"train_7350","question":"How many native Malagasy works are there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P364 wd:Q7930 }","paraphrases":["There is what number of native Malagasy works?"],"info":{}}
{"id":"train_7352","question":"When did studio album for language of work or name of English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q1860 . ?sbj wdt:P31 wd:Q208569 }","paraphrases":[],"info":{}}
{"id":"train_7356","question":"Name a psychopathological symptom of bipolar disorder.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q131755 wdt:P780 ?obj . ?obj wdt:P31 wd:Q30897648 }","paraphrases":[],"info":{}}
{"id":"train_7357","question":"\"Who is {developer} of {quicksort}, which has {doctoral student} is {Augusto Sampaio} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q486598 wdt:P61 ?answer . ?answer wdt:P185 wd:Q16466596 }","paraphrases":["\"Who is {engineer} of {quicksort}, which has {doctoral understudy} is {Augusto Sampaio} ?\"\""],"info":{}}
{"id":"train_7358","question":"What is the ranking of Russia at the FIFA World Cup?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7381959 . ?ent wdt:P1352 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["In the FIFA World Cup, Russia currently holds which ranking?"],"info":{}}
{"id":"train_7361","question":"Who is the {pharmaceutical product} for {has active ingredient} of {hydrogen peroxide}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3781 wd:Q171877 . ?sbj wdt:P31 wd:Q28885102 }","paraphrases":["Who is the {pharmaceutical item} for {has dynamic fixing} of {hydrogen peroxide}"],"info":{}}
{"id":"train_7362","question":"Tell me about Yuri Gagarin's spaceflight.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7327 wdt:P450 ?obj . ?obj wdt:P31 wd:Q752783 }","paraphrases":["Let me know around Yuri Gagarin's spaceflight."],"info":{}}
{"id":"train_7364","question":"What is the consumer price index inflation rate that comes from of Zeno's Conscience?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2630581 wdt:P495 ?X . ?X wdt:P1279 ?answer }","paraphrases":["What is the customer cost record expansion rate that comes from of Zeno's Conscience?"],"info":{}}
{"id":"train_7365","question":"What is the series Nanda Empire followed by?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q949268 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What is the arrangement Nanda Realm taken after by?"],"info":{}}
{"id":"train_7366","question":"The story Hamilton, based on Alexander Hamilton, was written by what author?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q19320959 p:P144 ?s . ?s ps:P144 wd:Q54016147 . ?s pq:P50 ?value }","paraphrases":["Which author wrote the story, Hamilton, based of Alexander Hamilton?"],"info":{}}
{"id":"train_7368","question":"What is the gender or a eunuch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P21 wd:Q179294 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is the gender of a eunuch?"],"info":{}}
{"id":"train_7371","question":"What is the physical phenomenon measured by inertial mass that tsarts with letter I","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1293220 . ?sbj wdt:P1880 wd:Q843816 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the physical wonder measured by inertial mass that tsarts with letter I"],"info":{}}
{"id":"train_7372","question":"What is the diplomatic relation of Denmark, that has a total fertility rate of 4.481?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35 wdt:P530 ?answer . ?answer wdt:P4841 ?x FILTER ( contains ( ?x , '4.481' ) ) }","paraphrases":["What is Denmark's diplomatic relations, a country with a fertility rate of 4.481?"],"info":{}}
{"id":"train_7373","question":"What subject is the inverse of functional programming?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q193076 wdt:P461 ?X . ?X wdt:P1269 ?answer }","paraphrases":["Name the opposite of functional programming."],"info":{}}
{"id":"train_7374","question":"Tell me which logographic writing system is used by the Japanese.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1269 wd:Q5287 . ?sbj wdt:P31 wd:Q3953107 }","paraphrases":["Let me know which logographic composing framework is utilized by the Japanese."],"info":{}}
{"id":"train_7375","question":"Who gave the{co-founder} of {software publisher} of {The Fall of Kelvin Walker: A Fable of the Sixties} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7733205 wdt:P123 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who co-founded the software publishing part of The Fall of Kevin Walker: A Fable of the Sixties?"],"info":{}}
{"id":"train_7376","question":"How endemic is South Australia to it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P183 wd:Q35715 }","paraphrases":["This category contains flora that are native to South Australia. Taxa of the lowest rank are always included. Higher taxa are included only if endemic."],"info":{}}
{"id":"train_7377","question":"Which was the cost of Titanic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q44578 wdt:P2130 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7379","question":"Tell me realm of the death whose name has the word spirit  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q443814 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'spirit' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the realm of death in which the word spirit has its name."],"info":{}}
{"id":"train_7380","question":"Since what time, Tenzin Gyatso has citizenship at People's Republic of China?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q17293 p:P27 ?s . ?s ps:P27 wd:Q148 . ?s pq:P580 ?value }","paraphrases":["How long has Tenzin Gyatso been a citizen at People's Republic of China?"],"info":{}}
{"id":"train_7381","question":"What is the male toponyym of Lorentz's trasnformation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q217255 wdt:P138 ?answer . ?answer wdt:P21 wd:Q6581097 }","paraphrases":["What is the male toponym of the transnformation of Lorentz?"],"info":{}}
{"id":"train_7383","question":"Which is the bibliographic citation mentioned by Ayumi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40345998 wdt:P1441 ?X . ?X wdt:P2860 ?answer }","paraphrases":["Which is the bibliographic quotation specified by Ayumi?"],"info":{}}
{"id":"train_7384","question":"What is ZooBank author ID of Albert Günther?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q57514 wdt:P2006 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7385","question":"Which administrative centre of Kingdom of Galicia–Volhynia ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q239502 wdt:P36 ?X . ?X wdt:P1376 ?answer }","paraphrases":["Galicia-Volhynia is the administrative centre of which Kingdom?"],"info":{}}
{"id":"train_7387","question":"Who is the {written work} for {based on} of {Forrest Gump}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q134773 wdt:P144 ?obj . ?obj wdt:P31 wd:Q47461344 }","paraphrases":["Who is the {composed work} for {based on} of {Forrest Gump}"],"info":{}}
{"id":"train_7388","question":"Name the electrical connector part that starts with letter U and appeared in SB Implementers Forum.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58184783 . ?sbj wdt:P123 wd:Q3847420 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the electrical connector phase that starts offevolved with letter U and appeared in SB Implementers Forum."],"info":{}}
{"id":"train_7391","question":"What was the religion of Stefan Nemanja during 1143?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q298612 p:P140 ?s . ?s ps:P140 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1143' ) ) }","paraphrases":["During 1143, what was the religion of Stefan Nemanja?"],"info":{}}
{"id":"train_7392","question":"Tell me schism whose name has the word schism in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41521 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'schism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the schism whose name contains the word schism."],"info":{}}
{"id":"train_7394","question":"Who was member of the board of the directors and developer of Mac OS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43627 wdt:P178 ?X . ?X wdt:P3320 ?answer }","paraphrases":["Give me the name of the person who was a member of the board of directors and the developer of Mac OS."],"info":{}}
{"id":"train_7395","question":"Who is the secretary general for Christian Democratic Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q49762 wdt:P3975 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7396","question":"What periodization contains the word \"wilhelmine\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q816829 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wilhelmine' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What periodization contains the word \"wilhelmine\" in its name?"],"info":{}}
{"id":"train_7397","question":"Tell me flux whose name has the word flux in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6485344 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'flux' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know flux whose title has the word flux in it."],"info":{}}
{"id":"train_7398","question":"In what language is flour pronounced as Sv-mjöl.ogg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36465 p:P443 ?s . ?s ps:P443 ?x filter ( contains ( ?x , 'Sv-mjöl.ogg' ) ) . ?s pq:P407 ?value }","paraphrases":["Which is the language in which flour is pronounced as Sv-mjölogg?"],"info":{}}
