{"id":"train_11750","question":"Name a color that contain the word \"yellow \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1075 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yellow' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a color in its name containing the word \"yellow\""],"info":{}}
{"id":"train_11751","question":"What is {colour} of {team} of {Maurice Wellock} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6793531 wdt:P54 ?X . ?X wdt:P462 ?answer }","paraphrases":["What color is Maurice Wellock's team?"],"info":{}}
{"id":"train_11752","question":"What is the name of IGO of United Nations General Assembly?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P355 wd:Q47423 . ?sbj wdt:P31 wd:Q245065 }","paraphrases":["Is the gag speed of a gun F. Ascaso rise to to 304.0?"],"info":{}}
{"id":"train_11753","question":"What essays are contained in,\" The Federalist Papers\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1433 wd:Q858036 . ?sbj wdt:P31 wd:Q35760 }","paraphrases":["What expositions are contained within,\" The Federalist Papers\"?"],"info":{}}
{"id":"train_11754","question":"Which HyperText Markup Language series W3C recommendation comprises of  the letters html5 in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2661442 . ?sbj wdt:P179 wd:Q8811 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'html5' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which HyperText Markup Language collection W3C suggestion contains of the letters html5 in its name?"],"info":{}}
{"id":"train_11756","question":"What are the orbits of the Local Bubble that are part of the constellation Orion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q329182 wdt:P397 ?answer . ?answer wdt:P59 wd:Q8860 }","paraphrases":["What are the circles of the Neighborhood Bubble that are portion of the group of stars Orion?"],"info":{}}
{"id":"train_11757","question":"Which municipal flag applies to rome jurisdiction","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1001 wd:Q220 . ?sbj wdt:P31 wd:Q21850100 }","paraphrases":[],"info":{}}
{"id":"train_11758","question":"What are the direct-controlled municipality which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1208802 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the direct-controlled district which begin with the letter t"],"info":{}}
{"id":"train_11760","question":"How many honorific prefixes relate to Sir?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P511 wd:Q209690 }","paraphrases":["Give me the honorific prefixes that relate to Sir."],"info":{}}
{"id":"train_11762","question":"Which country is the Hebrew language spoken?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q9288 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["Which nation is the Hebrew language spoken?"],"info":{}}
{"id":"train_11763","question":"Which jobs did the characters of Pinocchio have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4341553 wdt:P674 ?X . ?X wdt:P106 ?answer }","paraphrases":["Which jobs did the characters of Pinocchio have?"],"info":{}}
{"id":"train_11765","question":"In what division is the service operator of Airbus A380?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5830 wdt:P137 ?X . ?X wdt:P199 ?answer }","paraphrases":["The service operator of Airbus A380 is a part of what division?"],"info":{}}
{"id":"train_11768","question":"how many visitors did the statue of liberty receive in 2018","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9202 p:P1174 ?s . ?s ps:P1174 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2018' ) ) }","paraphrases":["5"],"info":{}}
{"id":"train_11769","question":"What was the position held by Bramwell Booth in 1929?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2923664 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1929' ) ) }","paraphrases":["What position did Bramwell Booth hold in 1929?"],"info":{}}
{"id":"train_11770","question":"What part of Malmö has an area of 2.371?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2211 p:P2046 ?s . ?s ps:P2046 ?x filter ( contains ( ?x , '2.371' ) ) . ?s pq:P518 ?value }","paraphrases":["Which part of Malmö has an area of 2.371?"],"info":{}}
{"id":"train_11771","question":"What is needed for sailing a ship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170483 wdt:P2283 ?X . ?X wdt:P3095 ?answer }","paraphrases":["what is necessary to sail a ship?"],"info":{}}
{"id":"train_11776","question":"Tell me municipal corporation in India whose name has the word nagar in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6936225 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'nagar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know civil organization in India whose title has the word nagar in it."],"info":{}}
{"id":"train_11780","question":"When did Las Palmas de Gran Canaria have a population of 383050.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11974 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '383050.0' ) ) . ?s pq:P585 ?value }","paraphrases":["What date did Las Palmas de Gran Canaria have a population of 383,050?"],"info":{}}
{"id":"train_11781","question":"name a textile fibre made of Bombyx mori that starts with letter S","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3071311 . ?sbj wdt:P1582 wd:Q134747 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["name a textile fibre made of Bombyx mori that begins with letter S"],"info":{}}
{"id":"train_11782","question":"What item was used in the birth of Victor E. Renuart, Jr.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2522312 wdt:P241 ?X . ?X wdt:P121 ?answer }","paraphrases":["What thing was utilized within the birth of Victor E. Renuart, Jr.?"],"info":{}}
{"id":"train_11784","question":"which aircraft is driving the fastest on take-off?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15056995 . ?ent wdt:P2430 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What aircraft has he fastest take-off speed?"],"info":{}}
{"id":"train_11785","question":"What college down shares a border with Munich?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q1726 . ?sbj wdt:P31 wd:Q1187811 }","paraphrases":["What college down offers a border with Munich?"],"info":{}}
{"id":"train_11788","question":"Is the number of works for the school equal 7?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q30668273 wdt:P3740 ?obj filter ( ?obj = 7 ) }","paraphrases":["Does 7 equal to the number of works for the school?"],"info":{}}
{"id":"train_11789","question":"Where does one apply the starch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41534 wdt:P1542 ?X . ?X wdt:P636 ?answer }","paraphrases":["Where does one apply the starch?"],"info":{}}
{"id":"train_11793","question":"Is the mass of the Procyon less than 1.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13034 wdt:P2067 ?obj filter ( ?obj < 1.8 ) }","paraphrases":["Is the Procyon's mass less than 1.8?"],"info":{}}
{"id":"train_11795","question":"what was the end time for Clifford Geertz has employer as University of Chicago?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q310956 p:P108 ?s . ?s ps:P108 wd:Q131252 . ?s pq:P582 ?value }","paraphrases":["When did the University of Chicago fire Clifford Geertz?"],"info":{}}
{"id":"train_11796","question":"\"Which prize received by Martha Graham, has another one of the winners named Lynn Fontanne?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q487604 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q242484 }","paraphrases":["\"Which prize gotten by Martha Graham, has another one of the victors named Lynn Fontanne?\""],"info":{}}
{"id":"train_11801","question":"What are the concepts that contain the word \"übersarung\" in their name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q151885 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'übersarung' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the concepts that contain the word \"übersarung\" in their title ?"],"info":{}}
{"id":"train_11802","question":"Who is the film director for The Star Wars Holiday Special?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1538082 wdt:P57 ?X . ?X wdt:P69 ?answer }","paraphrases":["The Star Wars Holiday Special was directed by whom?"],"info":{}}
{"id":"train_11803","question":"What record is the held for disc golf and where is it held?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q876737 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P276 ?value1 . }","paraphrases":["What is the disc golf record and where is it kept?"],"info":{}}
{"id":"train_11804","question":"What what is economic crisis has cause Wall Street Crash of 1929 and also which starts with letter d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q290178 . ?sbj wdt:P828 wd:Q201684 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is economic crisis has motive Wall Street Crash of 1929 and additionally which starts with letter d"],"info":{}}
{"id":"train_11806","question":"What combustible gas with the highest IDLH exists in humans?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21073026 . ?ent wdt:P2129 ?obj . ?ent wdt:P703 wd:Q15978631 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the combustible gas that has the highest IDLH existing in humans"],"info":{}}
{"id":"train_11807","question":"Who were Apollo's partner's Muses?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P451 wd:Q37340 . ?sbj wdt:P31 wd:Q66016 }","paraphrases":["Give the names of the Greek God Apollo's spouse's Muses."],"info":{}}
{"id":"train_11808","question":"TELL ME EMIRATE OF THE UNITED ARAB EMIRATES WHOSE NAME HAS THE WORD FUJAIRAH IN IT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19833031 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'fujairah' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know EMIRATE OF THE Joined together Middle easterner EMIRATES WHOSE Title HAS THE WORD FUJAIRAH IN IT"],"info":{}}
{"id":"train_11809","question":"Tell me forensic technique whose name has the word dnain it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q456443 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dna' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know measurable method whose title has the word dnain it."],"info":{}}
{"id":"train_11815","question":"What can you use to treat signs of lead poisoning?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q110315 wdt:P780 ?X . ?X wdt:P2176 ?answer }","paraphrases":["How can you treat the symptoms of lead poisoning?"],"info":{}}
{"id":"train_11816","question":"How much Bourbon whiskey is used to make a mint julep?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q616477 p:P186 ?s . ?s ps:P186 wd:Q543127 . ?s pq:P1114 ?value }","paraphrases":["A mint julep contains how much Bourbon whiskey?"],"info":{}}
{"id":"train_11817","question":"Moon Jae-in is the head of state of which sovereign state ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P35 wd:Q21001 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_11819","question":"Tell me the region of the Czech Republic that is the twinned administrative body of Hamburg.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1055 wdt:P190 ?obj . ?obj wdt:P31 wd:Q38911 }","paraphrases":["Tell me the Czech Republic region which is Hamburg's twinned administrative body."],"info":{}}
{"id":"train_11823","question":"What area of the South Bohemian Region has a male population of 637,834?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q188373 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '637834.0' ) ) . ?s pq:P1540 ?value }","paraphrases":["Which area has a male population of 637,834 in South Bohemian?"],"info":{}}
{"id":"train_11824","question":"Was Charles_II_of_England's childs George FitzRoy, 1st Duke of Northumberland and Lady Mary Tudor","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q122553 wdt:P40 wd:Q2346374 . wd:Q122553 wdt:P40 wd:Q4983566 }","paraphrases":["Was the 1st Duke of Northumberland and Lady Mary Tudor, George FitzRoy, the child of Charles II of England?"],"info":{}}
{"id":"train_11825","question":"Is the minimum age of the Category 1 0.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23830576 wdt:P2899 ?obj filter ( ?obj = 0.0 ) }","paraphrases":["Is the least age of the Category 1 0.0?"],"info":{}}
{"id":"train_11827","question":"which reserve currency has the highest price?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q756202 . ?ent wdt:P2284 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the highest priced world currency?"],"info":{}}
{"id":"train_11828","question":"Is it true that Buddy Holly signed with Brunswick and CNR Records?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5977 wdt:P264 wd:Q994175 . wd:Q5977 wdt:P264 wd:Q2553853 }","paraphrases":["Did Buddy Holly actually sign with Brunswick and CNR Records?"],"info":{}}
{"id":"train_11829","question":"What is a prescribed drug for strokes that is capable of inhibiting or preventing the pathological process of cerebrovascular disease?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12202 wdt:P2176 ?answer . ?answer wdt:P2175 wd:Q3010352 }","paraphrases":["What is a prescribed drug for strokes that is capable of inhibiting or stopping the pathological process of cerebrovascular disease?"],"info":{}}
{"id":"train_11830","question":"WHICH IS THE PHASE OF LIFE THAT CONTAINS THE WORD ZYGOSPORE IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1811014 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zygospore' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE PHASE OF LIFE THAT CONTAINS THE WORD ZYGOSPORE IN THEIR NAME"],"info":{}}
{"id":"train_11831","question":"Where did Madam C. J. Walker, a member of ASEAN Regional Forum, deceased at?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q447716 wdt:P20 ?answer . ?answer wdt:P463 wd:Q7886981 }","paraphrases":["Where did Madam C. J. Walker, a part of ASEAN Territorial Gathering, perished at?"],"info":{}}
{"id":"train_11832","question":"Which religion affiliation was established by Mahendra Sūri?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6733781 wdt:P140 ?X . ?X wdt:P112 ?answer }","paraphrases":["Which religion association was set up by Mahendra Sūri?"],"info":{}}
{"id":"train_11835","question":"Which cult film did Francis Ford Coppola direct?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P57 wd:Q56094 . ?sbj wdt:P31 wd:Q219557 }","paraphrases":["Give me the name of the cult film that Francis Ford Coppola directed."],"info":{}}
{"id":"train_11838","question":"Provide a programming language that contained the word zpl in their name used for array programming  paradigm.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9143 . ?sbj wdt:P3966 wd:Q4795882 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zpl' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give a programming dialect that contained the word zpl in their title utilized for cluster programming paradigm."],"info":{}}
{"id":"train_11840","question":"Name the unit used to measure mass quantity that starts with letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3647172 . ?sbj wdt:P111 wd:Q11423 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the unit used to measure mass quantity that begins with letter w"],"info":{}}
{"id":"train_11842","question":"Bill Gates is the chairperson for what private foundation located in the United States?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P488 wd:Q5284 . ?sbj wdt:P31 wd:Q7246202 }","paraphrases":["Bill Doors is the chairperson for what private establishment found within the Joined together States?"],"info":{}}
{"id":"train_11843","question":"When did William Jones become a Fellow of the Royal Society?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q371877 p:P166 ?s . ?s ps:P166 wd:Q15631401 . ?s pq:P585 ?value }","paraphrases":["William Jones became a Fellow of the Royal Society on what date?"],"info":{}}
{"id":"train_11844","question":"Who is the manager/director of BBC?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9531 wdt:P1037 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Give me the name of the manager or director of BBC."],"info":{}}
{"id":"train_11846","question":"What is the birth place of Margery Williams that has town and is part of the London Borough of Ealing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q948301 wdt:P19 ?answer . ?answer wdt:P150 wd:Q207218 }","paraphrases":["What is the birth put of Margery Williams that has town and is portion of the London Borough of Ealing?"],"info":{}}
{"id":"train_11847","question":"What was the population of South Dakota in the year 2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1211 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["South Dakota had how many residents in the year 2000?"],"info":{}}
{"id":"train_11850","question":"What is the name of the sister town of the location of birth of Troy Fraser ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7846826 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the title of the sister town of the area of birth of Troy Fraser ?"],"info":{}}
{"id":"train_11851","question":"Is it true that the number of seats of Coles equals to 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5355257 wdt:P1342 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is it genuine that the number of seats of Coles rises to to 1?"],"info":{}}
{"id":"train_11852","question":"Who was born in Hugh Griffith near a body of water?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q310934 wdt:P19 ?X . ?X wdt:P206 ?answer }","paraphrases":["Was Hugh Griffith born near a body of water?"],"info":{}}
{"id":"train_11853","question":"What is the {scientific area} of {correspondence at} of {Emil Baumgartel}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1335827 wdt:P485 ?X . ?X wdt:P101 ?answer }","paraphrases":["What is the {logical range} of {correspondence at} of {Emil Baumgartel}?"],"info":{}}
{"id":"train_11855","question":"when did gregory of nyssa die in circa?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q191734 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1480 wd:Q5727902 }","paraphrases":["The year Gregory of Nyssa died?"],"info":{}}
{"id":"train_11856","question":"Which is the spoken text audio for median?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q226995 wdt:P989 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11857","question":"In what year was Joan Sutherland awarded a Royal Philharmonic Society Gold Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q207269 p:P166 ?s . ?s ps:P166 wd:Q27575234 . ?s pq:P585 ?value }","paraphrases":["The Royal Philharmonic Society Gold Medal was awarded to Joan Sutherland in which year?"],"info":{}}
{"id":"train_11858","question":"what are the newscast which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1358344 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the newscast starting with the letter w"],"info":{}}
{"id":"train_11860","question":"Who is the chairperson of Durica Jojkić's committee?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12747513 wdt:P102 ?X . ?X wdt:P488 ?answer }","paraphrases":["Give me the name of the chairperson of Durica Jojkić's committee."],"info":{}}
{"id":"train_11862","question":"Whicth is {criterion used} for{Laissez faire} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1013 wd:Q171990 }","paraphrases":[],"info":{}}
{"id":"train_11864","question":"What key event is written about in the Comprehensive Guide to the Country of Durham (1892 edition)?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q53574467 wdt:P50 ?X . ?X wdt:P793 ?answer }","paraphrases":["What key occasion is composed almost within the Comprehensive Direct to the Nation of Durham (1892 edition)?"],"info":{}}
{"id":"train_11866","question":"Are Princess Feodora Of Leiningen and Queen Victoria related?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9439 p:P3373 ?s . ?s ps:P3373 wd:Q60508 . ?s pq:P1039 ?value }","paraphrases":["Are Princess Feodora Of Leiningen and Queen Victoria family?"],"info":{}}
{"id":"train_11867","question":"When did Carlos Fuentes use the alias Emmanuel Matta?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q154691 p:P742 ?s . ?s ps:P742 ?x filter ( contains ( ?x , 'Emmanuel Matta' ) ) . ?s pq:P582 ?value }","paraphrases":["When did Carlos Fuentes go by Emmanuel Matta?"],"info":{}}
{"id":"train_11868","question":"Tell me how to use academic discipline for syntax?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1152399 wdt:P101 ?X . ?X wdt:P2283 ?answer }","paraphrases":["Let me know how to utilize scholarly teach for syntax?"],"info":{}}
{"id":"train_11869","question":"Tell me area of law whose name has the word law in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1756157 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'law' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me area of law whose name has the word law in it."],"info":{}}
{"id":"train_11870","question":"Which is {manifestation of} of {work} of {Johann Reinhard Kistner} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55685289 wdt:P106 ?X . ?X wdt:P1557 ?answer }","paraphrases":["What work is Johann Reinhard Kistner best known for?"],"info":{}}
{"id":"train_11872","question":"When did Severus Snape stop being the headmaster of Hogwarts?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q176772 p:P39 ?s . ?s ps:P39 wd:Q2473303 . ?s pq:P582 ?value }","paraphrases":["on what serverus snape stop being the headmaster of hogwarts?"],"info":{}}
