{"id":"train_2092","question":"Who is the publisher and illustrator of The Little Prince?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q25338 wdt:P123 ?ans_1 . wd:Q25338 wdt:P110 ?ans_2 }","paraphrases":["Give me the names publisher and illustrator of The Little Prince."],"info":{}}
{"id":"train_2093","question":"What subclass model of spaceship has the longest shelf life?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q29048322 . ?ent wdt:P4218 ?obj . ?ent wdt:P279 wd:Q40218 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the subclass model of spaceship with the greatest service life."],"info":{}}
{"id":"train_2094","question":"Tell me artistic theme whose name has the word theotokos in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1406161 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'theotokos' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know imaginative subject whose title has the word theotokos in it."],"info":{}}
{"id":"train_2096","question":"With a population of 434516, what is the capital of Majorca?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8828 wdt:P36 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '434516' ) ) }","paraphrases":["With a population of 434516, what is the capital of Majorca?"],"info":{}}
{"id":"train_2097","question":"Who is the father of Nefertiti?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40930 wdt:P3373 ?answer . ?answer wdt:P22 wd:Q146029 }","paraphrases":["Who is the father of Nefertiti?"],"info":{}}
{"id":"train_2098","question":"Is Uruguay's minimum age for compulsory education the number 6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q77 wdt:P3270 ?obj filter ( ?obj = 6 ) }","paraphrases":["Is Uruguay's least age for obligatory instruction the number 6?"],"info":{}}
{"id":"train_2099","question":"What is the earliest date for John the Baptist's death in the year 30?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q40662 p:P570 ?s . ?s ps:P570 ?x filter ( contains ( ?x , '30-0-0' ) ) . ?s pq:P1319 ?value }","paraphrases":["For the death of John the Baptist in the year 30, what is the earliest date?"],"info":{}}
{"id":"train_2100","question":"Tell me freeway network whose name has the word system in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55504191 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'system' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know expressway arrange whose title has the word framework in it."],"info":{}}
{"id":"train_2103","question":"When was Niels Bohr  awarded the Nobel Prize in Physics? How much was he awarded?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q7085 p:P166 ?s . ?s ps:P166 wd:Q38104 . ?s pq:P585 ?value1 . ?s pq:P2121 ?value2 }","paraphrases":["When was once Niels Bohr awarded the Nobel Prize in Physics? How much used to be he awarded?"],"info":{}}
{"id":"train_2104","question":"Which is the Scoresway soccer person ID for Gareth Bale?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q184586 wdt:P3043 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2105","question":"What are the writing system which start with the letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8192 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the composing framework which begin with the letter W"],"info":{}}
{"id":"train_2106","question":"What silent short film depicts Richard III of England?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q133028 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q20667187 }","paraphrases":["What noiseless brief film portrays Richard III of Britain?"],"info":{}}
{"id":"train_2108","question":"IS THE TIME IN SPACE OF CATHERINE COLEMAN EQUALS TO 207552.O","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7468 wdt:P2873 ?obj filter ( ?obj = 207552.0 ) }","paraphrases":["IS THE TIME IN SPACE OF CATHERINE COLEMAN Rises to TO 207552.O"],"info":{}}
{"id":"train_2109","question":"Which is the Ethnologue language status for Esperanto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q143 wdt:P3823 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2110","question":"What goddess was from the Inca Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P27 wd:Q28573 . ?sbj wdt:P31 wd:Q205985 }","paraphrases":[],"info":{}}
{"id":"train_2111","question":"which doctrine starts with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q117850 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which tenet begins with the letter t"],"info":{}}
{"id":"train_2112","question":"What is Mathematical Reviews ID for Gérard Debreu ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q210960 wdt:P889 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2114","question":"What insectiside which contains phosphorus has the highest melting point?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q181322 . ?ent wdt:P2101 ?obj . ?ent wdt:P527 wd:Q674 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Please provide the name of the insecticide with the highest melting point that contains phosphorus."],"info":{}}
{"id":"train_2115","question":"When did the Auschwitz concentration camp become Nazi concentration camp?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7341 p:P31 ?s . ?s ps:P31 wd:Q328468 . ?s pq:P580 ?value }","paraphrases":["On what date was the Auschwitz concentration camp changed to the Nazi concentration camp?"],"info":{}}
{"id":"train_2117","question":"What is the opposite of a positron that is pulled by gravity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3229 wdt:P2152 ?answer . ?answer wdt:P517 wd:Q11412 }","paraphrases":["What is the inverse of a positron that's pulled by gravity?"],"info":{}}
{"id":"train_2118","question":"How many collections are in the Royal Danish Library?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P195 wd:Q867885 }","paraphrases":["What collections does the Royal Danish Library have?"],"info":{}}
{"id":"train_2120","question":"What editor is used in Dewey Decimal Classification","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q48460 wdt:P98 ?obj . ?obj wdt:P31 wd:Q4539 }","paraphrases":["Who is the editor of the Dewey Decimal Classification?"],"info":{}}
{"id":"train_2122","question":"What are the inhabitants of the studio where Halloween was filmed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q221103 wdt:P915 ?X . ?X wdt:P1082 ?answer }","paraphrases":["What are the occupants of the studio where Halloween was filmed?"],"info":{}}
{"id":"train_2123","question":"What causes Higgs boson to have a mean lifetime of 1e-05?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q402 p:P2645 ?s . ?s ps:P2645 ?x filter ( contains ( ?x , '1e-05' ) ) . ?s pq:P1013 ?value }","paraphrases":["Why does Higgs boson have a mean lifetime of 1e-05?"],"info":{}}
{"id":"train_2125","question":"What is the birthplace of Yi Xing, that borders Anhui.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q710705 wdt:P19 ?answer . ?answer wdt:P47 wd:Q40956 }","paraphrases":["What is the origin of Yi Xing, that borders Anhui."],"info":{}}
{"id":"train_2126","question":"What are the data serialization format that contains the word yaml in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24451526 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yaml' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the information serialization position that contains the word yaml in their name"],"info":{}}
{"id":"train_2127","question":"IS THE SUBLIMATION TEMPERTATURE OF THE SYNTHETIC GRAPHITE GREATER THAN 7922.4","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q21057320 wdt:P2113 ?obj filter ( ?obj > 7922.4 ) }","paraphrases":["S THE SUBLIMATION TEMPERTATURE OF THE Manufactured GRAPHITE More noteworthy THAN 7922.4"],"info":{}}
{"id":"train_2128","question":"In what year did Raghuram Rajan receive the Fischer Black Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q981496 p:P166 ?s . ?s ps:P166 wd:Q741683 . ?s pq:P585 ?value }","paraphrases":["Raghuram Rajan received the Fischer Black prize in what year?"],"info":{}}
{"id":"train_2129","question":"When was Whoopi Goldberg has received award for British Academy of Film and Television Arts?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q49001 p:P166 ?s . ?s ps:P166 wd:Q159661 . ?s pq:P585 ?value }","paraphrases":["When was Whoopi Goldberg has gotten grant for British Academy of Film and Television Arts?"],"info":{}}
{"id":"train_2130","question":"when was National Film Award for Best Screenplay  award received of the Arundhati Roy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q212801 p:P166 ?s . ?s ps:P166 wd:Q1967202 . ?s pq:P585 ?value }","paraphrases":["When did Arundhati Roy receive the National Film Award for Best Screenplay?"],"info":{}}
{"id":"train_2131","question":"Species. See text. Cupressus is one of several genera within the family Cupressaceae that have the common name cypress; for the others, see cypress. It is considered a polyphyletic group. Based on genetic and morphological analysis, the genus Cupressus is found in the subfamily Cupressoideae.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q146911 wdt:P171 ?X . ?X wdt:P105 ?answer }","paraphrases":["Species. See content. Cupressus is one of a few genera inside the family Cupressaceae that have the common title cypress; for the others, see cypress. It is considered a polyphyletic bunch. Based on hereditary and morphological investigation, the sort Cupressus is found within the subfamily Cupressoideae."],"info":{}}
{"id":"train_2132","question":"What counties are found in The Kyle and Jackie O Show in the City of Fairfield?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7745007 wdt:P131 ?answer . ?answer wdt:P150 wd:Q571368 }","paraphrases":["Who gave the{employed by} of {essayist} of {Canine stories, from the Onlooker;} ?"],"info":{}}
{"id":"train_2133","question":"Is it true that the maximum operating altitude of the Albatros D.I is greater than 11808?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q114039 wdt:P2254 ?obj filter ( ?obj > 11808.0 ) }","paraphrases":["Can the Albatros D.I only fly up to 11808?"],"info":{}}
{"id":"train_2134","question":"which mosque starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q32815 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which mosque begins with s"],"info":{}}
{"id":"train_2136","question":"When was Alan Sugar held the position as Enterprise Champion?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q336520 p:P39 ?s . ?s ps:P39 wd:Q5380297 . ?s pq:P580 ?value }","paraphrases":["At what time did Alan Sugar hold the position as Enterprise Champion?"],"info":{}}
{"id":"train_2137","question":"What is Peter Gabriel's record label?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q175195 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 }","paraphrases":["What is Diminish Gabriel's record label?"],"info":{}}
{"id":"train_2138","question":"What is the leaf material used for ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P186 wd:Q33971 . ?sbj wdt:P31 wd:Q1724915 }","paraphrases":["What is the leaf fabric utilized for ?"],"info":{}}
{"id":"train_2139","question":"How many students attend Aix-Marseille University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2302586 wdt:P2196 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2140","question":"What area of law starts with \"l\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1756157 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which area of law starts with \"I\"?"],"info":{}}
{"id":"train_2142","question":"Which means {instrument} for {harmonica} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1303 wd:Q51290 }","paraphrases":[],"info":{}}
{"id":"train_2145","question":"Who gave the{product of} of {series} of {Honda RC174} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15074515 wdt:P179 ?X . ?X wdt:P176 ?answer }","paraphrases":["Give me the name of who gave the product of the Honda RC174 series."],"info":{}}
{"id":"train_2146","question":"How many lingual works are told by Esperanto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P407 wd:Q143 }","paraphrases":["What is the number of lingual works told by Esperanto?"],"info":{}}
{"id":"train_2147","question":"Which is the ancient civilization in the time period of Ancient Near East and whose name contains the word summer in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28171280 . ?sbj wdt:P2348 wd:Q269678 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sumer' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the ancient civilization in the time duration of Ancient Near East and whose identify contains the word summer season in it's name?"],"info":{}}
{"id":"train_2148","question":"Which the venue of the bibliographic citation of the Toward a general psychobiological theory of emotions?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q22251380 wdt:P2860 ?X . ?X wdt:P1433 ?answer }","paraphrases":["Which the venue of the bibliographic quotation of the Toward a universal psychobiological concept of emotions?"],"info":{}}
{"id":"train_2149","question":"What is the family relationship between Gina Lollobrigida and Guido Lollobrigida?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q56009 p:P1038 ?s . ?s ps:P1038 wd:Q1553604 . ?s pq:P1039 ?value }","paraphrases":["How are Gina Lollobrigida and Guido Lollobrigida related?"],"info":{}}
{"id":"train_2150","question":"What aware did Paulo Freire receive as doctor honoris causa?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q164797 p:P166 ?s . ?s ps:P166 wd:Q11415564 . ?s pq:P1027 ?value }","paraphrases":["What mindful did Paulo Freire get as specialist honoris causa?"],"info":{}}
{"id":"train_2152","question":"In which city in Carbon County was the invention of Frank Zamboni made?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1287174 wdt:P19 ?answer . ?answer wdt:P150 wd:Q156467 }","paraphrases":["Which city in Carbon County did Frank Zamboni make his invention?"],"info":{}}
{"id":"train_2153","question":"Who is the {human} for {position held} of {United Nations Secretary-General}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P39 wd:Q81066 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {position held} of {Joined together Countries Secretary-General}"],"info":{}}
{"id":"train_2154","question":"When was Leonardo DiCaprio nominated for the Academy Award for Best Actor.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q38111 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P585 ?value }","paraphrases":["In what years was Leonardo DiCaprio one of the nominees for Oscar for best actor?"],"info":{}}
{"id":"train_2156","question":"Where did David Livingstone die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q48373 wdt:P20 ?obj . ?obj wdt:P31 wd:Q4989906 }","paraphrases":["Where did David Livingstone die?"],"info":{}}
{"id":"train_2157","question":"What start time does Cornelis Drebbel have for working in Haarlem?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q365463 p:P937 ?s . ?s ps:P937 wd:Q9920 . ?s pq:P580 ?value }","paraphrases":["The start time of Cornelis Drebbel, when working in Harlem, is when?"],"info":{}}
{"id":"train_2161","question":"Who is the employer and position of Gabriel Fauré?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q104919 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P39 wd:Q215793 }","paraphrases":["What position does Gabriel Faure hold and who is his employer?"],"info":{}}
{"id":"train_2162","question":"What are the phonetic alphabet which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q579287 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the phonetic alphabet which begin with the letter t"],"info":{}}
{"id":"train_2163","question":"Who is the record producer of The Dark Knight Rises?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q189330 wdt:P155 ?X . ?X wdt:P162 ?answer }","paraphrases":["Who is the record maker of The Dull Knight Rises?"],"info":{}}
{"id":"train_2167","question":"What patent medicine did John Pemberton invent that starts with the letter \"c\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3480271 . ?sbj wdt:P61 wd:Q215959 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What patent remedy did John Pemberton invent that starts with the letter \"c\"?"],"info":{}}
{"id":"train_2169","question":"Is principle office Girls' Generation new label?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20153 wdt:P264 ?X . ?X wdt:P159 ?answer }","paraphrases":["Is the Generation New Label of Girls ' Principal Office?"],"info":{}}
{"id":"train_2170","question":"When did member of sports team of George Weah and number of matches played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q173139 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["When did part of sports group of George Weah and number of matches When did part of sports group of George Weah and number of matches played?"],"info":{}}
{"id":"train_2172","question":"Is the Gini coefficient of the USA less than 41.52?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q30 wdt:P1125 ?obj filter ( ?obj < 41.52 ) }","paraphrases":["Is the Gini coefficient of the USA less than 41.52?"],"info":{}}
{"id":"train_2173","question":"When was Joseph Stalin's son Vasily Dzhugashvili born, and when did he die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q459216 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When was Joseph Stalin's son Vasily Dzhugashvili born, and when did he die?"],"info":{}}
{"id":"train_2174","question":"What are the incorporation which start with the letter g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25394665 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the incorporation that begins with the letter g"],"info":{}}
{"id":"train_2175","question":"Which sources can be cited to place Roger Bacon's birth in 1219?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q171677 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( YEAR ( ?x ) , '1219' ) ) . ?s pq:P1480 ?value }","paraphrases":["To place For Roger Bacon's birth in 1219, which sources can be cited?"],"info":{}}
{"id":"train_2178","question":"Who replaced Benazir Bhutto as Prime Minister of Pakistan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q34413 p:P39 ?s . ?s ps:P39 wd:Q735575 . ?s pq:P1365 ?value }","paraphrases":["Who took the place of Benazir Bhutto as Prime Minister of Pakistan?"],"info":{}}
{"id":"train_2180","question":"Who is {field} {partners} of {Richard Banda} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7323937 wdt:P26 ?X . ?X wdt:P101 ?answer }","paraphrases":["Richard Banda has who as field partners?"],"info":{}}
{"id":"train_2181","question":"Who was the owner of Willie Nelson's guitar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q206112 wdt:P1830 ?obj . ?obj wdt:P31 wd:Q6607 }","paraphrases":["Willie Nelson's guitar was owned by who?"],"info":{}}
{"id":"train_2184","question":"What item is used to play with a list of sleds?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q50210255 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["What thing is utilized to play with a list of sleds?"],"info":{}}
{"id":"train_2185","question":"Canada contains administrative territorial entity of how many?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q16 wdt:P150 ?obj }","paraphrases":["How many administrative territorial entities are there for Canada?"],"info":{}}
{"id":"train_2186","question":"Whom Frederick Sanger shared his Nobel Prize in Chemistry with and how much prize money he got.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q151564 p:P166 ?s . ?s ps:P166 wd:Q44585 . ?s pq:P2121 ?value1 . ?s pq:P1706 ?value2 }","paraphrases":["Who did Frederick Sanger share his Nobel Prize with and how much money did he get?"],"info":{}}
{"id":"train_2187","question":"Who was Alexander Dovzhenko's spouse when their marriage ended on 25th November 1956?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q55198 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1956' ) ) }","paraphrases":["Alexander Dovzhenko's marriage to whom ended on November 25, 1956?"],"info":{}}
{"id":"train_2190","question":"What position does Lady Jane Grey hold in the Kindom of England?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q162356 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P642 wd:Q179876 }","paraphrases":["in which position Lady Jane Grey hold in the Kindom of England"],"info":{}}
{"id":"train_2191","question":"WHERE AMONG THE DIVISIONS OF SOUTH HOLLAND IS STREEFKERK","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q694 wdt:P150 ?answer . ?answer wdt:P1383 wd:Q959585 }","paraphrases":["WHERE THE SOUTH HOLLAND DIVISIONS IS STREEFKERK"],"info":{}}
{"id":"train_2192","question":"what is the series ordinal for Rainer Maria Rilke has name as Karl ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q76483 p:P735 ?s . ?s ps:P735 wd:Q15731830 . ?s pq:P1545 ?value }","paraphrases":["what is the arrangement ordinal for Rainer Maria Rilke has title as Karl ?"],"info":{}}
{"id":"train_2193","question":"What are the results of the iPod Touch 6 developers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20670531 wdt:P178 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What are the comes about of the iPod Touch 6 developers?"],"info":{}}
