{"id":"train_4780","question":"What is the Alcalá de Henares population determined by the register office?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q46940 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }","paraphrases":["What is the population of Alcalá de Henares according to the register office?"],"info":{}}
{"id":"train_4781","question":"Does a house cats bite force reach 46.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q146 wdt:P3485 ?obj filter ( ?obj = 46.4 ) }","paraphrases":["Does the bite force of a house cat reach 46.4?"],"info":{}}
{"id":"train_4782","question":"What connects Okinawa Island and Sesoko Island?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q600614 p:P2789 ?s . ?s ps:P2789 wd:Q137962 . ?s pq:P2789 ?value }","paraphrases":["What interfaces Okinawa Island and Sesoko Island?"],"info":{}}
{"id":"train_4784","question":"What are the computer model which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55990535 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the computer demonstrate which begin with the letter z"],"info":{}}
{"id":"train_4785","question":"What treatment is given for signs of hydrogen fluoride exposure","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21174755 wdt:P780 ?X . ?X wdt:P2176 ?answer }","paraphrases":["What treatment is given for signs of hydrogen fluoride exposure"],"info":{}}
{"id":"train_4788","question":"Who did Alexander Fleming receive the Nobel Prize in Physiology or Medicine with?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q37064 p:P166 ?s . ?s ps:P166 wd:Q80061 . ?s pq:P1706 ?value }","paraphrases":["For the Nobel Prize in Physiology and Medicine Alexander Fleming won the prize with what other person?"],"info":{}}
{"id":"train_4789","question":"What location in Hyderabad the administrative territorial entity in the year 1724?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1361 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1724' ) ) }","paraphrases":["What area in Hyderabad the authoritative regional substance within the year 1724?"],"info":{}}
{"id":"train_4790","question":"What is the collection of Pietà?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q235242 wdt:P195 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4793","question":"What is the stateless nation of the Bilbao location?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8692 wdt:P276 ?obj . ?obj wdt:P31 wd:Q1151616 }","paraphrases":[],"info":{}}
{"id":"train_4795","question":"Who produced the record that split from I feel fine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q268440 wdt:P155 ?X . ?X wdt:P162 ?answer }","paraphrases":["Who produced the record I feel fine splitting from?"],"info":{}}
{"id":"train_4801","question":"what are the train service which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15141321 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the prepare benefit which begin with the letter v"],"info":{}}
{"id":"train_4802","question":"Which is the average space complexity of quicksort?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q486598 wdt:P3757 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4804","question":"Did John Wayne Gacy work at Jollibee Foods Corporation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q298252 wdt:P108 wd:Q37614 }","paraphrases":["Is it true that John Wayne Gacy worked at Jollibee Foods Corporation?"],"info":{}}
{"id":"train_4805","question":"Name an athlete competing in high jump ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2416 wd:Q165704 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Name a competitor contending in high bounce ?"],"info":{}}
{"id":"train_4807","question":"What volcanic eruption occurred in the Dutch East Indies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q188161 . ?sbj wdt:P31 wd:Q7692360 }","paraphrases":["What volcanic ejection happened in the Dutch East Indies?"],"info":{}}
{"id":"train_4808","question":"What award did Aaliyah receive in the year 2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11617 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["In 2000, which award did Aaliyah win?"],"info":{}}
{"id":"train_4809","question":"What award did Laurence Fishburne receive at the 46th Tony Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q193048 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q4638408 }","paraphrases":["Laurence Fishburne received what award at the 46th annual Tony Awards?"],"info":{}}
{"id":"train_4810","question":"How much market capitalization are for JPMorgan Chase?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q192314 wdt:P2226 ?obj }","paraphrases":["What is the number of market capitalization for JPMorgan Chase?"],"info":{}}
{"id":"train_4812","question":"What is the CFSI of the Le Pere Goriot setting location?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q240617 wdt:P840 ?X . ?X wdt:P1740 ?answer }","paraphrases":["What is the CFSI of the Le Pere Goriot setting area?"],"info":{}}
{"id":"train_4813","question":"who is the head coach of boston Celtics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q131371 wdt:P286 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Name the most senior coach of Boston's NBA team."],"info":{}}
{"id":"train_4815","question":"What Basque Autonomous Community shares a border with part of Pyrenees-Atlantiques?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3995 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P518 wd:Q12703 }","paraphrases":["ABout the Basque communities, which one sharesa border with part of Pyrenees-Atlantiques?"],"info":{}}
{"id":"train_4816","question":"When did the reign of Sigismund III Vasa as King of Poland end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q52940 p:P39 ?s . ?s ps:P39 wd:Q3273712 . ?s pq:P582 ?value }","paraphrases":["Sigismund III Vasa was King of Poland, when did his reign end?"],"info":{}}
{"id":"train_4817","question":"Who formed  Santa Monica predecessor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41108665 wdt:P186 ?X . ?X wdt:P155 ?answer }","paraphrases":["The Santa Monica predecessor was created by who?"],"info":{}}
{"id":"train_4818","question":"Who did James Joyce get married to in London?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q6882 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P2842 wd:Q84 }","paraphrases":["Who was James Joyce's London bride?"],"info":{}}
{"id":"train_4822","question":"Name the building by the engineer Arup with the least amount of elevators.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1497364 . ?ent wdt:P1301 ?obj . ?ent wdt:P631 wd:Q716737 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which building designed by the engineer Arup has the least amount of elevators?"],"info":{}}
{"id":"train_4823","question":"Who is the husband and child of Anthony Dryden Marshall","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4772424 wdt:P22 ?X . ?X wdt:P26 ?answer }","paraphrases":["Who is Anthony Dryden Marshall's husband and child?"],"info":{}}
{"id":"train_4824","question":"At what pressure does phosphoric acid need to be at to have a boiling point of 415.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q184782 p:P2102 ?s . ?s ps:P2102 ?x filter ( contains ( ?x , '415.0' ) ) . ?s pq:P2077 ?value }","paraphrases":["Which is the pressure that phosphoric acid need to be at to have a boiling point of 415.0?"],"info":{}}
{"id":"train_4825","question":"What is the symbol of the physical quantity of pound per square inch ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q626299 wdt:P111 ?X . ?X wdt:P416 ?answer }","paraphrases":["Pound per share inch is based on the physical quantity using which symbol?"],"info":{}}
{"id":"train_4828","question":"what is economic union starts with u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3623811 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is financial union begins with u"],"info":{}}
{"id":"train_4830","question":"How many opposites are there of the word parent?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P461 wd:Q7566 }","paraphrases":["Tell me words that are opposites of the word parent."],"info":{}}
{"id":"train_4831","question":"What is the Christian name of Paul Anderson, that is the same as Pavle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q220883 wdt:P735 ?answer . ?answer wdt:P460 wd:Q2064754 }","paraphrases":["What is the Christian title of Paul Anderson, that's the same as Pavle?"],"info":{}}
{"id":"train_4832","question":"Who is the child of Seabiscuit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1500356 wdt:P40 ?obj . ?obj wdt:P31 wd:Q10855242 }","paraphrases":["Which horses did Seabiscuit father?"],"info":{}}
{"id":"train_4833","question":"What is the mobile network operator founded by Verizon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P112 wd:Q467752 . ?sbj wdt:P31 wd:Q1941618 }","paraphrases":["The mobile network operator founded by Verizon is what?"],"info":{}}
{"id":"train_4834","question":"Is Planck's constant less than 5.300856032e-34?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q122894 wdt:P1181 ?obj filter ( ?obj < 5.300856032e-34 ) }","paraphrases":["What is Planck's constant?"],"info":{}}
{"id":"train_4835","question":"Mention the doctoral advisor-ship and the academic qualifying degree achieved by Raghuram Rajan when he studied at Massachusetts Institute of Technology.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q981496 p:P69 ?s . ?s ps:P69 wd:Q49108 . ?s pq:P184 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What doctoral advisor-ship and academic qualifying degree was achieved by Raghuram Rajan while he studied at Massachusetts Institute of Technology?"],"info":{}}
{"id":"train_4836","question":"What was proximately caused by the consequence  of bubonic plague ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q217519 wdt:P1542 ?X . ?X wdt:P1478 ?answer }","paraphrases":["What was proximately brought about by the result of bubonic plague ?"],"info":{}}
{"id":"train_4837","question":"What is the place of incorporation of the The Police, that has Zip + 4 and is W1F 0HS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178095 wdt:P740 ?answer . ?answer wdt:P281 ?x FILTER ( contains ( ?x , 'W1F 0HS' ) ) }","paraphrases":["What is the area of incorporation of the The Police, that has Zip + 4 and is W1F 0HS?"],"info":{}}
{"id":"train_4841","question":"What are the legendary figure which start with the letter e","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13002315 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'é' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the incredible figure which begin with the letter e"],"info":{}}
{"id":"train_4844","question":"What is ceiling exposure limit for phenol which duration is 15.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q130336 p:P2405 ?s . ?s ps:P2405 ?obj . ?s pq:P2047 ?x filter ( contains ( ?x , '15.0' ) ) }","paraphrases":["Phenol with a duration of 15.0 has what ceiling exposure limit?"],"info":{}}
{"id":"train_4846","question":"Is the maximum number of players of Abalone equal to 6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q17247 wdt:P1873 ?obj filter ( ?obj = 6 ) }","paraphrases":["In Abalone, is the maximum number of players 6?"],"info":{}}
{"id":"train_4848","question":"Is it true that the admission rate of the Massachusetts Institute of Technology equals to 0.08?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q49108 wdt:P5822 ?obj filter ( ?obj = 0.08 ) }","paraphrases":["Is 0.08 the admission rate of the Massachusetts Institute of Technology?"],"info":{}}
{"id":"train_4854","question":"What is the net profit of Nissan in a fiscal year?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q20165 p:P2295 ?s . ?s ps:P2295 ?obj . ?s pq:P1480 wd:Q191891 }","paraphrases":["In a fiscal year, how much is Nissan's net profit?"],"info":{}}
{"id":"train_4855","question":"When did Andrzej Pelczar leave Jagiellonian University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q189441 p:P1075 ?s . ?s ps:P1075 wd:Q515383 . ?s pq:P582 ?value }","paraphrases":["On what date did Andrzej Pelczar leave Jagiellonian University?"],"info":{}}
{"id":"train_4856","question":"Name the discoverer of Natural Selection and have birth year as 12-Feb-1809.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43478 wdt:P61 ?answer . ?answer wdt:P569 ?x FILTER ( contains ( YEAR ( ?x ) , '1809' ) ) }","paraphrases":["Name the discoverer of Natural Selection and have delivery yr as 12-Feb-1809."],"info":{}}
{"id":"train_4858","question":"What is the profession of Henry Washington Younger sons?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5729891 wdt:P40 ?X . ?X wdt:P106 ?answer }","paraphrases":["The sons of Henry Washington Younger have what profession?"],"info":{}}
{"id":"train_4859","question":"Which is the vertical depth for Lake Winnipeg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3272 wdt:P4511 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4860","question":"Why Roald Amundsen died at Bear Island?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q926 p:P20 ?s . ?s ps:P20 wd:Q194364 . ?s pq:P1480 ?value }","paraphrases":["How did Roald Amundsen die on Bear Island?"],"info":{}}
{"id":"train_4861","question":"Is the career plus-minus rating of the Roland Eriksson equal to -70?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q283133 wdt:P6547 ?obj filter ( ?obj = -70 ) }","paraphrases":["Is Roland Eriksson's career rating -70?"],"info":{}}
{"id":"train_4863","question":"Who is the producer and executive producer of Fight Club?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q190050 wdt:P162 ?ans_1 . wd:Q190050 wdt:P1431 ?ans_2 }","paraphrases":["Name the producer and executive producer of the movie Fight Club."],"info":{}}
{"id":"train_4865","question":"Was Genghis Khan's wife named Yesui?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q720 wdt:P26 wd:Q4177257 }","paraphrases":["Is it true that the wife of Genghis Khan was called Yesui?"],"info":{}}
{"id":"train_4867","question":"Which Led Zeppelin single is in tracklist IV?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q201940 wdt:P658 ?obj . ?obj wdt:P31 wd:Q134556 }","paraphrases":["What is the name of Led Zeppelin's tracklist number 4?"],"info":{}}
{"id":"train_4868","question":"What's Russia's inception?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q159 wdt:P571 ?obj }","paraphrases":["What is the inception for Russia?"],"info":{}}
{"id":"train_4869","question":"Is the coastline of borovoe less than 16.32?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5092054 wdt:P5141 ?obj filter ( ?obj < 16.32 ) }","paraphrases":["Is the coastline of borovoe less than 16.32?"],"info":{}}
{"id":"train_4870","question":"Is the mean age of England less than 30.88?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q21 wdt:P4442 ?obj filter ( ?obj < 30.88 ) }","paraphrases":["Is the cruel age of Britain less than 30.88?"],"info":{}}
{"id":"train_4872","question":"Where is the place of burial in Thessaloniki","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P20 wd:Q17151 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Where are the dead laid to rest in Thessaloniki?"],"info":{}}
{"id":"train_4874","question":"Who was Emmylou Harris' spouse in 1984?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q231286 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["Give the name of the person Emmylou Harris was married to in 1984."],"info":{}}
{"id":"train_4877","question":"What position was Stanley Baldwin elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q166635 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What job did Stanley Baldwin have?"],"info":{}}
{"id":"train_4878","question":"Is Tony Robbins' occupation motivational speaker and manager?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q380429 wdt:P106 wd:Q15982858 . wd:Q380429 wdt:P106 wd:Q6746710 }","paraphrases":["Is the profession of Tony Robbins' being a motivational speaker and manager?"],"info":{}}
{"id":"train_4879","question":"What is Sonia Fisch-Muller's field of study?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q25368065 wdt:P184 ?X . ?X wdt:P2650 ?answer }","paraphrases":["What is Sonia Fisch-Muller's field of study?"],"info":{}}
{"id":"train_4880","question":"Who is often confused with the snake that has a higher taxon than Ophidia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2102 wdt:P1889 ?answer . ?answer wdt:P171 wd:Q16986904 }","paraphrases":["Who is frequently befuddled with the wind that incorporates a higher taxon than Ophidia"],"info":{}}
{"id":"train_4881","question":"Is the incidence of pancreatic cancer less than 1.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q212961 wdt:P2844 ?obj filter ( ?obj < 1.6 ) }","paraphrases":["Is the rate of pancreatic cancer less than 1.6?"],"info":{}}
{"id":"train_4882","question":"What are the coordinates of the Amur river mouth?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q6862 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q1233637 }","paraphrases":["The Amur river mouth is located within which coordinates?"],"info":{}}
{"id":"train_4883","question":"What is the script of Modern English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1649537 wdt:P1365 ?X . ?X wdt:P282 ?answer }","paraphrases":["What is Modern English's script?"],"info":{}}
{"id":"train_4885","question":"What is the architectural style of Bauhaus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P149 wd:Q124354 . ?sbj wdt:P31 wd:Q811979 }","paraphrases":["How is the architectural style of Bauhaus?"],"info":{}}
{"id":"train_4886","question":"\"Who is {brother or sister} of {Khadijah bint Khuwaylid}, which has {marry} is {Safiyyah bint ‘Abd al-Muttalib} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42034 wdt:P3373 ?answer . ?answer wdt:P26 wd:Q2740828 }","paraphrases":["\"Who is {brother or sister} of {Khadijah bint Khuwaylid}, which has {wed} is {Safiyyah bint ‘Abd al-Muttalib} ?\""],"info":{}}
{"id":"train_4889","question":"What award did George Marshall receive on May the 4th, 1959?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q151414 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1959' ) ) }","paraphrases":["On May 4, 1959, which award did George Marshall receive?"],"info":{}}
{"id":"train_4890","question":"What was the statement made by Geoffrey Rush after being nominated for Best Supporting Actor ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q166272 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P805 ?value }","paraphrases":["After being nominated for Best Supporting Actor, what was the statement made by Geoffrey Rush?"],"info":{}}
{"id":"train_4891","question":"What is {workplace} of {Cnut the Great}, that has {diplomatic relation} is {Romania}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q134128 wdt:P937 ?answer . ?answer wdt:P530 wd:Q218 }","paraphrases":["What is {work environment} of {Cnut the Incredible}, that has {conciliatory connection} is {Romania}"],"info":{}}
{"id":"train_4892","question":"Was Dave Grohl part of the Democratic Party?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12006 wdt:P102 wd:Q29552 }","paraphrases":["Did Dave Grohl consider himself a member of the Democratic Party?"],"info":{}}
{"id":"train_4893","question":"Is the optimum viable temperature of the Marichromatium sp. 24.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q29565261 wdt:P3253 ?obj filter ( ?obj = 24.0 ) }","paraphrases":["Is sp. 24.0 the optimum viable temperature of the Marichromatium?"],"info":{}}
{"id":"train_4894","question":"Which is the 90minut player ID of Robert Lewandowski?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q151269 wdt:P3605 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4895","question":"Which is the taxon synonym of Ochotona?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q184067 wdt:P1420 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4896","question":"What is notable about the border of Utah and Wyoming?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q829 p:P47 ?s . ?s ps:P47 wd:Q1214 . ?s pq:P805 ?value }","paraphrases":["what is special about the border between Utah and Whyoming?"],"info":{}}
{"id":"train_4898","question":"Is Binalog the residence of Andrew Barton Paterson during the end time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q436699 p:P551 ?s . ?s ps:P551 wd:Q2903896 . ?s pq:P582 ?value }","paraphrases":["Did Andrew Barton Paterson live at Binalog when his position ended?"],"info":{}}
{"id":"train_4899","question":"Which is employment field of Tatsuya Sugai's employment?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11619106 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["What kind of job does Tatsuya Sugai have?"],"info":{}}
{"id":"train_4902","question":"Did Yemelyan Pugachev die in Moscow Oblast?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q154240 wdt:P20 ?answer . ?answer wdt:P1376 wd:Q1697 }","paraphrases":["Did Yemelyan Pugachev kick the bucket in Moscow Oblast?"],"info":{}}
{"id":"train_4904","question":"Does Odo of Scarpone hold a directorial position?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16027431 wdt:P39 ?X . ?X wdt:P2389 ?answer }","paraphrases":["Is a directorial position held by Odo of Scarpone?"],"info":{}}
{"id":"train_4906","question":"What is the toponym of the Island of Montreal that has a geographic coordinate of -73.555?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q292354 wdt:P138 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-73.555' ) ) }","paraphrases":["What is the toponym of the Island of Montreal that includes a geographic facilitate of -73.555?"],"info":{}}
{"id":"train_4907","question":"How many people live in Porto Alegre?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q40269 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["What is the population of Porto Alegre"],"info":{}}
