{"id":"train_15766","question":"What building does the University of Oxford own?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P127 wd:Q34433 . ?sbj wdt:P31 wd:Q41176 }","paraphrases":["What building does the College of Oxford own?"],"info":{}}
{"id":"train_15768","question":"Which play is named after David Bowie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P138 wd:Q5383 . ?sbj wdt:P31 wd:Q169930 }","paraphrases":["David Bowie was named after what play?"],"info":{}}
{"id":"train_15769","question":"where died Frédéric Auguste Bartholdi, that has district is neighborhood of the future?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q223274 wdt:P20 ?answer . ?answer wdt:P150 wd:Q210720 }","paraphrases":["where kicked the bucket Frédéric Auguste Bartholdi, that has area is neighborhood of the future?"],"info":{}}
{"id":"train_15772","question":"What textile fibre starts with the letter \"w\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3071311 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH TEXTILE FIBRE STARTS BY W"],"info":{}}
{"id":"train_15773","question":"Which is the princely state of the British Raj for the capital of Thiruvananthapuram?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q167715 . ?sbj wdt:P31 wd:Q1336152 }","paraphrases":[],"info":{}}
{"id":"train_15776","question":"Which protein synthesis inhibitor results in type I hypersensitivity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1542 wd:Q42982 . ?sbj wdt:P31 wd:Q7251505 }","paraphrases":[],"info":{}}
{"id":"train_15777","question":"tell  me black-body radiation that name has  the word hawking in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q900097 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hawking' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know black-body radiation that title has the word peddling in it"],"info":{}}
{"id":"train_15778","question":"What are the unit of measurement which start with the letter visus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3546121 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the unit of estimation which begin with the letter visus"],"info":{}}
{"id":"train_15780","question":"where is the educated at and position played on team / speciality of Michael_Jordan","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q41421 wdt:P69 ?ans_1 . wd:Q41421 wdt:P413 ?ans_2 }","paraphrases":["Which position play Micheal Jordan in his team?"],"info":{}}
{"id":"train_15781","question":"Who works for Vint Cerf that has an executive director named Thomas J. Watson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q92743 wdt:P108 ?answer . ?answer wdt:P169 wd:Q435716 }","paraphrases":["Who works for Vint Cerf that has an government director named Thomas J. Watson?"],"info":{}}
{"id":"train_15782","question":"Which is the HNI person or institution ID for Rem Koolhaas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q232364 wdt:P2476 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15783","question":"HOW MUCH OF SCHOOL CHILDREN IN THE CONTINENT OF GOZO","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170488 wdt:P30 ?X . ?X wdt:P2573 ?answer }","paraphrases":["HOW MUCH OF SCHOOL CHILDREN Within The Landmass OF GOZO"],"info":{}}
{"id":"train_15784","question":"Who was the spouse of Sándor Petőfi in 1847?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q81219 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1847' ) ) }","paraphrases":["Who was Sandor Petrofi married to in 1847?"],"info":{}}
{"id":"train_15785","question":"What country is Guayaquil from who died in 1533?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43509 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1533' ) ) }","paraphrases":["Guayaquil, who died in 1533, is from what country?"],"info":{}}
{"id":"train_15789","question":"Tell me war of succession whose name has the word wars  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1348385 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wars' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know war of progression whose title has the word wars in it."],"info":{}}
{"id":"train_15791","question":"How many individuals are interested in philosophy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2650 wd:Q5891 }","paraphrases":["What is the approximate number of individuals that are interested in philosophy?"],"info":{}}
{"id":"train_15792","question":"What was the position held by Henry IV of England in the year 1399?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q161866 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1399' ) ) }","paraphrases":["In the year 1399, what was the position held by Henry IV of England?"],"info":{}}
{"id":"train_15793","question":"What was the official language for the Tsardom of Russia in 1708?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q186096 p:P37 ?s . ?s ps:P37 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1708' ) ) }","paraphrases":["In 1708, what was the language spoken in Tsardom, Russia?"],"info":{}}
{"id":"train_15794","question":"Mukesh Ambani is the Chief Executive Officer of which corporation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P169 wd:Q298547 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["What company's CEO is Mukesh Ambani?"],"info":{}}
{"id":"train_15797","question":"Who has replaced as General Secretary of the Communist Party of Vietnam in Ho Chi Minh city?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36014 p:P39 ?s . ?s ps:P39 wd:Q848786 . ?s pq:P1365 ?value }","paraphrases":["In Ho Chi Minh City, who has replaced the General Secretary of the Communist Party of Vietnam?"],"info":{}}
{"id":"train_15798","question":"What branch of the United States Armed Forces was Charles Wayland Brooks part of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q767566 wdt:P241 ?X . ?X wdt:P607 ?answer }","paraphrases":["What branch of the United States Armed Forces was Charles Wayland Brooks phase of?"],"info":{}}
{"id":"train_15799","question":"Who is the favorite player of US Army service branch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1512 wdt:P737 ?answer . ?answer wdt:P241 wd:Q9212 }","paraphrases":["Who is the US Army branch's favorite player?"],"info":{}}
{"id":"train_15801","question":"Which is the {country of origin} and the {language of work or name} of {Of_Mice_and_Men} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q457977 wdt:P495 ?ans_1 . wd:Q457977 wdt:P407 ?ans_2 }","paraphrases":["Where and in what language was Of Mice and Men written?"],"info":{}}
{"id":"train_15802","question":"What is a vested interest of the shareholders of GNU Savannah?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1007059 wdt:P127 ?X . ?X wdt:P2650 ?answer }","paraphrases":["Give the vested interest of the shareholders of GNU Savannah."],"info":{}}
{"id":"train_15803","question":"How many instruments does Moby play?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q14045 wdt:P1303 ?obj }","paraphrases":["What instruments does the musician Moby use?"],"info":{}}
{"id":"train_15805","question":"What is the film starring of Bicycle Thieves whose date of the end is 1983-4-22?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q172837 wdt:P161 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( YEAR ( ?x ) , '1983' ) ) }","paraphrases":["What is the film featuring of Bike Cheats whose date of the conclusion is 1983-4-22?"],"info":{}}
{"id":"train_15806","question":"In which dominion of the British Empire Mizoram is located ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P150 wd:Q1502 . ?sbj wdt:P31 wd:Q223832 }","paraphrases":["What dominion is the British Empire Mizoram located?"],"info":{}}
{"id":"train_15807","question":"Is 7 the Mohs' hardness of the amethyst?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q79058 wdt:P1088 ?obj filter ( ?obj = 7 ) }","paraphrases":["Does 7.0 accurately represent the amethyst's Mohs' hardness?"],"info":{}}
{"id":"train_15809","question":"What sovereign state is Levant a location or terrain feature of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P706 wd:Q81483 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["What paramount state is Levant a area or territory include of?"],"info":{}}
{"id":"train_15810","question":"What civic building contains the word house in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q52177058 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'house' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What civic building contains the word house in its name?"],"info":{}}
{"id":"train_15811","question":"Sputnik 1 has what orbital period?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q80811 wdt:P2146 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15812","question":"What is the end time for The Storm on the Sea of Galilee at the Isabella Stewart Gardner Museum?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2246489 p:P195 ?s . ?s ps:P195 wd:Q49135 . ?s pq:P582 ?value }","paraphrases":["At the Isabella Stewart Gardner Museum, what is the end time for The Storm on the Sea of Galilee?"],"info":{}}
{"id":"train_15814","question":"How many postal code for New York City?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q60 wdt:P281 ?obj }","paraphrases":["What is the number of postal codes for New York City"],"info":{}}
{"id":"train_15815","question":"How many are located in or next to a body of water around Moscow?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q649 wdt:P206 ?obj }","paraphrases":["Which ones are located near a body of water around Moscow?"],"info":{}}
{"id":"train_15816","question":"What is the deal in the village of Western Cape, having a diplomatic relation with the United Kingdom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q127167 wdt:P131 ?answer . ?answer wdt:P530 wd:Q145 }","paraphrases":["What is the deal in the village of Western Cape, having a diplomatic relation with the United Kingdom?"],"info":{}}
{"id":"train_15817","question":"What's the position held of Éamon de Valera for parliamentary term 4th Dail?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q173347 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2937 wd:Q29000401 }","paraphrases":["What position did Eamon de Valera in Parliament"],"info":{}}
{"id":"train_15818","question":"was hans bethe nominated  in 1955-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q155794 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1955' ) ) }","paraphrases":["Did hans bethe receive a nomination in 1955-1-1?"],"info":{}}
{"id":"train_15820","question":"What is half-life of technetium-99m ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2373354 wdt:P2114 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15822","question":"sdgdfghdsfhg","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q310166 wdt:P69 ?answer . ?answer wdt:P2643 wd:Q23623487 }","paraphrases":["sdgdfghdsfhg"],"info":{}}
{"id":"train_15823","question":"Who was married to Joseph Lyons and when did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q370966 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who was hitched to Joseph Lyons and when did it end?"],"info":{}}
{"id":"train_15824","question":"Name the sibling of Loretta Lynn.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q272931 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Title the kin of Loretta Lynn."],"info":{}}
{"id":"train_15825","question":"What are the municipality of Brazil which start with the letter óbidos","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3184121 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'óbidos' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the district of Brazil which begin with the letter óbidos"],"info":{}}
{"id":"train_15826","question":"What are the private university which start with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902104 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the private college which begin with the letter u"],"info":{}}
{"id":"train_15828","question":"Which  is officeholder of Earl Warren ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1308 wd:Q311197 }","paraphrases":[],"info":{}}
{"id":"train_15829","question":"What is the orbital inclination of the Kepler?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47272 wdt:P2045 ?obj filter ( ?obj = 0.44747 ) }","paraphrases":["Give me the orbital inclination of the Kepler."],"info":{}}
{"id":"train_15831","question":"Which house from error1 is the shortest","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3947 . ?ent wdt:P1101 ?obj . ?ent wdt:P1435 wd:Q25553650 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which house from error1 is the shortest"],"info":{}}
{"id":"train_15834","question":"What film is a prequel of \"Goal III: Taking on the World\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132134 wdt:P155 ?X . ?X wdt:P161 ?answer }","paraphrases":["What film could be a prequel of \"Objective III: Taking on the World\"?"],"info":{}}
{"id":"train_15835","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131686 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'Человек разумный' ) ) }","paraphrases":["Tell me what it is."],"info":{}}
{"id":"train_15837","question":"What is the field of study of the journal that published \"Safety of enteral naloxone for the reversal of opiate-induced constipation in the intensive care unit\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q45219303 wdt:P1433 ?X . ?X wdt:P101 ?answer }","paraphrases":["The journal that published \"Safety of enteral naloxone for the reversal of opiate-induced constipation in the intensive care unit\" is in which field of study?"],"info":{}}
{"id":"train_15839","question":"Other than \"Two Hundred Years Together\", what else has The Gulag Archipelago written?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q369944 wdt:P50 ?answer . ?answer wdt:P800 wd:Q3656109 }","paraphrases":["Other than \"Two Hundred A long time Together\", what else has The Gulag Archipelago written?"],"info":{}}
{"id":"train_15840","question":"What artistic genre is the portrait of Christ when he appear to the disciples by the sea of Tiberias?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q22260425 wdt:P180 ?X . ?X wdt:P136 ?answer }","paraphrases":["The portrait of Christ when he appeared to the disciples by the sea of Tiberias belongs to what artistic genre?"],"info":{}}
{"id":"train_15841","question":"What is in the category of Mongolia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q711 wdt:P3067 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15842","question":"What is the capital of Meghalaya?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1195 wdt:P36 ?obj . ?obj wdt:P31 wd:Q515 }","paraphrases":["What is Meghalaya's capital?"],"info":{}}
{"id":"train_15844","question":"What is the diplomatic relationship between Norway and the country with the full title \"Federal Republic Germany\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20 wdt:P530 ?answer . ?answer wdt:P1448 ?x FILTER ( contains ( ?x , 'Federal Republic of Germany' ) ) }","paraphrases":["What is the diplomatic relationship between Norway and the us of a with the full title \"Federal Republic Germany\"?"],"info":{}}
{"id":"train_15845","question":"Who gave the{reason of failure} of {notable event} of {Alan Blumlein} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q724082 wdt:P793 ?X . ?X wdt:P770 ?answer }","paraphrases":["Who gave Alan Blumlein's reason of failure at a notable event?"],"info":{}}
{"id":"train_15846","question":"How many wives does the Chongzhen Emperor have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P26 wd:Q10069 }","paraphrases":["The Chongzhen Emperor is married to how many people?"],"info":{}}
{"id":"train_15847","question":"What agent makes use of communication?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2283 wd:Q11024 . ?sbj wdt:P31 wd:Q24229398 }","paraphrases":["What operator makes utilize of communication?"],"info":{}}
{"id":"train_15848","question":"Who gave the{provenance} of {exchange} of {Six Flags} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q824278 wdt:P414 ?X . ?X wdt:P127 ?answer }","paraphrases":["Which person gave the provenance of exchange of Six Flags"],"info":{}}
{"id":"train_15850","question":"Who is the {partner} and the {spouse} of {Freyja} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1647325 wdt:P451 ?ans_1 . wd:Q1647325 wdt:P26 ?ans_2 }","paraphrases":["Who is married to Freyja?"],"info":{}}
{"id":"train_15851","question":"What is the official religion of the Sunni Islam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3075 wd:Q483654 }","paraphrases":["Sunni Islam has what official religion?"],"info":{}}
{"id":"train_15852","question":"Which sculpture has the highest horizontal depth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q860861 . ?ent wdt:P5524 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which form has the most elevated flat depth?"],"info":{}}
{"id":"train_15853","question":"What is the Cathedral of the Diocese of Florence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q191739 wdt:P708 ?obj . ?obj wdt:P31 wd:Q2072238 }","paraphrases":["What is the Cathedral of the See of Florence?"],"info":{}}
{"id":"train_15855","question":"Why has Lupita Nyong'o been awarded with the Acedemy Award for Best Supporting Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3840847 p:P166 ?s . ?s ps:P166 wd:Q106301 . ?s pq:P805 ?value }","paraphrases":["Why has Lupita Nyong'o been granted with the Acedemy Grant for Best Supporting On-screen character?"],"info":{}}
{"id":"train_15858","question":"Name this nationalist party in India that starts with letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7278 . ?sbj wdt:P1142 wd:Q2633888 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name this nationalist celebration in India that starts offevolved with letter P"],"info":{}}
{"id":"train_15859","question":"What is a Whopper made of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1135327 wdt:P176 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What is a monster made of?"],"info":{}}
{"id":"train_15860","question":"At the point in time 1978-0-2, what was the population of Hungary?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q28 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1978' ) ) }","paraphrases":["What was the population of Hungary in 1978?"],"info":{}}
{"id":"train_15862","question":"Did Vienna copy the twin administrative body of Budapest and Ljubljana?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1741 wdt:P190 wd:Q1781 . wd:Q1741 wdt:P190 wd:Q437 }","paraphrases":["Is the Vienna government copied from the governments of Budapest and Ljubjana?"],"info":{}}
{"id":"train_15865","question":"where and what did Rajneesh study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q148285 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["where and what did Rajneesh study?"],"info":{}}
{"id":"train_15867","question":"Who was the chairperson of FIDE as of 1-1-1949?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q102178 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1949' ) ) }","paraphrases":["Who was the chairperson of FIDE on January 1, 1949?"],"info":{}}
{"id":"train_15868","question":"In which doctoral filed Hans Bethe has academic degree and in which doctoral field he works.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q155794 p:P512 ?s . ?s ps:P512 wd:Q849697 . ?s pq:P184 ?value1 . ?s pq:P101 ?value2 }","paraphrases":["What field does Hans Bethe work in, and what degree did he obtain?"],"info":{}}
{"id":"train_15869","question":"What is Naresuan's GDP based on the purchasing power parity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q515704 wdt:P27 ?X . ?X wdt:P2299 ?answer }","paraphrases":["What is Naresuan's GDP primarily based on the buying energy parity?"],"info":{}}
{"id":"train_15870","question":"What is the Irritant with the highest electrical conductivity whose instance of is Class II combustible liquid ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q6073871 . ?ent wdt:P2055 ?obj . ?ent wdt:P31 wd:Q21009057 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the Irritant with the best electrical conductivity whose instance of is Class II combustible liquid ?"],"info":{}}
{"id":"train_15871","question":"Name a city in Iran that begins with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56557504 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a city in Iran that starts with the letter z"],"info":{}}
{"id":"train_15872","question":"In which krai is Volgograd located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q914 . ?sbj wdt:P31 wd:Q20683493 }","paraphrases":["In which krai is Volgograd located?"],"info":{}}
{"id":"train_15873","question":"What's the CPI for the LOFAR headquarters.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1192324 wdt:P159 ?X . ?X wdt:P1279 ?answer }","paraphrases":["Which is the CPI for the LOFAR headquarters?"],"info":{}}
{"id":"train_15874","question":"Name the item used relate to Heidi Renoth","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q71051 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["Name of the item used is Heidi Renoth"],"info":{}}
{"id":"train_15876","question":"What is the diplomatic relation performed by the F-16 Fighting Falcon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q100026 wdt:P137 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is the political connection performed by the F-16 Battling Falcon?"],"info":{}}
{"id":"train_15877","question":"When did Tanaquil Le Clercq divorce George Balanchine?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q15502557 p:P26 ?s . ?s ps:P26 wd:Q310184 . ?s pq:P582 ?value }","paraphrases":["On what date did Tanaquil Le Clercq divorce George Balanchine?"],"info":{}}
