{"id":"train_20662","question":"What country contains Beijing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P150 wd:Q956 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["What nation contains Beijing?"],"info":{}}
{"id":"train_20669","question":"Which was the constitutional republic for the significant event of Cuban Missile Crisis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P793 wd:Q128160 . ?sbj wdt:P31 wd:Q1520223 }","paraphrases":["In which republic did the Cuban Missile Crisis have a significant impact?"],"info":{}}
{"id":"train_20670","question":"What are the history of a country or state which start with the letter history","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17544377 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'history' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the history of a u . s . a . or country which begin with the letter records"],"info":{}}
{"id":"train_20671","question":"Which famous place of Indian History has a lake on Arabian Sea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q133136 wdt:P1269 ?answer . ?answer wdt:P206 wd:Q58705 }","paraphrases":["Which well-known place of Indian History has a lake on Arabian Sea?"],"info":{}}
{"id":"train_20672","question":"Name a profession mainly done by women that starts with letter D","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28640 . ?sbj wdt:P1269 wd:Q1404482 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a profession mainly done by women that begins with letter D"],"info":{}}
{"id":"train_20675","question":"What is the maximum wavelength of sensitivity for MeerKAT?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q6807657 wdt:P3737 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20676","question":"What sister city to Haifa is the headquarters of Newcastle University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q837164 wdt:P159 ?answer . ?answer wdt:P190 wd:Q41621 }","paraphrases":["What sister city to Haifa is the base camp of Newcastle University?"],"info":{}}
{"id":"train_20677","question":"What are the market structure which start with the letter oligopoly","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q877707 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'oligopoly' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the market structure which begin with the letter oligopoly"],"info":{}}
{"id":"train_20683","question":"What business is conducted at the  New York Stock Exchange?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P414 wd:Q13677 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["What trade is conducted at the Unused York Stock Exchange?"],"info":{}}
{"id":"train_20684","question":"What are the film studio which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60644899 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'coin' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the film studio which begin with the letter s"],"info":{}}
{"id":"train_20686","question":"who film for screenwriter of jim henson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P58 wd:Q191037 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Who is filming Jim Henson's screenwriter?"],"info":{}}
{"id":"train_20693","question":"Was Ronald Reagan a captain in the military rank?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9960 wdt:P410 wd:Q2937293 }","paraphrases":["When Ronald Reagan was in the military, was he a captain?"],"info":{}}
{"id":"train_20696","question":"What are the fictional hybrid which start with the letter warhawk","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q30147469 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'warhawk' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which fictional hybrid starts with the letter warhawk?"],"info":{}}
{"id":"train_20697","question":"What is the value of the computing platform in Castlevania?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2515184 wdt:P400 ?X . ?X wdt:P2284 ?answer }","paraphrases":["What is the esteem of the computing stage in Castlevania?"],"info":{}}
{"id":"train_20698","question":"When was the Gutenberg Bible printed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q158075 wdt:P872 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20700","question":"Who was the presenter of Wheel of Fortune in 1982?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3567653 p:P371 ?s . ?s ps:P371 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1982' ) ) }","paraphrases":["What's the name of the person who was a Wheel of Fortune host in 1982?"],"info":{}}
{"id":"train_20702","question":"Where is Coimbatore located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9885 wdt:P2633 ?obj . ?obj wdt:P31 wd:Q46865913 }","paraphrases":["Where is Coimbatore found?"],"info":{}}
{"id":"train_20704","question":"What are the types of cuisine that start with letter Z ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1778821 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the types of cuisine that begin with letter Z ?"],"info":{}}
{"id":"train_20705","question":"What colors are Renato Bertocchi's team?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1408248 wdt:P54 ?X . ?X wdt:P462 ?answer }","paraphrases":["What colors are Renato Bertocchi's team?"],"info":{}}
{"id":"train_20706","question":"Tell me tagma whose name has the word abdomen in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1402830 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'abdomen' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know tagma whose title has the word guts in it."],"info":{}}
{"id":"train_20709","question":"yes","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9181 wdt:P1441 ?answer . ?answer wdt:P1476 ?x FILTER ( contains ( ?x , 'ירמיה' ) ) }","paraphrases":["yes"],"info":{}}
{"id":"train_20710","question":"Tell me the sovereign state for the capital of Belgrade.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q3711 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["Let me know the paramount state for the capital of Belgrade."],"info":{}}
{"id":"train_20711","question":"What's the B side of the song We Will Rock You?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1432 wd:Q326487 }","paraphrases":[],"info":{}}
{"id":"train_20712","question":"What is Paul Rudd's ethnic group and gender?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q276525 wdt:P172 ?ans_1 . wd:Q276525 wdt:P21 ?ans_2 }","paraphrases":["What is the ethnic group and gender of Paul Rudd?"],"info":{}}
{"id":"train_20714","question":"What is the tributary of the reservoir on this river of Sulak River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q770781 wdt:P469 ?X . ?X wdt:P974 ?answer }","paraphrases":["What is the tributary of the reservoir on this river of Sulak River?"],"info":{}}
{"id":"train_20715","question":"Who was nominated from West Side Story to receive the Academy Award for Best Cinematography and Color?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q273704 p:P1411 ?s . ?s ps:P1411 wd:Q21995136 . ?s pq:P2453 ?value }","paraphrases":["Who won an Academy Award nomination for Best Cinematography and Color for West Side Story?"],"info":{}}
{"id":"train_20717","question":"Who is the head of Wenckheim Frigyes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28359103 wdt:P463 ?X . ?X wdt:P159 ?answer }","paraphrases":["Who heads Wenkheim Frigyes?"],"info":{}}
{"id":"train_20718","question":"How many goals and matches did Dixie Dean play for Ashton United F.C.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q316323 p:P54 ?s . ?s ps:P54 wd:Q18283 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["maybe some goals"],"info":{}}
{"id":"train_20722","question":"When did Eduard Khil receive the award Order of Friendship of Peoples?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q360190 p:P166 ?s . ?s ps:P166 wd:Q583881 . ?s pq:P585 ?value }","paraphrases":["The Order of Friendship of Peoples award was given to Eduard Khil on what date?"],"info":{}}
{"id":"train_20724","question":"Who are Krishna's father and sibling?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q42891 wdt:P22 ?ans_1 . wd:Q42891 wdt:P3373 ?ans_2 }","paraphrases":["What are the names of Krishna's father and siblings?"],"info":{}}
{"id":"train_20728","question":"WHO IS THE ORGANISER OF THE PLAY OF 1996 NORWEGIAN SINGLE DISTANCE CHAMPIONSHIP IN SPEED SKATING","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55231472 wdt:P664 ?X . ?X wdt:P641 ?answer }","paraphrases":["Who organized the play of the 1996 Norwegian single distance championship in speed skating?"],"info":{}}
{"id":"train_20729","question":"Who became the head of state of North Korea on 9/9/1948?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q423 p:P35 ?s . ?s ps:P35 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1948' ) ) }","paraphrases":["What leader took over rule in North Korea on 9/9/1948?"],"info":{}}
{"id":"train_20731","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q236229 wdt:P20 ?answer . ?answer wdt:P150 wd:Q2367394 }","paraphrases":["What is it?"],"info":{}}
{"id":"train_20732","question":"Who did Gordie Howe play for in 1973?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q358519 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1973' ) ) }","paraphrases":["What team was Gordie Howe a member of in 1973?"],"info":{}}
{"id":"train_20733","question":"What position does Jon Bjelke-Petersen hold if his position number is 31?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1528405 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '31' ) ) }","paraphrases":["Jon Bjelke-Petersen holds which position at number 31?"],"info":{}}
{"id":"train_20736","question":"What computer network protocol runs the main regulatory text of the Hypertext Transfer Protocol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8777 wdt:P92 ?obj . ?obj wdt:P31 wd:Q15836568 }","paraphrases":["What computer arrange convention runs the most administrative content of the Hypertext Exchange Protocol?"],"info":{}}
{"id":"train_20737","question":"Name building located on 5th Avenue that starts with letter B","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1021645 . ?sbj wdt:P669 wd:Q109858 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name building positioned on fifth Avenue that starts with letter B"],"info":{}}
{"id":"train_20738","question":"What at Ferdinand de Saussure has doctoral thesis as De l'emploi du génitif absolu en sanscrit ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q13230 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P1026 wd:Q23846572 }","paraphrases":["Where at De l'emploi du génitif absolu en sanscrit Ferdinand de Saussure study his doctoral thesis?"],"info":{}}
{"id":"train_20739","question":"Which organization founded the United Nations General Assembly?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P112 wd:Q47423 . ?sbj wdt:P31 wd:Q43229 }","paraphrases":["Which organization established the Joined together Countries Common Assembly?"],"info":{}}
{"id":"train_20743","question":"Is it true that the orbits completed of the STS-68 is 218.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q169018 wdt:P1418 ?obj filter ( ?obj = 218.4 ) }","paraphrases":["Did the STS-68 orbit around 218 times?"],"info":{}}
{"id":"train_20744","question":"what did sub-orbital spaceflight mean for the mission that the crew member Alan Shepard was a part of","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1029 wd:Q174979 . ?sbj wdt:P31 wd:Q832435 }","paraphrases":["What suborbital spaceflight meant for the mission was Alan Shepard's crew member part of"],"info":{}}
{"id":"train_20745","question":"Which is the opera the lyrics of which were by Philip Glass?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P676 wd:Q189729 . ?sbj wdt:P31 wd:Q1344 }","paraphrases":["Philip Glass wrote the lyrics for what opera?"],"info":{}}
{"id":"train_20747","question":"In which part of Spain did Antonio Gades die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q561048 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q29 }","paraphrases":["Where in Spain did Antonio Gades die."],"info":{}}
{"id":"train_20749","question":"Was Kate_Winslet partner Stephen Tredre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q202765 wdt:P451 wd:Q16013977 }","paraphrases":["Is it true that Kate Winslet was the partner of Stephen Tredre?"],"info":{}}
{"id":"train_20750","question":"Mention the Wikidata property for the physical quantity Volume","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1629 wd:Q39297 . ?sbj wdt:P31 wd:Q21077852 }","paraphrases":["Mention of the physical quantity Wikidata property"],"info":{}}
{"id":"train_20752","question":"Where and what did John Crisham study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q106465 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["Where and what did John Crisham study?"],"info":{}}
{"id":"train_20754","question":"Tell me about series of Krishna and followed by?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q42891 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P156 ?value1 . }","paraphrases":["Let me know almost arrangement of Krishna and taken after by?"],"info":{}}
{"id":"train_20756","question":"Which is the YouTube playlist ID for Thriller?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q44320 wdt:P4300 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20757","question":"What racing team was Ayrton Senna part of in 1994?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q10490 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["in 1994, what was the racing team of Ayrton Senna?"],"info":{}}
{"id":"train_20758","question":"Is the number of children at Grace Park more than 0.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q230722 wdt:P1971 ?obj filter ( ?obj > 0.8 ) }","paraphrases":["Is the number of children at Beauty Stop more than 0.8?"],"info":{}}
{"id":"train_20759","question":"What is Eric Heiden's speed skating base.eu ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q311289 wdt:P2350 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20760","question":"What award did Bob Fosse receive at the 45th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q313256 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q918125 }","paraphrases":["What was Bob Fosse awarded at the 45th Academy Awards?"],"info":{}}
{"id":"train_20762","question":"When Duisburg started as head of government August Seeling?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2100 p:P6 ?s . ?s ps:P6 wd:Q763958 . ?s pq:P580 ?value }","paraphrases":["On what date Duisburg started as head of government August Seeling?"],"info":{}}
{"id":"train_20764","question":"In what year was Edward the Martyr buried at the Church of St. Edward the Martyr?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q192920 p:P119 ?s . ?s ps:P119 wd:Q5117215 . ?s pq:P580 ?value }","paraphrases":["When was Edward the Martyr buried at the Church of St. Eward the Martyr?"],"info":{}}
{"id":"train_20766","question":"Is the radius of Barnard's Star equal to 0.175?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q14268 wdt:P2120 ?obj filter ( ?obj = 0.175 ) }","paraphrases":["What is the radius of Barnard's Star?"],"info":{}}
{"id":"train_20767","question":"Which means {Storting person ID} from{Trygve Lie} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1271 wdt:P3072 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20769","question":"What is the conjugate acid of sulfuric acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4147 wd:Q4118 . ?sbj wdt:P31 wd:Q107968 }","paraphrases":["What is the conjugate corrosive of sulfuric acid?"],"info":{}}
{"id":"train_20771","question":"In which season did F.C.Porto sports celebrated its winning moment.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q128446 wdt:P2522 ?obj . ?obj wdt:P31 wd:Q27020041 }","paraphrases":["In which season did F.C.Porto sports celebrated its winning moment."],"info":{}}
{"id":"train_20774","question":"Which 2+2 has the largest torque?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3658098 . ?ent wdt:P2230 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Tell me which 2+2 contains the largest torque."],"info":{}}
{"id":"train_20775","question":"The KGB applies to jurisdiction in how many areas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q80919 wdt:P1001 ?obj }","paraphrases":["How many areas does KGB jurisdiction apply?"],"info":{}}
{"id":"train_20776","question":"When was the Battle of the Bulge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q151018 wdt:P2348 ?obj . ?obj wdt:P31 wd:Q103495 }","paraphrases":["when did the Battle of the Bulge break out?"],"info":{}}
{"id":"train_20777","question":"Which is the platform for Street Fighter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q288035 wdt:P400 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20778","question":"How many lakes flow out to the Yukon River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P201 wd:Q104437 }","paraphrases":["How many tributaries does the Yukon River have?"],"info":{}}
{"id":"train_20780","question":"Tell me the franchise that fictional universe described in Avengers: Age of Ultron and which that starts with c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q196600 . ?sbj wdt:P1445 wd:Q14171368 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal me the franchise that fictional universe described in Avengers: Age of Ultron and which that begins with c"],"info":{}}
{"id":"train_20782","question":"What is the twinned administrative body which is located in the territorial administrative entity of Staten Island?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q18432 wdt:P190 ?ans_1 . wd:Q18432 wdt:P131 ?ans_2 }","paraphrases":["What pair of administrative bodies can be found in the administrative territory of Staten Island?"],"info":{}}
{"id":"train_20784","question":"Mention the animation studio built for operating the American Broadcasting Company","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q169889 wdt:P137 ?obj . ?obj wdt:P31 wd:Q1107679 }","paraphrases":["Notice the activity studio worked for working the American Broadcasting Company"],"info":{}}
{"id":"train_20785","question":"What does the Companhia do Metropolitano de São Paulo operate in the São Paulo Metrô?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q483343 p:P137 ?s . ?s ps:P137 wd:Q38182538 . ?s pq:P518 ?value }","paraphrases":["In Sao Paulo Metro, what company does Companhia do Metropolitano de Sao Paulo operate?"],"info":{}}
{"id":"train_20787","question":"Which play includes the character Dionysus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P674 wd:Q41680 . ?sbj wdt:P31 wd:Q25379 }","paraphrases":[],"info":{}}
{"id":"train_20788","question":"What was the instance  in 1368 that was the inception of the Ming Dynasty.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9903 p:P571 ?s . ?s ps:P571 ?x filter ( contains ( YEAR ( ?x ) , '1368' ) ) . ?s pq:P31 ?value }","paraphrases":["What happened in 1368 that paved way to the establishment of the Ming Dinasty?"],"info":{}}
{"id":"train_20789","question":"What is the date of birth and death of Abigail Adams who has a son with John Quincy Adams?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q11816 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When did John Quincy Adams' wife Abigail Adams pass away?"],"info":{}}
{"id":"train_20792","question":"Who is the {voice dubber} of the {Professor}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28528264 wdt:P1441 ?X . ?X wdt:P725 ?answer }","paraphrases":["Who is the {voice dubber} of the {Professor}?"],"info":{}}
{"id":"train_20793","question":"What is the Baltisches Biographisches Lexikon digital ID for Pavel Schilling?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q717731 wdt:P2580 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20797","question":"What is confused with acrobatics, whose label is Rawkus Records?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q193036 wdt:P1889 ?answer . ?answer wdt:P264 wd:Q1426154 }","paraphrases":["What is confounded with trapeze artistry, whose name is Rawkus Records?"],"info":{}}
{"id":"train_20798","question":"Fo what film did Jack Nicholson get the Academy Award nomination for Best Supporting Actor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q39792 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P805 ?value }","paraphrases":["At the Academy Awards, what movie did Jack Nicholson get nominated for Best Supporting Actor?"],"info":{}}
{"id":"train_20800","question":"In which location did Vladimir Putin's manager/director serve as the intelligence agent?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q7747 p:P39 ?s . ?s ps:P39 wd:Q392651 . ?s pq:P276 ?value1 . ?s pq:P1037 ?value2 }","paraphrases":["In which place did Vladimir Putin's manager/director serve as the brain agent?"],"info":{}}
{"id":"train_20801","question":"What is the part of constellation of setting location of Mass Effect 2 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q725057 wdt:P840 ?X . ?X wdt:P59 ?answer }","paraphrases":["What is the section of constellation of placing vicinity of Mass Effect 2 ?"],"info":{}}
{"id":"train_20802","question":"Who is the {person} as {child} of {Stanley Kubrick}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2001 wdt:P40 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the {individual} as {child} of {Stanley Kubrick}?"],"info":{}}
