{"id":"train_14657","question":"What are the food ingredient which start with the letter zucchini","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25403900 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zucchini' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the food ingredient that starts with the letter zicchini"],"info":{}}
{"id":"train_14658","question":"When was Volgograd founded?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q914 p:P31 ?s . ?s ps:P31 ?x filter ( contains ( ?x , 'http://dbpedia.org/ontology/City' ) ) . ?s pq:P580 ?value }","paraphrases":["Which year was Volgograd founded?"],"info":{}}
{"id":"train_14660","question":"What is the name after the Lagrangian mechanics that contain the bname Joseph Louis Lagrange?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q324669 wdt:P138 ?answer . ?answer wdt:P1477 ?x FILTER ( contains ( ?x , 'Joseph Louis Lagrange' ) ) }","paraphrases":["What is the name after the Lagrangian mechanics that comprise the bname Joseph Louis Lagrange?"],"info":{}}
{"id":"train_14663","question":"Tell me naval offensive  whose name has the word attack in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6982012 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'attack' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the naval offensive whose name is attached to the word."],"info":{}}
{"id":"train_14664","question":"Who is the secretary general for Michel Aflaq?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3975 wd:Q355416 }","paraphrases":[],"info":{}}
{"id":"train_14666","question":"Which is the JMDb film ID for Nausicaä of the Valley of the Wind?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q8885676 wdt:P2400 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14669","question":"Since when was Forbes Burnham a member of the People's National Congress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q718256 p:P102 ?s . ?s ps:P102 wd:Q647210 . ?s pq:P580 ?value }","paraphrases":["When was Forbes Burnham a member of the PNC?"],"info":{}}
{"id":"train_14670","question":"What crystal system was crafted out of a glacier?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35666 wdt:P186 ?X . ?X wdt:P556 ?answer }","paraphrases":["What gem framework was made out of a glacier"],"info":{}}
{"id":"train_14672","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P180 wd:Q935 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["There is no question to paraphrase."],"info":{}}
{"id":"train_14673","question":"Music by 21st Century Schizoid Man is part of what label?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41414789 wdt:P86 ?X . ?X wdt:P264 ?answer }","paraphrases":["Music by 21st Century Schizoid Man is portion of what label?"],"info":{}}
{"id":"train_14674","question":"\"Is the human population in Peace of Westphalia 163168.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q150995 wdt:P276 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '163168.0' ) ) }","paraphrases":["\"Is the human populace in Peace of Westphalia 163168.0?"],"info":{}}
{"id":"train_14676","question":"When and for what did Martin Scorsese receive the Honorary César?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q41148 p:P166 ?s . ?s ps:P166 wd:Q727282 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["When and for what did Martin Scorsese get hold of the Honorary César?"],"info":{}}
{"id":"train_14678","question":"When was the position of Alfred, Lord Tennyson as Poet Laureate of the United Kingdom came to an end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q173869 p:P39 ?s . ?s ps:P39 wd:Q877838 . ?s pq:P582 ?value }","paraphrases":["When was the position of Alfred, Ruler Tennyson as Writer Laureate of the Joined together Kingdom came to an end?"],"info":{}}
{"id":"train_14680","question":"The Communist party of the Soviet Union, had a daily newspaper that was considered to be the mouthpiece of their propaganda; do you recall what it was?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q79854 wdt:P2813 ?obj . ?obj wdt:P31 wd:Q1110794 }","paraphrases":["The Soviet Union Communist Party had a daily newspaper that was considered their propaganda's mouthpiece ; do you remember what it was?"],"info":{}}
{"id":"train_14681","question":"Which award did Rosa Parks receive in 1980?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41921 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["What award was Rosa Parks given in 1980?"],"info":{}}
{"id":"train_14682","question":"How many diameter of 2 Pallas ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3002 wdt:P2386 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14684","question":"What town in Pennsylvania is Punxsutawney Phil from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4483668 wdt:P276 ?answer . ?answer wdt:P131 wd:Q1400 }","paraphrases":["What town in Pennsylvania is Punxsutawney Phil from?"],"info":{}}
{"id":"train_14686","question":"Is the Malta VAT-rate less than 14.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q233 wdt:P2855 ?obj filter ( ?obj < 14.4 ) }","paraphrases":["Is 14.4 greater than the Malta VAT-rate?"],"info":{}}
{"id":"train_14687","question":"Mention the year span in which Rey Gasnier  became member of the from the Australia national rugby league team","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3423313 p:P54 ?s . ?s ps:P54 wd:Q3589757 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["What was the year span in which Rey Gasnier become a member of the Australia national rugby league team?"],"info":{}}
{"id":"train_14688","question":"tell me phase of life starts with z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1811014 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which phase of life starts with the letter Z?"],"info":{}}
{"id":"train_14690","question":"Which {has fruit type} and the {this taxon is source of} of {Potato} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q10998 wdt:P4000 ?ans_1 . wd:Q10998 wdt:P1672 ?ans_2 }","paraphrases":["Which {has fruit type} and the {this taxon is source of} of {Potato} ?"],"info":{}}
{"id":"train_14691","question":"When did Cuba become a member of the UN?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q241 p:P463 ?s . ?s ps:P463 wd:Q1065 . ?s pq:P580 ?value }","paraphrases":["The year Cuba joined the UN"],"info":{}}
{"id":"train_14692","question":"Which is the Argentine Olympic Committee athlete ID for Manu Ginóbili?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q213132 wdt:P4065 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14699","question":"What is the population of Yemen in the year 1994?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q805 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["In 1994, what was Yemen's population?"],"info":{}}
{"id":"train_14700","question":"Is the neutron number of argon-39 equal to 21?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1928577 wdt:P1148 ?obj filter ( ?obj = 21 ) }","paraphrases":["Does argon-39 have 21 neutrons?"],"info":{}}
{"id":"train_14705","question":"What are the technical term which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12812139 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the technical term which begin with the letter v"],"info":{}}
{"id":"train_14708","question":"Which noble family of Henry II of England was co-founded by Ingelger?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q102140 wdt:P53 ?answer . ?answer wdt:P112 wd:Q525747 }","paraphrases":["Which respectable family of Henry II of Britain was co-founded by Ingelger?"],"info":{}}
{"id":"train_14711","question":"What is Hikaru Utada's label company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q234598 wdt:P264 ?X . ?X wdt:P355 ?answer }","paraphrases":["What is Hikaru Utada's name company?"],"info":{}}
{"id":"train_14714","question":"Does the M1939 have an effective firing range of 8000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q701703 wdt:P4176 ?obj filter ( ?obj = 8000 ) }","paraphrases":["Is an effective firing range of 8000 accurate for the M1939?"],"info":{}}
{"id":"train_14716","question":"Who is the structural engineer for Burj al-Arab?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q62939 wdt:P631 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14720","question":"In what part of the German Empire was Bertold Brecht born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q38757 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P361 wd:Q43287 }","paraphrases":["Where in the German Empire was Bertold Brecht conceived?"],"info":{}}
{"id":"train_14722","question":"Tell me novel series whose name has the word twilight  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1667921 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'twilight' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which novel series contains the term \"twilight\" in its name?"],"info":{}}
{"id":"train_14723","question":"Tell me unit of volume whose name has the word ćwierć in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1302471 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ćwierć' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What volume is cwierc?"],"info":{}}
{"id":"train_14725","question":"What honours did the composer of Symphony No. 9 receive?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11985 wdt:P86 ?X . ?X wdt:P166 ?answer }","paraphrases":["What respects did the composer of Orchestra No. 9 receive?"],"info":{}}
{"id":"train_14727","question":"What maritime identification digits signify the place of origin of Walden?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q863534 wdt:P495 ?X . ?X wdt:P2979 ?answer }","paraphrases":["What oceanic distinguishing proof digits imply the put of root of Walden?"],"info":{}}
{"id":"train_14728","question":"Tell me type of cheese whose name has the word tronchon in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3546121 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tronchon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE TYPE OF CHEESE ITS NAME HAS THE WORD TRONCHON IN IT"],"info":{}}
{"id":"train_14730","question":"Which is the OpenCitations bibliographic resource ID for Journal of the American Chemical Society?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q898902 wdt:P3181 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14736","question":"Is the right ascension of 3C 273 equal to 149.822332?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q229318 wdt:P6257 ?obj filter ( ?obj = 149.822332 ) }","paraphrases":["Is 149.822332 the right ascension of 3C 273?"],"info":{}}
{"id":"train_14737","question":"Tell me subculture whose name has the word therianthropes in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q264965 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'therianthropes' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me subculture whose name has the word therianthropes in it."],"info":{}}
{"id":"train_14739","question":"Was Ranbir Kapoor's native language Bengali?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1063412 wdt:P103 wd:Q9610 }","paraphrases":["Is Bengali the native language for Ranbir Kapoor?"],"info":{}}
{"id":"train_14740","question":"Where is Toshiro Mifune's place of death in the villages of Shinjuku-ku?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37001 wdt:P20 ?answer . ?answer wdt:P150 wd:Q179645 }","paraphrases":["Where is Toshiro Mifune's put of passing within the towns of Shinjuku-ku?"],"info":{}}
{"id":"train_14741","question":"What was first discovered in scientific data analysis that caused death by tuberculosis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10861030 wdt:P61 ?answer . ?answer wdt:P509 wd:Q12204 }","paraphrases":["What was to begin with found in logical information investigation that caused passing by tuberculosis?"],"info":{}}
{"id":"train_14743","question":"Who is the concubine of the scriptwriter of The Lady Without Camelias?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3208121 wdt:P58 ?X . ?X wdt:P451 ?answer }","paraphrases":["Who is The Lady Without Camelias ' scriptwriter's concubine?"],"info":{}}
{"id":"train_14746","question":"What is the period of time Ústí nad Labem Region has set to 41.6?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q192702 p:P4442 ?s . ?s ps:P4442 ?x filter ( contains ( ?x , '41.6' ) ) . ?s pq:P585 ?value }","paraphrases":["On what time did Ústí nad Labem Region has set to 41.6?"],"info":{}}
{"id":"train_14747","question":"What is the capital of Nanjing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q16666 . ?sbj wdt:P31 wd:Q50068795 }","paraphrases":["What is the capital of Nanjing?"],"info":{}}
{"id":"train_14748","question":"What is NBN System Key for Accipiter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q188737 wdt:P3240 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14749","question":"How many lung afflictions exist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P689 wd:Q7886 }","paraphrases":["There are how many lung afflictions?"],"info":{}}
{"id":"train_14750","question":"What are thebarycenter which start with the letter center","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q809690 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'center' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are thebarycenter which begin with the letter center"],"info":{}}
{"id":"train_14751","question":"What timeline is the topic of the aspect of Mathematical formulation of quantum mechanics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q606855 wdt:P1269 ?X . ?X wdt:P2184 ?answer }","paraphrases":["What timeline is the subject of the perspective of Scientific detailing of quantum mechanics?"],"info":{}}
{"id":"train_14752","question":"What is adjacent to Yamanashi Prefecture, that has municipalities in Haibara District?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132720 wdt:P47 ?answer . ?answer wdt:P150 wd:Q1203336 }","paraphrases":["What is adjoining to Yamanashi Prefecture, that has regions in Haibara District?"],"info":{}}
{"id":"train_14753","question":"who is excavation director of Assur ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4345 wd:Q200200 }","paraphrases":[],"info":{}}
{"id":"train_14754","question":"What time zone is Salerno located in at UTC+02:00?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1083 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value }","paraphrases":["What is the time zone for Salerno, which is located in UTC+2:00?"],"info":{}}
{"id":"train_14755","question":"Who was the spouse of Rudolph Valentino and when did they divorce?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q188692 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who was the wife of Rudolph Valentino and when did the marriage end?"],"info":{}}
{"id":"train_14756","question":"Pikachu is on the list of characters in Super Smash Bros. Who are some of the non-playable characters?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9351 wdt:P1441 ?answer . ?answer wdt:P1881 wd:Q17225533 }","paraphrases":["Pikachu is on the list of characters in Super Smash Bros. Who are some of the non-playable characters?"],"info":{}}
{"id":"train_14758","question":"What is Schläfli symbol of pyramid ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3358290 wdt:P3228 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14760","question":"What country has the official language of Norwegian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q9043 . ?sbj wdt:P31 wd:Q28575 }","paraphrases":["Which country has Norwegian's official language?"],"info":{}}
{"id":"train_14763","question":"Which position did Mahavira replace Parshvanatha for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9422 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q1400271 }","paraphrases":["Give me the name of the position in which Mahavira replace Parshvanatha for?"],"info":{}}
{"id":"train_14765","question":"What is between the connection of Fukushima Prefectural Road Route 52?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11593658 wdt:P2789 ?X . ?X wdt:P609 ?answer }","paraphrases":["What is between the association of Fukushima Prefectural Street Course 52?"],"info":{}}
{"id":"train_14766","question":"Is Global Warming the opposite of Global Cooling?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7942 wdt:P461 wd:Q1322176 }","paraphrases":["Are Global Cooling and Global Warming opposite of each other?"],"info":{}}
{"id":"train_14767","question":"Name the impact crater on Mars with the smallest diameter.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q55818 . ?ent wdt:P2386 ?obj . ?ent wdt:P31 wd:Q1475691 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Name the smallest - diameter impact crater on Mars."],"info":{}}
{"id":"train_14768","question":"How do you use a microphone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P479 wd:Q46384 }","paraphrases":[],"info":{}}
{"id":"train_14769","question":"what is marriageable age for Hungary?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q28 wdt:P3000 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14770","question":"Obergefell v Hodges overrules?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q19866992 wdt:P4006 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14771","question":"What award John Kenneth Galbraith received at 1993-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q186042 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1993' ) ) }","paraphrases":["Which award John Kenneth Galbraith received at 1993-1-1?"],"info":{}}
{"id":"train_14772","question":"Where is the birth place of Jonathan Edwards whose inhabitants are 9000.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q221648 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '9000.0' ) ) }","paraphrases":["Name the place of birth of Jonathan Edwards whose inhabitants are 9000?"],"info":{}}
{"id":"train_14773","question":"Which guide book that starts with the letter א","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223638 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'א' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which guide book begins with the letter"],"info":{}}
{"id":"train_14775","question":"What is the historical total fertility rate of Mali?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q927301 wdt:P1269 ?X . ?X wdt:P4841 ?answer }","paraphrases":["The historical total fertility rate of Mali is what?"],"info":{}}
{"id":"train_14776","question":"What nominative-accusative dead language has the least number of speakers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q45762 . ?ent wdt:P1098 ?obj . ?ent wdt:P4132 wd:Q178435 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which of the nominative-accusative dead language possesses the lowest number of speakers?"],"info":{}}
{"id":"train_14777","question":"What painting depicts Dante Alighieri?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P180 wd:Q1067 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["What painting showcases Dante Alighieri?"],"info":{}}
{"id":"train_14778","question":"Based in Arizona, what is David Spade's alma mater?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q298658 wdt:P69 ?answer . ?answer wdt:P131 wd:Q816 }","paraphrases":["What is the alma mater of David Spade, based in Arizona?"],"info":{}}
{"id":"train_14781","question":"Who has the craft of songwriter and is the lyricist of Dixie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1231722 wdt:P676 ?answer . ?answer wdt:P106 wd:Q753110 }","paraphrases":["Who has the craft of songwriter and is the lyricist of Dixie?"],"info":{}}
{"id":"train_14782","question":"What scripting language designed by Rasmus Lerdorf starts with letter p ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q187432 . ?sbj wdt:P287 wd:Q92768 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What scripting language designed with the aid of Rasmus Lerdorf begins with letter p ?"],"info":{}}
{"id":"train_14783","question":"What type of geography is on the continent of Eastern Bloc?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170541 wdt:P30 ?X . ?X wdt:P2633 ?answer }","paraphrases":["On the continent of Easter Bloc, what type of geography can be found?"],"info":{}}
{"id":"train_14785","question":"When did Józef Cyrankiewicz and his spouse Nina Andrycz get divorced?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q434797 p:P26 ?s . ?s ps:P26 wd:Q5404155 . ?s pq:P582 ?value }","paraphrases":["When did the divorce of Jozef Cyrankiewicz and his wife Nina Angrycz happen?"],"info":{}}
{"id":"train_14786","question":"What is the tributary of the spans of the Ma'anshan Bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14629163 wdt:P177 ?X . ?X wdt:P974 ?answer }","paraphrases":["What is the tributary of the ranges of the Ma'anshan Bridge?"],"info":{}}
{"id":"train_14787","question":"Was Komodo_dragon habitat Flores and Rinca ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4504 wdt:P2974 wd:Q148440 . wd:Q4504 wdt:P2974 wd:Q1164773 }","paraphrases":["Do Komodo dragons inhabit Flores and Rinca?"],"info":{}}
{"id":"train_14791","question":"Who has arrondissements to the district of Concord?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28249 wdt:P131 ?X . ?X wdt:P150 ?answer }","paraphrases":["Who has arrondissements to the area of Concord?"],"info":{}}
{"id":"train_14794","question":"Where is the Louis Armstrong museum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P466 wd:Q1779 . ?sbj wdt:P31 wd:Q10624527 }","paraphrases":["where is the museum about Louis Armstrong?"],"info":{}}
{"id":"train_14796","question":"How many political alignments are in the left-wing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1387 wd:Q164597 }","paraphrases":["The left-wing has how many political alignments?"],"info":{}}
