{"id":"train_18870","question":"which group starts with the letter o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16887380 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which bunch begins with the letter o"],"info":{}}
{"id":"train_18871","question":"Who is {victim} {participated in conflict} of {Guy de Montlaur} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3122281 wdt:P607 ?X . ?X wdt:P710 ?answer }","paraphrases":["Who is {casualty} {taken an interest in struggle} of {Fellow de Montlaur} ?"],"info":{}}
{"id":"train_18872","question":"What intersection of Anaxagoras has the abbreviation 男?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83041 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , '男' ) ) }","paraphrases":["What crossing point of Anaxagoras has the shortened form"],"info":{}}
{"id":"train_18875","question":"Name the death location of John X, which has a twin town called Cincinnati.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q227976 wdt:P20 ?answer . ?answer wdt:P190 wd:Q43196 }","paraphrases":["Name the death vicinity of John X, which has a twin town called Cincinnati."],"info":{}}
{"id":"train_18876","question":"whats the classification of eddy merckx","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2417 wd:Q103756 }","paraphrases":[],"info":{}}
{"id":"train_18878","question":"who disease for has effect of bacteria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10876 wdt:P1542 ?obj . ?obj wdt:P31 wd:Q12136 }","paraphrases":["who malady for has impact of bacteria?"],"info":{}}
{"id":"train_18879","question":"who rank for taxon rank of Dodo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43502 wdt:P105 ?obj . ?obj wdt:P31 wd:Q3100180 }","paraphrases":["What is the taxonomic rank of the Dodo?"],"info":{}}
{"id":"train_18880","question":"na","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q229619 p:P54 ?s . ?s ps:P54 wd:Q1276685 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["na"],"info":{}}
{"id":"train_18881","question":"How many industries does Bayer AG operate in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q152051 wdt:P452 ?obj }","paraphrases":["What is the number of industries Bayer AG operates?"],"info":{}}
{"id":"train_18882","question":"What event involving Punxsutawney Phil is on February 2, 1004?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4483668 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["Give me the event name of involving Punxsutawney Phil is on February 2, 1004?"],"info":{}}
{"id":"train_18883","question":"Tell me the population of the history of the Marshall Islands.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q899049 wdt:P1269 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Let me know the populace of the history of the Marshall Islands."],"info":{}}
{"id":"train_18884","question":"Which band contains the word u2 in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215380 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'u2' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which band contains in its name the word u2"],"info":{}}
{"id":"train_18885","question":"Is the angle from vertical of the Church tower, Miedum equal to 4.72?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13138368 wdt:P4183 ?obj filter ( ?obj = 4.72 ) }","paraphrases":["Tell me if the vertical angel of the Church tower Miedum is equal to 4.72."],"info":{}}
{"id":"train_18886","question":"\"Which is {diplomatic relation} of {Rwanda}, where {member of} is {Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1037 wdt:P530 ?answer . ?answer wdt:P463 wd:Q795985 }","paraphrases":["\"Which is {diplomatic relation} of {Rwanda}, where {member of} is {Bay of Bengal Initiative for Multi-Sectoral Technical and Economic Cooperation} ?\""],"info":{}}
{"id":"train_18887","question":"What is the population of Fuenlabrada in the year 2005?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q54902 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2005' ) ) }","paraphrases":["In 2005, how many people lived in Fuenlabrada?"],"info":{}}
{"id":"train_18888","question":"Where did Ken Burns study design?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q616886 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q82604 }","paraphrases":["Ken Burns studied design where?"],"info":{}}
{"id":"train_18890","question":"What is the diplomatic relation of the sovereign state of Mataram?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14126 wdt:P17 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is the conciliatory connection of the imperial state of Mataram?"],"info":{}}
{"id":"train_18891","question":"What is the castle for the burial place of Hadrian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1427 wdt:P119 ?obj . ?obj wdt:P31 wd:Q23413 }","paraphrases":["What is the castle for the monument of Hadrian?"],"info":{}}
{"id":"train_18892","question":"What is the product of the brand of Yum China ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q30645592 wdt:P1716 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What is the item of the brand of Yum China ?"],"info":{}}
{"id":"train_18893","question":"what is the {start time} for {Tilda Swinton} which has {partner} as {John Byrne} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q200534 p:P451 ?s . ?s ps:P451 wd:Q6224236 . ?s pq:P580 ?value }","paraphrases":["what is the {begin time} for {Tilda Swinton} which has {accomplice} as {John Byrne} ?"],"info":{}}
{"id":"train_18894","question":"What sports team is Hope Solo a member of and how many matches did she play?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q229619 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["Which sports team is a member of Hope Solo and how many matches has she played?"],"info":{}}
{"id":"train_18895","question":"Which was the cryptocurrency being invented by Satoshi Nakamoto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P178 wd:Q13382352 . ?sbj wdt:P31 wd:Q13479982 }","paraphrases":["Which was the cryptocurrency being designed by Satoshi Nakamoto?"],"info":{}}
{"id":"train_18896","question":"Name the lake with the highest salinity among those described by Paulys Realenzyklopädie der klassischen Altertumswissenschaft.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23397 . ?ent wdt:P4350 ?obj . ?ent wdt:P1343 wd:Q1138524 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Of the lakes that Paulys Realenzyklopädie der klassischen Altertumswissenschaft described, which has the highest salinity?"],"info":{}}
{"id":"train_18897","question":"How many operas did Philip Glass write?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P87 wd:Q189729 }","paraphrases":["Which is the number of operas that Philip Glass wrote?"],"info":{}}
{"id":"train_18898","question":"How many number of children is in the president of FIFA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q253414 wdt:P488 ?X . ?X wdt:P1971 ?answer }","paraphrases":["How many children does the president of FIFA have?"],"info":{}}
{"id":"train_18899","question":"According to the census, what is the population of Santos?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q81882 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["What is Santos's population, referencing the census?"],"info":{}}
{"id":"train_18900","question":"What is the event location of the event during the Pacific War located on a tributary of the Ruvu River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184425 wdt:P276 ?answer . ?answer wdt:P974 wd:Q2177943 }","paraphrases":["What is the occasion area of the occasion amid the Pacific War found on a tributary of the Ruvu River?"],"info":{}}
{"id":"train_18901","question":"What is the population of Cambridge, Massachusetts in the year 1880?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q49111 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1880' ) ) }","paraphrases":["What is the number of inhabitants in Cambridge, Massachusetts in the year 1880?"],"info":{}}
{"id":"train_18903","question":"When did Bukhara have a population of 111600?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5764 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '111600.0' ) ) . ?s pq:P585 ?value }","paraphrases":["Name the year in which Bukhara had a population of 11160."],"info":{}}
{"id":"train_18904","question":"Who is the spouse of the Sailor Moon author?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q704353 wdt:P58 ?X . ?X wdt:P26 ?answer }","paraphrases":["Give me the wife of the author of Sailor Moon."],"info":{}}
{"id":"train_18905","question":"What are the orbits of Europa and it's moon Thebe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3143 wdt:P397 ?answer . ?answer wdt:P398 wd:Q16765 }","paraphrases":["What are the circles of Europa and it's moon Thebe?"],"info":{}}
{"id":"train_18906","question":"which is the head quarter'wss location  and the  award recceived for the  planned _parenthood?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q2553262 wdt:P159 ?ans_1 . wd:Q2553262 wdt:P166 ?ans_2 }","paraphrases":["Where is planned parenthood located and what award did they receive?"],"info":{}}
{"id":"train_18907","question":"How many are interested in nationalism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2650 wd:Q6235 }","paraphrases":["Nationalism interests what number of people?"],"info":{}}
{"id":"train_18908","question":"What was Michael Chabon nominated for at the start of 2008?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q313466 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2008' ) ) }","paraphrases":["in 2008 michael chabon was nominated for?"],"info":{}}
{"id":"train_18911","question":"Who is the relative and what is the role of Dirk Nowitzki?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q44068 wdt:P1038 ?ans_1 . wd:Q44068 wdt:P413 ?ans_2 }","paraphrases":["What is Dirk Nowitzki's role and who is the relative?"],"info":{}}
{"id":"train_18912","question":"When did Johann Olav Koss receive the Jonas Prize aware?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q318403 p:P166 ?s . ?s ps:P166 wd:Q11979223 . ?s pq:P585 ?value }","paraphrases":["On what date did Johann Olav Koss receive the Jonas Prize Award?"],"info":{}}
{"id":"train_18913","question":"Name a civil aircraft operated by American Airlines.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q32396 wdt:P121 ?obj . ?obj wdt:P31 wd:Q2438179 }","paraphrases":[],"info":{}}
{"id":"train_18914","question":"What venue of the Battle of Nahāvand is in the borough of Central District?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q603549 wdt:P276 ?answer . ?answer wdt:P131 wd:Q4814073 }","paraphrases":["What scene of the Fight of Nahāvand is within the borough of Central District?"],"info":{}}
{"id":"train_18916","question":"Which campus of the State University of New York has the zip code 12246?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1140241 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P281 ?x filter ( contains ( ?x , '12246' ) ) }","paraphrases":["What campus of SUNY is in the 12246 zip code?"],"info":{}}
{"id":"train_18917","question":"What is landscape made of from Still Life with Apples?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3873325 wdt:P180 ?X . ?X wdt:P1582 ?answer }","paraphrases":["Who is the administrator of the WOW air service?"],"info":{}}
{"id":"train_18918","question":"What award did Jack Kilby receive in 1993?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q182031 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1993' ) ) }","paraphrases":["What was the name of the award Jack Kilby received in 1993?"],"info":{}}
{"id":"train_18919","question":"Who is the {protein} for {physically interacts with} of {fentanyl}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P129 wd:Q407541 . ?sbj wdt:P31 wd:Q8054 }","paraphrases":["Who is the {protein} for {physically interatomic with} of {fentanyl}"],"info":{}}
{"id":"train_18920","question":"IS THE NUMBER OF MISSING OF BRUMADINHO DAM DISASTER EQUALS 84","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q60998244 wdt:P1446 ?obj filter ( ?obj = 84 ) }","paraphrases":["IS THE EQUALS NUMBER OF BRUMADINHO DAM DISASTER 84"],"info":{}}
{"id":"train_18921","question":"When was Aristide Briand nominated for the Nobel Peace Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q179888 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value }","paraphrases":["In what year was Aristide Briand nominated for the Nobel Peace Prize?"],"info":{}}
{"id":"train_18923","question":"Does National Basketball Association own CNN International and NBA Store?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q155223 wdt:P1830 wd:Q1282786 . wd:Q155223 wdt:P1830 wd:Q6952699 }","paraphrases":["Is National Basketball Association owned by CNN International and NBA Store?"],"info":{}}
{"id":"train_18924","question":"Which actor in Close Encounters of the Third Kind has worked as an astrophysicist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q320588 wdt:P161 ?answer . ?answer wdt:P106 wd:Q752129 }","paraphrases":["Which performing artist in Near Experiences of the Third Kind has worked as an astrophysicist?"],"info":{}}
{"id":"train_18925","question":"Mention the professional playing partner of Ernest Hemingway","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1327 wd:Q23434 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["With whom did Ernest Hemingway professionally partner playing?"],"info":{}}
{"id":"train_18926","question":"Was science studies Rashomon's original work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q135465 wdt:P364 ?X . ?X wdt:P2579 ?answer }","paraphrases":["Was science thinks about Rashomon's unique work?"],"info":{}}
{"id":"train_18927","question":"When did Gustave Doré receive his Legion of Honour as an Officer?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6682 p:P166 ?s . ?s ps:P166 wd:Q10855195 . ?s pq:P580 ?value }","paraphrases":["In which year did Gustave Doré receive his Legion of Honour as an Officer?"],"info":{}}
{"id":"train_18928","question":"What award did Joseph Dalton Hooker receive on January 1, 1885?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q157501 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1885' ) ) }","paraphrases":["On January 1, 1885 Joseph Dalton Hooker was honored with which award?"],"info":{}}
{"id":"train_18930","question":"What represents the artwork of Donatello?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37562 wdt:P800 ?X . ?X wdt:P180 ?answer }","paraphrases":["The artworks of Donatello is represented by what?"],"info":{}}
{"id":"train_18933","question":"Was Kathie Lee Gifford occupation,  composer and television presenter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q465695 wdt:P106 wd:Q36834 . wd:Q465695 wdt:P106 wd:Q947873 }","paraphrases":["Is Kathie Lee Gifford a composer and television presenter?"],"info":{}}
{"id":"train_18934","question":"What are the dollo which start with the letter tyler","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q168658 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tyler' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What dollo starts with the letter tyler?"],"info":{}}
{"id":"train_18936","question":"TELL ME GEOGRAPHIC REGION WHOSE NAME HAS THE WORD SUMADIJA IN IT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q82794 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'šumadija' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose ME GEOGRAPHIC REGION WHOSE NAME HAS THE WORD SUMADIJA IN IT"],"info":{}}
{"id":"train_18938","question":"did montpellier become the adnistrative territory in 1790-3-4?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q6441 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1790' ) ) }","paraphrases":["Was it in 1790-3-4 when Monpellier became administrative territory?"],"info":{}}
{"id":"train_18939","question":"Wich means{BNB person ID} at{Martha Nussbaum} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q235470 wdt:P5361 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18940","question":"Which is founded by George Safford Parker?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P112 wd:Q3081252 }","paraphrases":[],"info":{}}
{"id":"train_18942","question":"What is the position and electoral district of Tony Abbott?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q348577 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 ?value1 . }","paraphrases":["What is the position and electoral district of Tony Abbott?"],"info":{}}
{"id":"train_18946","question":"Name the profession of people working with interior design","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P425 wd:Q179232 . ?sbj wdt:P31 wd:Q28640 }","paraphrases":["Name the occupation of people who work with interior design"],"info":{}}
{"id":"train_18947","question":"Which 1435 mm track gauge locomotive has the maximum boiler pressure?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19832486 . ?ent wdt:P5071 ?obj . ?ent wdt:P1064 wd:Q1999572 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What 1435 locomotive has the most boiler pressure?"],"info":{}}
{"id":"train_18948","question":"When was the end of the Ottoman Empire in Constantinople?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16869 p:P17 ?s . ?s ps:P17 wd:Q12560 . ?s pq:P582 ?value }","paraphrases":["What year did the Ottoman Empire in Constantinople come to an end?"],"info":{}}
{"id":"train_18949","question":"When did Catherine II of Russia gain citizenship of Prussia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36450 p:P27 ?s . ?s ps:P27 wd:Q27306 . ?s pq:P580 ?value }","paraphrases":["On what date did Catherine II of Russia gain citizenship of Prussia?"],"info":{}}
{"id":"train_18954","question":"Tell me the presentation by Sandra Hoffmann-Ursache and where she presented.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2221002 wdt:P1344 ?X . ?X wdt:P371 ?answer }","paraphrases":["Let me know the introduction by Sandra Hoffmann-Ursache and where she presented."],"info":{}}
{"id":"train_18956","question":"WHat is the galaxy where you an find the Andromeda constellation that contains the word \" ugc\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2488 . ?sbj wdt:P59 wd:Q9256 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ugc' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat is where you a discover the Andromeda star grouping that contains the word \" ugc\" in its name ?"],"info":{}}
{"id":"train_18957","question":"Who is {won by} {honorary title} of {Scott Cooper} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1750712 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who is {won by} {privileged title} of {Scott Cooper} ?"],"info":{}}
{"id":"train_18958","question":"Which Pyrénées-Orientales region produces the least amount of wine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2140699 . ?ent wdt:P2197 ?obj . ?ent wdt:P131 wd:Q12709 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which region in Pyrenees-Orientales produces the least amount of wine?"],"info":{}}
{"id":"train_18959","question":"How many matches and goals did Kenny Dalglish get when he played for Liverpool F.C.?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q187198 p:P54 ?s . ?s ps:P54 wd:Q1130849 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How many matches and desires did Kenny Dalglish get when he performed for Liverpool F.C.?"],"info":{}}
{"id":"train_18960","question":"Which is the musipedia tune ID for The Entertainer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1890794 wdt:P3352 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18961","question":"who is nominated of Annie Girardot that has work of Les Misérables ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q106443 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q1780602 }","paraphrases":["Give me the name of the nominated of Annie Girardot that has work of Les Misérables ?"],"info":{}}
{"id":"train_18962","question":"When did spouse of Drew Barrymore and end time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q676094 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["When did companion of Drew Barrymore and conclusion time?"],"info":{}}
{"id":"train_18966","question":"Which is the UN document symbol for International Covenant on Economic, Social and Cultural Rights?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q457862 wdt:P3069 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18967","question":"How many runway's are there at Tokyo International Airport?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q204853 wdt:P529 ?obj }","paraphrases":["Tokyo International Airport has how many runways?"],"info":{}}
{"id":"train_18969","question":"What was the capital of Alabama through 1846?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q173 p:P36 ?s . ?s ps:P36 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1846' ) ) }","paraphrases":["Until the end of 1846, what was Alabama's capital?"],"info":{}}
{"id":"train_18971","question":"How many places of burial are in Bolzano?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P119 wd:Q6526 }","paraphrases":["What is the number of burial places in Bolzano?"],"info":{}}
{"id":"train_18974","question":"Which sovereign state has the official language Latin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q397 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_18975","question":"On what day did Charles, Prince of Wales, become the Prince of Wales?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43274 p:P39 ?s . ?s ps:P39 wd:Q180729 . ?s pq:P580 ?value }","paraphrases":["When did Charles, Prince of Wales, become the Prince of Wales?"],"info":{}}
