{"id":"train_19095","question":"What is the edition of this religious book of King James?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q623398 wdt:P629 ?obj . ?obj wdt:P31 wd:Q179461 }","paraphrases":["What edition is this book of King James?"],"info":{}}
{"id":"train_19096","question":"Which is {number of matches played} and {number of points/goals/set scored} of {{Ricardo Zamora} {member of sports team} as {Catalonia national football team}}","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q296337 p:P54 ?s . ?s ps:P54 wd:Q17228 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How may matches did Ricardo Zamora played and how many goals did he score for the Catalonia national football team?"],"info":{}}
{"id":"train_19097","question":"Are The Happy Accidents of the Swing still on exhibit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2629559 wdt:P195 ?X . ?X wdt:P1435 ?answer }","paraphrases":["Are The Upbeat Mischances of the Swing still on exhibit?"],"info":{}}
{"id":"train_19098","question":"When did Carly Fiorina and Frank Fiorina get married","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q256380 p:P26 ?s . ?s ps:P26 wd:Q20165781 . ?s pq:P580 ?value }","paraphrases":["On what date were Carly and Frank Fiorina married?"],"info":{}}
{"id":"train_19101","question":"What is the criterion used for breast cancer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q128581 wdt:P1013 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19103","question":"What award did Allison Janney receive, that was won by Mary Steenburgen?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q229487 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q108935 }","paraphrases":["Allison Janney received what award that was won by Mary Steenburgen?"],"info":{}}
{"id":"train_19104","question":"Tell me the business of the stock exchange of the New York Stock Exchange that contains the word wabtec in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4830453 . ?sbj wdt:P414 wd:Q13677 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wabtec' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the commerce of the stock trade of the Unused York Stock Trade that contains the word wabtec in it's name?"],"info":{}}
{"id":"train_19105","question":"What are the people that are bordered by Londonderry County called?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192208 wdt:P47 ?X . ?X wdt:P1792 ?answer }","paraphrases":["What are the individuals that are bordered by Londonderry District called?"],"info":{}}
{"id":"train_19106","question":"What is the name of a feminist movement that has the word wereldvrouwenmars their name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15580856 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wereldvrouwenmars' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a women's activist development that has the word wereldvrouwenmars their name."],"info":{}}
{"id":"train_19107","question":"The function of a real variable is what input set?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q861681 wdt:P1851 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19109","question":"What college did Salvador Dali begin in 1922?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5577 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1922' ) ) }","paraphrases":["Which college did Salvador start in 1922?"],"info":{}}
{"id":"train_19110","question":"Which is the Zamenhof-Esperanto object for the language used of Esperanto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q143 . ?sbj wdt:P31 wd:Q75762 }","paraphrases":[],"info":{}}
{"id":"train_19112","question":"What is the nationality of Emmanuel Macron ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3052772 wdt:P27 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What is Emmanuel Macron's citizenship?"],"info":{}}
{"id":"train_19113","question":"What films did Marlon Brando direct?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P57 wd:Q34012 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Which films were directed by Marlon Brando?"],"info":{}}
{"id":"train_19114","question":"Tell me unitary authority of England whose name has the word wokingham in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1136601 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wokingham' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know unitary specialist of Britain whose title has the word wokingham in it."],"info":{}}
{"id":"train_19115","question":"Which is the Vine user ID for UEFA Champions League?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q18756 wdt:P3207 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19116","question":"What was the population in Brasilla at the time of 2.61e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2844 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '2.61e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["At the time of 2.61e+06, what was the population of Brasilla?"],"info":{}}
{"id":"train_19119","question":"What kind of music does Amalia's Pachelbel father?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q452904 wdt:P22 ?X . ?X wdt:P136 ?answer }","paraphrases":["Wha is Amalia Pachelbel's father's favorite type of music?"],"info":{}}
{"id":"train_19120","question":"Tell me magazine whose name has the word zillo in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41298 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zillo' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know magazine whose title has the word zillo in it."],"info":{}}
{"id":"train_19121","question":"Which {headquarters location} is {located in the administrative territorial entity} of {Princeton_University} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q21578 wdt:P159 ?ans_1 . wd:Q21578 wdt:P131 ?ans_2 }","paraphrases":["Name the headquarters is near the administrative territory of Princeton University?"],"info":{}}
{"id":"train_19125","question":"How many screenwriters are there for Casablanca?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q132689 wdt:P58 ?obj }","paraphrases":["Film Screenwriters List of Casablanca Movie Writers. ... Often times there are multiple writers for a film like this, so here’s a list of everyone who wrote Casablanca. ... List is made up of a variety of writers, including Julius J. Epstein and Howard E. Koch."],"info":{}}
{"id":"train_19126","question":"How was Lemmy Kilmister, who was taking the prescription drug hydroxyurea, murdered?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q309926 wdt:P509 ?answer . ?answer wdt:P2176 wd:Q212272 }","paraphrases":["How was Lemmy Kilmister, who was taking the medicine sedate hydroxyurea, murdered?"],"info":{}}
{"id":"train_19127","question":"Which is the scientific journal that originated from the Soviet Union.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P495 wd:Q15180 . ?sbj wdt:P31 wd:Q5633421 }","paraphrases":[],"info":{}}
{"id":"train_19128","question":"What is the birth city of Jackie Chan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36970 wdt:P19 ?answer . ?answer wdt:P1813 wd: }","paraphrases":["What is the birth city of Jackie Chan?"],"info":{}}
{"id":"train_19129","question":"Was a participant of the the Normandy landings the United Kingdom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q16470 wdt:P710 wd:Q145 }","paraphrases":["Did the United Kingdom take part in the Normandy landings?"],"info":{}}
{"id":"train_19130","question":"When was Android version 6.0 published?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q94 p:P348 ?s . ?s ps:P348 ?x filter ( contains ( ?x , '6.0' ) ) . ?s pq:P577 ?value }","paraphrases":["When Android version 6.0 was launched ?"],"info":{}}
{"id":"train_19131","question":"when was renalult the member of sports team as bernard hinault?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q109255 p:P54 ?s . ?s ps:P54 wd:Q668092 . ?s pq:P580 ?value }","paraphrases":["Renault was a member of a sports team as Bernard Hinault in which year?"],"info":{}}
{"id":"train_19132","question":"Who besides Hank Aaron has received the Major League Baseball Most Valuable Player Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q215777 p:P166 ?s . ?s ps:P166 wd:Q1514249 . ?s pq:P1706 ?value }","paraphrases":["Besides Hank Aaron, who has received the Major League Baseball MVP Award?"],"info":{}}
{"id":"train_19135","question":"what is the observable dimension degree of 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28390 wdt:P111 ?answer . ?answer wdt:P4020 ?x FILTER ( contains ( ?x , '1' ) ) }","paraphrases":["What is the degree of 1 observed dimension?"],"info":{}}
{"id":"train_19137","question":"Is the energy storage capacity of the Tesla Model S equal to 85?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1463050 wdt:P4140 ?obj filter ( ?obj = 85 ) }","paraphrases":["Does the storage capacity of the Model S Tesla equal 85?"],"info":{}}
{"id":"train_19139","question":"When did Ryōtarō Shiba receive the award for Person of Cultural Merit?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1087887 p:P166 ?s . ?s ps:P166 wd:Q2545449 . ?s pq:P585 ?value }","paraphrases":["Give me the date that Ryotaro Shiba received the award for Person of Cultural Merit."],"info":{}}
{"id":"train_19141","question":"When you looked into my eyes,\nI stood there like I was hyp-notized.\nYou sent a feeling to my spine,\nA feeling warm and smooth and fine.\nBut all I could do were stand there paralyzed.\nWhen we kissed, ooh what a thrill,\nYou took my hand and, ooh baby, what a chill.\nI felt like grabbin' you real tight,\nSqueeze and squeeze with all my might.\nBut all I could do were stand there paralyzed.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7490925 wdt:P27 ?X . ?X wdt:P150 ?answer }","paraphrases":["When you investigated my eyes, I remained there like I was hyp-notized. You sent an inclination to my spine, An inclination warm and smooth and fine. Be that as it may, everything I could do were remain there deadened. When we kissed, ooh what a rush, You grasped my hand and, ooh infant, what a chill. I felt like grabbin' you genuine tight, Squeeze and press energetically. However, everything I could do were remain there deadened."],"info":{}}
{"id":"train_19143","question":"What was the explosive material invented by Alfred Novbel that contains the word \"dynamite\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12870 . ?sbj wdt:P61 wd:Q23810 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dynamite' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What was once the explosive material invented by Alfred Novbel that contains the phrase \"dynamite\" in its title ?"],"info":{}}
{"id":"train_19144","question":"Which insecticide has the highest decomposition point?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q181322 . ?ent wdt:P2107 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What insecticide has the highest decomposition point?"],"info":{}}
{"id":"train_19145","question":"What award did Juan Carlos I win?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1346 wd:Q19943 . ?sbj wdt:P31 wd:Q618779 }","paraphrases":["What grant did Juan Carlos I win?"],"info":{}}
{"id":"train_19146","question":"Is the solubility of bezene equal to 007?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2270 wdt:P2177 ?obj filter ( ?obj = 0.07 ) }","paraphrases":["Is beneze's solubility 7?"],"info":{}}
{"id":"train_19147","question":"Which position was held by Archibald Primrose, 5th Earl of Rosebery who replaced John Wodehouse, 1st Earl of Kimberley?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q244620 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q335342 }","paraphrases":["John Wodehouse, 1st Earl of Kimberley was replaced by Archibald Primrose, 5th Earl of Rosebery in which position?"],"info":{}}
{"id":"train_19148","question":"Is it true that Sidney is twinned with Milan and Portsmouth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3130 wdt:P190 wd:Q490 . wd:Q3130 wdt:P190 wd:Q72259 }","paraphrases":["Are Milan and Portsmouth twinned with Sidney?"],"info":{}}
{"id":"train_19149","question":"Who are {inhabitants} of {originates} in {glima} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q651295 wdt:P495 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Who in { glima } are { inhabitants of { originates }?"],"info":{}}
{"id":"train_19150","question":"How many choreographs did  FrederickAshton do","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1809 wd:Q711073 }","paraphrases":["How many choreographed dances can be attributed to Frederick Ashton?"],"info":{}}
{"id":"train_19151","question":"When did Mumbai become liberated from the Portuguese Empire?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1156 p:P17 ?s . ?s ps:P17 wd:Q200464 . ?s pq:P582 ?value }","paraphrases":["When did Mumbai ended up freed from the Portuguese Domain?"],"info":{}}
{"id":"train_19152","question":"Which member of the American Mathematical Society has the highest Erdős number?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P2021 ?obj . ?ent wdt:P463 wd:Q465654 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which American Mathematical Society member has the highest number of Erdős?"],"info":{}}
{"id":"train_19153","question":"Who uses Pellagra?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q221441 wdt:P2176 ?X . ?X wdt:P2868 ?answer }","paraphrases":["By whom is Pellagra used?"],"info":{}}
{"id":"train_19154","question":"When did Pierre Bourdieu leave the University of Lille?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q156268 p:P108 ?s . ?s ps:P108 wd:Q3551621 . ?s pq:P582 ?value }","paraphrases":["When was Pierre Boudieu left the University of Lille?."],"info":{}}
{"id":"train_19155","question":"What is the Classic IC flammable liquid with the highest peak exposure limit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009056 . ?ent wdt:P2406 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What flammable liquid has the highest exposure limit?"],"info":{}}
{"id":"train_19157","question":"What is the portrait of Jiří Brabec's death?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12025054 wdt:P509 ?X . ?X wdt:P180 ?answer }","paraphrases":["What is the representation of Jiří Brabec's death?"],"info":{}}
{"id":"train_19159","question":"What are the geological supereon which start with the letter precambrian","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15398983 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'precambrian' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the topographical supereon which begin with the letter precambrian"],"info":{}}
{"id":"train_19162","question":"What is the tributary of Ob that has the coordinate location 57.2447 83.3919?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q973 wdt:P974 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '57.2447 83.3919' ) ) }","paraphrases":["What is the tributary of Ob that has the facilitate area 57.2447 83.3919?"],"info":{}}
{"id":"train_19165","question":"What's the terminus of Beijing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P559 wd:Q956 }","paraphrases":["Give me the terminus of Beijing."],"info":{}}
{"id":"train_19167","question":"Who served as director and director of photography for the film Eternal Sunshine of the Spotless Mind?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q208269 wdt:P57 ?ans_1 . wd:Q208269 wdt:P344 ?ans_2 }","paraphrases":["Which person was the director and director of photography for the film Eternal Sunshine of the Spotless Mind?"],"info":{}}
{"id":"train_19169","question":"Who were J. R. R. Tolkien's parents?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q892 wdt:P3205 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who were J. R. R. Tolkien's guardians?"],"info":{}}
{"id":"train_19171","question":"What award did Annie Hall receive that Woody Allen won?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q233464 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q25089 }","paraphrases":["What award did Annie Hall and Woody Allen both win?"],"info":{}}
{"id":"train_19175","question":"What is {date of birth} and {date of death} of {{Pedro I} who has {child} as {, Prince of Beira}}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q4765121 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When did Pedro I die and when was he born?"],"info":{}}
{"id":"train_19176","question":"What ethnoreligious group starts with the letter \"y\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11197007 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH ETHNORELIGIOUS GROUP STARTS BY THE LETTER Y"],"info":{}}
{"id":"train_19178","question":"What sports team did Yaya Touré play on that played 33 games?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q184277 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter ( contains ( ?x , '33.0' ) ) }","paraphrases":["Name the sports team which played 33 games that Yaya Touré  played on."],"info":{}}
{"id":"train_19179","question":"What was Aki Kaurismaki nominated for in the year 1990?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q276186 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1990' ) ) }","paraphrases":["In 1990, what was Aki Kaurismaki nominated for?"],"info":{}}
{"id":"train_19180","question":"What number is Edgar Allan Poe's Allan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16867 p:P735 ?s . ?s ps:P735 wd:Q2616573 . ?s pq:P1545 ?value }","paraphrases":["Wich number is Edgar Allen Poe's Allan?"],"info":{}}
{"id":"train_19182","question":"\"Which is {musical key} of {Piano Concerto}, whose {prequel is} is {D minor} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44261 wdt:P826 ?answer . ?answer wdt:P155 wd:Q283903 }","paraphrases":["\"Which is {musical key} of {Piano Concerto}, whose {prequel is} is {D minor} ?\""],"info":{}}
{"id":"train_19183","question":"What is the time zone of the Dnipropetrovsk Oblast ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q170672 p:P421 ?s . ?s ps:P421 wd:Q6760 . ?s pq:P1264 ?value }","paraphrases":["The Dnipropetrovsk Oblast is in which time zone?"],"info":{}}
{"id":"train_19185","question":"Was Wolfgang Amadeus Mozart born in Salzburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q254 wdt:P19 wd:Q34713 }","paraphrases":["Is Salzburg the birth place of Wolfgang Amadeus Mozart?"],"info":{}}
{"id":"train_19188","question":"When did Baden-Wurttemberg start in West Germany?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q985 p:P131 ?s . ?s ps:P131 wd:Q713750 . ?s pq:P580 ?value }","paraphrases":["In what year did Baden-Wurttemberg begin in West Germany?"],"info":{}}
{"id":"train_19190","question":"Who plays in the sequel of Ziegfeld Follies (1911)?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4024404 wdt:P155 ?X . ?X wdt:P175 ?answer }","paraphrases":["Who plays within the spin-off of Ziegfeld Imprudences (1911)?"],"info":{}}
{"id":"train_19191","question":"What is not to be confused with the national anthem that has Q48460, not 781.599?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23691 wdt:P1889 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '781.599' ) ) }","paraphrases":["What is now not to be confused with the country wide anthem that has Q48460, no longer 781.599?"],"info":{}}
{"id":"train_19193","question":"How many editions of Tom Clancy's Ghost Recon have been published?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1422301 wdt:P400 ?X . ?X wdt:P747 ?answer }","paraphrases":["How numerous versions of Tom Clancy's Phantom Recon have been published?"],"info":{}}
{"id":"train_19194","question":"what is the Hindu Scriptures and texts that contains the word 'bhagavad' in its name and translated by Paul Deussen.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1194040 . ?sbj wdt:P655 wd:Q26714 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'bhagavad' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is the Hindu Scriptures and texts that contains the word 'bhagavad' in its name and translated by Paul Deussen."],"info":{}}
{"id":"train_19197","question":"Who is the {sculpture} for {depicts} of {Iroquois}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P180 wd:Q68518 . ?sbj wdt:P31 wd:Q860861 }","paraphrases":["Who is the {form} for {portrays} of {Iroquois}"],"info":{}}
{"id":"train_19199","question":"How many film crew members are there in The Lion King?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q36479 wdt:P3092 ?obj }","paraphrases":["Which is the film crew members in The Lion King?"],"info":{}}
{"id":"train_19200","question":"What is the date of the end of the writers of The Prophet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1196302 wdt:P50 ?X . ?X wdt:P570 ?answer }","paraphrases":["What is the date of the conclusion of the scholars of The Prophet?"],"info":{}}
{"id":"train_19201","question":"What are the perceptions of cocaine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2176 wd:Q41576 . ?sbj wdt:P31 wd:Q160402 }","paraphrases":["What are the discernments of cocaine?"],"info":{}}
{"id":"train_19202","question":"Was Bob Marley a member of The Upsetters?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q409 wdt:P463 wd:Q286596 }","paraphrases":["Did the membership of The Upsetters include Bob Marley?"],"info":{}}
{"id":"train_19203","question":"Which is the geosphere that starts with \"p\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q241284 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the geosphere that begins with \"p\"?"],"info":{}}
{"id":"train_19204","question":"What is the GDP (PPP) of Benin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q962 wdt:P4010 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19205","question":"What was the inflation rate of São Tomé and Príncipe in 1989?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1039 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1989' ) ) }","paraphrases":["In 1989, what was the inflation rate of Sao Tome and Principe?"],"info":{}}
