{"id":"train_16003","question":"What occupational carcinogen containing hydrogen has the highest decomposition point ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21074597 . ?ent wdt:P2107 ?obj . ?ent wdt:P527 wd:Q556 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which hydrogen - containing occupational carcinogen has the highest point of decomposition?"],"info":{}}
{"id":"train_16004","question":"What is the fertility rate in Kurnool?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3635276 wdt:P17 ?X . ?X wdt:P4841 ?answer }","paraphrases":["What is the richness rate in Kurnool?"],"info":{}}
{"id":"train_16005","question":"Where, in the English administrative territorial entity, was Martin McDonagh born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q372394 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q21 }","paraphrases":["In which English administrative territorial entity was Martin McDonagh born in?"],"info":{}}
{"id":"train_16006","question":"Which is the university that used the Russian language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q7737 . ?sbj wdt:P31 wd:Q3918 }","paraphrases":["Which is the college that utilized the Russian language?"],"info":{}}
{"id":"train_16007","question":"What is distribution of web browser ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P437 wd:Q6368 }","paraphrases":[],"info":{}}
{"id":"train_16010","question":"Name an heptalogy art piece set in the 1990s that starts with the letter H","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q614101 . ?sbj wdt:P2408 wd:Q34653 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an heptalogy artwork piece set in the 1990s that starts with the letter H"],"info":{}}
{"id":"train_16011","question":"Is the wing area of SZD-50 Puchacz equal to 12.944?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9375 wdt:P2112 ?obj filter ( ?obj = 12.944 ) }","paraphrases":["Does the wing area of SZD-50 equal 12.944?"],"info":{}}
{"id":"train_16013","question":"What has higher taxon of Litchi chinensis, that contains a type of taxon in its genus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13182 wdt:P171 ?answer . ?answer wdt:P105 wd:Q34740 }","paraphrases":["What has higher taxon of Litchi chinensis, that contains a sort of taxon in its genus?"],"info":{}}
{"id":"train_16015","question":"Which region of Spain shares its border with Granada?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8810 wdt:P47 ?obj . ?obj wdt:P31 wd:Q2074737 }","paraphrases":["Which locale of Spain offers its border with Granada?"],"info":{}}
{"id":"train_16017","question":"What is librettist for Francis Poulence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P87 wd:Q191408 }","paraphrases":[],"info":{}}
{"id":"train_16018","question":"Who is the mother of Pedro I and when did she die and did she have a child as Princess Paula of Brazil","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q4765169 . ?s pq:P25 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["What are the name and death date of Pedro I's mother, and did she bear a child when she was known as Princess Paula of Brazil?"],"info":{}}
{"id":"train_16021","question":"It comes from the top level domain of Paramore.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q473466 wdt:P495 ?X . ?X wdt:P78 ?answer }","paraphrases":["It comes from the beat level space of Paramore."],"info":{}}
{"id":"train_16022","question":"Tell me condition whose name has the word tetrachromacy in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q813912 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tetrachromacy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know condition whose title has the word tetrachromacy in it."],"info":{}}
{"id":"train_16024","question":"What is the genetic association of mental depression, which has the Gene Atlas Image of PBB GE IFT88 204703 at fs.png?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4340209 wdt:P2293 ?answer . ?answer wdt:P692 ?x FILTER ( contains ( ?x , 'PBB GE IFT88 204703 at fs.png' ) ) }","paraphrases":["What is the genetic association of intellectual depression, which has the Gene Atlas Image of PBB GE IFT88 204703 at fs.png?"],"info":{}}
{"id":"train_16027","question":"What award did J.B.S. Haldane receive in 1952?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q156333 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1952' ) ) }","paraphrases":["In 1952, J.B.S. Haldane earned what accolade?"],"info":{}}
{"id":"train_16031","question":"Was the explosive yield of The Gadget less than 24.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28846410 wdt:P2145 ?obj filter ( ?obj < 24.0 ) }","paraphrases":["Did the Gadget produce an explosive yield under 24.0?"],"info":{}}
{"id":"train_16032","question":"What is the birth location of Alauddin Khalji having the county seat of Mamluk sultanate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q335362 wdt:P19 ?answer . ?answer wdt:P1376 wd:Q847420 }","paraphrases":["What is the birth vicinity of Alauddin Khalji having the county seat of Mamluk sultanate?"],"info":{}}
{"id":"train_16033","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q186554 wdt:P171 ?answer . ?answer wdt:P105 wd:Q2889003 }","paraphrases":["What is it?"],"info":{}}
{"id":"train_16034","question":"Who is the person that was educated at the University of Notre Dame?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P69 wd:Q178848 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was a student at the University of Notre Dame?"],"info":{}}
{"id":"train_16035","question":"On Jan 1st, 1915, what did Henri Bergson get nominated for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q42156 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1915' ) ) }","paraphrases":["Henri Bergson was nominated for what award on January 1st, 1915?"],"info":{}}
{"id":"train_16037","question":"What kind of songs were written by Billie Holiday?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P676 wd:Q104358 . ?sbj wdt:P31 wd:Q207628 }","paraphrases":["What kind of melodies were composed by Billie Holiday?"],"info":{}}
{"id":"train_16038","question":"For what  Frederic Chopin  was in significant event in the year 1849?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1268 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1849' ) ) }","paraphrases":["What important event happened for Frederic Chopin in 1849?"],"info":{}}
{"id":"train_16039","question":"What position was Jeffrey Archer elected to?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q313489 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What position was Jeffrey Toxophilite chosen to?"],"info":{}}
{"id":"train_16040","question":"Where does Dmitry Medvedev reside?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q23530 wdt:P263 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16041","question":"Who is {cast member} of {Ghostbusters} where {character role} is {Janine Melnitz} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q108745 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q1061977 }","paraphrases":["Who is the cast member in the movie, \"Ghostbusters\" where the character role was Janine Melnitz?"],"info":{}}
{"id":"train_16044","question":"Does Noam Chomsky have a son whose name is Aviva Chomsky?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9049 wdt:P40 wd:Q520020 }","paraphrases":["Does Noam Chomsky have a son named Aviva?"],"info":{}}
{"id":"train_16045","question":"How do you now that Mycenae has a 354 residents","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132564 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '354' ) ) . ?s pq:P459 ?value }","paraphrases":["Macenae has 354 residents how is that?"],"info":{}}
{"id":"train_16047","question":"did mpeg-2 part 3 followed the mp3?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42591 p:P361 ?s . ?s ps:P361 wd:Q6717246 . ?s pq:P155 ?value }","paraphrases":["Was the mp3 followed by mpeg2-part 3?"],"info":{}}
{"id":"train_16049","question":"Name a United States Supreme Court decision that applies to the jurisdiction of the United States of America that contains the word \"united\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19692072 . ?sbj wdt:P1001 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'united' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a United States Supreme Court choice that applies to the jurisdiction of the United States of America that incorporates the phrase \"united\" in its title"],"info":{}}
{"id":"train_16050","question":"Where is the brain located anatomically and in the taxon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1073 wdt:P927 ?ans_1 . wd:Q1073 wdt:P703 ?ans_2 }","paraphrases":["In the taxon and anatomically, give me the brain location."],"info":{}}
{"id":"train_16051","question":"Which is the data theft as a significant event of Nicolas Sarkozy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q329 wdt:P793 ?obj . ?obj wdt:P31 wd:Q5227362 }","paraphrases":["Which is the information robbery as a noteworthy occasion of Nicolas Sarkozy?"],"info":{}}
{"id":"train_16052","question":"How many matches did Juan Alberto Schiaffino play for the Italy national football team and how many goals did he score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q332064 p:P54 ?s . ?s ps:P54 wd:Q676899 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["Playing for the Italy national soccer team, how many matches did Jean Alberto Schiaffino play in, and how many goals did he make?"],"info":{}}
{"id":"train_16053","question":"Who is working for J.L. Mackie, who has a subnetwork of 2001:630:440::/44?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q713642 wdt:P108 ?answer . ?answer wdt:P3793 ?x FILTER ( contains ( ?x , '2001:630:440::/44' ) ) }","paraphrases":["Who is working for J.L. Mackie, who has a subnetwork of 2001:630:440::/44?"],"info":{}}
{"id":"train_16054","question":"Who is the  {position} for {organisation directed from the office} of {NATO}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2389 wd:Q7184 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["Who is the {position} for {association coordinated from the office} of {NATO}"],"info":{}}
{"id":"train_16055","question":"What therapy is written by Sigmund Freud that starts with the letter \"p\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q179661 . ?sbj wdt:P50 wd:Q9215 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which therapy is written by Sigmund Freud that starts with letter \"p\"?"],"info":{}}
{"id":"train_16057","question":"What is the World Health Organisation International Nonproprietary Name for nitric oxide radical ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q207843 wdt:P2275 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16060","question":"How many languages are there for the Indian/English population?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P407 wd:Q1348800 }","paraphrases":["In Indians / English How many languages are available to their inhabitants?\n "],"info":{}}
{"id":"train_16061","question":"WHAT ARE THE BASEBALL LEAGUE WHICH START WITH THE LETTER P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6631808 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE BASEBALL LAGUE OF THE LETTER P"],"info":{}}
{"id":"train_16062","question":"What is the sound of user of spoon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q81895 wdt:P1535 ?X . ?X wdt:P4733 ?answer }","paraphrases":["What's the spoon user's sound?"],"info":{}}
{"id":"train_16063","question":"Who is the mother and spouse of Achilles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q41746 wdt:P25 ?ans_1 . wd:Q41746 wdt:P26 ?ans_2 }","paraphrases":["Who birthed Achilles and who is Achilles married to?"],"info":{}}
{"id":"train_16066","question":"What software version of Snapchat was published on 3-20-2018?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q333618 p:P348 ?s . ?s ps:P348 ?obj . ?s pq:P577 ?x filter ( contains ( YEAR ( ?x ) , '2018' ) ) }","paraphrases":["Which version of Snapchat when live on 3-20-2018."],"info":{}}
{"id":"train_16068","question":"What is a song played by Petula Clark, besides \"Downtown\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1050303 wdt:P1889 ?answer . ?answer wdt:P175 wd:Q236212 }","paraphrases":["What is a song played with the aid of Petula Clark, besides \"Downtown\"?"],"info":{}}
{"id":"train_16069","question":"What is the economic union for ASEAN?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P530 wd:Q7768 . ?sbj wdt:P31 wd:Q3623811 }","paraphrases":["What economic union is for ASEAN?"],"info":{}}
{"id":"train_16070","question":"What are the borders of the Ehime Prefecture, which can be subdivided into the Kita District?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q123376 wdt:P47 ?answer . ?answer wdt:P150 wd:Q1155929 }","paraphrases":["What are the borders of the Ehime Prefecture, which can be subdivided into the Kita District?"],"info":{}}
{"id":"train_16071","question":"What is the basic form of government for an absolute monarchy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P122 wd:Q184558 }","paraphrases":[],"info":{}}
{"id":"train_16072","question":"Jefferson Davis was head of state of which historical country?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P35 wd:Q162269 . ?sbj wdt:P31 wd:Q3024240 }","paraphrases":[],"info":{}}
{"id":"train_16073","question":"Who is the chairperson of the Communist Party of China and who are his followers?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q17427 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What is the name of chairperson of the Communist Party of China and who are his followers?"],"info":{}}
{"id":"train_16074","question":"What are the film studio which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q820655 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the film studios that begin with alphabet Z."],"info":{}}
{"id":"train_16075","question":"Who is the founder of Confucianism, whose kid is Kong Li?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9581 wdt:P112 ?answer . ?answer wdt:P40 wd:Q7240164 }","paraphrases":["Give me the name of the confucianism founder kid Kong Li."],"info":{}}
{"id":"train_16076","question":"How is chocolate pronounced in German?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q195 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q188 }","paraphrases":["How do you say chocolate in German?"],"info":{}}
{"id":"train_16077","question":"What are the hypostasis which contains the word holy in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q651118 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'holy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the hypostasis which contains the word blessed in their name"],"info":{}}
{"id":"train_16080","question":"What is the location of death created by John A. Hartford?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16997793 wdt:P112 ?X . ?X wdt:P20 ?answer }","paraphrases":["What is John A. Hartford's place of death?"],"info":{}}
{"id":"train_16083","question":"Which is {studied by} {science, that studies} of {ocean chemistry} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7076133 wdt:P2579 ?X . ?X wdt:P3095 ?answer }","paraphrases":["What is studied by the science that studies ocean chemistry?"],"info":{}}
{"id":"train_16085","question":"In what year did the population of Amazonas reach 4063614?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q40040 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '4063614' ) ) . ?s pq:P585 ?value }","paraphrases":["When the population of Amazonas hit 4063614, what year was it?"],"info":{}}
{"id":"train_16086","question":"Who is the sidekick of Sonic the Hedgehog?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2546 wd:Q191626 }","paraphrases":[],"info":{}}
{"id":"train_16087","question":"What operas has Claude Debussy composed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P86 wd:Q4700 . ?sbj wdt:P31 wd:Q1344 }","paraphrases":[],"info":{}}
{"id":"train_16088","question":"Is the yield strength of AISI 420C / EN X46Cr13 martensitic stainless steel the same as 1400","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q55714959 wdt:P5529 ?obj filter ( ?obj = 1400 ) }","paraphrases":["Is 1400 the yield strength of AISI 420C / EN X46Cr13 martensitic stainless steel?"],"info":{}}
{"id":"train_16089","question":"Does the time to altitude of the DT-2 equal 14.5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q22672999 wdt:P2362 ?obj filter ( ?obj = 14.5 ) }","paraphrases":["Is the DT-2's altitude time equal to 14.5?"],"info":{}}
{"id":"train_16090","question":"What is the headquarters location and the located on terrain feature of Commonwealth_of_Independent_States ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q7779 wdt:P159 ?ans_1 . wd:Q7779 wdt:P706 ?ans_2 }","paraphrases":["What on terrain feature is located on the HQ of Commonwealth_of_Independent_States?"],"info":{}}
{"id":"train_16091","question":"What is the valid in period for Vienna with its time zone as UTC+01:00?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1741 p:P421 ?s . ?s ps:P421 wd:Q6655 . ?s pq:P1264 ?value }","paraphrases":["what is the appropriate time range for Vienna, which is one hour ahead of Universal Time?"],"info":{}}
{"id":"train_16094","question":"What is a Hindu denomination that starts with the letter s.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1318257 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What may be a Hindu category that begins with the letter s."],"info":{}}
{"id":"train_16095","question":"Is {dizziness} a {symptom} of {DDT} exposure?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q163648 wdt:P1542 ?answer . ?answer wdt:P780 wd:Q10916362 }","paraphrases":["Is {discombobulation} a {indication} of {DDT} exposure?"],"info":{}}
{"id":"train_16098","question":"Who did Sebastian Piñera replace as President of Chile?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q306 p:P39 ?s . ?s ps:P39 wd:Q466956 . ?s pq:P1366 ?value }","paraphrases":["Give me the name of the person Sebastian Pinera replaced as President of Chili."],"info":{}}
{"id":"train_16101","question":"What languages Denis de Sallo knows? One of them has an acronym and that is французский.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1187712 wdt:P1412 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'французский' ) ) }","paraphrases":["What languages Denis de Sallo knows? One of them has an acronym and that is французский"],"info":{}}
{"id":"train_16102","question":"In what city, that is twinned with Ibadan, is Case Western Reserve University located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1047060 wdt:P159 ?answer . ?answer wdt:P190 wd:Q183298 }","paraphrases":["In what city, that is twinned with Ibadan, is Case Western Reserve University located?"],"info":{}}
{"id":"train_16108","question":"Who discovered malaria on Nov. 6, 1880?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12156 p:P61 ?s . ?s ps:P61 ?obj . ?s pq:P575 ?x filter ( contains ( YEAR ( ?x ) , '1880' ) ) }","paraphrases":["I want to know the name of the person who discovered malaria in 1880!"],"info":{}}
{"id":"train_16109","question":"which is industry of Caterpillar Inc. ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q459965 wdt:P452 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16110","question":"What was located in the administrative territorial entity of Milan in 1816-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q490 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1816' ) ) }","paraphrases":["What was found in the administrative territorial entity of Milan January 1, 1816?"],"info":{}}
{"id":"train_16111","question":"Which is the McCune-Reischauer romanization for Kim Jong-il","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q10665 wdt:P1942 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16112","question":"When was Joseph Stalin's child Svetlana Alliluyeva born, and when did she die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q228584 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When was Joseph Stalin's child Svetlana Alliluyeva born, and when did she die?"],"info":{}}
{"id":"train_16114","question":"What is the Class IIIB combustible liquid with the highest flash point that is used in insecticides?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009059 . ?ent wdt:P2128 ?obj . ?ent wdt:P2868 wd:Q181322 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the Class IIIB flamable liquid with the best flash point that is used in insecticides?"],"info":{}}
{"id":"train_16118","question":"Was ABBA originally from Sweden?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q18233 wdt:P495 wd:Q34 }","paraphrases":["Did ABBA originally come from Sweden?"],"info":{}}
{"id":"train_16119","question":"What is the name of the nihonium that is pronounced Kaiaponia.ogg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1301 wdt:P138 ?answer . ?answer wdt:P443 ?x FILTER ( contains ( ?x , 'Ka-iaponia.ogg' ) ) }","paraphrases":["Name the nihonium pronounced Kaiaponia.ogg."],"info":{}}
{"id":"train_16123","question":"Is the number of cases of tuberculosis equal to 520?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12204 wdt:P1603 ?obj filter ( ?obj = 520 ) }","paraphrases":["Is the number of cases of tuberculosis equal to 520?"],"info":{}}
{"id":"train_16124","question":"Name an archaeological artifact that contain the word \"rosetta \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q220659 . ?sbj wdt:P747 wd:Q44170531 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'rosetta' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an archaeological artifact that contain the word \"rosetta \" in its name"],"info":{}}
