{"id":"train_18292","question":"On 2000-8-1, what was the population of Recife?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q48344 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["As of August 1, 2000, what was Recife's population?"],"info":{}}
{"id":"train_18296","question":"What was the occupation of Ronald Dahl and when did he die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q25161 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P570 ?value1 . }","paraphrases":["What was the occupation of Ronald Dahl and when did he kick the bucket?"],"info":{}}
{"id":"train_18297","question":"What is the affiliation of the University of Chicago?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1416 wd:Q131252 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is the alliance of the College of Chicago?"],"info":{}}
{"id":"train_18298","question":"When was Maximilian Schell nominated for Best Supporting Actor in the Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q153018 p:P1411 ?s . ?s ps:P1411 wd:Q106291 . ?s pq:P585 ?value }","paraphrases":["In what year was Maximilian Schell nominated for Best Supporting Actor in the Academy Awards?"],"info":{}}
{"id":"train_18299","question":"when was saori yoshida has award received as medal with purple ribbon?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q230985 p:P166 ?s . ?s ps:P166 wd:Q11605748 . ?s pq:P585 ?value }","paraphrases":["On what date did Saori Yoshida receive a purple ribbon medal?"],"info":{}}
{"id":"train_18300","question":"WHICH IS THE FEDERATION WITH THE MOST PPP GDP PER CAPITAL","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q43702 . ?ent wdt:P2299 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["WHICH IS THE Alliance WITH The Foremost PPP GDP PER CAPITAL"],"info":{}}
{"id":"train_18303","question":"What is Auvergne's Wikimedia portal's main topic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1204 wd:Q1152 }","paraphrases":[],"info":{}}
{"id":"train_18305","question":"What geological events happen in the Inyo County in California?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q980149 wdt:P2695 ?X . ?X wdt:P706 ?answer }","paraphrases":["What geographical occasions happen within the Inyo Province in California?"],"info":{}}
{"id":"train_18306","question":"How many original networks are there for the {China Central Television} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P449 wd:Q207936 }","paraphrases":["Which is the number of original networks that there are for the China Central Television?"],"info":{}}
{"id":"train_18307","question":"What are the explosive material that starts with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12870 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the hazardous material that begins with the letter w"],"info":{}}
{"id":"train_18308","question":"Which is the national anthem that is published in Cedarmont Kids and contains the word banner in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23691 . ?sbj wdt:P1433 wd:Q48724391 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'banner' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the national song of devotion that's distributed in Cedarmont Kids and contains the word standard in it's name?"],"info":{}}
{"id":"train_18309","question":"What is the official residence of Venice","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P263 wd:Q641 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Where does the mayor of Venice live?"],"info":{}}
{"id":"train_18310","question":"When did Pedro I's child Princess Maria Amélia of Brazil die and who was her mother?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q235815 . ?s pq:P25 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["What date did Princess Maria Amelia, Pedro the firsts daughter, die and what was the name of her mum?"],"info":{}}
{"id":"train_18311","question":"Name a gambling game that contain the word \"zahlenlotto \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11416 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zahlenlotto' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a betting diversion that contain the word \"zahlenlotto \" in its name"],"info":{}}
{"id":"train_18314","question":"What science studies symmetry breaking?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q903282 wdt:P2579 ?X . ?X wdt:P1036 ?answer }","paraphrases":["The thing that science investigations symmetry breaking?."],"info":{}}
{"id":"train_18315","question":"WHAT IS HELD POSITION OF ANDREW JACKSON THAT IS ELECTORAL DISTRICT IS TENNESSEE'S 1ST CONGRESSIONAL DISTRICT","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11817 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 wd:Q7699986 }","paraphrases":["What position did Andrew Jackson hold in the Electoral District in Tennessee's 1st Congressional District?"],"info":{}}
{"id":"train_18318","question":"What color are Sunny Leone's hair and eyes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q260794 wdt:P1884 ?ans_1 . wd:Q260794 wdt:P1340 ?ans_2 }","paraphrases":["What color eyes and hair does Sunny Leone have?"],"info":{}}
{"id":"train_18319","question":"which award is received to Konrad Lorenz and at what time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q78496 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["which grant is gotten to Konrad Lorenz and at what time?"],"info":{}}
{"id":"train_18321","question":"Name a student of Max Planck","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P185 wd:Q9021 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was a student of Max Planck?"],"info":{}}
{"id":"train_18322","question":"Who is the person with most national team caps?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1129 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Who has the most national team caps?"],"info":{}}
{"id":"train_18323","question":"When did Brandenburg become Cottbus District?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1208 p:P1365 ?s . ?s ps:P1365 wd:Q48046 . ?s pq:P1011 ?value }","paraphrases":["Brandenburg became the Cottbus District at what point in time?"],"info":{}}
{"id":"train_18324","question":"What is {named after} the {award received} by {Iron_Maiden} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q42482 wdt:P138 ?ans_1 . wd:Q42482 wdt:P166 ?ans_2 }","paraphrases":["What is {named after} the {award received} by means of {Iron_Maiden} ?"],"info":{}}
{"id":"train_18325","question":"What is not to be confused with Puja Hinduism that uses GPS coordinates of 61.727095 42.544285?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10937578 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '61.727095 42.544285' ) ) }","paraphrases":["What isn't to be befuddled with Puja Hinduism that employments GPS facilitates of 61.727095 42.544285?"],"info":{}}
{"id":"train_18329","question":"Which is the country of origin for The X-Files?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2744 wdt:P495 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18330","question":"Who is the top dog of Bill Shoemaker, whose top dog is Alvaro Pineda?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q718423 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q8076740 }","paraphrases":["Who is the beat canine of Charge Shoemaker, whose best pooch is Alvaro Pineda?"],"info":{}}
{"id":"train_18332","question":"Is the national team caps of Erik Jensen equal to 4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q50348579 wdt:P1129 ?obj filter ( ?obj = 4 ) }","paraphrases":["Is 4 the national team caps of Erik Jensen?"],"info":{}}
{"id":"train_18333","question":"What medication can be used to counter drug reactions to (RS)-methadone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q179996 wdt:P769 ?obj . ?obj wdt:P31 wd:Q12140 }","paraphrases":["What drugs can be used to counter drug (RS)-methadone reactions?"],"info":{}}
{"id":"train_18334","question":"What does John GIlbert's spouse do for a living?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q503956 wdt:P26 ?X . ?X wdt:P106 ?answer }","paraphrases":["what is the occupation of John GIlbert's spouse?"],"info":{}}
{"id":"train_18336","question":"Where is the tomb of Vernon and Irene Castle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q324348 wdt:P119 ?X . ?X wdt:P1435 ?answer }","paraphrases":["Where is the tomb of Vernon and Irene Castle?"],"info":{}}
{"id":"train_18337","question":"What is the Wikimedia category for the category for employees of the organization of Villanova University","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1466001 wdt:P4195 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["What is the Wikimedia category for the category for representatives of the organization of Villanova University"],"info":{}}
{"id":"train_18339","question":"What is at Q484460, 2--45634 at the Archbasiclica of St. John Lateran in the administrative unit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q84090 wdt:P131 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '2--45634' ) ) }","paraphrases":["What is at Q484460, 2--45634 at the Archbasiclica of St. John Lateran in the administrative unit?"],"info":{}}
{"id":"train_18341","question":"What strain has the lowest minimum viable temperature and whose biosafety level is 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q855769 . ?ent wdt:P3251 ?obj . ?ent wdt:P1604 wd:Q18396533 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which strain the the lowest minimum viable temperature and has BSL is 1?"],"info":{}}
{"id":"train_18342","question":"Where is the birth place of Giambattista Vico that is known as the twin cities in which San Francisco is one them?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178709 wdt:P19 ?answer . ?answer wdt:P190 wd:Q62 }","paraphrases":["Where is the birth put of Giambattista Vico that's known as the twin cities in which San Francisco is one them?"],"info":{}}
{"id":"train_18343","question":"What was the ordinal series for William Lyon Mackenzie King during his position held as Prime Minister of Canada?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q128633 p:P39 ?s . ?s ps:P39 wd:Q839078 . ?s pq:P1545 ?value }","paraphrases":["Where does Prime Minister Mackenzie King fall in the line of Canadian leaders?"],"info":{}}
{"id":"train_18344","question":"Tell me non-governmental organization for development whose name has the word ornithologicalin it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3356057 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ornithological' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which development NGO  contains the word ornithological in its name."],"info":{}}
{"id":"train_18345","question":"What is the population of Neptune?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P398 wd:Q332 . ?sbj wdt:P31 wd:Q3592493 }","paraphrases":["In which authentic nation did the Roman Domain exist?"],"info":{}}
{"id":"train_18346","question":"What is Mario Monicelli nominated for in the 38th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q53026 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917067 }","paraphrases":["Mario Monicellis is short listed for which 38th Academy Award?"],"info":{}}
{"id":"train_18349","question":"Which is the academic title for the occupation of Thomas Aquinas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9438 wdt:P106 ?obj . ?obj wdt:P31 wd:Q3529618 }","paraphrases":["Which is the scholastic title for the occupation of Thomas Aquinas?"],"info":{}}
{"id":"train_18355","question":"Name the archaeological culture that contains the word \"Sumer\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q465299 . ?sbj wdt:P2596 wd:Q656043 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sumer' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the archaeological culture that contains the phrase \"Sumer\" in its identify"],"info":{}}
{"id":"train_18356","question":"What software is used by Ryanair?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1535 wd:Q170614 . ?sbj wdt:P31 wd:Q7397 }","paraphrases":["Name the software used by Ryanair?"],"info":{}}
{"id":"train_18357","question":"What businesses sponsor Oracle","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P156 wd:Q19900 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Oracle is sponsored by which businesses?"],"info":{}}
{"id":"train_18362","question":"Who is the developer of Free Software Foundation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P178 wd:Q48413 }","paraphrases":[],"info":{}}
{"id":"train_18365","question":"Who is the oldest person at an event?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P3629 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["At an event, who is the oldest person?"],"info":{}}
{"id":"train_18366","question":"What type of kinship Dick Van Dyke to his niece?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q310295 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q3403377 }","paraphrases":["How exactly is Dick Van Dyke related to his niece?"],"info":{}}
{"id":"train_18367","question":"which type of business entity in the USA name has  the word {=corporation in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q57653825 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'corporation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which sort of commerce substance within the USA title has the word {=enterprise in it"],"info":{}}
{"id":"train_18368","question":"who is manager/director for commands of Erich von Manstein ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57135 wdt:P598 ?X . ?X wdt:P1037 ?answer }","paraphrases":["Who is Erich von Manstein's command manager / manager?"],"info":{}}
{"id":"train_18369","question":"The most flammable solid with the most ionization of energy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21073024 . ?ent wdt:P2260 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the most flammable solid with the most ionization of energy?"],"info":{}}
{"id":"train_18370","question":"How has John Russell, Viscount Amberley influenced children?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6255964 wdt:P40 ?X . ?X wdt:P737 ?answer }","paraphrases":["How has John Russell, Viscount Amberley impacted kids?"],"info":{}}
{"id":"train_18371","question":"What position did Jean Monnet hold during 1952?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q159700 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1952' ) ) }","paraphrases":["Jean Monnet held what position in 1952?"],"info":{}}
{"id":"train_18372","question":"In the administrative unit of New Calendonia, has Lagun Onari won the award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q33788 wdt:P131 ?answer . ?answer wdt:P166 wd:Q3381638 }","paraphrases":["Within the authoritative unit of Modern Calendonia, has Lagun Onari won the award?"],"info":{}}
{"id":"train_18373","question":"What is {owned by} {television channel} of {Bleach} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5362638 wdt:P449 ?X . ?X wdt:P127 ?answer }","paraphrases":["What company owns the channel that Bleach airs on?"],"info":{}}
{"id":"train_18374","question":"Where does Elmarie Gerryts hold a record on pole vault and what is the height?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q5366421 . ?s pq:P2048 ?value1 . ?s pq:P276 ?value2 }","paraphrases":["Where does Elmarie Gerryts hold a record on shaft vault and what is the stature?"],"info":{}}
{"id":"train_18375","question":"What is the  facility launch site of US Airways Flight 1549 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q251039 wdt:P1427 ?X . ?X wdt:P912 ?answer }","paraphrases":["What is the US Airways Flight 1549 launch site?"],"info":{}}
{"id":"train_18376","question":"When was Max Planck nominated for the Nobel Prize in Physics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9021 p:P1411 ?s . ?s ps:P1411 wd:Q38104 . ?s pq:P585 ?value }","paraphrases":["Max Planck was up for the Physics Nobel Prize during what year?"],"info":{}}
{"id":"train_18379","question":"In which year Alien cast was nominated for Saturn Award for Best Supporting Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q103569 p:P1411 ?s . ?s ps:P1411 wd:Q1257399 . ?s pq:P585 ?value }","paraphrases":["When was the Alien Cast nominated for Saturn Award for Best Suporting Actress?"],"info":{}}
{"id":"train_18380","question":"Which is {child body} of {parent body} of {Iapetus} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17958 wdt:P397 ?X . ?X wdt:P398 ?answer }","paraphrases":["Which is {child body} of {parent body} of {Iapetus} ?"],"info":{}}
{"id":"train_18381","question":"Which is the deepest point in Rhode Island having tributary of Mana River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1387 wdt:P1589 ?answer . ?answer wdt:P974 wd:Q640606 }","paraphrases":["Which is Rhode Island's deepest point with Mana River tributary?"],"info":{}}
{"id":"train_18383","question":"How many times was Elizabeth II head of state?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P35 wd:Q9682 }","paraphrases":["What Elizabeth II head of state more than once?"],"info":{}}
{"id":"train_18384","question":"In which country did American English originate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7976 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_18385","question":"Is 8 the number of perpetrators in the assassination of Mahatma Gandhi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3350154 wdt:P3886 ?obj filter ( ?obj = 0.8 ) }","paraphrases":["Did 8 people perpetrate during the assassination of Mahatma Gandhi?"],"info":{}}
{"id":"train_18386","question":"What is the geographic location of New York State University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1140241 wdt:P2427 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18387","question":"Who is the brother of the screenwriter of The King - Jari Litmanen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15859914 wdt:P58 ?X . ?X wdt:P3373 ?answer }","paraphrases":["Give me the name of the brother of the screenwriter of The King - Jari Litmanen."],"info":{}}
{"id":"train_18388","question":"When was Margot Kidder received citizenship for the country United states of america?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q234471 p:P27 ?s . ?s ps:P27 wd:Q30 . ?s pq:P580 ?value }","paraphrases":["In what year did Margot Kidder become a USA citizen?"],"info":{}}
{"id":"train_18389","question":"who  children of cinematographer of enkitta mothathe ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17052490 wdt:P344 ?X . ?X wdt:P40 ?answer }","paraphrases":["The children of cinematographer of enkitta mothathe are?"],"info":{}}
{"id":"train_18390","question":"When was Mérida twinned with Incheon?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q165204 p:P190 ?s . ?s ps:P190 wd:Q20934 . ?s pq:P585 ?value }","paraphrases":["On what date was Mérida twinned with Incheon?"],"info":{}}
{"id":"train_18393","question":"What { character role } has { cast member } as { Ryan Moloney } for { Neighbours }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q908708 p:P161 ?s . ?s ps:P161 wd:Q5296779 . ?s pq:P453 ?value }","paraphrases":["Who played the character Ryan Moloney in Neighbours?"],"info":{}}
{"id":"train_18394","question":"Who is famous for the portrayal of Bali Ha'i?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4850834 wdt:P175 ?X . ?X wdt:P800 ?answer }","paraphrases":["Who is celebrated for the depiction of Bali Ha'i?"],"info":{}}
{"id":"train_18395","question":"Tell me fictional detective whose name has the word sam in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18553645 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'blood' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose  me fictional detective whose name has the word sam in it."],"info":{}}
{"id":"train_18396","question":"who  is the influenced by of Christopher hitchens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P737 wd:Q49081 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["who is the impacted by of Christopher hitchens?"],"info":{}}
{"id":"train_18397","question":"which radio program starts with o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1555508 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ö' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which radio program beginss with o"],"info":{}}
{"id":"train_18398","question":"Which subject has role of Samus Aran?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12400 wdt:P2868 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18401","question":"The capital of Norfolk is in which county?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1376 wd:Q23109 . ?sbj wdt:P31 wd:Q1357964 }","paraphrases":["What country contains the capital of Norfolk?"],"info":{}}
{"id":"train_18402","question":"What is the occupation of blues ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9759 wdt:P3095 ?obj . ?obj wdt:P31 wd:Q12737077 }","paraphrases":["What is the occupation of blues ?"],"info":{}}
{"id":"train_18405","question":"Tenochtitlan is the capitol of what empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q13695 . ?sbj wdt:P31 wd:Q48349 }","paraphrases":["Tenochtitlan is the capitol of what empire?"],"info":{}}
{"id":"train_18406","question":"What profession of herding is a fodder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12059906 wdt:P425 ?answer . ?answer wdt:P121 wd:Q211439 }","paraphrases":["in what herding profession involves a fodder?"],"info":{}}
{"id":"train_18407","question":"What major works are created by Ruth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19960416 wdt:P170 ?X . ?X wdt:P800 ?answer }","paraphrases":["What are Ruth's major works?"],"info":{}}
{"id":"train_18408","question":"Is the size of the British Museum place thesaurus equal to 45883?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28693488 wdt:P3575 ?obj filter ( ?obj = 45883 ) }","paraphrases":["Is the measure of the British Historical center put thesaurus break even with to 45883?"],"info":{}}
