{"id":"train_2666","question":"What are technical specification which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20819677 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are specialized detail which begin with the letter w"],"info":{}}
{"id":"train_2670","question":"What what is  soft drink country of origin and also which starts with letter b","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q147538 . ?sbj wdt:P495 wd:Q49 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is delicate drink nation of beginning conjointly which begins with letter b"],"info":{}}
{"id":"train_2673","question":"what era was world war 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2408 wd:Q362 }","paraphrases":["WWII took place in what era?"],"info":{}}
{"id":"train_2674","question":"What is the safety classification and labeling for hydrochloric acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2409 wdt:P4952 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2675","question":"Where is the Crux constellation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P59 wd:Q10542 }","paraphrases":["Give me the location of the Crux constellation."],"info":{}}
{"id":"train_2676","question":"Who is the {human} for {student} of {Francis Bacon}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P802 wd:Q37388 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {understudy} of {Francis Bacon}"],"info":{}}
{"id":"train_2677","question":"What is the job description of job posting 225088?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6587 wdt:P61 ?X . ?X wdt:P106 ?answer }","paraphrases":["What is the expected set of responsibilities of occupation posting 225088?"],"info":{}}
{"id":"train_2679","question":"Jefferson Davis is commemorated for what milestone ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P547 wd:Q162269 . ?sbj wdt:P31 wd:Q10145 }","paraphrases":[],"info":{}}
{"id":"train_2680","question":"What is the type of kinship Ana Boyer Preysler has as a relative of Enrique Iglesias?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47122 p:P1038 ?s . ?s ps:P1038 wd:Q27665550 . ?s pq:P1039 ?value }","paraphrases":["What familial ties does Ana Boyer Preysler have with Enrique Iglesias?"],"info":{}}
{"id":"train_2681","question":"Which is the Internet Wrestling Database ID for John Cena?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q44437 wdt:P2829 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2682","question":"What award did Tom Holland receive in the year 2012?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2023710 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2012' ) ) }","paraphrases":["Tom Holland earned what recognition in 2012?"],"info":{}}
{"id":"train_2683","question":"When is {end time} and {start time} of {{Leontien van Moorsel} has {member of sports team} as {Farm Frites - Hartol}}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q234158 p:P54 ?s . ?s ps:P54 wd:Q2694122 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When is { end time } and { start time } of { { Leontien van Moorsel } like { Farm Frites - Hartol } } { member of the sports team }?"],"info":{}}
{"id":"train_2684","question":"Is the net profit of the Eastern-Siberian Inland Navigation Company equal to 5,578,000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q639310 wdt:P2295 ?obj filter ( ?obj = 5578800.0 ) }","paraphrases":["Did the Eastern-Siberian Inland Navigation Company make a profit of nearly 5.6 million dollars?"],"info":{}}
{"id":"train_2688","question":"What is the battle of Cardinal Richelieu","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q26702 wdt:P607 ?obj . ?obj wdt:P31 wd:Q188055 }","paraphrases":["Which battle is Cardinal Richelieu?"],"info":{}}
{"id":"train_2689","question":"who favorite player of writer of think like a freak ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18786735 wdt:P50 ?X . ?X wdt:P737 ?answer }","paraphrases":["who favorite player of author of think like a crack ?"],"info":{}}
{"id":"train_2690","question":"Which is the flag carrier which contains the word qantas in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q721639 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'qantas' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the flag carrier in the name of the word qantas?"],"info":{}}
{"id":"train_2694","question":"Which is the parent organization of the Business American Airlines?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q32396 wdt:P749 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":["Which is the parent organization of the Commerce American Carriers?"],"info":{}}
{"id":"train_2695","question":"What award did Princess Mononoke receive at the Animation Kobe Theatrical Film Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q186572 p:P166 ?s . ?s ps:P166 wd:Q19830564 . ?s pq:P155 ?value }","paraphrases":["When Princess Mononoke was given an award at the Animation Kobe Theatrical Film Awards, which award was it?"],"info":{}}
{"id":"train_2696","question":"What did is the post of Austen Chamberlain and vested?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q188999 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What did is the post of Austen Chamberlain and vested?"],"info":{}}
{"id":"train_2698","question":"Name the bullet train with the highest speed limit owned by Reseau Ferre de France?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q858485 . ?ent wdt:P3086 ?obj . ?ent wdt:P127 wd:Q1071978 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Reseau Ferre de France bullet train has the highest speed limit?"],"info":{}}
{"id":"train_2699","question":"WHAT IS CIVILISATION OF PLACE OF ACTIVITY OF CLEMENT XI?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q129967 wdt:P937 ?X . ?X wdt:P2596 ?answer }","paraphrases":["What is Clement XI's civilization's place of activity?"],"info":{}}
{"id":"train_2700","question":"Which is the place of birth for Chengguan District?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P19 wd:Q1026100 }","paraphrases":[],"info":{}}
{"id":"train_2703","question":"What is Queensland ID of Brisbane?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q34932 wdt:P3257 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2704","question":"What position did Stephen of England hold at the start of November 1141?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q60849 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1141' ) ) }","paraphrases":["On the start of 1141 what position did Stephen of England hold?"],"info":{}}
{"id":"train_2705","question":"What was Svante August Arrhenius nominated for in 1912?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q80956 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1912' ) ) }","paraphrases":["In the year 1912 what did Svante August Arrhenius get nominated for?"],"info":{}}
{"id":"train_2709","question":"During what time period did WWII occur?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2348 wd:Q362 . ?sbj wdt:P31 wd:Q180684 }","paraphrases":["Amid what time period did WWII occur?"],"info":{}}
{"id":"train_2711","question":"What genre in film is Lisa Marie Presley in, that started in 1-1-1950?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q237324 wdt:P136 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1950' ) ) }","paraphrases":["What style in film is Lisa Marie Presley in, that began in 1-1-1950?"],"info":{}}
{"id":"train_2712","question":"Where does Martin Garrix reside and what is his occupation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q14544318 wdt:P551 ?ans_1 . wd:Q14544318 wdt:P106 ?ans_2 }","paraphrases":["What job does Martin Garrix have and where does he live?"],"info":{}}
{"id":"train_2713","question":"What is the official currency of United Kingdom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P38 wd:Q25224 . ?sbj wdt:P31 wd:Q185086 }","paraphrases":[],"info":{}}
{"id":"train_2714","question":"Which is the route of administration of erythromycin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q213511 wdt:P636 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2716","question":"Who is the  {plantation} for {architect} of {Thomas Jefferson}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P84 wd:Q11812 . ?sbj wdt:P31 wd:Q188913 }","paraphrases":["Who is the {manor} for {modeler} of {Thomas Jefferson}"],"info":{}}
{"id":"train_2718","question":"Which Christian Church has the pope as the office held by the head of the organisation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2388 wd:Q19546 . ?sbj wdt:P31 wd:Q34651 }","paraphrases":["Which Christian Church is the head of the organization holding the pope as the office?"],"info":{}}
{"id":"train_2719","question":"What is the name of the fertility deity on the Mount Olympus that starts with letter H","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015914 . ?sbj wdt:P263 wd:Q80344 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the name of the fertility deity on the Mount Olympus that starts with letter H"],"info":{}}
{"id":"train_2720","question":"What is SlideShare username of Kennedy Space Center ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q48821 wdt:P4016 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2721","question":"Tell me the dialect of the writing system of written Cantonese that contains the word cantonese in it's name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33384 . ?sbj wdt:P282 wd:Q2472605 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'cantonese' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal me the dialect of the writing system of written Cantonese that contains the word cantonese in it's name."],"info":{}}
{"id":"train_2724","question":"What is the main color of ruby?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43088 wdt:P462 ?obj . ?obj wdt:P31 wd:Q166902 }","paraphrases":[],"info":{}}
{"id":"train_2725","question":"Is it true that Wikidata time precision of the million years equals to 3.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q24004475 wdt:P2803 ?obj filter ( ?obj = 3.6 ) }","paraphrases":["Is it genuine that Wikidata time exactness of the million a long time rises to to 3.6?"],"info":{}}
{"id":"train_2726","question":"How do you pronounce the Earth's structure?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1664027 wdt:P1269 ?X . ?X wdt:P443 ?answer }","paraphrases":["How would you articulate the Earth's structure?"],"info":{}}
{"id":"train_2729","question":"Is the number of season of the Malibu Country less than 1.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q210665 wdt:P2437 ?obj filter ( ?obj < 1.2 ) }","paraphrases":["What is the number of the Malibu Country season?"],"info":{}}
{"id":"train_2730","question":"What is the significance of Juan Carlos I's abdication?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3342 wd:Q19943 . ?sbj wdt:P31 wd:Q207549 }","paraphrases":["What is the importance of Juan Carlos I's abdication?"],"info":{}}
{"id":"train_2731","question":"Which hydroelectric dam produces the most energy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12323 . ?ent wdt:P2109 ?obj . ?ent wdt:P31 wd:Q15911738 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Give me the name of the hydroelectric dam that produces the most energy?"],"info":{}}
{"id":"train_2732","question":"Who is the person in the time period of Ancient Egypt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2348 wd:Q11768 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who were some important figures in the Ancient Egyptian era?"],"info":{}}
{"id":"train_2735","question":"Who directed the movie, Who Framed Roger Rabbit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q379873 wdt:P57 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who coordinated the motion picture, Who Surrounded Roger Rabbit?"],"info":{}}
{"id":"train_2739","question":"In what journal is the Laser potodetachment of O3 published?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q31929734 wdt:P1433 ?X . ?X wdt:P101 ?answer }","paraphrases":["Where was the Laser potodetachment of O3 published?"],"info":{}}
{"id":"train_2742","question":"When Chinua Achebe was nominated as Neustadt International Prize for Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q155845 p:P1411 ?s . ?s ps:P1411 wd:Q580574 . ?s pq:P585 ?value }","paraphrases":["When was Chinua Achebe nominated as the Neustadt International Prize for Literature?"],"info":{}}
{"id":"train_2743","question":"Tell me ensemble whose name has the word uppenbarelsekyrkan in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1497375 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'uppenbarelsekyrkan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know outfit whose title has the word uppenbarelsekyrkan in it."],"info":{}}
{"id":"train_2745","question":"Who is the narrator of The Catcher in the Rye?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q183883 wdt:P2438 ?obj . ?obj wdt:P31 wd:Q15632617 }","paraphrases":["What is the main tourist attraction for the religion of the Russian Orthodox Church?"],"info":{}}
{"id":"train_2747","question":"Was Louis XVI the sibling of Charles X of France?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7732 wdt:P3373 wd:Q7742 . wd:Q7732 wdt:P3373 wd:Q7758 }","paraphrases":["Were Charles X of France and Louis XVI brothers?"],"info":{}}
{"id":"train_2750","question":"How many bases does a quadrilateral have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3263 wd:Q36810 }","paraphrases":["Bases in a quadrilateral?"],"info":{}}
{"id":"train_2751","question":"who is owner of player for Milt Palacio ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2449958 wdt:P54 ?X . ?X wdt:P127 ?answer }","paraphrases":["who is proprietor of player for Milt Palacio ?"],"info":{}}
{"id":"train_2754","question":"Who speaks the same language of George Michael?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q130311 wdt:P1412 ?X . ?X wdt:P5110 ?answer }","paraphrases":["In reference to George Michael, who are the people who speak the same language as him?"],"info":{}}
{"id":"train_2756","question":"Erythromycin has what kind of physical interaction with other drugs?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q213511 wdt:P769 ?X . ?X wdt:P129 ?answer }","paraphrases":["What kind of physical interaction does erythromycin have with other drugs?"],"info":{}}
{"id":"train_2757","question":"What are the scientific theory which start with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3239681 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the logical hypothesis which begin with the letter u"],"info":{}}
{"id":"train_2758","question":"What are decays of helium-4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P816 wd:Q1151346 }","paraphrases":[],"info":{}}
{"id":"train_2760","question":"Which is the {sex or gender} and the {ethnic group} of {Tyra_Banks} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q172303 wdt:P21 ?ans_1 . wd:Q172303 wdt:P172 ?ans_2 }","paraphrases":["What is Tyra Banks' gender and ethnicity?"],"info":{}}
{"id":"train_2761","question":"What is the practice of Taoism and it's main regulatory text?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q9598 wdt:P3095 ?ans_1 . wd:Q9598 wdt:P92 ?ans_2 }","paraphrases":["What is the main regulatory text and the practice of Taoism"],"info":{}}
{"id":"train_2762","question":"Which country shares its border with Andorra which is named Andorra-France border?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q228 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P805 wd:Q2009420 }","paraphrases":["Which country shares the Andorra-France border?"],"info":{}}
{"id":"train_2764","question":"TELL ME TYPE OF STATISTIC WHOSE NAME HAS THE WORD VARIANCE IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47103999 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'variance' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know Sort OF Measurement WHOSE Title HAS THE WORD Change IN IT."],"info":{}}
{"id":"train_2765","question":"What are the birth and death dates of Isabella 1 of Castile and John, Prince of Asturias' child?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q45859 p:P40 ?s . ?s ps:P40 wd:Q381871 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["What are the dates of birth and death of the Prince of Asturias, Isabel 1 of Castile and John?"],"info":{}}
{"id":"train_2767","question":"What is the location of the headquarters of Symantec in the United States of America?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q677085 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P17 wd:Q30 }","paraphrases":["Where is the US headquarters of Symantec"],"info":{}}
{"id":"train_2768","question":"Who replaced Bonaventure as cardinal-bishop?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43746 p:P39 ?s . ?s ps:P39 wd:Q1729113 . ?s pq:P1365 ?value }","paraphrases":["Who is the cardinal-bishop after Bonaventure?"],"info":{}}
{"id":"train_2771","question":"What is the { determination method } for { Parkinson's disease } { genetic association } like { RIT2 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11085 p:P2293 ?s . ?s ps:P2293 wd:Q18031133 . ?s pq:P459 ?value }","paraphrases":["What is the procedure to determine Parkinson's disease?"],"info":{}}
{"id":"train_2772","question":"Who is the owner of Kareem Abdul-Jabbar and from when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q179051 p:P1830 ?s . ?s ps:P1830 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["Who is the proprietor of Kareem Abdul-Jabbar and from when?"],"info":{}}
{"id":"train_2773","question":"During what Christian holy day was Joseph present in work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q128267 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q60075825 }","paraphrases":["Amid what Christian heavenly day was Joseph show in work?"],"info":{}}
{"id":"train_2774","question":"What award did Cornelia Funke receive in 2004?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q57971 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["Cornelia Funke received what award in 2004?"],"info":{}}
{"id":"train_2775","question":"Tell me rapid transit  whose name has the word subway in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5503 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'subway' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Inform about the rapid transit whose name has the word subway in it."],"info":{}}
{"id":"train_2776","question":"What is the official language of the topic of the history of Jamaica?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1994210 wdt:P1269 ?X . ?X wdt:P37 ?answer }","paraphrases":["Name the official language of the history of Jamaica's topic."],"info":{}}
{"id":"train_2777","question":"What was Isaac Newton a student of and who was his doctoral advisor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q935 wdt:P185 ?ans_1 . wd:Q935 wdt:P184 ?ans_2 }","paraphrases":["What subject did Isaac Newton study and who advised him?"],"info":{}}
{"id":"train_2778","question":"Who was the rector of Autonomous University of Barcelona from 2009-1-14?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43452 p:P1075 ?s . ?s ps:P1075 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["Who was the minister of Independent College of Barcelona from 2009-1-14?"],"info":{}}
{"id":"train_2781","question":"What territory was Wrocław a part of during 1138?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1799 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1138' ) ) }","paraphrases":["Wroclaw belonged to what territory during 1138?"],"info":{}}
{"id":"train_2783","question":"What are the postal codes for Sioux Falls?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q131335 wdt:P281 ?obj }","paraphrases":["Give me the postal codes for Sioux Falls."],"info":{}}
{"id":"train_2784","question":"What what is territory of australia  by na  and also which starts with letter n","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q14192199 . ?sbj wdt:P1366 wd:Q15640003 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is territory of australia by na and also which starts offevolved with letter n"],"info":{}}
{"id":"train_2787","question":"When did eBay take over as the parent organization for PayPal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q483959 p:P749 ?s . ?s ps:P749 wd:Q58024 . ?s pq:P580 ?value }","paraphrases":["When did eBay become the parent organization for PayPal?"],"info":{}}
{"id":"train_2788","question":"what is military decoration starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1788716 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is military enhancement begins with w"],"info":{}}
{"id":"train_2791","question":"Which is the artist-info artist ID for Camille Claudel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q120582 wdt:P5489 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2792","question":"Name the country maintaining the diplomatic relationship with Soviet Union","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q15180 wdt:P530 ?obj . ?obj wdt:P31 wd:Q6256 }","paraphrases":["Title the nation keeping up the conciliatory relationship with Soviet Union"],"info":{}}
