{"id":"train_8769","question":"What is the confusion in this birth record 1416-0-0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23009870 wdt:P1889 ?answer . ?answer wdt:P1249 ?x FILTER ( contains ( YEAR ( ?x ) , '1416' ) ) }","paraphrases":["What is the confusion in this start report 1416-0-0?"],"info":{}}
{"id":"train_8771","question":"Who is the voice actor for Jill Valentine?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q840368 p:P175 ?s . ?s ps:P175 ?obj . ?s pq:P3831 wd:Q2405480 }","paraphrases":["Who acted as the voice of the character Jill Valentine?"],"info":{}}
{"id":"train_8772","question":"What is the taxon parent of Scorpaeniformes, whose vernacular name is Lớp Cá vây tia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q208777 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'Lớp Cá vây tia' ) ) }","paraphrases":["What is the taxon parent of Scorpaeniformes, whose vernacular title is Lớp Cá vây tia?"],"info":{}}
{"id":"train_8773","question":"What university starts with the letter \"u\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3918 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What college begins with the letter \"u\"?"],"info":{}}
{"id":"train_8776","question":"Name a crude drug in a monoclinic crystal form that starts with letter G","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q735160 . ?sbj wdt:P556 wd:Q624543 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a crude drug in a monoclinic crystal structure that starts with letter G"],"info":{}}
{"id":"train_8777","question":"What gene is genetically associated with colorectal cancer","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2293 wd:Q188874 . ?sbj wdt:P31 wd:Q7187 }","paraphrases":["What quality is hereditarily related with colorectal cancer"],"info":{}}
{"id":"train_8781","question":"Who is the human biblical figure for the significant person of Saul?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3342 wd:Q28730 . ?sbj wdt:P31 wd:Q20643955 }","paraphrases":["Who is the human from the Bible for the important person of Saul?"],"info":{}}
{"id":"train_8784","question":"Which is the unary operation of the notation of integral symbol and contains the word integral in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q657596 . ?sbj wdt:P913 wd:Q1665420 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'integral' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the unary operation of the notation of indispensable symbol and incorporates the word necessary in it is name?"],"info":{}}
{"id":"train_8787","question":"What is the British controlled territory in Tripura","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P150 wd:Q1363 . ?sbj wdt:P31 wd:Q223832 }","paraphrases":["What is the British controlled domain in Tripura"],"info":{}}
{"id":"train_8789","question":"When did Belfast stop being part of the Kingdom of Ireland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q10686 p:P17 ?s . ?s ps:P17 wd:Q215530 . ?s pq:P582 ?value }","paraphrases":["When did Belfast stop being part of Ireland's Kingdom?"],"info":{}}
{"id":"train_8799","question":"Which federation has the largest Gini coefficient?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q43702 . ?ent wdt:P1125 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Who has the largest Gini CoEff."],"info":{}}
{"id":"train_8802","question":"When was Nelson Mandela Bay Metropolitan Municipality twinned adminsitrative in Gothenburg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1856565 p:P190 ?s . ?s ps:P190 wd:Q25287 . ?s pq:P580 ?value }","paraphrases":["On which date was Nelson Mandela Bay Metropolitan Municipality twinned adminsitrative in Gothenburg?"],"info":{}}
{"id":"train_8803","question":"When did Alicante have a population of 322,673?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11959 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '322673.0' ) ) . ?s pq:P585 ?value }","paraphrases":["On what date did the number of people in Alicante reach 322,673?"],"info":{}}
{"id":"train_8804","question":"Tell me which is the aqueous solution that has fermentation as fabrication method and contains the word vinegar in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q906356 . ?sbj wdt:P2079 wd:Q41760 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vinegar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me which is the aqueous solution that has fermentation as fabrication approach and contains the phrase vinegar in it's name?"],"info":{}}
{"id":"train_8805","question":"Tell me about socialist state for public holiday of Chinese New Year?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P832 wd:Q131772 . ?sbj wdt:P31 wd:Q842112 }","paraphrases":[],"info":{}}
{"id":"train_8806","question":"What is the board game with the highest number of minimum players?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q131436 . ?ent wdt:P1872 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which board game has the highest number of minimum players?"],"info":{}}
{"id":"train_8807","question":"what are the linear combination which start with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q27628 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What linear combination does the letter p start with?"],"info":{}}
{"id":"train_8809","question":"what are the alloy which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q37756 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the amalgam which begin with the letter z"],"info":{}}
{"id":"train_8811","question":"When did Venice become the Republic of Venice?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q641 p:P17 ?s . ?s ps:P17 wd:Q4948 . ?s pq:P580 ?value }","paraphrases":["What was the date when Venice had its name changed to the Republic of Venice?"],"info":{}}
{"id":"train_8812","question":"When did Tianjin begin to have a twinned administrative body with Hakodate?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11736 p:P190 ?s . ?s ps:P190 wd:Q26418 . ?s pq:P580 ?value }","paraphrases":["On what date did Tianjin begin to have a twinned administrative body with Hakodate?"],"info":{}}
{"id":"train_8814","question":"Was John Gotti convicted for obstruction of justice and tax noncompliance?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q301646 wdt:P1399 wd:Q525302 . wd:Q301646 wdt:P1399 wd:Q15279749 }","paraphrases":["Was John Gotti found guilty of obstruction of justice and tax noncompliance?"],"info":{}}
{"id":"train_8815","question":"Who designed the Metropolitan Railway A Class?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6825216 wdt:P287 ?X . ?X wdt:P800 ?answer }","paraphrases":["Which designer designed the Metropolitan Railway A Class?"],"info":{}}
{"id":"train_8816","question":"Is Grand Theft Auto V part of the Grand Theft Auto series?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q17452 wdt:P179 wd:Q132730 }","paraphrases":["Does the game series Grand Theft Auto contain a game called Grand Theft Auto V?"],"info":{}}
{"id":"train_8817","question":"when are we going to see Jim Capaldi perform?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2624195 p:P175 ?s . ?s ps:P175 wd:Q1392515 . ?s pq:P585 ?value }","paraphrases":["On what time will we see Jim Capaldi's performance?"],"info":{}}
{"id":"train_8821","question":"Where was Pancho Vladigerov kept prisoner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q528781 wdt:P119 ?X . ?X wdt:P276 ?answer }","paraphrases":["While Pancho Vladigerov was a prisoner, where was he held?"],"info":{}}
{"id":"train_8822","question":"Which is the door that was commissioned by Frederick William II of Prussia and starts with the letter b?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q36794 . ?sbj wdt:P88 wd:Q152229 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the door that was once commissioned by way of Frederick William II of Prussia and begins with the letter b?"],"info":{}}
{"id":"train_8823","question":"Was Lionel Richie or Peter Michael Escovedo Nicole Richie father?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q232495 wdt:P22 wd:Q26695 . wd:Q232495 wdt:P22 wd:Q7175870 }","paraphrases":["Who was the father of Nicole Richie - Lionel Richie or Peter Michael?"],"info":{}}
{"id":"train_8824","question":"How many subsidiary are European Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q458 wdt:P355 ?obj }","paraphrases":["Tell me how many subsidiaries are in the E.U."],"info":{}}
{"id":"train_8826","question":"Which is the disease that L-Tyrosine is used as a treatment drug?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2176 wd:Q188017 . ?sbj wdt:P31 wd:Q12136 }","paraphrases":["What is the name of the disease that treatment drug L-Tyrosine is used?"],"info":{}}
{"id":"train_8827","question":"What is executive branch of basin countries of Tigris ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35591 wdt:P205 ?X . ?X wdt:P208 ?answer }","paraphrases":["What is official department of bowl nations of Tigris ?"],"info":{}}
{"id":"train_8828","question":"WHAT IS DEUTCHE ULTRAMARATHON VEREINIGUNG ID FOR DEAN KARNAZES","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q331288 wdt:P2162 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8829","question":"Who has kids by Gustav Holst, whose year of birth is 1907-4-12?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q200867 wdt:P40 ?answer . ?answer wdt:P569 ?x FILTER ( contains ( YEAR ( ?x ) , '1907' ) ) }","paraphrases":["Who's got children from Gustav Holst, whose birth year is 1907-4-12?"],"info":{}}
{"id":"train_8830","question":"Which is the hydrological order number for Morava?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q179251 wdt:P4279 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8831","question":"What is {Carnegie Classification of Educate of Higher Instruction} of {school gone to} of {Tsung-Dao Lee} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q183679 wdt:P69 ?X . ?X wdt:P2643 ?answer }","paraphrases":["What is the Carnegie Classification of Educate of Higher Instruction of the school that Tsung-Dao Lee attended?"],"info":{}}
{"id":"train_8832","question":"What's Janet Jackson's lyrics song?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P676 wd:Q131324 . ?sbj wdt:P31 wd:Q7366 }","paraphrases":["What's Janet Jackson's verses song?"],"info":{}}
{"id":"train_8833","question":"Which is the Filmfare Awards given to winner Anil Kapoor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1346 wd:Q313956 . ?sbj wdt:P31 wd:Q37049 }","paraphrases":[],"info":{}}
{"id":"train_8835","question":"What is the linguistic typology and status of UNESCO in the Spanish language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1321 wdt:P4132 ?ans_1 . wd:Q1321 wdt:P1999 ?ans_2 }","paraphrases":["How is the Spanish language classified by UNESCO?"],"info":{}}
{"id":"train_8836","question":"WHICH REGULATES MOLECULAR BIOLOGY OF REGULATION OF GENE EXPRESSION","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q411391 wdt:P128 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8837","question":"Name the biological branch for studies pertaining to bat.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q28425 wdt:P2579 ?obj . ?obj wdt:P31 wd:Q28598684 }","paraphrases":["What biological branch studies bats?"],"info":{}}
{"id":"train_8838","question":"TELL ME THE ANALYTIC FUNCTION THAT STARTS WITH F","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215084 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know THE Explanatory Work THAT Begins WITH F"],"info":{}}
{"id":"train_8839","question":"Who is the production designer of Alejandro Jodorowsky?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2554 wd:Q263730 }","paraphrases":[],"info":{}}
{"id":"train_8840","question":"When did Debrecen stay in the county town?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q79880 p:P31 ?s . ?s ps:P31 wd:Q1175512 . ?s pq:P582 ?value }","paraphrases":["Debrecen stayed in the county town during what year(s)?"],"info":{}}
{"id":"train_8841","question":"Was Stevie Nicks a musical composer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q234691 wdt:P101 wd:Q207628 }","paraphrases":["Is it true that Stevie Nicks was a musical composer?"],"info":{}}
{"id":"train_8842","question":"Did you trespasser incidents?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q36740 wdt:P793 wd:Q839884 . wd:Q36740 wdt:P793 wd:Q1950147 }","paraphrases":["Have you ever trespassed?"],"info":{}}
{"id":"train_8846","question":"What follows the Mihira Bhoja series?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q1279558 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What takes after the Mihira Bhoja series?"],"info":{}}
{"id":"train_8848","question":"Name a mineral acid made of hydrogen sulfate ion that contains the word \"acid\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q408683 . ?sbj wdt:P4149 wd:Q3143743 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'acid' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a mineral acid made of hydrogen sulfate ion containing in its name the word \"acid\""],"info":{}}
{"id":"train_8849","question":"What is Liam Neeson's Box Office Mojo person ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q58444 wdt:P2688 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8850","question":"When did Harold MacMillan end his position as Member of the 38th Parliament of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q128985 p:P39 ?s . ?s ps:P39 wd:Q41582597 . ?s pq:P582 ?value }","paraphrases":["When did Harold MacMillan leave the 38th Parliament of the United Kingdom?"],"info":{}}
{"id":"train_8852","question":"Which are the symphtoms of Alfred Deakin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q313805 wdt:P1050 ?X . ?X wdt:P2293 ?answer }","paraphrases":["List symptoms of Afred Deakin"],"info":{}}
{"id":"train_8854","question":"Is Hrithik Roshan ethnic group of Gujarati people","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q233619 wdt:P172 wd:Q1282294 }","paraphrases":["What is the ethnic group of the Gujarati?"],"info":{}}
{"id":"train_8855","question":"Explain me that mutant which contains the word of wraith in their own name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1094617 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wraith' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Explain to me the mutant that contains the word wraith in its own name"],"info":{}}
{"id":"train_8859","question":"Who is the student of Luke Skywalker?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P802 wd:Q51746 . ?sbj wdt:P31 wd:Q15632617 }","paraphrases":["Who is the understudy of Luke Skywalker?"],"info":{}}
{"id":"train_8860","question":"When did Peter Singer finish his educated at the University of Melbourne?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q211539 p:P69 ?s . ?s ps:P69 wd:Q319078 . ?s pq:P582 ?value }","paraphrases":["On what date did Peter Singer complete his education at the University of Melbourne?"],"info":{}}
{"id":"train_8861","question":"Is the explosive velocity of picric acid equal to 8820?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q189298 wdt:P2231 ?obj filter ( ?obj = 8820.0 ) }","paraphrases":["Does 8820 equal the explosive velocity of picric acid?"],"info":{}}
{"id":"train_8862","question":"What country is Salman of Saudi Arabia a citizen of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q367825 wdt:P27 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What nation is Salman of Saudi Arabia a citizen of?"],"info":{}}
{"id":"train_8863","question":"Where is the westerly point located at  0.865308333333 -87.634630555556, in which Perry Como was buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q333405 wdt:P119 ?answer . ?answer wdt:P1335 ?x FILTER ( contains ( ?x , '30.865308333333 -87.634630555556' ) ) }","paraphrases":["Where is the westerly point found at 0.865308333333 -87.634630555556, in which Perry Como was buried?"],"info":{}}
{"id":"train_8864","question":"which is the owned by and subsidiary of British_Airways ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q8766 wdt:P127 ?ans_1 . wd:Q8766 wdt:P355 ?ans_2 }","paraphrases":["Name a British Airways owned subsidiary?"],"info":{}}
{"id":"train_8865","question":"Which is the musical by the librettist Alan Jay Lerner that starts with the letter p?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2743 . ?sbj wdt:P87 wd:Q961893 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the musical by the librettist Alan Jay Lerner that begins with the letter p?"],"info":{}}
{"id":"train_8866","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q846071 wdt:P171 ?answer . ?answer wdt:P460 wd:Q13582382 }","paraphrases":["What is it?"],"info":{}}
{"id":"train_8868","question":"Enlist the cited series of Star Wars Episode V: The Empire Strikes Back","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q181795 wdt:P179 ?obj . ?obj wdt:P31 wd:Q24856 }","paraphrases":["Enroll the cited arrangement of Star Wars Scene V: The Realm Strikes Back"],"info":{}}
{"id":"train_8869","question":"What was the political party of Jefferson Davis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q162269 wdt:P27 ?obj . ?obj wdt:P31 wd:Q1520223 }","paraphrases":["What was the political party of Jefferson Davis?"],"info":{}}
{"id":"train_8872","question":"Tell me mathematical notation whose name has the word schläfli in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1140046 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'schläfli' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me mathematical notation, the name of which contains the word schläfli."],"info":{}}
{"id":"train_8875","question":"How many goals/points have been scored by Valeriy Lobanovskyi of FC Chornomorets Odesa?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q324484 p:P54 ?s . ?s ps:P54 wd:Q44296 . ?s pq:P1351 ?value }","paraphrases":["Give me the number of goals/points scored by Valeriy Lobanovskyi at FC Chornomorets Odesa?"],"info":{}}
{"id":"train_8876","question":"What is the the wikibase:geoLatitude ?min of the location of the discovery of neodymium?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1388 wdt:P189 ?X . ?X wdt:P1333 ?answer }","paraphrases":["What is the the wikibase:geoLatitude ?min of the area of the revelation of neodymium?"],"info":{}}
{"id":"train_8878","question":"How many filming location were there for Saving Private Ryan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q165817 wdt:P915 ?obj }","paraphrases":["At how many locations was Saving Private Ryan filmed?"],"info":{}}
{"id":"train_8879","question":"Is the electrical conductivity of the Galinstan equal to 3460000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q675176 wdt:P2055 ?obj filter ( ?obj = 3460000 ) }","paraphrases":["The electric conductivity of Galinstan is equivalent to 3460000?"],"info":{}}
{"id":"train_8881","question":"What is the name of the language that uses the Vatteluttu alphabet script and is used by the newspaper Dina Thanthi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3522186 wdt:P407 ?answer . ?answer wdt:P282 wd:Q1992000 }","paraphrases":["What is the title of the dialect that employments the Vatteluttu letter set script and is utilized by the daily paper Dina Thanthi?"],"info":{}}
{"id":"train_8882","question":"IS THE SPEED LIMIT OF THE CIRCUM BAIKAL RAILWAY IS GREATER THAN 16.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q163706 wdt:P3086 ?obj filter ( ?obj > 16.0 ) }","paraphrases":["IS THE SPEED Constrain OF THE CIRCUM BAIKAL Railroad IS More noteworthy THAN 16.0"],"info":{}}
{"id":"train_8886","question":"Tell me archaeological period whose name has the word stage in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15401633 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'stage' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the archaeological period the name of which has the word stage in it?"],"info":{}}
{"id":"train_8889","question":"What are the branch of psychology which start with the letter psychophysiology","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60680430 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'psychophysiology' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the branch of psychology which begin with the letter psychophysiology"],"info":{}}
{"id":"train_8894","question":"What is the highest position in the Kingdom of Mercia ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q105092 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["What is the most elevated position within the Kingdom of Mercia ?"],"info":{}}
{"id":"train_8895","question":"What is a cinematic technique that starts with the letter t.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1001378 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a cinematic method that begins with the letter t."],"info":{}}
{"id":"train_8898","question":"What was the population of Egypt in 1975?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q79 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1975' ) ) }","paraphrases":["Which was the population number of Egypt in 1975?"],"info":{}}
{"id":"train_8899","question":"What is the article ID in the Canadian Encyclopedia for Iceberg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q47568 wdt:P5395 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8900","question":"Where is the place of burial and the birthplace of James Arness?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q470190 wdt:P119 ?ans_1 . wd:Q470190 wdt:P19 ?ans_2 }","paraphrases":["Name the place of birth and death of James Arness."],"info":{}}
