{"id":"train_961","question":"What is the birthday of Abigail Adams who has a child named Abigail Adams Smith?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q4667661 . ?s pq:P22 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["What is the birthday of Abigail Adams who has a baby named Abigail Adams Smith?"],"info":{}}
{"id":"train_962","question":"What award did Ken Thompson receive on January 1st, 1983?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1107006 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1983' ) ) }","paraphrases":["On January 1st, 1983, Ken Thompson received what award?"],"info":{}}
{"id":"train_963","question":"Name a film shot in New York that starts with letter S","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11424 . ?sbj wdt:P915 wd:Q60 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a film shot in Modern York that begins with letter S"],"info":{}}
{"id":"train_966","question":"What is the EC number for electron transport chain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q211016 wdt:P591 ?answer }","paraphrases":[],"info":{}}
{"id":"train_967","question":"What was Gene Wolfe nominated for in 1990?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q361149 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1990' ) ) }","paraphrases":["Which award was Gene Wolfe nominated for in 1990?"],"info":{}}
{"id":"train_968","question":"Was Jimi Hendrix's death related to the EMLL 24th Anniversary Show?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5928 wdt:P1196 wd:Q5323544 }","paraphrases":["Is it true that the death of Jimi Hendrix is related to the EMLL 24th Anniversary Show?"],"info":{}}
{"id":"train_970","question":"What material has the highest operating temperature?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q214609 . ?ent wdt:P5066 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What material has the highest temperature?"],"info":{}}
{"id":"train_971","question":"What medical condition did Väinö Linna have in 1984?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q311037 p:P1050 ?s . ?s ps:P1050 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["What was Väinö Linna's medical condition in 1984?"],"info":{}}
{"id":"train_973","question":"Tell me the Human population and birthplace of konstantin khabensky?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q558666 wdt:P19 ?X . ?X wdt:P1082 ?answer }","paraphrases":["I would like the know in the birthplace of Konstatin khabensy the Human population."],"info":{}}
{"id":"train_974","question":"What is Flags of the World ID for Union Jack ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3173323 wdt:P3089 ?answer }","paraphrases":[],"info":{}}
{"id":"train_977","question":"What is the object I.D. of L.L. Zamenhof at the Museum of FAine Arts, Boston?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11758 wdt:P4625 ?answer }","paraphrases":[],"info":{}}
{"id":"train_978","question":"What is alphabet  language signed of  Ōe no Yoshitoki ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3594014 wdt:P1412 ?X . ?X wdt:P282 ?answer }","paraphrases":["Ōe no Yoshitoki signed what alphabet language?"],"info":{}}
{"id":"train_981","question":"What is the organize sport of Super_Bowl ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q32096 wdt:P664 ?ans_1 . wd:Q32096 wdt:P641 ?ans_2 }","paraphrases":["The Super Bowl is part of which sports organization?"],"info":{}}
{"id":"train_982","question":"Get  the postal code for Baidu that is headquartered at Beijing?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q14772 p:P159 ?s . ?s ps:P159 wd:Q956 . ?s pq:P281 ?value }","paraphrases":["Headquartered at Beijing, what is the postal code of Baidu?"],"info":{}}
{"id":"train_983","question":"WHAT ARE THE DECIMAL CLASSIFICATION WHICH START WITH THE LETTER C","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1207369 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE DECIMAL CLASSIFICATION WHICH Begin WITH THE LETTER C"],"info":{}}
{"id":"train_985","question":"What {subject has role} which {physically interacts with} of {Dopamine} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q170304 wdt:P2868 ?ans_1 . wd:Q170304 wdt:P129 ?ans_2 }","paraphrases":["Which subject physically interacts with Dopamine?"],"info":{}}
{"id":"train_987","question":"What is the taxonomic type of Cactaceae?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q14560 wdt:P427 ?obj . ?obj wdt:P31 wd:Q16521 }","paraphrases":["What is the ordered sort of Cactaceae?"],"info":{}}
{"id":"train_988","question":"When did Thomas Wakley, the Member of the 12th Parliament of the United Kingdom, end his position?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q334239 p:P39 ?s . ?s ps:P39 wd:Q41582548 . ?s pq:P1534 ?value1 . ?s pq:P2715 ?value2 }","paraphrases":["When did Thomas Wakley of the United Kindom's 12th Paliment, leave his position?"],"info":{}}
{"id":"train_989","question":"What are the radiation particles that contain the word cosmic in their names ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q945733 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'cosmic' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the radiation particles in their names that contain the word cosmic"],"info":{}}
{"id":"train_990","question":"Which is the {country for sport} and the {sport} of {Novak_Djokovic} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q5812 wdt:P1532 ?ans_1 . wd:Q5812 wdt:P641 ?ans_2 }","paraphrases":["What country is Novak Djokovic from, and what sport does he play?"],"info":{}}
{"id":"train_992","question":"Tell me cyprinus rubrofuscus whose name has the word koi in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3246258 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'koi' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know cyprinus rubrofuscus whose title has the word koi in it."],"info":{}}
{"id":"train_995","question":"What are the titles of The X-Files episodes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P179 wd:Q2744 . ?sbj wdt:P31 wd:Q21191270 }","paraphrases":["What are the names of The X-Files episodes?"],"info":{}}
{"id":"train_996","question":"Who is The X-Files' creator and executive producer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q2744 wdt:P170 ?ans_1 . wd:Q2744 wdt:P1431 ?ans_2 }","paraphrases":["Who is the creator and executive producer of The X-Files?"],"info":{}}
{"id":"train_997","question":"On December 31, 2012, what were Nokia's total assets?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1418 p:P2403 ?s . ?s ps:P2403 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2012' ) ) }","paraphrases":["Considering the date of December 31, 2012, what were Nokia's total assets?"],"info":{}}
{"id":"train_999","question":"What is the official language of Vantaa?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q127623 p:P37 ?s . ?s ps:P37 ?obj . ?s pq:P3831 wd:Q61566 }","paraphrases":["What is Vantaa's official language?"],"info":{}}
{"id":"train_1000","question":"Who is known for being the script writer of Barefoot Gen: Explosion of Tears?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16164415 wdt:P58 ?X . ?X wdt:P800 ?answer }","paraphrases":["Who is known to be Barefoot Gen's script writer: Tears explosion?"],"info":{}}
{"id":"train_1005","question":"What is the admin HQ of Alma Matter and Victor Hugo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q535 wdt:P69 ?X . ?X wdt:P159 ?answer }","paraphrases":["What is the admin HQ of Alma Matter and Victor Hugo?"],"info":{}}
{"id":"train_1007","question":"Tell me Mahavidya whose name has the word tara in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1076022 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tara' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me Mahavidya whose name contains the word tara."],"info":{}}
{"id":"train_1008","question":"what is magnetic moment for electorn?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2225 wdt:P2069 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1009","question":"Which is the mathematical formula of the shape of the cooling tower?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q193886 wdt:P1419 ?X . ?X wdt:P2534 ?answer }","paraphrases":["Which is the mathematical method of the shape of the cooling tower?"],"info":{}}
{"id":"train_1011","question":"Which {musical instrument} of {musician}  is used on {A Theme from The Threepenny Opera} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51801055 wdt:P175 ?X . ?X wdt:P1303 ?answer }","paraphrases":["Which {melodic instrument} of {artist} is utilized on {A Subject from The Threepenny Musical drama} ?"],"info":{}}
{"id":"train_1014","question":"Does Michael Jordan wear jewellery?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41421 wdt:P3828 wd:Q161439 }","paraphrases":["Is Michael Jordan known to wear jewelry?"],"info":{}}
{"id":"train_1017","question":"How many {twinned administrative body} are there for {Monterrey} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q81033 wdt:P190 ?obj }","paraphrases":["What is the number of twinned administrative bodies in Monterrey?"],"info":{}}
{"id":"train_1018","question":"Was Chandragupta Maurya the student of both Chanakya and Vidyananda?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q188541 wdt:P1066 wd:Q9045 . wd:Q188541 wdt:P1066 wd:Q7928209 }","paraphrases":["Did Chandragupta Maurya study at both Chanakya and Vidyananda?"],"info":{}}
{"id":"train_1025","question":"What is the biography in Gerhard Schröder's German Bundestag?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2530 wdt:P1713 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1030","question":"When did A.R. Rahman receive the IIFA Award for Best Music Director?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q108560 p:P166 ?s . ?s ps:P166 wd:Q492560 . ?s pq:P585 ?value }","paraphrases":["A.R. Rahman received the IIFA Award for Best Music Director in what year?"],"info":{}}
{"id":"train_1031","question":"How many country citizenship are taken by Antonio José de Sucre Farell?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q189779 wdt:P27 ?obj }","paraphrases":["Antionio Jose De Sucre Farell took how many country Citizenships?"],"info":{}}
{"id":"train_1032","question":"What are the winged horse which start with the letter pegasus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2537829 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pegasus' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which winged horses begin with the word \"pegasus\"?"],"info":{}}
{"id":"train_1034","question":"na","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q338151 p:P69 ?s . ?s ps:P69 wd:Q49108 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["na"],"info":{}}
{"id":"train_1035","question":"What is the award received of Harold Pinter that is prized money that is 7 digits","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41042 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter ( contains ( ?x , '1e+07' ) ) }","paraphrases":["What 7 digit prize money award was given to Harold Pinter?"],"info":{}}
{"id":"train_1039","question":"Who worked as the manager/director of École Normale Supérieure?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83259 wdt:P1037 ?X . ?X wdt:P108 ?answer }","paraphrases":["Give me the name of the manager/director of École Normale Supérieure?"],"info":{}}
{"id":"train_1041","question":"Which is the group that caused the Congress of Vienna?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P828 wd:Q46362 . ?sbj wdt:P31 wd:Q16887380 }","paraphrases":["Which group made the Congress of Vienna?"],"info":{}}
{"id":"train_1043","question":"What award did Brokeback Mountain receive in the 78th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q160618 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q319132 }","paraphrases":["Which Oscar did Brokeback Mountain get?"],"info":{}}
{"id":"train_1044","question":"Which is the membership as a member party of Denis Sassou Nguesso?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57418 wdt:P102 ?X . ?X wdt:P2124 ?answer }","paraphrases":["Which is the participation as a part party of Denis Sassou Nguesso"],"info":{}}
{"id":"train_1045","question":"What is the opposite of inorganic chemistry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11165 wdt:P461 ?answer . ?answer wdt:P2184 wd:Q17480697 }","paraphrases":["What is the inverse of inorganic chemistry?"],"info":{}}
{"id":"train_1047","question":"Which is the Thai cultural heritage ID for Khlong Saen Saeb?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1431800 wdt:P1626 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1048","question":"What is the number of those maintained by Fukuoka?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P126 wd:Q26600 }","paraphrases":["Which is the number of those maintained by Fukuoka?"],"info":{}}
{"id":"train_1050","question":"Give the name of the hill with the highest isolation whose is at a high range.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q54050 . ?ent wdt:P2659 ?obj . ?ent wdt:P31 wd:Q46831 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which highly isolated hill is at a high range?"],"info":{}}
{"id":"train_1051","question":"What are the Wikimedia set index article which start with the letter typhoon","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15623926 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'typhoon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Wikimedia set index article which start with the letter storm"],"info":{}}
{"id":"train_1053","question":"How many things are founded by Oprah Winfrey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q55800 wdt:P112 ?obj }","paraphrases":["Tell me how many things are founded by Oprah Winfrey."],"info":{}}
{"id":"train_1054","question":"DOES THE NUMBER OF CYLINDERS OF THE KKSTB 197 EQUALS 2","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q310348 wdt:P1100 ?obj filter ( ?obj = 2 ) }","paraphrases":["Are there two cylinders of the KKSTB?"],"info":{}}
{"id":"train_1055","question":"In what sport is Lin Dan ranked number one?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1390341 p:P1344 ?s . ?s ps:P1344 ?obj . ?s pq:P1352 ?x filter ( contains ( ?x , '1.0' ) ) }","paraphrases":["Lin Dan achieved the number one ranking in what sport?"],"info":{}}
{"id":"train_1056","question":"what is highly urbanized city language used by tagalog and also which starts with letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29946056 . ?sbj wdt:P2936 wd:Q34057 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is particularly urbanized metropolis language used by using tagalog and also which starts offevolved with letter v"],"info":{}}
{"id":"train_1057","question":"Tell me town in Croatia whose name has the word šibenik in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15105893 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'šibenik' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know town in Croatia whose title has the word šibenik in it."],"info":{}}
{"id":"train_1058","question":"What is TORA ID for Uppsala ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q25286 wdt:P4820 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1063","question":"When did Peter Freuchen join the Social Democrats?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q945641 p:P102 ?s . ?s ps:P102 wd:Q212101 . ?s pq:P580 ?value }","paraphrases":["In which year did Peter Freuchen become a member of the Social Democrats?"],"info":{}}
{"id":"train_1064","question":"What country related to Israel has the highest debt related to GDP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P1689 ?obj . ?ent wdt:P530 wd:Q801 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What country associated to Israel has the highest debt for GDP?"],"info":{}}
{"id":"train_1065","question":"Is it true that the maximal incubation period in humans with leprosy equals to 21?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q36956 wdt:P3487 ?obj filter ( ?obj = 21 ) }","paraphrases":["Is 21 the maximal incubation period in humans with leprosy?"],"info":{}}
{"id":"train_1066","question":"What does social science essentially study?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2579 wd:Q34749 . ?sbj wdt:P31 wd:Q190995 }","paraphrases":["Social science is the study of what?"],"info":{}}
{"id":"train_1068","question":"What are the form of government which start with the letter unicameralism","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1307214 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'unicameralism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the frame of government which begin with the letter unicameralism"],"info":{}}
{"id":"train_1070","question":"Is it true that the number of episodes of Mansfield Park is greater than 0.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q280295 wdt:P1113 ?obj filter ( ?obj > 0.8 ) }","paraphrases":["Does Mansfield Park have more than 0.8 episodes?"],"info":{}}
{"id":"train_1071","question":"What is the railway gun with min muscle velocity whose country is France","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1049358 . ?ent wdt:P4137 ?obj . ?ent wdt:P17 wd:Q142 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Give me the name of the railway gun with min muscle velocity country in france?"],"info":{}}
{"id":"train_1072","question":"DOES THE EFFECTIVE FIRING RNGE OF THE 70 K EQUALS 13120","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4031056 wdt:P4176 ?obj filter ( ?obj = 13120 ) }","paraphrases":["Is the effective firing range of the 70K 13120?"],"info":{}}
{"id":"train_1073","question":"When was Andhra Pradesh in Hyderabad?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1159 p:P36 ?s . ?s ps:P36 wd:Q1361 . ?s pq:P582 ?value }","paraphrases":["On what date did Andhra Pradesh in Hyderabad?"],"info":{}}
{"id":"train_1075","question":"Which is the Australian Parliament ID for Kurt Waldheim?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1260 wdt:P2280 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1078","question":"What are winged horse which start with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2537829 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are winged horses starting with letter p"],"info":{}}
{"id":"train_1080","question":"Name an art genre that contains the word \"ballet\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1792379 . ?sbj wdt:P2579 wd:Q4076591 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ballet' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an artwork style that incorporates the phrase \"ballet\" in its title"],"info":{}}
{"id":"train_1081","question":"What theatre did Frank Gehry design?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P84 wd:Q180374 . ?sbj wdt:P31 wd:Q24354 }","paraphrases":["What theater did Straight to the point Gehry design?"],"info":{}}
{"id":"train_1082","question":"What is the taxon synonym of angiosperms?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1420 wd:Q25314 }","paraphrases":[],"info":{}}
{"id":"train_1087","question":"Does the proton have a magnetic moment that is equal to 0.0015210322053?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2294 wdt:P2069 ?obj filter ( ?obj = 0.0015210322053 ) }","paraphrases":["Does the proton have a attractive minute that's break even with to 0.0015210322053?"],"info":{}}
{"id":"train_1088","question":"What type of spice is cuminum cyminum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q132624 wdt:P1672 ?obj . ?obj wdt:P31 wd:Q42527 }","paraphrases":["What sort of zest is cuminum cyminum?"],"info":{}}
{"id":"train_1089","question":"Who is the member of Canada that was elected on January 1st, 1966?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q16 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1966' ) ) }","paraphrases":["Could you provide the member of Canada elected on January 1st, 1966?."],"info":{}}
{"id":"train_1091","question":"When and why was James Matheson elected as Member of the 15th Parliament of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q4870843 p:P39 ?s . ?s ps:P39 wd:Q41582555 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["In what year and under what circumstances was James Matheson elected as a Member of the 15th Parliament of the UK?"],"info":{}}
{"id":"train_1092","question":"Who is the cast member for the role of Bunny Lebowski in the Big Lebowski?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q337078 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q55717001 }","paraphrases":["Who played Bunny Lebowski in The Big Lebowski?"],"info":{}}
{"id":"train_1093","question":"Who are the writers and collaborators to Chris Odom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24898980 wdt:P3919 ?X . ?X wdt:P50 ?answer }","paraphrases":["Who are the scholars and collaborators to Chris Odom?"],"info":{}}
{"id":"train_1095","question":"What is the location of the Honda headquarters with the postal code 107-8556?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9584 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P281 ?x filter ( contains ( ?x , '107-8556' ) ) }","paraphrases":["Where is Honda headquarters with postal code 107-8556?"],"info":{}}
