{"id":"train_12906","question":"Give the reason for Knights Templar demolished in the year 1312?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41300 p:P576 ?s . ?s ps:P576 ?x filter ( contains ( YEAR ( ?x ) , '1312' ) ) . ?s pq:P642 ?value }","paraphrases":["Why was Knights Templar destroyed in 1312?"],"info":{}}
{"id":"train_12907","question":"What is that has of","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q81307 wdt:P159 ?answer . ?answer wdt:P190 wd:Q1524 }","paraphrases":["What is that has of for"],"info":{}}
{"id":"train_12910","question":"What year did Charles IV divorce Elizabeth of Pomerania?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q155669 p:P26 ?s . ?s ps:P26 wd:Q266519 . ?s pq:P582 ?value }","paraphrases":["When were Charles IV and Elizabeth of Pomerania divorced?"],"info":{}}
{"id":"train_12912","question":"tell me the index number that starts with v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1738991 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know the file number that begins with v"],"info":{}}
{"id":"train_12914","question":"What {type of taxon} is {higher taxon} of {Arthropoda} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1360 wdt:P171 ?X . ?X wdt:P105 ?answer }","paraphrases":["What {sort of taxon} is {higher taxon} of {Arthropoda} ?"],"info":{}}
{"id":"train_12915","question":"what are the metabolite starts with v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q407595 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the metabolite starts with the letter v."],"info":{}}
{"id":"train_12916","question":"What is autores.uy ID of José Gervasio Artigas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q252847 wdt:P2558 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12917","question":"Which stadium is the home venue of F.C. Porto ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q128446 wdt:P115 ?obj . ?obj wdt:P31 wd:Q483110 }","paraphrases":["What is F.C. Porto's home stadium?"],"info":{}}
{"id":"train_12918","question":"What is the academic discipline created by the founder of Junta de la Victoria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23308214 wdt:P112 ?X . ?X wdt:P101 ?answer }","paraphrases":["Which subject of study was founded by the original creator of Junta de la Victoria?"],"info":{}}
{"id":"train_12919","question":"who  is makes use  of sports Martin Lang","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6775961 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["who is makes utilize of sports Martin Lang"],"info":{}}
{"id":"train_12921","question":"Which is Mohs' hardness of pyrite?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q50769 wdt:P1088 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12922","question":"Are Jacob and Leon given names of Jack Ruby?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q192519 wdt:P735 wd:Q25999604 . wd:Q192519 wdt:P735 wd:Q37080 }","paraphrases":["Are Jack Ruby's birth names Jacob and Leon?"],"info":{}}
{"id":"train_12923","question":"Does the kayak have a maximum capacity of 3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q539632 wdt:P1083 ?obj filter ( ?obj = 3 ) }","paraphrases":["Does the kayak have a capacity of up to 3?"],"info":{}}
{"id":"train_12924","question":"What are the railway tunnel which start with the letter T","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1311958 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the railroad burrow which begin with the letter T"],"info":{}}
{"id":"train_12925","question":"What is the fidelity claimed by Armee de Vinchy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2862886 wdt:P945 ?X . ?X wdt:P1336 ?answer }","paraphrases":["What did Armee de Vinchy claim as fidelity?"],"info":{}}
{"id":"train_12926","question":"When was Venus Williams nominated for the Best Female Tennis Player ESPY Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11578 p:P1411 ?s . ?s ps:P1411 wd:Q16275104 . ?s pq:P585 ?value }","paraphrases":["Venus Williams was up for Best Female Tennis Player ESPY Award in what year?"],"info":{}}
{"id":"train_12929","question":"In what year did Maria Klawe cease being a chairperson for the Association for Computing Machinery?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q127992 p:P488 ?s . ?s ps:P488 wd:Q11754 . ?s pq:P582 ?value }","paraphrases":["Maria Klawe was replaced as chairperson for the Association for Computing Machinery in which year?"],"info":{}}
{"id":"train_12932","question":"Is 240.0 the operating boiler pressure of the Norfolk and Western Railway 611?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q54756316 wdt:P5071 ?obj filter ( ?obj = 240.0 ) }","paraphrases":["Is the Norfolk and Western Railway 611 operating at 240.0?"],"info":{}}
{"id":"train_12933","question":"What is the currency used in the Soviet Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q15180 wdt:P38 ?obj . ?obj wdt:P31 wd:Q8142 }","paraphrases":["What currency does the Soviet Union use?"],"info":{}}
{"id":"train_12934","question":"What method is used to determine the total fertility rate of Morocco as 2.691?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1028 p:P4841 ?s . ?s ps:P4841 ?x filter ( contains ( ?x , '2.691' ) ) . ?s pq:P459 ?value }","paraphrases":["How can we calculate the total fertility rate of Morocco as 2.691?"],"info":{}}
{"id":"train_12935","question":"Is the radial velocity of Messier 28 equal to 12.64?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13644 wdt:P2216 ?obj filter ( ?obj = 12.64 ) }","paraphrases":["Is the 12.64 the equivalent of the radial velocity of Messier 28?"],"info":{}}
{"id":"train_12938","question":"Which team did Malcolm Allison play just 2 matches with?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1383862 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter ( contains ( ?x , '2.0' ) ) }","paraphrases":["Malcolm Allison played only two matches with which team?"],"info":{}}
{"id":"train_12939","question":"Tell me the sister city of the death place of Adolph Sulyomi-Schulmann","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1292341 wdt:P20 ?X . ?X wdt:P190 ?answer }","paraphrases":["Let me know the sister city of the passing put of Adolph Sulyomi-Schulmann"],"info":{}}
{"id":"train_12940","question":"Which is {owned} and {founded by} {American_Broadcasting_Company} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q169889 wdt:P127 ?ans_1 . wd:Q169889 wdt:P112 ?ans_2 }","paraphrases":["Which is ABC is the parent company and founder of?"],"info":{}}
{"id":"train_12941","question":"Does iron treat iron deficiency and hypochromic anemia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q677 wdt:P2175 wd:Q1313081 . wd:Q677 wdt:P2175 wd:Q2306782 }","paraphrases":["Does iron treat both hypochromic and iron deficiency?"],"info":{}}
{"id":"train_12942","question":"What is named for Mira variable in Omicron Ceti III satellite?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q744691 wdt:P138 ?answer . ?answer wdt:P398 wd:Q48906483 }","paraphrases":["What is named for Mira variable in Omicron Ceti III satellite?"],"info":{}}
{"id":"train_12946","question":"What is the secret police of Lavrentiy Beria's military branch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q141829 wdt:P241 ?obj . ?obj wdt:P31 wd:Q214183 }","paraphrases":["What is the mystery police of Lavrentiy Beria's military branch?"],"info":{}}
{"id":"train_12947","question":"Is it true that the number of houses of Patsch railway station is greater than 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q14912780 wdt:P4080 ?obj filter ( ?obj > 0.0 ) }","paraphrases":["Is it true that Patsch Railway Station's number of houses is greater than 0?"],"info":{}}
{"id":"train_12948","question":"What is award received of Cesária Évora that is point  time is 1997-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q103759 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1997' ) ) }","paraphrases":["What 1997 award did Cesária Évora get?"],"info":{}}
{"id":"train_12952","question":"Which nomination did Shelley Winters receive for her work in \"A place in the Sun\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q202144 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q733627 }","paraphrases":["What was the award nomination received for Shelly Winter's work in \"A place in the Sun\"?"],"info":{}}
{"id":"train_12956","question":"Which is the FilmTv.it TV series ID of Grey's Anatomy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q438406 wdt:P5255 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12957","question":"What is the South African municipality code for the Nelson Mandela Bay Metropolitan Municipality?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1856565 wdt:P911 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12958","question":"What are the diplomatic rank which start with the letter permanent","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q303618 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'permanent' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the diplomatic rank which start with the letter permanent"],"info":{}}
{"id":"train_12959","question":"What is the name of Napoleon horse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q517 wdt:P3091 ?obj . ?obj wdt:P31 wd:Q726 }","paraphrases":["Napoleon horse has what name?"],"info":{}}
{"id":"train_12960","question":"Tell me game whose name has the word zauberturm in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11410 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zauberturm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the game whose name contains the word zauberturm"],"info":{}}
{"id":"train_12961","question":"What is an interpreted language that starts with the letter y.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1993334 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is an interpreted language that begins with the letter y."],"info":{}}
{"id":"train_12966","question":"which unit of time with the highest wikidata time precision whose measured physical quantity is time?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1790144 . ?ent wdt:P2803 ?obj . ?ent wdt:P111 wd:Q11471 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["which unit of time with the best possible wikidata time precision whose measured bodily quantity is time?"],"info":{}}
{"id":"train_12968","question":"Czechoslovakia has diplomatic relations with what sovereign state?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P530 wd:Q33946 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["What sovereign state does Czechoslovakia have a diplomatic relationship with?"],"info":{}}
{"id":"train_12970","question":"What is Six Degrees of francis Bacon ID for Oliver Cromwell","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q44279 wdt:P2401 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12971","question":"What is a chemical compound encoded by CGU with the word \"arginine\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11173 . ?sbj wdt:P702 wd:Q29018177 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'arginine' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a chemical compound encoded through CGU with the word \"arginine\" in its name?"],"info":{}}
{"id":"train_12972","question":"Which fungicide has the highest electric dipole moment??","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q193237 . ?ent wdt:P2201 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which fungicide has the most electric dipole movement?"],"info":{}}
{"id":"train_12975","question":"Was Charles Barkley a member of the Los Angeles Clippers and Auburn Tigers men's basketball sports team?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q192707 wdt:P54 wd:Q976396 . wd:Q192707 wdt:P54 wd:Q4819312 }","paraphrases":["Which basketball team was Charles Barklay a member of, the LA Clippers oro the Auburn Tigers?"],"info":{}}
{"id":"train_12977","question":"What are the hydroxide salts which start with the letter hydroxide","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q425597 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hydroxide' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which are the hydroxide salts that starts with letter hydroxide?"],"info":{}}
{"id":"train_12978","question":"World Heritage of Yosemite National Park is?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q180402 wdt:P2614 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12979","question":"how much full time works does elements have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q172891 wdt:P953 ?obj }","paraphrases":["Elements Massage has by far proved to be the best place of employment for me. ..... Full time is capped at 30 hrs per week, so a second source of income is ..."],"info":{}}
{"id":"train_12981","question":"which isotope of Platinum has the lowest binding energy","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19475 . ?ent wdt:P2154 ?obj . ?ent wdt:P279 wd:Q880 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["which isotope of Platinum has the least official energy"],"info":{}}
{"id":"train_12983","question":"what is the name of the conjugate acid of hydroxide ion which has the index of refraction equal to 1.33432?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q199877 wdt:P4147 ?answer . ?answer wdt:P1109 ?x FILTER ( contains ( ?x , '1.33432' ) ) }","paraphrases":["what is the name of the conjugate acid of hydroxide ion which has the index of refraction equal to 1.33432?"],"info":{}}
{"id":"train_12988","question":"Name a province of Pakistan ruled by the Provincial Cabinet of Sindh that contains the word \"sindh\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15058985 . ?sbj wdt:P208 wd:Q59137047 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sindh' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a province of Pakistan dominated by using the Provincial Cabinet of Sindh that carries the phrase \"sindh\" in its identify"],"info":{}}
{"id":"train_12989","question":"Which party member was a suspect in the German presidential election of 2009?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q707051 wdt:P710 ?X . ?X wdt:P102 ?answer }","paraphrases":["Name the party member who was a suspect in the 2009 presidential election of Germany."],"info":{}}
{"id":"train_12990","question":"What award did Renee Zellweger receive in 2004?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q122614 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["which star received a reward in 2004"],"info":{}}
{"id":"train_12991","question":"What position did Idi Amin hold starting on July 28, 1975?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q48231 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1975' ) ) }","paraphrases":["Which position was did Idi Amin hold starting on July 28, 1975?"],"info":{}}
{"id":"train_12992","question":"WHICH IS ARRODISSEMENTS OF COUNTRY SEAT FOE YAREN DISTRICT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q31026 wdt:P1376 ?X . ?X wdt:P150 ?answer }","paraphrases":["WHICH IS ARRODISSEMENTS OF Nation Situate Adversary YAREN Locale"],"info":{}}
{"id":"train_12993","question":"What are the historical profession which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16335296 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the historical profession that starts with the letter z"],"info":{}}
{"id":"train_12994","question":"When did Derek Jacobi begin working at Royal Shakespeare Company?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q256164 p:P108 ?s . ?s ps:P108 wd:Q1146254 . ?s pq:P580 ?value }","paraphrases":["Derek Jacobi started working at the Royal Shakespeare Company in what year?"],"info":{}}
{"id":"train_12995","question":"Give me words that contain the word warhead in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12870 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'warhead' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Provide me words that contain the word warhead in their name"],"info":{}}
{"id":"train_12996","question":"Which profession is practiced by the blues?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9759 wdt:P3095 ?obj . ?obj wdt:P31 wd:Q28640 }","paraphrases":["Which calling is practiced by the blues?"],"info":{}}
{"id":"train_12997","question":"What archaeological site starts with the letter \"w\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q839954 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What archeological location begins with the letter \"w\"?"],"info":{}}
{"id":"train_12998","question":"What is a main topic of history concerning Georgia being bordered by Alabama.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3137082 wdt:P1269 ?answer . ?answer wdt:P47 wd:Q173 }","paraphrases":["What's a major history topic about Alabama bordering Georgia."],"info":{}}
{"id":"train_13000","question":"Tell me the Divided country that starts with the letter k","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11396118 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'k' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose to me the Divided nation that begins with the letter k"],"info":{}}
{"id":"train_13001","question":"What number of century breaks does human  have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P4912 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["How many centuries do humans go through?"],"info":{}}
{"id":"train_13002","question":"When did the Iron Age start?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q11764 wdt:P580 ?obj }","paraphrases":["When did the Iron Age begin?"],"info":{}}
{"id":"train_13003","question":"What is theme of book format of La Abadía del Crimen ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4894453 wdt:P437 ?X . ?X wdt:P144 ?answer }","paraphrases":["What is the book \"La Abadia del Crimen\" about?"],"info":{}}
{"id":"train_13005","question":"When did Tennessee become part of the Confederate States of America?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q81931 p:P150 ?s . ?s ps:P150 wd:Q1509 . ?s pq:P580 ?value }","paraphrases":["In what year did Tennessee join the Confederate States of America?"],"info":{}}
{"id":"train_13007","question":"Who was found guilty in the matter of Anna Branting's spouse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q434056 wdt:P26 ?X . ?X wdt:P1399 ?answer }","paraphrases":["In the matter of Anna Branting's spouse, who was found guilty?"],"info":{}}
{"id":"train_13008","question":"Is it true that the fee of Institut Teknologi Bandung is greater than 1800000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1579397 wdt:P2555 ?obj filter ( ?obj > 1800000.0 ) }","paraphrases":["Is the fee of the Institute Tecknologi Bandung greater than 1800000?"],"info":{}}
{"id":"train_13009","question":"Tell me the sexual orientation of Rocco Siffredi.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q56219 wdt:P91 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13013","question":"How many films did edit George Lucas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1040 wd:Q38222 }","paraphrases":["What is the number of films that George Lucas edited?"],"info":{}}
{"id":"train_13015","question":"Tell me a video game console model that begins with the letter \"w\" and uses a Classic Controller as the input method.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56682555 . ?sbj wdt:P479 wd:Q2573628 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know a video diversion support show that starts with the letter \"w\" and employments a Classic Controller as the input method."],"info":{}}
{"id":"train_13016","question":"What is the featured work of Sonic the Hedgehog that has the voice of actor Dennis Haysbert?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q191626 wdt:P1441 ?answer . ?answer wdt:P725 wd:Q350208 }","paraphrases":["What is the highlighted work of Sonic the Hedgehog that has the voice of performing artist Dennis Haysbert?"],"info":{}}
{"id":"train_13018","question":"Tell me public research university whose name has the word university in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q62078547 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'university' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose to me open research college whose name has the word college in it."],"info":{}}
{"id":"train_13019","question":"Who is the designer of Phahonyothin Road?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2063769 wdt:P609 ?X . ?X wdt:P287 ?answer }","paraphrases":["Who designed Phahonyothin Road?"],"info":{}}
{"id":"train_13022","question":"who is chancellor for aspect history of Delaware?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5775877 wdt:P1269 ?X . ?X wdt:P6 ?answer }","paraphrases":["What is the chancellor's role in the history of Delaware?"],"info":{}}
{"id":"train_13023","question":"Who is the {tennis event} for {victory} of {Rod Laver}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q105550 wdt:P2522 ?obj . ?obj wdt:P31 wd:Q46190676 }","paraphrases":["Who is the {tennis event} for {victory} of {Rod Laver}"],"info":{}}
{"id":"train_13024","question":"Which non-negative integer is the opposite of 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P461 wd:Q204 . ?sbj wdt:P31 wd:Q28920052 }","paraphrases":["Which non-negative numbers is the inverse of 0?"],"info":{}}
{"id":"train_13025","question":"At what point did Andrew Johnson end his career as a United States senator?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8612 p:P39 ?s . ?s ps:P39 wd:Q13217683 . ?s pq:P582 ?value }","paraphrases":["In which year did Andrew Johnson retire as a U.S Senator?"],"info":{}}
