{"id":"train_11633","question":"Is the observing time of the Leviathan of Parsonstown equal to 60?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q459970 wdt:P3891 ?obj filter ( ?obj = 60 ) }","paraphrases":["Is Leviathan of Parsonstown observing time equal to 60?"],"info":{}}
{"id":"train_11634","question":"who state of languages spoken of marcel carné ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q52409 wdt:P1412 ?X . ?X wdt:P17 ?answer }","paraphrases":["who state of dialects talked of marcel carné ?"],"info":{}}
{"id":"train_11635","question":"Where in the bible can you find the book of David?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41370 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q29154430 }","paraphrases":["Where within the book of scriptures can you discover the book of David?"],"info":{}}
{"id":"train_11636","question":"What is the highest constitutional court level you can find in Hamburg ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1055 wdt:P209 ?obj . ?obj wdt:P31 wd:Q32766 }","paraphrases":["What is the highest constitutional court in Hamburg?"],"info":{}}
{"id":"train_11637","question":"Which is a picture of Ryōtarō Shiba?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1087887 wdt:P18 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11638","question":"Is Mario Puzo the screenwriter of The Godfather?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47703 wdt:P58 wd:Q182870 }","paraphrases":["Is the screenwriter of The Godfather Mario Puzo?"],"info":{}}
{"id":"train_11640","question":"What is the diplomatic relations of Saint Kitts and Nevis, that has an inflation rate of consumer price index is 2.7?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q763 wdt:P530 ?answer . ?answer wdt:P1279 ?x FILTER ( contains ( ?x , '2.7' ) ) }","paraphrases":["What is the diplomatic members of the family of Saint Kitts and Nevis, that has an inflation fee of purchaser fee index is 2.7?"],"info":{}}
{"id":"train_11642","question":"What are the symptoms and drug used for treatment of Gastroenteritis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q156103 wdt:P780 ?ans_1 . wd:Q156103 wdt:P2176 ?ans_2 }","paraphrases":["What are the symptoms and medications used for Gastroenteritis?"],"info":{}}
{"id":"train_11643","question":"Was colonel_sanders is doing occupation as cook in restaurateur?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q120450 wdt:P106 wd:Q156839 . wd:Q120450 wdt:P106 wd:Q3427922 }","paraphrases":["Was colonel sanders a cook in a restaurant?"],"info":{}}
{"id":"train_11644","question":"Name the lowest Alexa ranked magazine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q41298 . ?ent wdt:P1661 ?obj . ?ent wdt:P31 wd:Q41298 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Alexa's lowest ranked magazine is..."],"info":{}}
{"id":"train_11645","question":"Which is the Wikimedia category for the category of associated people of Oslo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q585 wdt:P1792 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["Which is the Wikimedia category for the category of related individuals of Oslo?"],"info":{}}
{"id":"train_11646","question":"What gender and ethnic affiliation does Alex Trebek identify with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q929985 wdt:P172 ?ans_1 . wd:Q929985 wdt:P21 ?ans_2 }","paraphrases":["What gender and ethnic affiliation does Alex Trebek discover with?"],"info":{}}
{"id":"train_11647","question":"Is the male population of Capital Hill equal to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q994840 wdt:P1540 ?obj filter ( ?obj = 0.0 ) }","paraphrases":["Are there any males in Captial Hil?"],"info":{}}
{"id":"train_11649","question":"What is the governing document of the Navajo people?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q108266 wdt:P140 ?X . ?X wdt:P92 ?answer }","paraphrases":["What is the administering record of the Navajo people?"],"info":{}}
{"id":"train_11650","question":"What is the gross domestic product per capita based on purchasing power parity of Siddhartha's location?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q457289 wdt:P840 ?X . ?X wdt:P2299 ?answer }","paraphrases":["What is the net residential item per capita based on obtaining control equality of Siddhartha's location?"],"info":{}}
{"id":"train_11651","question":"What films is Bruce Willis cast in","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P161 wd:Q2680 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["What movies is Bruce Willis cast in"],"info":{}}
{"id":"train_11652","question":"what is the royal or noble rank contains the word in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q355567 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yabghu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is the regal or respectable rank contains the word in their name"],"info":{}}
{"id":"train_11655","question":"What platform and software engine does Dota 2 use?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q771541 wdt:P400 ?ans_1 . wd:Q771541 wdt:P408 ?ans_2 }","paraphrases":["DOTA 2 uses what platform running what software engine?"],"info":{}}
{"id":"train_11657","question":"Vladimir Lenin was the head of government of which historical country.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q1394 . ?sbj wdt:P31 wd:Q3024240 }","paraphrases":[],"info":{}}
{"id":"train_11658","question":"What award did Mairead Maguire receive, and how much was the prize money?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q157655 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }","paraphrases":["What award was given to Mairead Maguire, and how much was the money for the prize?"],"info":{}}
{"id":"train_11659","question":"Give me the name of the mass media that starts with 'y' and has a 3GPP readable file format.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11033 . ?sbj wdt:P1072 wd:Q27863097 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me the identify of the mass media that begins with 'y' and has a 3GPP readable file format."],"info":{}}
{"id":"train_11663","question":"Which is the Filmportal ID for Arsène Wenger?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q47576 wdt:P2639 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11664","question":"Who runs the capital city Tenochtitlan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q13695 . ?sbj wdt:P31 wd:Q878249 }","paraphrases":["Who runs Tenochtitlan, the capital?"],"info":{}}
{"id":"train_11665","question":"Tell me the sport that the sports discipline competition of the beach ball and starts with the letter h?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q349 . ?sbj wdt:P2416 wd:Q535116 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the recreation that the sports activities self-discipline opposition of the seashore ball and starts with the letter h?"],"info":{}}
{"id":"train_11666","question":"What death place is divided into by Philaret Drozdov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q129641 wdt:P20 ?X . ?X wdt:P150 ?answer }","paraphrases":["What place of death is Philaret Drozdov split into?"],"info":{}}
{"id":"train_11667","question":"Tell me  Jewish denomination whose name has the word judaism  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3001185 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'judaism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal me Jewish denomination whose name has the word judaism in it."],"info":{}}
{"id":"train_11668","question":"Tell me theatrical genre whose name has the word zauberstück in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15850590 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zauberstück' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know dramatic class whose title has the word zauberstück in it."],"info":{}}
{"id":"train_11669","question":"Tell me probability distribution whose name has the word distribution in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q200726 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'distribution' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose  me probability distribution whose name has the word distribution in it."],"info":{}}
{"id":"train_11672","question":"Give me a name of coachwork type, that starts with an alphabet 'v'.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15729598 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me a coach type name that begins with an ' v ' alphabet."],"info":{}}
{"id":"train_11676","question":"What is regulated by sports  Union of North African Football Federations ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q427061 wdt:P641 ?X . ?X wdt:P3719 ?answer }","paraphrases":["What does the Sports Union of North African Football Federations regulate?"],"info":{}}
{"id":"train_11677","question":"What is the occupational carcinogen for polyvinyl chloride's monomer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4599 wd:Q146368 . ?sbj wdt:P31 wd:Q21074597 }","paraphrases":[],"info":{}}
{"id":"train_11678","question":"When did Michel Serrault receive the Cesar Award for Best Actor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q318088 p:P166 ?s . ?s ps:P166 wd:Q900494 . ?s pq:P585 ?value }","paraphrases":["Michel Serrault receive the Cesar Award for Best Actor in what year?"],"info":{}}
{"id":"train_11680","question":"What is the public holiday/feast day celebrating the resurrection of Jesus called in Belarus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q51624 wdt:P841 ?obj . ?obj wdt:P31 wd:Q2097974 }","paraphrases":["What is the public holiday / festival in Belarus to celebrate Jesus ' resurrection."],"info":{}}
{"id":"train_11681","question":"Did George_Clooney live in Laglio ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23844 wdt:P551 wd:Q47341 }","paraphrases":["The eighteenth-century Villa Oleandra in Laglio is the very well-known summer residence of George Clooney, who since 2002 has chosen this quiet village located on the western shore of Como Lake to spend his vacations, sometimes in the company of other Hollywood celebrities."],"info":{}}
{"id":"train_11682","question":"List the opposite of played by of copying.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1156791 wdt:P1535 ?X . ?X wdt:P461 ?answer }","paraphrases":["List the inverse of played by of replicating."],"info":{}}
{"id":"train_11685","question":"Was the F16 Made by Turkish Aerospace Industries or Caproni?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q100026 wdt:P176 wd:Q2002470 . wd:Q100026 wdt:P176 wd:Q2264354 }","paraphrases":["Did Turkish Aerospace Industries or Caproni make the F16?"],"info":{}}
{"id":"train_11686","question":"Who are the members of sports team of Ricky Ponting since the year 2004?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q472649 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["Who are the members of Ricky Pontig's sports team?"],"info":{}}
{"id":"train_11687","question":"What was the population of London in 1971?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23311 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1971' ) ) }","paraphrases":["In London, 1971, what was the population?"],"info":{}}
{"id":"train_11690","question":"Which Class IC flammable liquid has the highest standard molar entropy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009056 . ?ent wdt:P3071 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["The highest standard of molar entropy can be found in which Class IC combustible liquid?"],"info":{}}
{"id":"train_11691","question":"What is Portuguese Job Code CPP-2010 for astronomer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11063 wdt:P1052 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11693","question":"who is brother for children of Eleanor of Aquitaine ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178525 wdt:P40 ?X . ?X wdt:P3373 ?answer }","paraphrases":["who is brother for children of Eleanor of Aquitaine ?"],"info":{}}
{"id":"train_11694","question":"Who is {headed by} of {party membership} of {Luis Alberto Sánchez} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q969753 wdt:P102 ?X . ?X wdt:P488 ?answer }","paraphrases":["Who is {headed by} of {party participation} of {Luis Alberto Sánchez} ?"],"info":{}}
{"id":"train_11696","question":"Give the world record that Hicham El Guerrouj holds.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q83905 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P1013 wd:Q688615 }","paraphrases":["Hicham El Guerrouj holds what world record?"],"info":{}}
{"id":"train_11697","question":"What are the intergovernmental organization that contains the word southern in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q245065 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'southern' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the between time organization that contains the word southern in their name"],"info":{}}
{"id":"train_11699","question":"What position was held by Michael Manley in 1969?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q365395 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1969' ) ) }","paraphrases":["What role did Michael Manley hold in 1969?"],"info":{}}
{"id":"train_11702","question":"What are the unit of area which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1371562 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which are the unit of area which start with the letter w?"],"info":{}}
{"id":"train_11705","question":"Who is the {human} for {father} of {Alexander Graham Bell}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q34286 wdt:P22 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {father} of {Alexander Graham Bell}"],"info":{}}
{"id":"train_11706","question":"What team is Radamel Falcao Garcia a member of sports team and what is his number of matches played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q138172 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["What sports team is Radamel Falcao a member of & how many matches were played?"],"info":{}}
{"id":"train_11708","question":"Who was the screenwriter of Neon Genesis Evangelion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q662 wdt:P58 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was the screenwriter of Neon Beginning Evangelion?"],"info":{}}
{"id":"train_11710","question":"What is the highest position in the church of England ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q82708 wdt:P2388 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["Who is the leader of the church of England?"],"info":{}}
{"id":"train_11711","question":"At what point in time did Birmingham have a population of 1123000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2256 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '1123000' ) ) . ?s pq:P585 ?value }","paraphrases":["When did Birmingham's population reach 1123000?"],"info":{}}
{"id":"train_11712","question":"Name the item operator of the object accessed by Air Mauritius","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q407556 wdt:P121 ?X . ?X wdt:P137 ?answer }","paraphrases":["Title the thing administrator of the question gotten to by Discuss Mauritius"],"info":{}}
{"id":"train_11714","question":"What is the name of the ethnic group that originates from Korea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P495 wd:Q18097 . ?sbj wdt:P31 wd:Q41710 }","paraphrases":["What is the title of the ethnic bunch that starts from Korea?"],"info":{}}
{"id":"train_11715","question":"When did Amnesty International win the Nobel Peace Prize, and what was the amount of money awarded?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q42970 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P585 ?value1 . ?s pq:P2121 ?value2 }","paraphrases":["When did Absolution Worldwide win the Nobel Peace Prize, and what was the sum of cash awarded?"],"info":{}}
{"id":"train_11716","question":"Give me the name of the award received of Renzo Piano that of point in time is 2000-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q190148 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["What award did Renzo Piano receive in 2000?"],"info":{}}
{"id":"train_11717","question":"What is the economy whose name contains the word russia in it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q159810 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'russia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the economy whose title consists of the word russia in it?"],"info":{}}
{"id":"train_11719","question":"What what is programming language programming paradigm non-structured programming  and  alsowhich that starts with letter b","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9143 . ?sbj wdt:P3966 wd:Q905156 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is programming language programming paradigm non-structured programming and alsowhich that starts with letter b"],"info":{}}
{"id":"train_11721","question":"When did Sāo Paulo have a population of 4.50949e+07?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q175 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '4.50949e+07' ) ) . ?s pq:P585 ?value }","paraphrases":["When did the population of Sao Paulo reach 4.50949e+07?"],"info":{}}
{"id":"train_11723","question":"What is the namesake of Cassini-Huygens, that died in 9/14/1712?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q165585 wdt:P138 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( YEAR ( ?x ) , '1712' ) ) }","paraphrases":["What is the namesake of Cassini-Huygens, that kicked the bucket in 9/14/1712?"],"info":{}}
{"id":"train_11725","question":"What opponent competed against Kerri Walsh Jennings?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q232666 wdt:P1344 ?X . ?X wdt:P710 ?answer }","paraphrases":["Who was Kerri Walsh Jennings's opponent?"],"info":{}}
{"id":"train_11726","question":"Tell me system of units whose name has the word units in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q932268 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'units' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the unit system whose name contains the word units."],"info":{}}
{"id":"train_11727","question":"What is the biomedical quantity of cocaine used for treatment?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2176 wd:Q41576 . ?sbj wdt:P31 wd:Q42014143 }","paraphrases":[],"info":{}}
{"id":"train_11730","question":"Which location in Morava can be found at the corordinates 48.1739?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q179251 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '48.1739' ) ) . ?s pq:P518 ?value }","paraphrases":["If you locate the coordinates 48.1739, which location within Morava will have been found?"],"info":{}}
{"id":"train_11733","question":"Which television show does Ellen DeGeneres host?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P371 wd:Q483325 . ?sbj wdt:P31 wd:Q15416 }","paraphrases":["Which tv appear does Ellen DeGeneres host?"],"info":{}}
{"id":"train_11734","question":"What is the twin city of Klaipeda, which has a size of 25.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q776965 wdt:P190 ?answer . ?answer wdt:P2046 ?x FILTER ( contains ( ?x , '25.0' ) ) }","paraphrases":["What is the twin city of Klaipeda, which includes a measure of 25.0?"],"info":{}}
{"id":"train_11736","question":"Who is {manager/director} of {European Southern Observatory} where {end time} is {1974-1-1} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q151991 p:P1037 ?s . ?s ps:P1037 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1974' ) ) }","paraphrases":["Who is {manager/director} of {European Southern Observatory} where {conclusion time} is {1974-1-1} ?"],"info":{}}
{"id":"train_11737","question":"What is the name of a roof shape that starts with the letter t.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1156686 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a roof shape that begins with the letter t."],"info":{}}
{"id":"train_11742","question":"What is the copy of steradian with the unit conversion of 0.00053996?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q177612 wdt:P144 ?answer . ?answer wdt:P2442 ?x FILTER ( contains ( ?x , '0.00053996' ) ) }","paraphrases":["What is the copy of steradian with the unit conversion of 0.00053996?"],"info":{}}
{"id":"train_11744","question":"Tell me health specialty whose name has the word sam in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q44597158 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sexology' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know wellbeing forte whose title has the word sam in it."],"info":{}}
{"id":"train_11746","question":"Name the multiple star constellation where you can find Centaurus that starts with letter H","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q878367 . ?sbj wdt:P59 wd:Q8844 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the a couple of celebrity constellation the place you can locate Centaurus that starts offevolved with letter H"],"info":{}}
{"id":"train_11747","question":"What is the capital of Henan with a location of 34.7578?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43684 wdt:P36 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '34.7578' ) ) }","paraphrases":["What is Henan's capital with a 34,7578 location?"],"info":{}}
{"id":"train_11748","question":"What is music genre of comes before  I mine øjne ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3791021 wdt:P156 ?X . ?X wdt:P136 ?answer }","paraphrases":["What is music class of comes some time recently I mine øjne ?"],"info":{}}
