{"id":"train_17321","question":"who artistic genre of label of time remembers One time Once ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7805084 wdt:P264 ?X . ?X wdt:P136 ?answer }","paraphrases":["who imaginative sort of name of time recalls One time Once ?"],"info":{}}
{"id":"train_17322","question":"What medication is used to treat cocaine addiction","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P769 wd:Q41576 . ?sbj wdt:P31 wd:Q12140 }","paraphrases":["What medicine is utilized to treat cocaine habit"],"info":{}}
{"id":"train_17323","question":"How many matches and goals did Peter Schmeichel have playing for Hvidovre IF","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q182314 p:P54 ?s . ?s ps:P54 wd:Q843097 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How many fits and dreams did Peter Schmeichel have playing for Hvidovre IF"],"info":{}}
{"id":"train_17324","question":"how many lakes run to the ottawa river?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q60974 wdt:P469 ?obj }","paraphrases":["In regards to the Ottowa river, how many lakes run into it?"],"info":{}}
{"id":"train_17325","question":"What is Ian McKellen's gender and sexual orientation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q170510 wdt:P91 ?ans_1 . wd:Q170510 wdt:P21 ?ans_2 }","paraphrases":["Give the gender and sexual orientation for McKellen's."],"info":{}}
{"id":"train_17326","question":"Is the London Bridge a bascule bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2673 wd:Q130206 . ?sbj wdt:P31 wd:Q911663 }","paraphrases":["Is the London Bridge a bascule bridge?"],"info":{}}
{"id":"train_17327","question":"Where and what did Christopher A. Sims study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q109737 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["Where and what was the study of Christopher A. Sims?"],"info":{}}
{"id":"train_17329","question":"What position did Peggy Whitson hold as an ISS Expedition Commander?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q235523 p:P39 ?s . ?s ps:P39 wd:Q20113740 . ?s pq:P642 ?value }","paraphrases":["As an ISS Expedition Commander, what position did Peggy Whitson hold?"],"info":{}}
{"id":"train_17330","question":"For what was Rachel Weisz in nomination in the year 2006?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q134077 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2006' ) ) }","paraphrases":["Which award was Rachel Weisz nominated for in 2006?"],"info":{}}
{"id":"train_17331","question":"What follows the Ezekiel series?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q178390 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P156 ?value1 . }","paraphrases":["What takes after the Ezekiel arrangement?"],"info":{}}
{"id":"train_17333","question":"What is the antonym of something that takes place during Yule?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q211945 wdt:P837 ?X . ?X wdt:P461 ?answer }","paraphrases":["What is the opposite of something that takes place during Yule?"],"info":{}}
{"id":"train_17334","question":"what are the rebellion which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q124734 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the disobedience which begin with the letter w"],"info":{}}
{"id":"train_17335","question":"Who married a contestant of Mussorgysky?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4308467 wdt:P161 ?X . ?X wdt:P26 ?answer }","paraphrases":["Who hitched a contender of Mussorgysky?"],"info":{}}
{"id":"train_17336","question":"Which sovereign state has the highest central government debt as a percent of GDP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P1689 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What nation has the highest federal debt per percent of GDP?"],"info":{}}
{"id":"train_17338","question":"Is Monopoly's publishing house the parent company of Playskool Inc.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17243 wdt:P123 ?answer . ?answer wdt:P355 wd:Q9060843 }","paraphrases":["Is Monopoly's publishing residence the father or mother corporation of Playskool Inc.?"],"info":{}}
{"id":"train_17339","question":"What is the award Hermann von Helmholtz received on January 1st, 1866?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q60024 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1866' ) ) }","paraphrases":["On January 1, 1866, what award did Hermann von Helmholtz receive?"],"info":{}}
{"id":"train_17340","question":"Is Amedeo Maiuri and Ettore Pais  excavation directors of Pompeii","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q43332 wdt:P4345 wd:Q442340 . wd:Q43332 wdt:P4345 wd:Q981427 }","paraphrases":["Is  it true that Amedeo Maiuri and Ettore Pais are excavation directors of Pompeii?"],"info":{}}
{"id":"train_17342","question":"What is area code of the admin HQ of the New York Stock Exchange ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13677 wdt:P159 ?X . ?X wdt:P473 ?answer }","paraphrases":["What is zone code of the admin HQ of the Modern York Stock Trade ?"],"info":{}}
{"id":"train_17343","question":"What gene is associated with colorectal cancer by a genome-wide association study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q188874 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q1098876 }","paraphrases":["Which gene is associated with colorectal cancer by a genome-wide association study?"],"info":{}}
{"id":"train_17344","question":"What is that is of","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q182559 wdt:P1889 ?answer . ?answer wdt:P737 wd:Q4995044 }","paraphrases":["What is that's of"],"info":{}}
{"id":"train_17348","question":"Which means {type locality (geology)} on{forsterite} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q415037 wdt:P2695 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17349","question":"How many pieces has Claudio Abbado conducted?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3300 wd:Q151608 }","paraphrases":["Which is the number of pieces that Claudio Abbado has conducted?"],"info":{}}
{"id":"train_17350","question":"What Empire used to have Istanbul as its capital ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q406 wdt:P1376 ?obj . ?obj wdt:P31 wd:Q48349 }","paraphrases":["What Domain utilized to have Istanbul as its capital ?"],"info":{}}
{"id":"train_17352","question":"Who is the mascot of Alan I. Bigel's faculty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4706930 wdt:P69 ?X . ?X wdt:P822 ?answer }","paraphrases":["Who is the mascot of Alan I. Bigel's staff?"],"info":{}}
{"id":"train_17354","question":"How many tracklists are there for nevermind?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q17444 wdt:P658 ?obj }","paraphrases":["For nevermind, how many tracklists are there?"],"info":{}}
{"id":"train_17355","question":"Where and what did Jodie Foster study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q41351 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["Where and what did Jodie Cultivate study?"],"info":{}}
{"id":"train_17356","question":"Which nonprofit organization has the largest member count?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q163740 . ?ent wdt:P2124 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What nonprofit organization has the most members?"],"info":{}}
{"id":"train_17357","question":"Who was nominated for the Nobel Prize in Physics for their discovery of the Chandasekhar limit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51366 wdt:P138 ?answer . ?answer wdt:P1411 wd:Q38104 }","paraphrases":["Who was nominated for the Nobel Prize in Physics for their discovery of the Chandasekhar limit?"],"info":{}}
{"id":"train_17359","question":"On January 1st, 1957, what was Pavel Cherenkov nominated for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q76970 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1957' ) ) }","paraphrases":["Pavel Cherenkov was nominated for what on January 1st, 1957?"],"info":{}}
{"id":"train_17360","question":"Of those treated by nadolol, who has died from Bumpy Johnson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1332591 wdt:P509 ?answer . ?answer wdt:P2176 wd:Q424952 }","paraphrases":["Of these dealt with with the aid of nadolol, who has died from Bumpy Johnson?"],"info":{}}
{"id":"train_17361","question":"Which is the double record of Rod Laver?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q105550 wdt:P555 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17362","question":"At the 26th Academy Awards, what was John Houseman nominated for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q315734 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q516479 }","paraphrases":["What category was John Houseman a nominee in at the 26th Annual Academy Awards?"],"info":{}}
{"id":"train_17363","question":"Where is Joachim Murat buried?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q151173 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P965 ?x filter ( contains ( ?x , '39' ) ) }","paraphrases":["What location is Joachim Murat buried?"],"info":{}}
{"id":"train_17365","question":"What position did Jean Chrétien hold before being replaced by Gerald Regan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q128543 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q247524 }","paraphrases":["Jean Chrétien was replaced by Gerald Regan in what position?"],"info":{}}
{"id":"train_17368","question":"Who won the Academy Award for Best Writing, Adapted Screenplay for The Best Years of Our Lives?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q645094 p:P166 ?s . ?s ps:P166 wd:Q107258 . ?s pq:P1346 ?value }","paraphrases":["Who won the Oscar for Best Writing?"],"info":{}}
{"id":"train_17369","question":"What is a subsidiary of Lamont-Doherty Earth Observatory that is a private, non-profit educational institution with the word \"Columbia\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23002054 . ?sbj wdt:P355 wd:Q34051 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'columbia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a subsidiary of Lamont-Doherty Earth Observatory that is a private, non-profit academic institution with the phrase \"Columbia\" in its name?"],"info":{}}
{"id":"train_17372","question":"What is preceded by the Emirate of Sicily, which is on the continent of Europe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1250763 wdt:P1365 ?answer . ?answer wdt:P30 wd:Q46 }","paraphrases":["What is gone before by the Emirate of Sicily, which is on the landmass of Europe?"],"info":{}}
{"id":"train_17373","question":"What position was held by John Major and what year was he elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q9559 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["What function was held by using John Major and what yr used to be he elected in?"],"info":{}}
{"id":"train_17375","question":"What is the sister city of Ponce that includes the county seat of Aragon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q864024 wdt:P190 ?answer . ?answer wdt:P1376 wd:Q4040 }","paraphrases":["What is the sister city of Ponce that incorporates the district situate of Aragon?"],"info":{}}
{"id":"train_17376","question":"What is the Bandcamp ID of Bikini Kill?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q860153 wdt:P3283 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17378","question":"What is the Class II combustible liquid with the highest autoignition temperature?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009057 . ?ent wdt:P2199 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the highest autoignition temperature Class II fuel liquid?"],"info":{}}
{"id":"train_17379","question":"Who is the godmother of Best Moment ESPY award winner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4896742 wdt:P1346 ?X . ?X wdt:P1290 ?answer }","paraphrases":["Who is the back up parent of Best Minute ESPY grant winner?"],"info":{}}
{"id":"train_17380","question":"who Q48460 of topic  of history of minnesota ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2984061 wdt:P1269 ?X . ?X wdt:P1036 ?answer }","paraphrases":["who Q48460 of point of history of minnesota ?"],"info":{}}
{"id":"train_17383","question":"who found the  office held  by head  of the  organisation of  communist party  of india?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q17427 wdt:P112 ?ans_1 . wd:Q17427 wdt:P2388 ?ans_2 }","paraphrases":["The communist party of India was founded and headed by who?"],"info":{}}
{"id":"train_17387","question":"Who is elected in final cause of Austen Chamberlain who has position as member of the 31st Parliament of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q188999 p:P39 ?s . ?s ps:P39 wd:Q41582582 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["Who is chosen in last cause of Austen Chamberlain who has position as part of the 31st Parliament of the Joined together Kingdom?"],"info":{}}
{"id":"train_17389","question":"Where is {landscape of} {significant works} of {Henry Raeburn} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q561916 wdt:P800 ?X . ?X wdt:P180 ?answer }","paraphrases":["What are the significant works of Henry Raeburn?"],"info":{}}
{"id":"train_17390","question":"What is the Internet Standard of Internet Protocol version 6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P747 wd:Q2551624 . ?sbj wdt:P31 wd:Q290378 }","paraphrases":["What is the IPv6 standard?"],"info":{}}
{"id":"train_17391","question":"What what is aircraft family  armament by general-purpose bom which starts with letter 1","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15056993 . ?sbj wdt:P520 wd:Q8141984 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , '1' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the aircraft family armament by general-purpose bom which starts with  letter 1?"],"info":{}}
{"id":"train_17392","question":"What type of material can be used in the atmosphere of Mars?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q218860 wdt:P186 ?obj }","paraphrases":["What material can be found in Mars' atmosphere?"],"info":{}}
{"id":"train_17394","question":"Which IPA symbol has the highest IPA number order?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q41885931 . ?ent wdt:P3917 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What IPA has the highest # order?"],"info":{}}
{"id":"train_17395","question":"What is the IPTC Newscode of cartoon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q627603 wdt:P5429 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17396","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1133128 wdt:P676 ?answer . ?answer wdt:P20 wd:Q2634 }","paraphrases":["Who is it?"],"info":{}}
{"id":"train_17398","question":"Which sculpture has the most horizontal depth ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q860861 . ?ent wdt:P5524 ?obj . ?ent wdt:P31 wd:Q860861 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which form has the foremost flat profundity ?"],"info":{}}
{"id":"train_17402","question":"How many goals did Mia Hamm score for the team magicJack intalae?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q222086 p:P54 ?s . ?s ps:P54 wd:Q312181 . ?s pq:P1351 ?value }","paraphrases":["give the number of goals did Mia Hamm score for the team magicJack intalae?"],"info":{}}
{"id":"train_17403","question":"Where these Neuilly-sur-Seine lived in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q106443 wdt:P551 ?answer . ?answer wdt:P47 wd:Q48958 }","paraphrases":["Where did they live in Neuilly - sur - Seine?"],"info":{}}
{"id":"train_17404","question":"Montevideo is the capital of what state?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1335 wdt:P1376 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["Montevideo is the capital of what state?"],"info":{}}
{"id":"train_17406","question":"Give the Android one smartphone that has the lowest memory capacity.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q18063397 . ?ent wdt:P3559 ?obj . ?ent wdt:P31 wd:Q19723451 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the Android One smartphone with the lowest memory capacity?"],"info":{}}
{"id":"train_17408","question":"What product is made with the Twitter API?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q54935352 wdt:P178 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What item is made with the Twitter API?"],"info":{}}
{"id":"train_17411","question":"How many matches Michael Laudrup played as a member of the Denmark national under-19 football team and how many goals did he score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q188720 p:P54 ?s . ?s ps:P54 wd:Q3873525 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How many football games did Michael Laudrup Play for Denmark and how many goals did he score?"],"info":{}}
{"id":"train_17412","question":"Which is the astronomical filter of visible spectrum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1227 wd:Q76299 }","paraphrases":[],"info":{}}
{"id":"train_17413","question":"What is the equivalent of Vice Admiral that has the NATO code for grade OF-8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q214443 wdt:P460 ?answer . ?answer wdt:P1611 wd:Q18536831 }","paraphrases":["What is the proportionate of Bad habit Chief naval officer that has the NATO code for review OF-8?"],"info":{}}
{"id":"train_17415","question":"Did the movie The Godfather Part II include Gastone Moschin and Leopoldo Trieste as cast members?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q184768 wdt:P161 wd:Q696055 . wd:Q184768 wdt:P161 wd:Q472419 }","paraphrases":["Is it true that The Godfather Part II included Gastone Moschin and Leopoldo Trieste as cast members?"],"info":{}}
{"id":"train_17416","question":"What is ZIP+4 narrative set in Singin' to the Rain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q309153 wdt:P840 ?X . ?X wdt:P281 ?answer }","paraphrases":["The narrative set in Singin' to the Rain is what?"],"info":{}}
{"id":"train_17419","question":"Which player has consequence of Serbian Nationality?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17097756 wdt:P1542 ?X . ?X wdt:P710 ?answer }","paraphrases":["Name the player that has consequence of Serbian Nationality."],"info":{}}
{"id":"train_17420","question":"Tell me atmospheric optical phenomenon whose name has the word subsun in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29564129 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'subsun' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know barometrical optical marvel whose title has the word subsun in it."],"info":{}}
{"id":"train_17421","question":"Who is the central bank/issuer for the International Monetary Fund?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P562 wd:Q7804 }","paraphrases":[],"info":{}}
{"id":"train_17422","question":"What is the ChEBI ID for L-Histidine","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q485277 wdt:P683 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17423","question":"Using the official language of יהודים, what are the people of osip mandelstam called?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q189950 wdt:P172 ?answer . ?answer wdt:P1705 ?x FILTER ( contains ( ?x , 'יהודים' ) ) }","paraphrases":["What are the osip mandelstam people called using the official language?"],"info":{}}
{"id":"train_17424","question":"Mariano Rajoy is a member of which political party in Spain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10819 wdt:P102 ?obj . ?obj wdt:P31 wd:Q6065085 }","paraphrases":["A member of which political party is Mariano Rajoy in Spain?"],"info":{}}
{"id":"train_17425","question":"When does Bydgoszcz begin and end daylight saving time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41252 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q36669 }","paraphrases":["During which time does Bydgoszcz begin and end daylight saving time?"],"info":{}}
{"id":"train_17426","question":"Is Kuala Lumpur the state of Malaysia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1865 wdt:P501 ?obj . ?obj wdt:P31 wd:Q15063586 }","paraphrases":["Is Kuala Lumpur Malaysia's state"],"info":{}}
{"id":"train_17427","question":"Who is the {improvisational theatre} for {affiliation} of {Phil Hartman}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q366834 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q1140700 }","paraphrases":["Phil Hartman has what improvisational theatre for affiliation?"],"info":{}}
{"id":"train_17429","question":"Was Malcolm X born in Omaha?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q43303 wdt:P19 wd:Q43199 }","paraphrases":["Was Omaha the birthplace of Malcolm X?"],"info":{}}
{"id":"train_17430","question":"Is it true that the length of Kutelo is 0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q61870750 wdt:P2043 ?obj filter ( ?obj = 0 ) }","paraphrases":["Is the length of Kutelo 0?"],"info":{}}
{"id":"train_17432","question":"How many sports are played in CSKA Moscow?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q32140 wdt:P641 ?obj }","paraphrases":["What is the number of sports played in CSKA Moscow"],"info":{}}
{"id":"train_17433","question":"Which is the business for which the chief executive officer is Warren Buffett?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P169 wd:Q47213 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Which is the trade for which the chief official officer is Warren Buffett?"],"info":{}}
{"id":"train_17434","question":"What fictional character was created by Shigeru Miyamoto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12382 wdt:P800 ?obj . ?obj wdt:P31 wd:Q15632617 }","paraphrases":["What anecdotal character was made by Shigeru Miyamoto?"],"info":{}}
{"id":"train_17436","question":"What is {child of} of {has brother} of {Cao Hua} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8252909 wdt:P3373 ?X . ?X wdt:P22 ?answer }","paraphrases":["What is {child of} of {has brother} of {Cao Hua} ?"],"info":{}}
{"id":"train_17438","question":"What position did Raúl Alfonsín Gato hold until July 3, 2002?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q193062 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["Raul Alfonsin Gato held what position until July3, 2002?"],"info":{}}
