{"id":"train_19681","question":"What what is city-state highest judical authority by HCC and also which starts with letter h","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q133442 . ?sbj wdt:P209 wd:Q1573233 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is city-state most noteworthy judical specialist by HCC additionally which begins with letter h"],"info":{}}
{"id":"train_19683","question":"What is the total quantity of the unit of information?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3550873 wdt:P111 ?X . ?X wdt:P828 ?answer }","paraphrases":["How much is in one unit of information?"],"info":{}}
{"id":"train_19684","question":"Who preceded and who succeeded to Lothair I as king of Franks?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q150735 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Who came before and after Lothair I as king of Franks?"],"info":{}}
{"id":"train_19687","question":"Did Winston Churchill receive his education at Great Ballard School?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q8016 wdt:P69 wd:Q5598687 }","paraphrases":["Did Winston Churchill go to school at Great Ballard?"],"info":{}}
{"id":"train_19689","question":"What is the number of neutrons in helium-3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q533498 wdt:P1148 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19691","question":"What is the religious affiliation of Jami, that has a Q48460 of 297?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q312458 wdt:P140 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '297' ) ) }","paraphrases":["What is Jami's religious affiliation, which has a 297 Q48460?"],"info":{}}
{"id":"train_19693","question":"When did Theodore Roethke cease to reside in Washington?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1151763 p:P551 ?s . ?s ps:P551 wd:Q1223 . ?s pq:P582 ?value }","paraphrases":["Theordore Roethke lived in Washington until what date?"],"info":{}}
{"id":"train_19694","question":"Tell me opera whose name has the word zhenitba in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1344 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zhenitba' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me the name of opera whose name has word zhenitba in it?"],"info":{}}
{"id":"train_19695","question":"What was Dominique Blanc nominated for at the 26th César Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q271481 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q421542 }","paraphrases":["Which was Dominique Blanc nominated for at the 26th César Awards?"],"info":{}}
{"id":"train_19697","question":"What {prescribed drug} for {Bulimia} has a {displacement} of {309.134}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q180913 wdt:P2176 ?answer . ?answer wdt:P2067 ?x FILTER ( contains ( ?x , '309.134' ) ) }","paraphrases":["What {endorsed sedate} for {Bulimia} features a {relocation} of {309.134}?"],"info":{}}
{"id":"train_19698","question":"who television program for presenter of oprah winfrey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P371 wd:Q55800 . ?sbj wdt:P31 wd:Q15416 }","paraphrases":["What is Oprah Winfrey's television program called?"],"info":{}}
{"id":"train_19699","question":"What vaccine starts with the letter \"v\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134808 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What antibody begins with the letter \"v\"?"],"info":{}}
{"id":"train_19700","question":"What is the item operated by the airline Airbus A380?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P121 wd:Q5830 . ?sbj wdt:P31 wd:Q46970 }","paraphrases":["What is the thing worked by the aircraft Airbus A380?"],"info":{}}
{"id":"train_19701","question":"When did Stephen Harper begin his term as Prime Minister of Canada?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q206 p:P39 ?s . ?s ps:P39 wd:Q839078 . ?s pq:P580 ?value }","paraphrases":["Stephen Harper became Prime Minister of Canada on what date?"],"info":{}}
{"id":"train_19703","question":"Which is the member of political party of Booker T. Washington?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q319871 wdt:P102 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19705","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q154340 wdt:P937 ?answer . ?answer wdt:P6 wd:Q601266 }","paraphrases":["What is it?"],"info":{}}
{"id":"train_19706","question":"Who is the Werner Heisenberg's doctoral student?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q40904 wdt:P185 ?ans_1 . wd:Q40904 wdt:P802 ?ans_2 }","paraphrases":["Who is the doctoral student of Werner Heisenberg?"],"info":{}}
{"id":"train_19707","question":"Are the eligible voters of the Catalan regional election 2015 in la Quar equal to 40?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44913730 wdt:P1867 ?obj filter ( ?obj = 40 ) }","paraphrases":["Were there 40 eligible voters of the 2015 Catalan regional election  in la Quar?"],"info":{}}
{"id":"train_19708","question":"What are the Zuckerart  which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q227790 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT IS THE ZUCKERART THAT STARTS WITH THE LETTER S"],"info":{}}
{"id":"train_19709","question":"What ARE {Commons Institution page} of {Musée national d'Art moderne} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1895953 wdt:P1612 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19710","question":"When did Bernie Ecclestone first pass 3 billion in new worth?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q172724 p:P2218 ?s . ?s ps:P2218 ?x filter ( contains ( ?x , '2.9e+09' ) ) . ?s pq:P585 ?value }","paraphrases":["Bernie Ecclestone had a net worth of more that 3 billion in what year?"],"info":{}}
{"id":"train_19711","question":"When did the book Watership Down earn the Carnegie Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q936801 p:P166 ?s . ?s ps:P166 wd:Q1043985 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["On what year did Watership Down win the Carnegie Medal?"],"info":{}}
{"id":"train_19712","question":"Where did Francisco I. Madero graduate from in 1892?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q216766 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1892' ) ) }","paraphrases":["From what school did Francisco I. Madero graduate in 1892?"],"info":{}}
{"id":"train_19713","question":"What is monomer of propylene ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q151324 wdt:P4599 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19714","question":"What is the taxon rank of Spider and who is Spider's parent taxon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1357 wdt:P105 ?ans_1 . wd:Q1357 wdt:P171 ?ans_2 }","paraphrases":["what is Spider's taxon lineage?"],"info":{}}
{"id":"train_19717","question":"TELL FILM GENRE WHOSE NAME HAS THE WORD WESTERN IN TI","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q201658 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'western' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH FILM GENRE CONTAINS THE WORD WESTERN IN ITS NAME.?"],"info":{}}
{"id":"train_19719","question":"Give the name of the award received by Walter Gropius in 1961.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q61071 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1961' ) ) }","paraphrases":["Grant the title of the grant gotten by Walter Gropius in 1961."],"info":{}}
{"id":"train_19721","question":"Are Las Vegas, Phuket and Huludao twinned administrative bodies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23768 wdt:P190 wd:Q844430 . wd:Q23768 wdt:P190 wd:Q75379 }","paraphrases":["Are Phuket and Huludao and Las Vegas combined administrative bodies?"],"info":{}}
{"id":"train_19724","question":"Which is the FIL ID of Felix Loch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q60711 wdt:P2990 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19725","question":"What is the number of matches played and number of points / goals / set of scores of Landon Donovan being a member of the sports team like C.D. FAS","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q202237 p:P54 ?s . ?s ps:P54 wd:Q2539734 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["What is the number of matches played and number of focuses / objectives / set of scores of Landon Donovan being a part of the sports group like C.D. FAS"],"info":{}}
{"id":"train_19726","question":"Who are the inhabitants of Taiwan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q152864 wdt:P159 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Who inhabits Taiwan?"],"info":{}}
{"id":"train_19728","question":"Which is the ISBN identifier group for South Korea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q884 wdt:P3097 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19730","question":"Which is {distance} of {tributary} of {Gulf of Guinea} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41430 wdt:P974 ?X . ?X wdt:P2043 ?answer }","paraphrases":["Which is {remove} of {tributary} of {Inlet of Guinea} ?"],"info":{}}
{"id":"train_19731","question":"Which {member} is {author} of {Two Treatises of Government} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q231949 wdt:P50 ?X . ?X wdt:P463 ?answer }","paraphrases":["Which {part} is {creator} of {Two Treatises of Government} ?"],"info":{}}
{"id":"train_19733","question":"Give me the determination method for Liberia has total fertility rate as 5.105 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1014 p:P4841 ?s . ?s ps:P4841 ?x filter ( contains ( ?x , '5.105' ) ) . ?s pq:P459 ?value }","paraphrases":["what method is used to determine Liberia's fertility rate of 5.105?"],"info":{}}
{"id":"train_19734","question":"What product is made by P-26B Peashooter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15139430 wdt:P176 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What item is made by P-26B Peashooter?"],"info":{}}
{"id":"train_19736","question":"What was Donald Trump's point time and what award did he receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q22686 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What was Donald Trump's point time and what grant did he receive?"],"info":{}}
{"id":"train_19739","question":"How many work locations are by Bangkok?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P937 wd:Q1861 }","paraphrases":["Which is the number of work locations that are in Bangkok?"],"info":{}}
{"id":"train_19740","question":"What airline operated the Airbus A340?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P121 wd:Q6481 . ?sbj wdt:P31 wd:Q46970 }","paraphrases":["Which airline operated the Airbus A340?"],"info":{}}
{"id":"train_19743","question":"What has the oxidation state of 1.0 and is named for the Iron Age","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11764 wdt:P138 ?answer . ?answer wdt:P1121 ?x FILTER ( contains ( ?x , '1.0' ) ) }","paraphrases":["What has the oxidation nation of 1.0 and is named for the Iron Age"],"info":{}}
{"id":"train_19746","question":"When did Vigdís Finnbogadótti receive an award as honorary doctor of the Paris-Sorbonne University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q189797 p:P166 ?s . ?s ps:P166 wd:Q42171927 . ?s pq:P585 ?value }","paraphrases":["On which date did Vigdís Finnbogadótti get an award as honorary doctor of the Paris-Sorbonne University?"],"info":{}}
{"id":"train_19749","question":"Name someone related to Ezra Pund","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1038 wd:Q163366 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Title somebody related to Ezra Pund"],"info":{}}
{"id":"train_19750","question":"Is the chromosome count of the Passiflora equal to 36?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q161185 wdt:P5230 ?obj filter ( ?obj = 36 ) }","paraphrases":["Does Passiflora's chromosome count equal 36?"],"info":{}}
{"id":"train_19751","question":"In what movie did Val Kilmer play as Moses?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9077 p:P175 ?s . ?s ps:P175 wd:Q191084 . ?s pq:P642 ?value }","paraphrases":["What movie did Val Kilmer play Moses in?"],"info":{}}
{"id":"train_19752","question":"Which is the newspaper format for Die Zeit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q157142 wdt:P3912 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19753","question":"Tell me an automobile marque in the London Stock Exchange that starts with the letter \"t\".","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17412622 . ?sbj wdt:P414 wd:Q171240 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me an automobile marque in the London Stock Exchange that begins with the letter \"t\"."],"info":{}}
{"id":"train_19755","question":"Who is Mongolia in diplomatic relations with, that has it local government in Hubei?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q711 wdt:P530 ?answer . ?answer wdt:P150 wd:Q46862 }","paraphrases":["Who is Mongolia in discretionary relations with, that has it nearby government in Hubei?"],"info":{}}
{"id":"train_19756","question":"what is in the office held by head of state of knyaz ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1906 wd:Q273613 }","paraphrases":[],"info":{}}
{"id":"train_19757","question":"Did {Freemasonry} and {history of topic} {history of Freemasonry}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41726 wdt:P2184 wd:Q153704 }","paraphrases":["Was Freemasonry a history topic in the history of Freemasonry?"],"info":{}}
{"id":"train_19758","question":"What fictional city is the Andy Griffith Show set in","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q526035 . ?sbj wdt:P31 wd:Q1964689 }","paraphrases":["What anecdotal city is the Andy Griffith Appear set in"],"info":{}}
{"id":"train_19760","question":"What was José Gervasio Artigas position that ended on January 20th, 1917?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q252847 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1817' ) ) }","paraphrases":["Which position did Jose Gervasio Artigas quit on January 20th, 1917?"],"info":{}}
{"id":"train_19761","question":"Mention the academic background and the field of Aldus Manutius while being working for Caterina Pico","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q213220 p:P108 ?s . ?s ps:P108 wd:Q3663523 . ?s pq:P802 ?value1 . ?s pq:P101 ?value2 }","paraphrases":["Mention the tutorial history and the discipline of Aldus Manutius whilst being working for Caterina Pico"],"info":{}}
{"id":"train_19762","question":"Tell me what award was received by John Richard Hicks and when he received it.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q184862 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["Tell me what award used to be acquired with the aid of John Richard Hicks and when he obtained it."],"info":{}}
{"id":"train_19763","question":"What did Hagia Sophia commission and found?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q12506 wdt:P88 ?ans_1 . wd:Q12506 wdt:P112 ?ans_2 }","paraphrases":["Tell me what Hagia Sophia commissioned and found."],"info":{}}
{"id":"train_19767","question":"What is {WHO Hotel} of {treated by} of {feebleness} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184674 wdt:P2176 ?X . ?X wdt:P2275 ?answer }","paraphrases":["What WHO Hotel is treated by feebleness?"],"info":{}}
{"id":"train_19768","question":"Where was Jerry Lewis born and what caused his death?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q294927 wdt:P509 ?ans_1 . wd:Q294927 wdt:P19 ?ans_2 }","paraphrases":["Name Jerry Lewis's place of birth and cause of death."],"info":{}}
{"id":"train_19771","question":"What is timeline of topic for precedes has Prehistoric Egypt ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q208520 wdt:P156 ?X . ?X wdt:P2184 ?answer }","paraphrases":["What is the field of this work of the work of Heinrich Famous Dietrich?"],"info":{}}
{"id":"train_19772","question":"What is the sequel to The Matrix?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83495 wdt:P495 ?X . ?X wdt:P47 ?answer }","paraphrases":["What is the continuation to The Matrix?"],"info":{}}
{"id":"train_19775","question":"What is in the Indian reservation of twin cities of Panama City?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3306 wdt:P190 ?X . ?X wdt:P131 ?answer }","paraphrases":["What is within the Indian reservation of twin cities of Panama City?"],"info":{}}
{"id":"train_19777","question":"How many names are named after Jean Dieudonné} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P138 wd:Q371957 }","paraphrases":["Give me the names named after Jean Dieudonne."],"info":{}}
{"id":"train_19779","question":"what is physical phenomenon  name starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1293220 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is physical marvel title begins with s"],"info":{}}
{"id":"train_19780","question":"Complete information for the GCFC2 gene.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18302702 wdt:P688 ?X . ?X wdt:P681 ?answer }","paraphrases":["Total data for the GCFC2 gene."],"info":{}}
{"id":"train_19781","question":"Which football team is managed by Alex Ferguson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P286 wd:Q44980 . ?sbj wdt:P31 wd:Q6979593 }","paraphrases":["Which Alex Ferguson football team is running?"],"info":{}}
{"id":"train_19782","question":"Which is the medication that vinegar is used as material?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41354 wdt:P186 ?obj . ?obj wdt:P31 wd:Q12140 }","paraphrases":["Which is the medicine that vinegar is utilized as material?"],"info":{}}
{"id":"train_19784","question":"Which is said to be the same as a square metre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q25343 wdt:P460 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19785","question":"What is named for the Thomson scattering and has significance with the plum pudding model?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1477639 wdt:P138 ?answer . ?answer wdt:P800 wd:Q274116 }","paraphrases":["What is named for the Thomson scrambling and has noteworthiness with the plum pudding model?"],"info":{}}
{"id":"train_19787","question":"How many afflicts are there in the thyroid gloubu} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P689 wd:Q16399 }","paraphrases":["Which is the number of afflicts that there are in the thyroid gloubu?"],"info":{}}
{"id":"train_19789","question":"Tell me what degree Larry Page has from the University of Michigan.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q4934 p:P69 ?s . ?s ps:P69 wd:Q230492 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What degree did Larry Page get from the University of Michigan?"],"info":{}}
{"id":"train_19792","question":"what is being practiced in  the competition class of  ice_hockey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q41466 wdt:P3095 ?ans_1 . wd:Q41466 wdt:P2094 ?ans_2 }","paraphrases":["what is being practiced in the competition classification of ice_hockey?"],"info":{}}
{"id":"train_19795","question":"Which is the biogeochemical cycle which starts with letter c?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q846303 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the biogeochemical cycle which begins with letter c?"],"info":{}}
{"id":"train_19796","question":"Does the maximum frequency of audible sound of the Homo sapiens equal 20?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q15978631 wdt:P3465 ?obj filter ( ?obj = 20 ) }","paraphrases":["Is the maximum frequency of audible sound of the Homosapien equal to 20?"],"info":{}}
{"id":"train_19797","question":"WHO BURIED THE CREATORS OF THE SACRIFICE AT LYSTRA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3944654 wdt:P170 ?X . ?X wdt:P119 ?answer }","paraphrases":["WHO BURIED THE Makers OF THE Give up AT LYSTRA?"],"info":{}}
{"id":"train_19798","question":"which custom starts with z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q251777 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the custom that starts with the letter z."],"info":{}}
{"id":"train_19800","question":"When Matt Busby started as member of sports team at Manchester City F.C.?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q206237 p:P54 ?s . ?s ps:P54 wd:Q50602 . ?s pq:P580 ?value }","paraphrases":["When Matt Busby began as individual from games group at Manchester City F.C.?"],"info":{}}
{"id":"train_19801","question":"WHICH LAGOON HAVE THE HIGHEST RESISDENCE TIME OF WATER?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q187223 . ?ent wdt:P3020 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["The lagoon with the highest resisdence time of water is?"],"info":{}}
{"id":"train_19802","question":"When did Henryk Sienkiewicz receive a nomination for the Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41502 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["In which year was Henryk Sienkiewicz nominated for Nobel Prize in Literature?"],"info":{}}
{"id":"train_19803","question":"How many school children were in a developed country in 1-1-2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q132453 p:P2573 ?s . ?s ps:P2573 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["How many school-aged children were there in developed countries in November of 2000?"],"info":{}}
