{"id":"train_8157","question":"TELL ME TYPE OF BUSINESS ENTITY WHOSE NAME HAS THE WORD STIFTUNG IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1269299 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'stiftung' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME TYPE OF BUSINESS ENTITY WHOSE NAME HAS THE WORD STIFTUNG IN IT."],"info":{}}
{"id":"train_8158","question":"What is the population of Madagascar in the year 1999?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1019 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1999' ) ) }","paraphrases":["What was Madagascar's population in 1999?"],"info":{}}
{"id":"train_8159","question":"WHAT IS THE DATE OF HIS CHILD","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q50993 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["WHAT IS THE DATE OF HIS CHILD"],"info":{}}
{"id":"train_8163","question":"Who is informed by the advisor of Ramesh Sitaraman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7289442 wdt:P184 ?X . ?X wdt:P737 ?answer }","paraphrases":["Who is educated by the advisor of Ramesh Sitaraman?"],"info":{}}
{"id":"train_8165","question":"What is the diplomatic relation that comes from screamo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11363 wdt:P495 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is the conciliatory connection that comes from screamo?"],"info":{}}
{"id":"train_8166","question":"How was it determined New Brunswick's population was 751171.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1965 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '751171.0' ) ) . ?s pq:P459 ?value }","paraphrases":["Please determine why new burnswicks population was 751171.0"],"info":{}}
{"id":"train_8167","question":"Which is the Wikitribune category for corruption?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q366 wdt:P4973 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8168","question":"What time Charles VI of France has been positioned as king of France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q160349 p:P39 ?s . ?s ps:P39 wd:Q18384454 . ?s pq:P582 ?value }","paraphrases":["When was Charles VI of France appointed the king of France?"],"info":{}}
{"id":"train_8170","question":"Who is the fictional character in the notable work of Shigeru Miyamoto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12382 wdt:P800 ?obj . ?obj wdt:P31 wd:Q95074 }","paraphrases":["Who is the anecdotal character within the eminent work of Shigeru Miyamoto"],"info":{}}
{"id":"train_8171","question":"Elihu Yale (5 April 1649 – 8 July 1721) was a British merchant, slave trader, President of the ... The wedding took place at St. Mary's Church, at Fort St. George, where Yale was a ... even began to kidnap young children and deport them to distant parts of the world, .... Wikimedia Commons has media related to Elihu Yale.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q514846 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '655884' ) ) }","paraphrases":["Elihu Yale (5 April 1649 – 8 July 1721) was a British vendor, slave dealer, President of the ... The wedding took put at St. Mary's Church, at Post St. George, where Yale was a ... indeed started to capture youthful children and extradite them to far off parts of the world, .... Wikimedia Commons has media related to Elihu Yale."],"info":{}}
{"id":"train_8173","question":"What is the { end time } for { Rhineland - Palatinate } like { Helmut Kohl }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1200 p:P6 ?s . ?s ps:P6 wd:Q2518 . ?s pq:P582 ?value }","paraphrases":["When did Rhineland-Palatinate Helmut Kohl end?"],"info":{}}
{"id":"train_8179","question":"Is Boris Johnson the father of Stanley Johnson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q180589 wdt:P22 wd:Q7599711 }","paraphrases":["Is Stanley Johnson's son Boris Johnson?"],"info":{}}
{"id":"train_8182","question":"What is Ivo Andric's IPA Transcription?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q47561 wdt:P898 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8184","question":"Does Marvel Comics own Marvel Tales?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q173496 wdt:P1830 wd:Q6778201 }","paraphrases":["Is Marvel Tales owned by Marvel Comics?"],"info":{}}
{"id":"train_8189","question":"Who produces and makes 300B?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4634305 wdt:P176 ?X . ?X wdt:P1056 ?answer }","paraphrases":["Who produces and makes 300B?"],"info":{}}
{"id":"train_8191","question":"How many muscles work with the humerus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q162595 wdt:P3491 ?obj }","paraphrases":["Which muscles involve the humerus?"],"info":{}}
{"id":"train_8193","question":"Tell me warfare whose name has the word war in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12786121 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'war' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the war whose name contains the word war"],"info":{}}
{"id":"train_8195","question":"What is the population of Turks and Caicos Islands that started at 1985-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q18221 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1985' ) ) }","paraphrases":["How many people lived in the Turks and Caicos Islands during 1985?"],"info":{}}
{"id":"train_8197","question":"Tell me animation technique whose name has the word supermarionation in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3516833 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'supermarionation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which animation technique has the word supermarionation in it?"],"info":{}}
{"id":"train_8199","question":"Tell me force whose name has the word fundamental in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11402 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'fundamental' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the strength of whose name is the fundamental word in it."],"info":{}}
{"id":"train_8201","question":"Which phonological system is used by a facet of Hungarian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1269 wd:Q9067 . ?sbj wdt:P31 wd:Q49124804 }","paraphrases":["Which phonological system does a Hungarian facet use?"],"info":{}}
{"id":"train_8202","question":"Is the duration of 2064-2065 one-year-period equal to 1.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q61702903 wdt:P2047 ?obj filter ( ?obj = 1.2 ) }","paraphrases":["Is the one-year-period between 2064-2065 actually 1.2?"],"info":{}}
{"id":"train_8204","question":"What are the unit of measurement which start with the letter visus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33384 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'öömrang' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the measuring unit which begins with the letter virus."],"info":{}}
{"id":"train_8206","question":"What was the IP address of Heidelberg University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q151510 p:P3761 ?s . ?s ps:P3761 ?x filter ( contains ( ?x , '129.206.0.0/16' ) ) . ?s pq:P1552 ?value }","paraphrases":["Tell me Heidelberg University's IP address?"],"info":{}}
{"id":"train_8207","question":"Which sport discipline does Abebe Bikila compete in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q52596 wdt:P2416 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8209","question":"Is it true that cloud computing win the 2014 Laurence Olivier Awards?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q483639 wdt:P166 wd:Q16995982 }","paraphrases":["Did cloud computing win the Laurence Olivier Award in 2014?"],"info":{}}
{"id":"train_8210","question":"WHo died in Venice ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P20 wd:Q641 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["WHo passed on in Venice ?"],"info":{}}
{"id":"train_8212","question":"Which high school did Phil Hartman attend?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q366834 wdt:P69 ?obj . ?obj wdt:P31 wd:Q9826 }","paraphrases":["Which tall school did Phil Hartman attend?"],"info":{}}
{"id":"train_8213","question":"In 1978, what was Graham Greene nominated for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q128560 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1978' ) ) }","paraphrases":["Which award was Graham Greene short-listed for in 1978?"],"info":{}}
{"id":"train_8215","question":"Which is the capitol building that Thomas Jefferson was the architect for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P84 wd:Q11812 . ?sbj wdt:P31 wd:Q3284499 }","paraphrases":["Which is the capital building for which the architect was Thomas Jefferson?"],"info":{}}
{"id":"train_8216","question":"What was the population of Connecticut as of 2010-4-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q779 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2010' ) ) }","paraphrases":["As of 2010-4-1, what was the population of Connecticut?"],"info":{}}
{"id":"train_8217","question":"Who are the writers mentioned in Bertie the Bus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4895666 wdt:P1441 ?X . ?X wdt:P50 ?answer }","paraphrases":["Who are the journalists specified in Bertie the Transport?"],"info":{}}
{"id":"train_8218","question":"What was the royal of the noble rank of the head of state in the Roman Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2277 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q355567 }","paraphrases":["What was the illustrious of the respectable rank of the head of state within the Roman Empire?"],"info":{}}
{"id":"train_8220","question":"Where was Barbra Streisand born and where was she formed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q4636 wdt:P740 ?ans_1 . wd:Q4636 wdt:P19 ?ans_2 }","paraphrases":["Barbara Streisand was borned and formed where?"],"info":{}}
{"id":"train_8221","question":"Where is the resting place of Joseph when referring to the history of Egypt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q145746 wdt:P20 ?answer . ?answer wdt:P2184 wd:Q185301 }","paraphrases":["Where is the resting put of Joseph when alluding to the history of Egypt?"],"info":{}}
{"id":"train_8224","question":"When did Charlemagne's child Charles the Younger was born and who was his mother?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q283107 . ?s pq:P569 ?value1 . ?s pq:P25 ?value2 }","paraphrases":["What is the date of the birth of Charlemagne's son, O Lovem, and who would his mother be?"],"info":{}}
{"id":"train_8227","question":"Thiruvananthapuram was the capital of what state?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q167715 . ?sbj wdt:P31 wd:Q3024240 }","paraphrases":["Which state has Thiruvananthapuram as its capital?"],"info":{}}
{"id":"train_8229","question":"Where did Muhammad Iqbal earn their Bachelor of Arts degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q484141 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q1765120 }","paraphrases":["What college awarded Muhammad Iqbal earn his Bachelor of Arts degree?"],"info":{}}
{"id":"train_8232","question":"When did educated at of Umberto Eco and academic degree","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q12807 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["When and where was Umberto Eco educated?"],"info":{}}
{"id":"train_8233","question":"How many deaths took place as a result of conflict of Axis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43056 wdt:P607 ?X . ?X wdt:P1120 ?answer }","paraphrases":["The conflict of Axis resulted in how many deaths?"],"info":{}}
{"id":"train_8234","question":"What disease has the shortest incubation period in humans?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12136 . ?ent wdt:P3488 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What disease does human incubation have the shortest incubation period?"],"info":{}}
{"id":"train_8236","question":"Where did Jean-Baptiste Say work starting in 1831?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q13513 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1831' ) ) }","paraphrases":["Jean-Baptiste Say was employed where from 1831?"],"info":{}}
{"id":"train_8239","question":"How many landing locations are there in the Atlantic Ocean?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1158 wd:Q97 }","paraphrases":["In the Atlantic Ocean, how many landing locations are there?"],"info":{}}
{"id":"train_8240","question":"(Spanish: Felipe II; 21 May 1527 – 13 September 1598) was King of Spain[a] (1556–98), King of Portugal (1581–98, as Philip I, Filipe I),[1] King of Naples and Sicily (both from 1554), and jure uxoris King of England and Ireland (during his marriage to Queen Mary I from 1554 to 1558).[2] He was also Duke of Milan.[3] From 1555 he was lord of the Seventeen Provinces of the Netherlands.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q34417 wdt:P25 ?ans_1 . wd:Q34417 wdt:P40 ?ans_2 }","paraphrases":["(Spanish: Felipe II; 21 May 1527 – 13 September 1598) was King of Spain[a] (1556–98), King of Portugal (1581–98, as Philip I, Filipe I),[1] King of Naples and Sicily (both from 1554), and jure uxoris King of England and Ireland (during his marriage to Queen Mary I from 1554 to 1558).[2] He used to be additionally Duke of Milan.[3] From 1555 he was once lord of the Seventeen Provinces of the Netherlands."],"info":{}}
{"id":"train_8244","question":"Which disease is medically treated by hydrogen peroxide?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q171877 wdt:P2175 ?obj . ?obj wdt:P31 wd:Q12136 }","paraphrases":["Which disease is hydrogen peroxide medically treated?"],"info":{}}
{"id":"train_8245","question":"Did Andy Warhol die in NYC?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5603 wdt:P20 wd:Q60 }","paraphrases":["Was NYC where Andy Warhol died?"],"info":{}}
{"id":"train_8246","question":"What is in the village that David Summer worked at?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21062278 wdt:P108 ?X . ?X wdt:P131 ?answer }","paraphrases":["What is within the town that David Summer worked at?"],"info":{}}
{"id":"train_8249","question":"When did member of sports team of John Charles and number of matches played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q312404 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["Who did John Charles play for and how many matches did he play?"],"info":{}}
{"id":"train_8250","question":"What is the member of the political party and sports team of Andre Agassi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q7407 wdt:P102 ?ans_1 . wd:Q7407 wdt:P54 ?ans_2 }","paraphrases":["Who is a member of a political party and part of Andre Agassi's sports team?"],"info":{}}
{"id":"train_8252","question":"When was Coronation Street nominated for a British Academy Television Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q945030 p:P1411 ?s . ?s ps:P1411 wd:Q1369077 . ?s pq:P585 ?value }","paraphrases":["In what year did Coronation Street get short-listed for a British Academy Television Award?"],"info":{}}
{"id":"train_8253","question":"When did Tomsk start being the administrative territorial entity of the Tomsk Governorate?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q976 p:P131 ?s . ?s ps:P131 wd:Q1378406 . ?s pq:P580 ?value }","paraphrases":["On what date did Tomsk become the administrative territorial entity of the Tomsk Governorate?"],"info":{}}
{"id":"train_8256","question":"what is the {start time} for {the apprentice} has {executive producer} as {Mark Burnett} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47561 p:P463 ?s . ?s ps:P463 wd:Q1132636 . ?s pq:P582 ?value }","paraphrases":["what is the {ready time} for {the apprentice} which has {executive producer} as {Mark Burnett} ?"],"info":{}}
{"id":"train_8257","question":"Tell me the folk religion that has as foundational text Nihon Shoki and starts with the letter s?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1068640 . ?sbj wdt:P457 wd:Q813935 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the folks religion that has as foundational text Nihon Shoki and starts offevolved with the letter s?"],"info":{}}
{"id":"train_8259","question":"What  is the  ID of  the housekeeper of the Libray of Congress Demographic Group?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2596569 wdt:P4946 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8261","question":"What is the intensive quantity measured by amperes per volt meter that contains the word \"conductivity \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3387041 . ?sbj wdt:P1880 wd:Q20966435 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'conductivity' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the concentrated amount estimated by amperes per volt meter that contains \"conductivity \" in its name"],"info":{}}
{"id":"train_8263","question":"which type of medical test starts with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55215251 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which sort of restorative test begins with the letter u"],"info":{}}
{"id":"train_8264","question":"Where did Lloyd Shapley go to college and what did he study ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q244739 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["Where did Lloyd Shapley go to college and what did he consider ?"],"info":{}}
{"id":"train_8265","question":"What is the institute of technology whose mascot is Ramblin' Wreck that contains the word \" georgia\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1371037 . ?sbj wdt:P822 wd:Q7289241 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'georgia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the founded of innovation whose mascot is Ramblin' Wreck that contains the word \" georgia\" in its title ?"],"info":{}}
{"id":"train_8266","question":"Did London twin with Phnom Penh?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q84 wdt:P190 wd:Q1850 }","paraphrases":["Is Phnom Penh twinned with London?"],"info":{}}
{"id":"train_8267","question":"What is the name of the city that Nadezha Mandelstam died in, whose sister city is Vienna?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q234765 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1741 }","paraphrases":["What is the title of the metropolis that Nadezha Mandelstam died in, whose sister town is Vienna?"],"info":{}}
{"id":"train_8268","question":"Who are rhe sons of Emperor Wu of Jin whose surname is Sima?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7356 wdt:P40 ?answer . ?answer wdt:P734 wd:Q592176 }","paraphrases":["Who are rhe sons of Emperor Wu of Jin whose surname is Sima?"],"info":{}}
{"id":"train_8269","question":"Is Kenya's nominal GDP per capita equal to 1376.71?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q114 wdt:P2132 ?obj filter ( ?obj = 1376.71 ) }","paraphrases":["Is Kenya's ostensible GDP per capita break even with to 1376.71?"],"info":{}}
{"id":"train_8270","question":"When did Groucho Marx receive the Academy Honorary Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q103846 p:P166 ?s . ?s ps:P166 wd:Q727328 . ?s pq:P585 ?value }","paraphrases":["When was Groucho Marx awarded the Academy Honorary Award?"],"info":{}}
{"id":"train_8273","question":"What is the political party of Altmarkkreis Salzwedel Governor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6061 wdt:P6 ?X . ?X wdt:P102 ?answer }","paraphrases":["What is the political party of Altmarkkreis Salzwedel Governor?"],"info":{}}
{"id":"train_8274","question":"\"Which male relating to Antonio Stradivari, has an abbreviation of мужской ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q182011 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'мужской' ) ) }","paraphrases":["\"Which male relating to Antonio Stradivari, has an truncation of мужской ?\""],"info":{}}
{"id":"train_8276","question":"Which characters of Tosca Are U  carceriere?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q192941 p:P674 ?s . ?s ps:P674 ?obj . ?s pq:P1705 ?x filter ( contains ( ?x , 'Un carceriere' ) ) }","paraphrases":["Who of Tosca Are U characters were jailed?"],"info":{}}
{"id":"train_8277","question":"Where is Coco Chanel buried with the coordinates of 46.519952777778 6.6010833333333?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q45661 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P625 ?x filter ( contains ( ?x , '46.519952777778 6.6010833333333' ) ) }","paraphrases":["Coco Chanel is buried where with the coordinates 46.519952777778 6.6010833333333"],"info":{}}
{"id":"train_8279","question":"Which is the Brooklyn Museum artwork ID for butter knife?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2561443 wdt:P4740 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8280","question":"Is Tina Turner's family name Turner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q131814 wdt:P734 wd:Q12804512 }","paraphrases":["Is it true that Tina Turner's family name is Turner?"],"info":{}}
{"id":"train_8281","question":"Is the angular resolution of AMiBA equal to 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1094807 wdt:P3439 ?obj filter ( ?obj = 2 ) }","paraphrases":["Does AMiBA have an angular resolution of 2?"],"info":{}}
{"id":"train_8282","question":"tell  me ice hockey team league National Hockey League starts with o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4498974 . ?sbj wdt:P118 wd:Q1215892 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal me ice hockey team league National Hockey League starts with o"],"info":{}}
{"id":"train_8285","question":"Tell me about the ring system of Jupiter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q319 wdt:P398 ?obj . ?obj wdt:P31 wd:Q28951811 }","paraphrases":["Tell me about Jupiter's ring system?"],"info":{}}
