{"id":"train_13279","question":"Which is the permanent residency for Andy Lau?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q16766 wdt:P5389 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13280","question":"What was the position Edward the Confessor held when he replaced Harthacanute?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q130005 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q190091 }","paraphrases":["Harthacanute was replaced by Edward the Confessor who at the time held what position?"],"info":{}}
{"id":"train_13281","question":"What was The West Wing nominated for in 2001?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3577037 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["West Wing was nominated for what in 2001?"],"info":{}}
{"id":"train_13283","question":"When did award received of Vannevar Bush and field of work?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q299595 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P101 ?value1 . }","paraphrases":["When was Vannevar Bush's award and field of work received?"],"info":{}}
{"id":"train_13284","question":"What label released the album Melting the Crown?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20081317 wdt:P264 ?X . ?X wdt:P159 ?answer }","paraphrases":["What name discharged the collection Dissolving the Crown?"],"info":{}}
{"id":"train_13286","question":"what is an algorithm that contains the word system in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8366 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'system' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is an algorithm that consists of the word device in their name"],"info":{}}
{"id":"train_13287","question":"What sound does a pig make in the French language?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q787 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q150 }","paraphrases":["When saying it in French, what is the sound made by a pig?"],"info":{}}
{"id":"train_13289","question":"What was the residentce of László Moholy-Nagy in the end of 1937?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q160448 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1937' ) ) }","paraphrases":["At the end of 1937, where did László Moholy-Nagy reside?"],"info":{}}
{"id":"train_13290","question":"Which countries are located in the Himalayas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P706 wd:Q27231 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["Which Himalayan countries are located?"],"info":{}}
{"id":"train_13292","question":"When was Enoch Powell elected and what position did they hold?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q333028 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["When did Enoch Powell get elected and for what position?"],"info":{}}
{"id":"train_13293","question":"Who was the head of government of the Czech Republic on January 1st, 1993?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q213 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1993' ) ) }","paraphrases":["Who became the head of the Czech Republic in 1993?"],"info":{}}
{"id":"train_13295","question":"Name the workplace of Walter Houser Brattain, which is located at street address 345 Boyer Ave, Walla Walla, WA 99362?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184577 wdt:P108 ?answer . ?answer wdt:P969 ?x FILTER ( contains ( ?x , '345 Boyer Ave, Walla Walla, WA, 99362' ) ) }","paraphrases":["Name the place of business of Walter Houser Brattain, which is located at road address 345 Boyer Ave, Walla Walla, WA 99362?"],"info":{}}
{"id":"train_13296","question":"When did James Stewart and Gloria Hatrick McLean end their marriage?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q102462 p:P26 ?s . ?s ps:P26 wd:Q20988924 . ?s pq:P582 ?value }","paraphrases":["What year did James Stewart and Gloria Hatrick McLean divorce?"],"info":{}}
{"id":"train_13298","question":"What is the number of plays of Euroleague Basketball?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q185982 wdt:P641 ?X . ?X wdt:P2047 ?answer }","paraphrases":["What is the number of plays of Euroleague Basketball?"],"info":{}}
{"id":"train_13299","question":"Does the topographic prominence of the Dunantspitze equal 15?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q664935 wdt:P2660 ?obj filter ( ?obj = 15 ) }","paraphrases":["Does the topographic conspicuousness of the Dunantspitze rise to 15?"],"info":{}}
{"id":"train_13301","question":"What degree and major did Neil Armstrong receive and University of Southern California?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q1615 p:P69 ?s . ?s ps:P69 wd:Q4614 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["What degree and majeure did Neil Armstrong and Southern California University receive?"],"info":{}}
{"id":"train_13303","question":"What year did Ruth Benedict receive her PhD?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q228822 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q752297 }","paraphrases":["Ruth Benedict received her PhD during which year?"],"info":{}}
{"id":"train_13304","question":"Is the ward of Thường Tín located next to a body of water?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q864581 wdt:P131 ?X . ?X wdt:P206 ?answer }","paraphrases":["where the ward of Thurong Tin located body"],"info":{}}
{"id":"train_13305","question":"How do we observe the physical quantity of the picometre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192274 wdt:P111 ?X . ?X wdt:P4020 ?answer }","paraphrases":["How do we watch the physical amount of the picometre?"],"info":{}}
{"id":"train_13307","question":"Which is the Australian Dictionary of Biography ID for Henry George?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q355245 wdt:P1907 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13308","question":"What are the poem which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5185279 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the sonnet which begin with the letter t"],"info":{}}
{"id":"train_13309","question":"What is the natural abundance of helium-3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q533498 wdt:P2374 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13310","question":"what is the subject of the history of Asia, that has time zone is Magadan","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q627531 wdt:P1269 ?answer . ?answer wdt:P421 wd:Q385504 }","paraphrases":["what is the concern of the records of Asia, that has time quarter is Magadan"],"info":{}}
{"id":"train_13314","question":"How many places have the Berber language as their official language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P37 wd:Q25448 }","paraphrases":["What's the number of places where Berber is the official language?"],"info":{}}
{"id":"train_13315","question":"What is the meeting for the overseers of UNICEF?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q740308 wdt:P749 ?obj . ?obj wdt:P31 wd:Q18287076 }","paraphrases":["What is the assembly for the supervisors of UNICEF?"],"info":{}}
{"id":"train_13316","question":"Who is the  {human} for {creator} of {Star Trek}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1092 wdt:P170 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the { human } for the { Star Trek } creator?"],"info":{}}
{"id":"train_13317","question":"What flux did the Coma Cluster produce?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q870674 wdt:P2221 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13318","question":"What is the { start time } for { Taranto } as { Brest } has { twined the administrative body }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q13498 p:P190 ?s . ?s ps:P190 wd:Q12193 . ?s pq:P580 ?value }","paraphrases":["What is the { begin time } for { Taranto } as { Brest } has { twined the authoritative body }?"],"info":{}}
{"id":"train_13319","question":"What is YouTube Gaming's game id for Portal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q274897 wdt:P5367 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13320","question":"Name a doll created by Mattel that contains the word \"ken \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q168658 . ?sbj wdt:P176 wd:Q596139 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ken' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a doll created via Mattel that carries the word \"ken \" in its title"],"info":{}}
{"id":"train_13321","question":"What nation is Mohamed Boudiaf diplomatically related to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q314691 wdt:P27 ?X . ?X wdt:P530 ?answer }","paraphrases":["What country is Mohamed Boudiaf strategically related to?"],"info":{}}
{"id":"train_13322","question":"When did Robert Ballard end his service in the United States Army?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q312867 p:P241 ?s . ?s ps:P241 wd:Q9212 . ?s pq:P582 ?value }","paraphrases":["On what date did Robert Ballard end his service in the United States Army?"],"info":{}}
{"id":"train_13323","question":"Did Bangalore administrate over San Francisco and Kharkiv?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1355 wdt:P190 wd:Q62 . wd:Q1355 wdt:P190 wd:Q42308 }","paraphrases":["Which country administrates over San Francisco and Kharkiv?"],"info":{}}
{"id":"train_13327","question":"Who gave the {interaction} of {antiparticle of} of {strange quark} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6763 wdt:P2152 ?X . ?X wdt:P517 ?answer }","paraphrases":["Who gave the {interaction} of {antiparticle of} of {interesting quark} ?"],"info":{}}
{"id":"train_13329","question":"Where in Austria is the University of Vienna headquarters located?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q165980 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P17 wd:Q40 }","paraphrases":["Where are the headquarters of the University of Venna"],"info":{}}
{"id":"train_13330","question":"What was the cause of Mahatma Gandhi's actions?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1001 wdt:P607 ?obj . ?obj wdt:P31 wd:Q506259 }","paraphrases":["What was the cause of Mahatma Gandhi's actions?"],"info":{}}
{"id":"train_13332","question":"Is the stellar rotational velocity of the Mu2 Octantis equal to 1.45?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q392735 wdt:P4296 ?obj filter ( ?obj = 1.45 ) }","paraphrases":["Is the stellar rotational speed of the Mu2 Octantis rise to to 1.45?"],"info":{}}
{"id":"train_13333","question":"When did award received of Chris Thile and point in time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q596779 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["When did grant gotten of Chris Thile and point in time?"],"info":{}}
{"id":"train_13334","question":"IS STEPHEN FRY NOMINATED FOR KENTUCKY COLONEL AND DRAMA DESK WARD FOR OUTSTANDING FEATURED ACTOR ON A PLAY","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q192912 wdt:P1411 wd:Q632482 . wd:Q192912 wdt:P1411 wd:Q5305712 }","paraphrases":["Does the nomination for outstanding features actor in a play include Stephen Fry's work in Kentucky Colonel and Drama Desk?"],"info":{}}
{"id":"train_13335","question":"WHICH IS THE FIELD WORK AND OCCUPATION OF BRAM STOKER AS AN EMPLOYER IN DUBLIN CASTLE","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q36184 p:P108 ?s . ?s ps:P108 wd:Q742767 . ?s pq:P101 ?value1 . ?s pq:P106 ?value2 }","paraphrases":["WHICH IS THE FIELD WORK AND OCCUPATION OF BRAM STOKER AS AN Boss IN DUBLIN CASTLE"],"info":{}}
{"id":"train_13337","question":"what is geological epoch starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q754897 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What geological epoch starts with \"w\"?"],"info":{}}
{"id":"train_13338","question":"Who had influenced France Prešeren, who worked as a translator?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1031 wdt:P737 ?answer . ?answer wdt:P106 wd:Q333634 }","paraphrases":["Who had influenced France Prešeren, who worked as a translator?"],"info":{}}
{"id":"train_13340","question":"\"What has the Symptom of Polymerization, and the Antonym of Oligomer?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q181898 wdt:P1542 ?answer . ?answer wdt:P461 wd:Q726004 }","paraphrases":["What has the Symptom of Polymerization, and the Antonym of Oligomer?\""],"info":{}}
{"id":"train_13342","question":"Name a country who is diplomatic towards the Russian Empire.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q34266 wdt:P530 ?obj . ?obj wdt:P31 wd:Q6256 }","paraphrases":[],"info":{}}
{"id":"train_13343","question":"What sport did Shane Warne, #23, play?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q555240 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1618 ?x filter ( contains ( ?x , '23' ) ) }","paraphrases":["Shane Warne, #23, participated in what sport?"],"info":{}}
{"id":"train_13347","question":"Who was the stepparent of Napolean.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3448 wd:Q517 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["To whom did Napolean's parents get re-married?"],"info":{}}
{"id":"train_13348","question":"What is the name of cyclone with the small substained winds?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q79602 . ?ent wdt:P2895 ?obj . ?ent wdt:P31 wd:Q79602 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What type of cyclone has relatively low sustained windspeeds?"],"info":{}}
{"id":"train_13349","question":"When did Nadia Boulanger start working at Fontainebleau Schools?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q140619 p:P108 ?s . ?s ps:P108 wd:Q470082 . ?s pq:P580 ?value }","paraphrases":["When did Nadia Boulanger begin working at Fontainebleau Schools?"],"info":{}}
{"id":"train_13350","question":"What were the battles undertook by Joan of Arc","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7226 wdt:P607 ?obj . ?obj wdt:P31 wd:Q178561 }","paraphrases":["What were the fights attempted by Joan of Arc"],"info":{}}
{"id":"train_13351","question":"When the death of the Marat has been confirmed as murder?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q636537 p:P180 ?s . ?s ps:P180 wd:Q132821 . ?s pq:P642 ?value }","paraphrases":["when was the death of the marat confirmed as murder?"],"info":{}}
{"id":"train_13355","question":"What are the SI base unit which start with the letter second","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223662 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'second' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the SI base unit which begin with the letter second"],"info":{}}
{"id":"train_13356","question":"What was the population of Ulyanovsk in 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5627 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["How many people lived in Ulyanovsk in 2016?"],"info":{}}
{"id":"train_13359","question":"What is the male of Adam, that has abreviated name of o?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q70899 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , '♂' ) ) }","paraphrases":["What is the male of Adam, that has abreviated title of o?"],"info":{}}
{"id":"train_13360","question":"was warren buffett's family name buffett?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47213 wdt:P734 wd:Q21492748 }","paraphrases":["Did Warren Buffett have Buffett as family name?"],"info":{}}
{"id":"train_13361","question":"Who is the character Mimi from La bohème?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q188621 p:P674 ?s . ?s ps:P674 ?obj . ?s pq:P1932 ?x filter ( contains ( ?x , 'Mimì' ) ) }","paraphrases":["Who plays Mimi from La boheme?"],"info":{}}
{"id":"train_13366","question":"When was International Organization for Standardization the developer for COBOL?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q131140 p:P178 ?s . ?s ps:P178 wd:Q15028 . ?s pq:P580 ?value }","paraphrases":["International Organization for Standardization developed COBOL in what year?"],"info":{}}
{"id":"train_13367","question":"When did Pamplona become the capital of Navarre?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q10282 p:P1376 ?s . ?s ps:P1376 wd:Q4018 . ?s pq:P580 ?value }","paraphrases":["In what year did Pamplona become the capital of Navarre?"],"info":{}}
{"id":"train_13368","question":"Which are the list of French Revolutionary Wars?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q207318 wdt:P360 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13369","question":"Tell me form factor whose name has the word ultrabook in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24574728 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ultrabook' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know shape figure whose title has the word ultrabook in it."],"info":{}}
{"id":"train_13370","question":"What comes after sodium on the periodic table","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q658 p:P31 ?s . ?s ps:P31 wd:Q11344 . ?s pq:P156 ?value }","paraphrases":["Which element follows sodium on the periodic table?"],"info":{}}
{"id":"train_13371","question":"Whenwas the Canary Islands located in the the UTC+01:00 time zone?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5813 p:P421 ?s . ?s ps:P421 wd:Q6655 . ?s pq:P1264 ?value }","paraphrases":["Give the time period the Canary Islands were located in the UTC+01:00 time zone."],"info":{}}
{"id":"train_13374","question":"WHICH  IS THE CLASS II COMBUSTIBLE LIQUID WITH THE MAXIMUM DYNAMIC VISCOSITY","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009057 . ?ent wdt:P3070 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Class II Combustible Liquid has the highest maximum viscosity?"],"info":{}}
{"id":"train_13375","question":"WHO IS THE CHILDREN THAT SCOTT WADE TEAMS PLAYED FOR?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7437454 wdt:P40 ?X . ?X wdt:P54 ?answer }","paraphrases":["Scott Wade's team played for which children?"],"info":{}}
{"id":"train_13378","question":"What was Adam Sandler's estimated net worth in 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q132952 p:P2218 ?s . ?s ps:P2218 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["How much was Adam Sandler worth in 2015?"],"info":{}}
{"id":"train_13380","question":"Is the median income of Slovenia equal to 25085?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q215 wdt:P3529 ?obj filter ( ?obj = 25085 ) }","paraphrases":["Is 25085 the median income of people who live in Slovenia?"],"info":{}}
{"id":"train_13381","question":"Who are the employees of Banco Santander in the year of 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q806215 p:P1128 ?s . ?s ps:P1128 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["In 2015 who were the employees of Banco Santander?"],"info":{}}
{"id":"train_13382","question":"WHICH IS THE STATISTICAL INFERENCE STARTS WITH B","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q938438 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE Factual Deduction Begins WITH B"],"info":{}}
{"id":"train_13384","question":"Is the sublimation temperature of carbon dioxide equal to -109?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1997 wdt:P2113 ?obj filter ( ?obj = -109 ) }","paraphrases":["does carbon iv oxide sublime at -109 degrees?"],"info":{}}
{"id":"train_13385","question":"IS JAMES DEEN OCCUPATION PORNOGRAPHIC ACTOR AND BLOGGER","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q332641 wdt:P106 wd:Q488111 . wd:Q332641 wdt:P106 wd:Q8246794 }","paraphrases":["Is the occupation of James Deen that of a pornographic actor and blogger?"],"info":{}}
{"id":"train_13386","question":"What is the watershed area of the White Nile?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q4814791 wdt:P2053 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13387","question":"How many times has Deutsches Institut fur Normnug been edited?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P98 wd:Q152746 }","paraphrases":["Deutsches Institut fur Normnug has been edited how many times?"],"info":{}}
{"id":"train_13388","question":"What is the name of the deathplace of Tullio Levi-Civita that also borders Pomezia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q353438 wdt:P20 ?answer . ?answer wdt:P47 wd:Q243172 }","paraphrases":["What is the title of the deathplace of Tullio Levi-Civita that moreover borders Pomezia?"],"info":{}}
{"id":"train_13389","question":"Which party is headed by Anabella Azin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5674198 wdt:P102 ?X . ?X wdt:P488 ?answer }","paraphrases":["Which party will Anabella Azin lead?"],"info":{}}
{"id":"train_13390","question":"Which is Prosopographia Attica for Epicurus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q43216 wdt:P2421 ?answer }","paraphrases":[],"info":{}}
{"id":"train_13392","question":"Which {time} of {lives in} {Ludwig Erhard} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2496 wdt:P551 ?X . ?X wdt:P421 ?answer }","paraphrases":["Which {time} of {lives in} {Ludwig Erhard} ?"],"info":{}}
{"id":"train_13393","question":"Which is the {original combination} and the {parent taxon} of {Leopard} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q34706 wdt:P1403 ?ans_1 . wd:Q34706 wdt:P171 ?ans_2 }","paraphrases":["Which is the {initial combination} and the {parent taxon} of {Panther} ?"],"info":{}}
{"id":"train_13394","question":"How many instrumentation are by harpsichord?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P870 wd:Q81982 }","paraphrases":["What is the number of harpsichord players in the instrumental?"],"info":{}}
