{"id":"train_5029","question":"What is the name of the location of death for Socrates, whose governor is Marta Suplicy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q102331 wdt:P20 ?answer . ?answer wdt:P6 wd:Q463614 }","paraphrases":["What is the title of the area of passing for Socrates, whose senator is Marta Suplicy?"],"info":{}}
{"id":"train_5031","question":"What team was Pele' apart of on January 1st 1957?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12897 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1957' ) ) }","paraphrases":["In which team was Pele a member of on January 1st 1957?"],"info":{}}
{"id":"train_5033","question":"Where was Boney M. born in 1975?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q156298 p:P495 ?s . ?s ps:P495 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1975' ) ) }","paraphrases":["What is the birthplace of Boney M. in 1975?"],"info":{}}
{"id":"train_5035","question":"What was approved by Fuji followed by McIntosh?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q504893 p:P156 ?s . ?s ps:P156 wd:Q1144556 . ?s pq:P790 ?value }","paraphrases":["What was approved by Fuji followed by McIntosh"],"info":{}}
{"id":"train_5036","question":"Which country has the highest par?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1137210 . ?ent wdt:P3530 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which nation has the most noteworthy standard?"],"info":{}}
{"id":"train_5038","question":"Who held the title of King of Franks after Chlothar II?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q209118 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["When Chlothar II died, who became King of Franks?"],"info":{}}
{"id":"train_5039","question":"In 2016, what was the net profit of UnitedHealth Group?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2103926 p:P2295 ?s . ?s ps:P2295 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["What was UnitedHealth Group's net profit in 2016?"],"info":{}}
{"id":"train_5041","question":"Which is the conjugate acid for nitric acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4147 wd:Q83320 }","paraphrases":[],"info":{}}
{"id":"train_5044","question":"Name a movie featuring Burt Reynolds","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P161 wd:Q202148 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Name one movie starring Burt Reynolds."],"info":{}}
{"id":"train_5045","question":"what is the county of American Indians ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P172 wd:Q49297 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":[],"info":{}}
{"id":"train_5046","question":"What is the born on of advisor of Gaston Bachelard ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q270800 wdt:P184 ?X . ?X wdt:P569 ?answer }","paraphrases":["What is the born on of advisor of Gaston Bachelard ?"],"info":{}}
{"id":"train_5047","question":"Which category of people is active in Eamon de Valera?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q173347 wdt:P937 ?X . ?X wdt:P1792 ?answer }","paraphrases":["Which category of individuals is dynamic in Eamon de Valera?"],"info":{}}
{"id":"train_5049","question":"What is the history of anarchism, as opposed to illegalism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2746978 wdt:P1269 ?answer . ?answer wdt:P1889 wd:Q1516296 }","paraphrases":["What is the history of political agitation, as contradicted to illegalism?"],"info":{}}
{"id":"train_5051","question":"Who are the daughters of the author of Black Lamb and Grey Falcon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4921153 wdt:P50 ?X . ?X wdt:P40 ?answer }","paraphrases":["Who are Black Lamb and Grey Falcon's daughters?"],"info":{}}
{"id":"train_5052","question":"Does the Seeteufel beam equal 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q320214 wdt:P2261 ?obj filter ( ?obj = 2 ) }","paraphrases":["Does the Seeteufel pillar rise to 2?"],"info":{}}
{"id":"train_5053","question":"Tell me chartered company whose name has the word company in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162157 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'company' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know chartered company whose title has the word company in it."],"info":{}}
{"id":"train_5054","question":"Was Oda Nobunaga born on June 23, 1534?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q171411 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( YEAR ( ?x ) , '1534' ) ) . ?s pq:P31 ?value }","paraphrases":["Was June 23, 1534 the date in which Oba Nobunaga born?"],"info":{}}
{"id":"train_5055","question":"Which state has the city that is the twin city of Geneva?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q71 wdt:P190 ?X . ?X wdt:P17 ?answer }","paraphrases":["Which state has the city that's the twin city of Geneva?"],"info":{}}
{"id":"train_5056","question":"\"Where is {birth place} of {Louis Timothee}, which has {member of} is {Treaty on Open Skies} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6688279 wdt:P19 ?answer . ?answer wdt:P463 wd:Q1928989 }","paraphrases":["What is the action photo studio which has made 'The Archers', which has obtained the award 'Satellite Award for Best Miniseries'?"],"info":{}}
{"id":"train_5057","question":"What point in time did Indonesia have the inflation rate of 17.1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q252 p:P1279 ?s . ?s ps:P1279 ?x filter ( contains ( ?x , '17.1' ) ) . ?s pq:P585 ?value }","paraphrases":["Give the date that Indonesia had the inflation rate of 17.1"],"info":{}}
{"id":"train_5058","question":"What happens when caffeine interactions with a certain receptor in the body","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q60235 p:P129 ?s . ?s ps:P129 wd:Q21107812 . ?s pq:P2868 ?value }","paraphrases":["When caffeine interacts with a certain receptor in the body, what are the effects?"],"info":{}}
{"id":"train_5061","question":"What is the Bildindex der Kunst und Architektur ID for The Night Watch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q219831 wdt:P2092 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5062","question":"What is Flickr's software framework in its current version 3.16.10?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q103204 wdt:P1547 ?answer . ?answer wdt:P348 ?x FILTER ( contains ( ?x , '3.16.10' ) ) }","paraphrases":["What is Flickr's computer program system in its current adaptation 3.16.10?"],"info":{}}
{"id":"train_5064","question":"Tell me carbine whose name has the word zastava in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q183302 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zastava' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me carbine whose name has the word zastava in it."],"info":{}}
{"id":"train_5065","question":"During which time period did Nastia Liukin compete as a gymnast?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q230164 p:P641 ?s . ?s ps:P641 wd:Q3122646 . ?s pq:P2031 ?value1 . ?s pq:P2032 ?value2 }","paraphrases":["When did Nastia Liukin compete as a gymnast during which period"],"info":{}}
{"id":"train_5067","question":"What competition involving Fulgencio Batista began on September 5, 1933?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11270 wdt:P1344 ?answer . ?answer wdt:P580 ?x FILTER ( contains ( YEAR ( ?x ) , '1933' ) ) }","paraphrases":["What competition including Fulgencio Batista started on September 5, 1933?"],"info":{}}
{"id":"train_5071","question":"What agonistic role does L-aspartic Acid have?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q178450 p:P129 ?s . ?s ps:P129 ?obj . ?s pq:P2868 wd:Q389934 }","paraphrases":["What is the agonistic role of the L-aspartic Acid?"],"info":{}}
{"id":"train_5072","question":"What is the name o an historical country that starts with the letter r.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3024240 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title o an authentic nation that begins with the letter r."],"info":{}}
{"id":"train_5074","question":"explain me that the artistic type that contains the word of venus which has its own name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16767597 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'venus' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Explain to me that artistic type that contains a venus word that has a name of its own."],"info":{}}
{"id":"train_5076","question":"What is the series ordinal of Philip V of France's child Margaret I, Countess of Burgundy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8433 p:P40 ?s . ?s ps:P40 wd:Q261999 . ?s pq:P1545 ?value }","paraphrases":["Which child of Philip V of France is Margaret I, Countess of Burgundy, numerically?"],"info":{}}
{"id":"train_5081","question":"Wich means{FIPS 5-2 alpha code (US states)}in {North Carolina} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1454 wdt:P5086 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5082","question":"Was Jupiter's child astronomical body Amalthea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q319 wdt:P398 wd:Q3257 }","paraphrases":["Is Amalthea the astronomical child body of Jupiter?"],"info":{}}
{"id":"train_5084","question":"What position does the nominee for 'One Ok Rock' currently hold?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1072736 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What position does the chosen one for 'One Ok Rock' right now hold?"],"info":{}}
{"id":"train_5085","question":"Was David_Bowie record label EMI?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5383 wdt:P264 wd:Q183412 }","paraphrases":["Was record label EMI associated with David Bowie?"],"info":{}}
{"id":"train_5086","question":"What is the ten digit ISBN number for the novel \"For Whom the Bell Tolls\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q200920 wdt:P957 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5087","question":"Tell me the amount George Best was purchased for by Dunstable Town F.C?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q164521 p:P54 ?s . ?s ps:P54 wd:Q5315710 . ?s pq:P1642 ?value }","paraphrases":["How much did Dunstable Town F.C pay for George Best?"],"info":{}}
{"id":"train_5088","question":"Tell me an ancient civilization whose name has the word urartu in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28171280 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'urartu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know an antiquated civilization whose title has the word urartu in it."],"info":{}}
{"id":"train_5089","question":"Who is the cast member of Thomas Mitchell?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P161 wd:Q317026 }","paraphrases":[],"info":{}}
{"id":"train_5091","question":"What is the Fine Wind, Clear Morning portrait which has the coordinate location of 35.3625?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3565037 wdt:P180 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '35.3625' ) ) }","paraphrases":["What is the Fine Wind, Clear Morning portrait which has the coordinate location of 35.3625?"],"info":{}}
{"id":"train_5093","question":"What are the physical quantity that measured by watt per meter kelvin and which that starts with the letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q107715 . ?sbj wdt:P1880 wd:Q1463969 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the physical quantity that measured by means of watt per meter kelvin and which that starts with the letter c"],"info":{}}
{"id":"train_5094","question":"How many programmers work for John Carmack?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P943 wd:Q92605 }","paraphrases":["Which is the number of programmers that work for John Carmack?"],"info":{}}
{"id":"train_5095","question":"Who is the husband of the actor in Psycho?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q163038 wdt:P161 ?X . ?X wdt:P26 ?answer }","paraphrases":["Who is the spouse of the performing artist in Psycho?"],"info":{}}
{"id":"train_5098","question":"Tell me steroid hormone whose name has the world testosterone in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q422137 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'testosterone' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the steroid hormone with its name in it"],"info":{}}
{"id":"train_5099","question":"What is the name of David Brudnoy's alumni foundation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15516751 wdt:P69 ?X . ?X wdt:P571 ?answer }","paraphrases":["Name the alumni foundation of David Brudnoy."],"info":{}}
{"id":"train_5101","question":"What is Nitrous oxide subject role and its effect\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q905750 wdt:P2868 ?ans_1 . wd:Q905750 wdt:P1542 ?ans_2 }","paraphrases":["What is the role and effect of nitrous oxide?"],"info":{}}
{"id":"train_5102","question":"When was the Old City of Jerusalem created in the Kingdom of Jerusalem?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q213274 p:P17 ?s . ?s ps:P17 wd:Q55502 . ?s pq:P580 ?value }","paraphrases":["The Old City of Jerusalem was created in the Kingdom of Jerusalem at what time?"],"info":{}}
{"id":"train_5103","question":"Who is Lockheed C-130 Hercules' operator and developer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q182027 wdt:P137 ?ans_1 . wd:Q182027 wdt:P178 ?ans_2 }","paraphrases":["Who developed and operates the Lockheed C-130 Hercules?"],"info":{}}
{"id":"train_5107","question":"Mention the date of birth and death of Louis IX of France having child Peter, Count of Perche and Alençon","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q346 p:P40 ?s . ?s ps:P40 wd:Q739327 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["Specify the date of birth and passing of Louis IX of France having child Dwindle, Tally of Perche and Alençon"],"info":{}}
{"id":"train_5108","question":"Where was James Clerk Maxwell born in Scotland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9095 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q22 }","paraphrases":["Where in Scotland was James Clerk Maxwell born?"],"info":{}}
{"id":"train_5110","question":"How many matches did Radamel Falcao García play when he was in the Colombia National Under-20 Football Team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q138172 p:P54 ?s . ?s ps:P54 wd:Q1641573 . ?s pq:P1350 ?value }","paraphrases":["When Radamel Falcao played for the Colombia National Under-20 Football Team, how many matched did he play with them?"],"info":{}}
{"id":"train_5111","question":"What is the full name of this Lucy and Ricky Ricardo musician?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6698594 wdt:P175 ?answer . ?answer wdt:P1477 ?x FILTER ( contains ( ?x , 'Lucille Désirée Ball' ) ) }","paraphrases":["What is the total title of this Lucy and Ricky Ricardo musician?"],"info":{}}
{"id":"train_5115","question":"Who is the  {human} for {record held} of {marathon}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q40244 wdt:P1000 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who holds the marathon record?"],"info":{}}
{"id":"train_5116","question":"What was the significant event celebrated in the honor of Hans-Georg Gadamer on February 11, 2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q76356 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["On 2-11-2000, what significant celebration honored Hans-Georg Gadamer?"],"info":{}}
{"id":"train_5118","question":"What is the crime that Chris Brown was convicted of that involved Rihanna?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q155700 p:P1399 ?s . ?s ps:P1399 ?obj . ?s pq:P533 wd:Q36844 }","paraphrases":["What is the wrongdoing that Chris Brown was indicted for that included Rihanna?"],"info":{}}
{"id":"train_5120","question":"What is Rumi's culture and religion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q43347 wdt:P2596 ?ans_1 . wd:Q43347 wdt:P140 ?ans_2 }","paraphrases":["Name Rumi's culture and religion."],"info":{}}
{"id":"train_5121","question":"Who leads the Christian Science movement?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P135 wd:Q624477 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Give me the name of the leader of the Christian Science movement?"],"info":{}}
{"id":"train_5122","question":"Tell me mineral resource whose name has the word petroleum in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q889659 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'petroleum' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know mineral asset whose title has the word petroleum in their name"],"info":{}}
{"id":"train_5123","question":"Who painted the figures of 'Wolves Beyond the Border'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8030575 wdt:P674 ?X . ?X wdt:P170 ?answer }","paraphrases":["The figures of \"Wolves Beyond the Border\" was painted by which artist?"],"info":{}}
{"id":"train_5124","question":"Who created Judo ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11420 wdt:P112 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who made Judo ?"],"info":{}}
{"id":"train_5125","question":"What is the noble title given to Georges Cuvier on December 29, 1829?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q171969 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1829' ) ) }","paraphrases":["Give the name of noble title awarded to Georges Cuvier in 1829?"],"info":{}}
{"id":"train_5127","question":"What was Sally Field nominated for at the 52nd Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q187033 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q543438 }","paraphrases":["Tell me what Sally Field was nominated for at the 52nd Academy Awards."],"info":{}}
{"id":"train_5130","question":"who theater for location of Soviet Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P276 wd:Q15180 . ?sbj wdt:P31 wd:Q718893 }","paraphrases":["who theater for area of Soviet Union?"],"info":{}}
{"id":"train_5131","question":"Is it true that the maximum thrust of the Pratt & Whitney F100 is equal to 17800?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1154115 wdt:P2228 ?obj filter ( ?obj = 17800 ) }","paraphrases":["Is it genuine that the greatest pushed of the Pratt & Whitney F100 is break even with to 17800?"],"info":{}}
{"id":"train_5132","question":"Which is the place of death of Robert Aldrich?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q95133 wdt:P20 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5135","question":"What planet has use of a sundial?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q80793 wdt:P2283 ?X . ?X wdt:P398 ?answer }","paraphrases":["What planet has utilize of a sundial?"],"info":{}}
{"id":"train_5138","question":"Is the minimum explosive concentration of dinitro-ortho-cresol equal to 30?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q209437 wdt:P2204 ?obj filter ( ?obj = 30 ) }","paraphrases":["Is the least unstable concentration of dinitro-ortho-cresol break even with to 30?"],"info":{}}
{"id":"train_5139","question":"When did Barbara Payton the spouse of Franchot Tone die ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q457229 p:P26 ?s . ?s ps:P26 wd:Q4859221 . ?s pq:P582 ?value }","paraphrases":["What year did Franchot Tone's wife Barbara Payton die?"],"info":{}}
{"id":"train_5140","question":"What position did Sargon 2, who started in 721, hold?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q208336 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( ?x , '-721-0-0' ) ) }","paraphrases":["Established in 721, Sargon 2 has which position?"],"info":{}}
{"id":"train_5141","question":"Due to what disease for anatomical location of human leg","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P927 wd:Q6027402 . ?sbj wdt:P31 wd:Q12136 }","paraphrases":["Due to what malady for anatomical area of human leg"],"info":{}}
{"id":"train_5142","question":"When was LeBron James nominated for Best Male Athlete ESPY Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36159 p:P1411 ?s . ?s ps:P1411 wd:Q4896724 . ?s pq:P585 ?value }","paraphrases":["Give me the date LeBron James was nominated for Best Male Athlete ESPY Award."],"info":{}}
{"id":"train_5143","question":"What is in the category of electronic component?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P880 wd:Q11653 }","paraphrases":[],"info":{}}
{"id":"train_5144","question":"What is the airplane bombing with the lowest number of survivors with one of the survivors being Umar Farouk Abdulmutallab?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19354904 . ?ent wdt:P1561 ?obj . ?ent wdt:P710 wd:Q983843 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Of all the airplane bomobings with one of the survivors being Umar Farouk Abdulmutallab, which has the lowest number of survivors?"],"info":{}}
{"id":"train_5146","question":"\"Which is {namesake} of {Lagrange multiplier}, that has {studies} is {mathematical analysis} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q598870 wdt:P138 ?answer . ?answer wdt:P101 wd:Q7754 }","paraphrases":["\"Which is {namesake} of {Lagrange multiplier}, that has {thinks about} is {numerical investigation} ?\""],"info":{}}
{"id":"train_5147","question":"What are the names of the characters in E.T. the Extra-Terrestrial?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11621 wdt:P674 ?obj . ?obj wdt:P31 wd:Q15773347 }","paraphrases":["In the hit movie E.T, what the names of the main characters?"],"info":{}}
{"id":"train_5148","question":"What is the median income of Hong Kong","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q8646 wdt:P3529 ?answer }","paraphrases":[],"info":{}}
