{"id":"train_3635","question":"Which are famous books of Maurice?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1241741 wdt:P50 ?X . ?X wdt:P800 ?answer }","paraphrases":["Name Maurice's famous books."],"info":{}}
{"id":"train_3637","question":"When in the history of Haiti did the country have boroughs called Nippes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q846445 wdt:P1269 ?answer . ?answer wdt:P150 wd:Q125232 }","paraphrases":["When within the history of Haiti did the nation have boroughs called Nippes?"],"info":{}}
{"id":"train_3639","question":"What is the domain child of Roman Smoluchowski?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9312628 wdt:P22 ?X . ?X wdt:P101 ?answer }","paraphrases":["What is the domain infant of Roman Smoluchowski?"],"info":{}}
{"id":"train_3640","question":"Who are Merrie Melodie's characters mediatised to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1750628 wdt:P674 ?X . ?X wdt:P1366 ?answer }","paraphrases":["Give me the group that Merrie Melodie's characters mediatised to."],"info":{}}
{"id":"train_3641","question":"what are the product of game  platform of deflektor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3263157 wdt:P400 ?X . ?X wdt:P176 ?answer }","paraphrases":["what are the item of amusement stage of deflektor?"],"info":{}}
{"id":"train_3642","question":"Which model of drill has the least vibration?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23811262 . ?ent wdt:P2806 ?obj . ?ent wdt:P279 wd:Q58964 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["what is the smoothest drill?"],"info":{}}
{"id":"train_3644","question":"What is the birth city of Laurie Anderson that is a partner town to Mexico City?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q235066 wdt:P19 ?answer . ?answer wdt:P190 wd:Q1489 }","paraphrases":["What is the beginning city of Laurie Anderson that is a companion town to Mexico City?"],"info":{}}
{"id":"train_3645","question":"Name a part of India history that contain the word \"history\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17524420 . ?sbj wdt:P1269 wd:Q668 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'history' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a piece of India history that contain \"history\" in its name ?"],"info":{}}
{"id":"train_3646","question":"Did Caffeine subject has role stimulant and PDE3 inhibitor ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q60235 wdt:P2868 wd:Q211036 . wd:Q60235 wdt:P2868 wd:Q2043933 }","paraphrases":["Does Caffeine play a role as a stimulant and PDE3 inhibitor?"],"info":{}}
{"id":"train_3648","question":"When did Wisconsin have a population of 1.05467e+0.6?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1537 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '1.05467e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["The population of Wisconsin was 1.05467e+0.6 for what year?"],"info":{}}
{"id":"train_3652","question":"In what sister city of Bordeaux did Robert Aldrich die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q95133 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1479 }","paraphrases":["Robert Aldrich died in what sister city of Bordeaux?"],"info":{}}
{"id":"train_3655","question":"where is christopher sims educated at and its end time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q109737 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["where is christopher sims taught at and its conclusion time?"],"info":{}}
{"id":"train_3658","question":"What are the property which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q937228 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the property which begin with the letter z"],"info":{}}
{"id":"train_3662","question":"What is the territorial jurisdiction of Plessy v. Ferguson, that has a total fertility rate of 2.0075?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q656660 wdt:P1001 ?answer . ?answer wdt:P4841 ?x FILTER ( contains ( ?x , '2.0075' ) ) }","paraphrases":["What is the territorial jurisdiction of Plessy v. Ferguson, that has a whole fertility price of 2.0075?"],"info":{}}
{"id":"train_3664","question":"\"Who is the namesake of the Lorentz force, who was also a member of the Royal Netherlands Academy of Arts and Sciences?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q172137 wdt:P138 ?answer . ?answer wdt:P463 wd:Q253439 }","paraphrases":["\"Who is the namesake of the Lorentz force, who used to be also a member of the Royal Netherlands Academy of Arts and Sciences?\""],"info":{}}
{"id":"train_3665","question":"What body of water is Belegrade located next to and in what time zone is it located in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q3711 wdt:P206 ?ans_1 . wd:Q3711 wdt:P421 ?ans_2 }","paraphrases":["Which time zone is Belegarde a part of, and what body of water is it adjacent to?"],"info":{}}
{"id":"train_3667","question":"Name a TV show produced by Donald Trump","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1431 wd:Q22686 . ?sbj wdt:P31 wd:Q5398426 }","paraphrases":["Name a TV show created by Donald Trump"],"info":{}}
{"id":"train_3668","question":"Who is the husband of Madhuri Dixit, who has gender identity as male?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q232451 wdt:P26 ?answer . ?answer wdt:P21 wd:Q6581097 }","paraphrases":["Who is Madhuri Dixit's husband,  as a male gender identity"],"info":{}}
{"id":"train_3671","question":"How was William Walton nominated for the Best Original Dramatic or Comedy Score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q310939 p:P1411 ?s . ?s ps:P1411 wd:Q22752868 . ?s pq:P805 ?value }","paraphrases":["How did William Walton get the nomination for the Best Original Dramatic and Comedy Score awards?"],"info":{}}
{"id":"train_3673","question":"What award did Jerome Robbins receive in 1976?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q353019 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1976' ) ) }","paraphrases":["Which of the award receive Jerome Robbins receive in 1976?"],"info":{}}
{"id":"train_3676","question":"How many ethnic groups are in Brazil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q155 wdt:P172 ?obj }","paraphrases":["Which is the number of ethnic groups that are in Brazil?"],"info":{}}
{"id":"train_3677","question":"What is the location of the fomation of N SYNC?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q154454 wdt:P740 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3679","question":"What is the position held by Mr. Gordon Brown in electoral district as a member of the 54th parliament of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q10648 p:P39 ?s . ?s ps:P39 wd:Q35647955 . ?s pq:P768 ?value }","paraphrases":["What position is held by Mr.Gordon Brown as a member of the parliament in United Kingdom?"],"info":{}}
{"id":"train_3680","question":"What is the first name of Paul Verhoeven, since it is said to be different from Pawel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q129079 wdt:P735 ?answer . ?answer wdt:P460 wd:Q19816823 }","paraphrases":["What is the primary title of Paul Verhoeven, since it is said to be diverse from Pawel?"],"info":{}}
{"id":"train_3684","question":"What is the social state with the lowest total reserves whose described by source is Jeweish Encyclopedia of Brockhaus and Efron?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q619610 . ?ent wdt:P2134 ?obj . ?ent wdt:P1343 wd:Q4173137 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which social state described by Jewish Encyclopedia of Brockhaus and Efron has the lowest total reserves?"],"info":{}}
{"id":"train_3685","question":"Tell me about member of sports team of Bobby Moore and number of matches played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q191492 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["Let me know almost part of sports group of Bobby Moore and number of matches played?"],"info":{}}
{"id":"train_3687","question":"WHAT IS THE BY PRODUCT OF ANIMAL HUSBANDRY","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q80962 wdt:P2821 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3689","question":"What { working language or name } does { milk } have { pronunciation audio } as { Wo - meew.ogg }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8495 p:P443 ?s . ?s ps:P443 ?x filter ( contains ( ?x , 'Wo-meew.ogg' ) ) . ?s pq:P407 ?value }","paraphrases":["In what language is milk pronounced as Wo-meew.ogg?"],"info":{}}
{"id":"train_3690","question":"What gunpowder developer has a 1318-0-0 birthdate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12861 wdt:P61 ?answer . ?answer wdt:P569 ?x FILTER ( contains ( YEAR ( ?x ) , '1318' ) ) }","paraphrases":["What explosive designer includes a 1318-0-0 birthdate? ?"],"info":{}}
{"id":"train_3691","question":"What award did Alec Baldwin win in 2017?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q170572 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2017' ) ) }","paraphrases":["which award if any was won by Alec Baldwin in 2017?"],"info":{}}
{"id":"train_3693","question":"Is the height of Sumbawa Pony greater than 0.96?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q919647 wdt:P2048 ?obj filter ( ?obj > 0.96 ) }","paraphrases":["Is the tallness of Sumbawa Horse more noteworthy than 0.96?"],"info":{}}
{"id":"train_3694","question":"who shore of located on islet of high stile?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q29015421 wdt:P5130 ?X . ?X wdt:P206 ?answer }","paraphrases":["who shore of found on islet of tall stile?"],"info":{}}
{"id":"train_3695","question":"What award did Alexander Fleming receive and when did he receive it?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q37064 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What award did Alexander Fleming receive and when did he acquire it?"],"info":{}}
{"id":"train_3697","question":"Who gave the{affiliate of} of {plays for} of {Amauri Sanit} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2841376 wdt:P54 ?X . ?X wdt:P831 ?answer }","paraphrases":["Who gave the{affiliate of} of {plays for} of {Amauri Sanit} ?"],"info":{}}
{"id":"train_3699","question":"Who made the Jorkwang Film?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35980843 wdt:P452 ?X . ?X wdt:P1056 ?answer }","paraphrases":["Who made the Jorkwang Film?"],"info":{}}
{"id":"train_3700","question":"What was NCIS nominated for in the year 2013?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4525 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["Give me the name(s) of the award(s) NCIS was nominated for in 2013."],"info":{}}
{"id":"train_3701","question":"Who are members of sports team of Clarence Seedorf since the year 2002?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q484909 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["Who are members of Clarence Seedorf since 2002?"],"info":{}}
{"id":"train_3702","question":"What’s the most common form of dementia in the Americas?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q83030 p:P1193 ?s . ?s ps:P1193 ?obj . ?s pq:P276 wd:Q828 }","paraphrases":["What is the most common form of mental deterioration in North and Central America?"],"info":{}}
{"id":"train_3703","question":"Where is Theodoros Angelopolos majoring in Jurisprudence?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q55168 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q4932206 }","paraphrases":["Give me the location Theodoros Angelopolos is majoring in Jurisprudence."],"info":{}}
{"id":"train_3705","question":"What sovereign state uses the Australian dollar as currency?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P38 wd:Q259502 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":["What imperial state employments the Australian dollar as currency?"],"info":{}}
{"id":"train_3707","question":"Which is the written work which has English as a language of work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q1860 . ?sbj wdt:P31 wd:Q47461344 }","paraphrases":["What is the written work that has English as a working language?"],"info":{}}
{"id":"train_3708","question":"Who was the wife of Valentinian I?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q46720 wdt:P26 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3710","question":"Which is the ZDB ID for Maxim?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3552325 wdt:P1042 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3711","question":"is the dept of the mittelland canal 52.27703333333 7.6040944444444?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q48480 p:P885 ?s . ?s ps:P885 ?obj . ?s pq:P625 ?x filter ( contains ( ?x , '52.277033333333 7.6040944444444' ) ) }","paraphrases":["What is the depth of the Mittelland Canal?"],"info":{}}
{"id":"train_3712","question":"which country club has the highest slop rating?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1137210 . ?ent wdt:P3840 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["which nation club has the most elevated slop rating?"],"info":{}}
{"id":"train_3713","question":"What is the the early childhood baptism date for Diego Velazquez from Iglesia de San Pedro?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q297 p:P1636 ?s . ?s ps:P1636 ?obj . ?s pq:P276 wd:Q5911120 }","paraphrases":["On which date was Diego Velazquez from Iglesia de San Pedro baptized in his childhood?"],"info":{}}
{"id":"train_3715","question":"Who was nominated for Mr. Smith Goes to Washington at the 12th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q866120 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q508513 }","paraphrases":["Give me the actor name who was nominated for Mr. Smith Goes to Washington at the 12th Academy Awards?"],"info":{}}
{"id":"train_3716","question":"What school did Thomas J. Healey's sibling attend?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7791077 wdt:P3373 ?X . ?X wdt:P69 ?answer }","paraphrases":["What school did Thomas J. Healey's kin attend?"],"info":{}}
{"id":"train_3719","question":"What is the signs of result of silver ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1090 wdt:P1542 ?X . ?X wdt:P780 ?answer }","paraphrases":["What is the signs of result of silver ?"],"info":{}}
{"id":"train_3720","question":"What is BoardGameGeek ID of Carrom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q900489 wdt:P2339 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3721","question":"What actions does a trumpet player take?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8338 wdt:P3095 ?X . ?X wdt:P425 ?answer }","paraphrases":["What activities does a trumpet player take?"],"info":{}}
{"id":"train_3722","question":"What is the open source hardware with the lowest voltage whose connector is USB Micro-B?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q159172 . ?ent wdt:P2436 ?obj . ?ent wdt:P2935 wd:Q24837468 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which open source hardware has the lowest voltage with connector of USB Micro-B?"],"info":{}}
{"id":"train_3725","question":"Does the angle from vertical of the Leaning Tower of Pisa equal 3.97?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q39054 wdt:P4183 ?obj filter ( ?obj = 3.97 ) }","paraphrases":["Does the point from vertical of the Inclining Tower of Pisa rise to 3.97?"],"info":{}}
{"id":"train_3726","question":"where is the anatomical location and connects with Brain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1073 wdt:P927 ?ans_1 . wd:Q1073 wdt:P2789 ?ans_2 }","paraphrases":["What and where is the connection to the brain?"],"info":{}}
{"id":"train_3727","question":"For which song did Mick Jagger win a Golden Globe Award for Best Original Song?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q128121 p:P166 ?s . ?s ps:P166 wd:Q1472235 . ?s pq:P1346 ?value }","paraphrases":["Name the song that won a Golden Globe Award Best Original Song for Mick Jagger?"],"info":{}}
{"id":"train_3728","question":"in what country is belgrade located and when did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q3711 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["in what nation is belgrade found and when did it end?"],"info":{}}
{"id":"train_3730","question":"What are the examinations of the consequences of alcoholism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15326 wdt:P1542 ?X . ?X wdt:P923 ?answer }","paraphrases":["What has been found to be a result of alcoholism?"],"info":{}}
{"id":"train_3731","question":"Which is the location of first performance of Palace of Versailles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4647 wd:Q2946 }","paraphrases":[],"info":{}}
{"id":"train_3732","question":"Who is the Clerks Regular for the order of Ignatius of Loyola?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44281 wdt:P611 ?obj . ?obj wdt:P31 wd:Q2138822 }","paraphrases":["Who are the Regular Clerks for Ignatius of Loyola's order?"],"info":{}}
{"id":"train_3733","question":"What is William of Rubruck's date of birth?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q316083 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( YEAR ( ?x ) , '1220' ) ) . ?s pq:P31 ?value }","paraphrases":["When is the DOB for William of Rubruck's?"],"info":{}}
{"id":"train_3736","question":"What has cause of Universiade ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q188158 wdt:P828 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3737","question":"What is the type of music, part of work or School of Ragtime, in Excercise No.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q29541175 wdt:P1433 ?X . ?X wdt:P136 ?answer }","paraphrases":["What is the type of music, part of work or School of Ragtime, in Excercise What is the type of music, part of work or School of Ragtime, in Excercise No.6?"],"info":{}}
{"id":"train_3738","question":"What diplomatic relation to Canada is in the administrative unit of Victoria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36687 wdt:P131 ?answer . ?answer wdt:P530 wd:Q16 }","paraphrases":["What political connection to Canada is within the authoritative unit of Victoria?"],"info":{}}
{"id":"train_3739","question":"What is Drogo's birthdate?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q723791 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["When was Drogo born?"],"info":{}}
{"id":"train_3741","question":"What award did Jean-Claude Killy receive in Alpine skiing at the 1968 Winter Olympics - Men's downhill?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11485 p:P1344 ?s . ?s ps:P1344 wd:Q1005563 . ?s pq:P166 ?value }","paraphrases":["What award did Jean-Clause Killy get in the 1968 Olympics?"],"info":{}}
{"id":"train_3743","question":"Which is the USK rating of Grand Theft Auto III?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q149106 wdt:P914 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3745","question":"What is the name of the culture of pupil of Isocrates?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q221182 wdt:P802 ?X . ?X wdt:P172 ?answer }","paraphrases":["What is the title of the culture of understudy of Isocrates?"],"info":{}}
{"id":"train_3746","question":"Tell me the relation between Pieter Brueghel the Elder and Pieter III. Brueghel ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43270 p:P1038 ?s . ?s ps:P1038 wd:Q2094250 . ?s pq:P1039 ?value }","paraphrases":["What do Pieter Brueghel the Elder and Pieter III. Brueghel have in common?"],"info":{}}
{"id":"train_3747","question":"Tell me if the natural abundance of iron-56 is more than 0.734032","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1052454 wdt:P2374 ?obj filter ( ?obj > 0.734032 ) }","paraphrases":["Is the natural abundance of iron-56 more than 0.734032?"],"info":{}}
{"id":"train_3748","question":"Who began the International Olympic Committee?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q40970 wdt:P112 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who started the Universal Olympic Committee?"],"info":{}}
{"id":"train_3750","question":"What are the galaxy that contains the word ugc in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2488 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ugc' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the universe that contains the word ugc in their name"],"info":{}}
{"id":"train_3751","question":"Was Bryan Adams nominated for a Grammy for Album of the Year and a Juno for Entertainer of the Year?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q482907 wdt:P1411 wd:Q904528 . wd:Q482907 wdt:P1411 wd:Q6314074 }","paraphrases":["Did Bryan Adams receive a Grammy nomination for Album of the year and a Juno nomination for Entertainer of the Year?"],"info":{}}
{"id":"train_3753","question":"Which is the IAFD male performer ID of Jamie Gillis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q725962 wdt:P4505 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3754","question":"What movie did Jim Henson direct?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P57 wd:Q191037 . ?sbj wdt:P31 wd:Q24869 }","paraphrases":["What motion picture did Jim Henson direct?"],"info":{}}
{"id":"train_3755","question":"Who is a partner in the characters of Disney's Magical Quest 3 (starring Mickey & Donald)?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3030325 wdt:P674 ?X . ?X wdt:P451 ?answer }","paraphrases":["Who could be a accomplice within the characters of Disney's Mysterious Journey 3 (featuring Mickey & Donald)?"],"info":{}}
{"id":"train_3758","question":"where is mouth of the watercourse of Neva that is of is Gulf of Finland ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q645 p:P403 ?s . ?s ps:P403 ?obj . ?s pq:P642 wd:Q14686 }","paraphrases":["Where is the mouth of the watercourse of Neva located on the Gulf of Finland?"],"info":{}}
{"id":"train_3759","question":"How many matches did Eric Cantona play for FC Martigues?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q170328 p:P54 ?s . ?s ps:P54 wd:Q1132418 . ?s pq:P1350 ?value }","paraphrases":["In how many matches Eric Cantona representated FC Martigues?"],"info":{}}
