{"id":"train_17440","question":"Is the electric dipole moment of isopropyl alcohol greater than 1.992?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q16392 wdt:P2201 ?obj filter ( ?obj > 1.992 ) }","paraphrases":["Is the electric dipole minute of isopropyl liquor more prominent than 1.992?"],"info":{}}
{"id":"train_17441","question":"What position was held by Janet Yellen at the London School of Economics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q263725 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P108 wd:Q174570 }","paraphrases":["Janet Yellen held what position at the London School of Ecomonics"],"info":{}}
{"id":"train_17442","question":"When was Anita Brookner nominated for the Man Booker Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q237687 p:P1411 ?s . ?s ps:P1411 wd:Q160082 . ?s pq:P585 ?value }","paraphrases":["What year was Anita Brookner nominated for the Man Booker Prize?"],"info":{}}
{"id":"train_17446","question":"What is Spotify album ID  for OK Computer","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q202996 wdt:P2205 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17448","question":"When did Alcide De Gasperi take on his role as the head of the Italian government?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q38 p:P6 ?s . ?s ps:P6 wd:Q153832 . ?s pq:P580 ?value }","paraphrases":["On what date did Alcide De Gasperi take on his role as the head of the Italian government?"],"info":{}}
{"id":"train_17452","question":"Where did the significant works of Giannino Castiglioni take place?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1122412 wdt:P800 ?X . ?X wdt:P276 ?answer }","paraphrases":["Where did the noteworthy works of Giannino Castiglioni take put?"],"info":{}}
{"id":"train_17453","question":"How many out of school children were there in Tajikistan in 2000-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q863 p:P2573 ?s . ?s ps:P2573 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["How many students were there in Tajikistan at the start of the year 2000?"],"info":{}}
{"id":"train_17454","question":"Who caused the death and the honoring of Achilles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q41746 wdt:P157 ?ans_1 . wd:Q41746 wdt:P1049 ?ans_2 }","paraphrases":["Who killed Achilles?"],"info":{}}
{"id":"train_17456","question":"What is the name of district of capital of Allahabad of India?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q162442 wdt:P1376 ?obj . ?obj wdt:P31 wd:Q1149652 }","paraphrases":["Give me the name of Allahabad's district capital?"],"info":{}}
{"id":"train_17457","question":"What are the professions in the association of football?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P425 wd:Q2736 . ?sbj wdt:P31 wd:Q28640 }","paraphrases":["In the association of football, what are the professions?"],"info":{}}
{"id":"train_17458","question":"Is it true Richard_III_of_England family Tudor dynasty and House of York?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q133028 wdt:P53 wd:Q101978 . wd:Q133028 wdt:P53 wd:Q105285 }","paraphrases":["Was the Richard's III of England family Tudor dynasty and House of York?"],"info":{}}
{"id":"train_17459","question":"What is the Elo rating for Judit Polgar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q183250 wdt:P1087 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17460","question":"IS THE REDSHIRT OF THE NGC 5907 GREATER THAN 0.00267","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q544846 wdt:P1090 ?obj filter ( ?obj > 0.00267 ) }","paraphrases":["Is 0.00267 smaller than the NGC 5907's redshirt?"],"info":{}}
{"id":"train_17461","question":"Is it true that M sin i of WASP-121b equals to 1.183?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q34848979 wdt:P2051 ?obj filter ( ?obj = 1.183 ) }","paraphrases":["Does WASP-121b have an M sin i of 1.183?"],"info":{}}
{"id":"train_17462","question":"When did Ngũgĩ wa Thiong'o begin working at the University of Nairobi?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q302910 p:P108 ?s . ?s ps:P108 wd:Q649998 . ?s pq:P580 ?value }","paraphrases":["On what date did Ngugi wa Thiong'o start her job at the University of Nairobi?"],"info":{}}
{"id":"train_17464","question":"When was Panasonic's total assets equal to 6.40332e+12?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q53247 p:P2403 ?s . ?s ps:P2403 ?x filter ( contains ( ?x , '6.40332e+12' ) ) . ?s pq:P585 ?value }","paraphrases":["On what date did 6.40332e+12 equal the total assets of Panasonic?"],"info":{}}
{"id":"train_17465","question":"Which is the intangible cultural heritage status of Day of the Dead?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q309256 wdt:P3259 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17466","question":"Is the redshift of the Messier 74 equal to 0.002188?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q14013 wdt:P1090 ?obj filter ( ?obj = 0.002188 ) }","paraphrases":["Is 0.002188 the redshift of the Messier 74?"],"info":{}}
{"id":"train_17467","question":"Which is published in the series of Shin Megami Tensei: Devil Survivor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q945187 wdt:P179 ?X . ?X wdt:P400 ?answer }","paraphrases":["Which is distributed within the arrangement of Shin Megami Tensei: Demon Survivor?"],"info":{}}
{"id":"train_17468","question":"Is Sohail Khan the sibling of Salman Khan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9543 wdt:P3373 wd:Q983053 }","paraphrases":["Are Sohail Khan and Salman Khan siblings?"],"info":{}}
{"id":"train_17470","question":"who has boroughs of diplomatic relation of brazil ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q155 wdt:P530 ?X . ?X wdt:P150 ?answer }","paraphrases":["Give me the names of those with diplomatic relation in Brazil."],"info":{}}
{"id":"train_17471","question":"who federal state for indigenous to of american english?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7976 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q43702 }","paraphrases":["who federal state for indigenous to of american english?"],"info":{}}
{"id":"train_17473","question":"What is the title of the academic journal in the field of communication?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P101 wd:Q11024 . ?sbj wdt:P31 wd:Q737498 }","paraphrases":["What is the title of the scholarly diary in the field of correspondence?"],"info":{}}
{"id":"train_17475","question":"Which transcript starts with the letter m?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26944990 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which transcript begins with the letter m?"],"info":{}}
{"id":"train_17476","question":"TELL ME CONTROVERSY WHOSE NAME HAS THE WORD MISCEGENATION IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1255828 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'miscegenation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME CONTROVERSY WHOSE NAME HAS THE WORD MISCEGENATION IN IT."],"info":{}}
{"id":"train_17477","question":"who is the astronomical observatory for operator of California Institute of technology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P137 wd:Q161562 . ?sbj wdt:P31 wd:Q1254933 }","paraphrases":["The Calif Inst of Technology uses what astronomical observatory?"],"info":{}}
{"id":"train_17478","question":"Name a galaxy in Andromedia that starts with letter U","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2488 . ?sbj wdt:P59 wd:Q9256 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the galaxy that starts with letter 'U' in Andromedia?"],"info":{}}
{"id":"train_17479","question":"What is the cosmic microwave background experiment with the lowest maximum wavelength of sensitivity whose operator is National Science Foundation ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q33093130 . ?ent wdt:P3737 ?obj . ?ent wdt:P137 wd:Q304878 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["From the NSF what's the lowest wavelength in the cosmic microwave background experiment?"],"info":{}}
{"id":"train_17481","question":"Which is the constitutional republic for the anthem of The Star-Spangled Banner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P85 wd:Q44696 . ?sbj wdt:P31 wd:Q1520223 }","paraphrases":[],"info":{}}
{"id":"train_17482","question":"\"Who is {woman} of {Heimdall}, which has {abreviated name} is {чол} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131196 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'чол' ) ) }","paraphrases":["\"Who is {lady} of {Heimdall}, which has {abreviated title} is {чол} ?\""],"info":{}}
{"id":"train_17484","question":"Name a national economy that contains the word \" economy\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6456916 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'economy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a national economy that contains the word \" economy\" in its name"],"info":{}}
{"id":"train_17485","question":"Who is the grandnephew of Sixtus IV?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q163514 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q4113832 }","paraphrases":["give me the name of the grandnephew of Sixtus IV?"],"info":{}}
{"id":"train_17489","question":"where and what did Zaha Hadid study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q47780 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["where and what did Zaha Hadid think about?"],"info":{}}
{"id":"train_17492","question":"tell  me recurring tournament  competition class men's golf  starts with c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15259995 . ?sbj wdt:P2094 wd:Q55864193 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["inform me habitual tournament opposition type men's golf begins with c"],"info":{}}
{"id":"train_17494","question":"When Frederick William I of Prussia's child Princess Philippine Charlotte of Prussia was born and when did she die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q62043 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["What are the birth and death dates of Princess Philippine Charlotte of Prussia, daughter of Frederick William I of Prussia?"],"info":{}}
{"id":"train_17495","question":"Which is the Canal-U person ID for Daniel Schneidermann?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q146749 wdt:P5243 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17497","question":"Is the number of representatives in an organization/legislature of the Westmorland and Lonsdale equal to 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q874372 wdt:P1410 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is the number of agents in an organization/legislature of the Westmorland and Lonsdale rise to to 1?"],"info":{}}
{"id":"train_17499","question":"What is the pronunciation audio of sweet potato whose language of work or name is French?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q37937 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q150 }","paraphrases":["Give me the pronunciation audio of sweet potato whose language of work or name is French?"],"info":{}}
{"id":"train_17500","question":"Which is the academic major and the academic degree of John Grisham who received his education at Missisipi State University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q106465 p:P69 ?s . ?s ps:P69 wd:Q1939211 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What major did John Grisham get from Mississipi State University?"],"info":{}}
{"id":"train_17501","question":"What is successor of String Quintet in E major, Op.11, No.5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7623961 wdt:P826 ?X . ?X wdt:P156 ?answer }","paraphrases":["What is successor of String Quintet in E major, Op.11, No.5? many children are out of school within the Center East?"],"info":{}}
{"id":"train_17502","question":"What is the presynaptic connection between rod cells?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P925 wd:Q505544 }","paraphrases":[],"info":{}}
{"id":"train_17503","question":"Who is the archdiocese in Barcelona?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1492 wdt:P708 ?obj . ?obj wdt:P31 wd:Q2072238 }","paraphrases":["Name the archdiocese in Barcelona."],"info":{}}
{"id":"train_17504","question":"What disease does RS-methadone treat","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2176 wd:Q179996 . ?sbj wdt:P31 wd:Q12136 }","paraphrases":["RS-methadone treats what disease?"],"info":{}}
{"id":"train_17505","question":"What are the belligerents in the American Revolutionary War, who have divided into Cantabria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40949 wdt:P710 ?answer . ?answer wdt:P150 wd:Q3946 }","paraphrases":["What are the belligerents within the American Progressive War, who have isolated into Cantabria?"],"info":{}}
{"id":"train_17506","question":"Who is the {doctoral student} of the {doctoral advisor} of {Werner_Heisenberg} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q40904 wdt:P185 ?ans_1 . wd:Q40904 wdt:P184 ?ans_2 }","paraphrases":["Who is Werner Heisenberg's doctoral student?"],"info":{}}
{"id":"train_17514","question":"Tell me event sequence whose name has the word wikidach in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15900616 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wikidach' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know occasion grouping whose title has the word wikidach in it."],"info":{}}
{"id":"train_17515","question":"Which is the category for people who died here of Shizuoka Prefecture?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q131320 wdt:P1465 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17516","question":"What revolves around Messier 15?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11332 wdt:P397 ?X . ?X wdt:P398 ?answer }","paraphrases":["What rotates around Messier 15?"],"info":{}}
{"id":"train_17518","question":"Who are the contesting divisions in \"Clash of Champions\" ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27827075 wdt:P199 ?X . ?X wdt:P161 ?answer }","paraphrases":["What are the names of the contesting divisions in \"Clash of Champions\"?"],"info":{}}
{"id":"train_17521","question":"Name the designation being held accountable by John Jay while being as the United states ambassador","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q310847 wdt:P39 ?obj . ?obj wdt:P31 wd:Q15726790 }","paraphrases":["Title the assignment being held responsible by John Jay whereas being as the Joined together states ambassador"],"info":{}}
{"id":"train_17523","question":"What is an SI Base unit that starts with the letter s.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223662 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a unit of SI Base starting with the letter s."],"info":{}}
{"id":"train_17524","question":"What is the significance of the sons of Richard Wilhelm?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q62126 wdt:P40 ?X . ?X wdt:P800 ?answer }","paraphrases":["What significance did the sons of Richard Wilhelm have?"],"info":{}}
{"id":"train_17525","question":"Beechland Beach is located in what town?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4879659 wdt:P131 ?X . ?X wdt:P190 ?answer }","paraphrases":["In which town is Beechland Beach located?"],"info":{}}
{"id":"train_17526","question":"Which member of The Smiths originates from a place that has a sister town named Córdoba?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q180598 wdt:P740 ?answer . ?answer wdt:P190 wd:Q5818 }","paraphrases":["Which part of The Smiths begins from a put that includes a sister town named Córdoba?"],"info":{}}
{"id":"train_17527","question":"What book has gospels and is in Old English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q42365 . ?sbj wdt:P31 wd:Q690851 }","paraphrases":["What book has accounts and is in Ancient English?"],"info":{}}
{"id":"train_17532","question":"Which person is Noether's theorem named after, whose culture is German?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q578555 wdt:P138 ?answer . ?answer wdt:P172 wd:Q42884 }","paraphrases":["Which person is Noether's theorem named after, whose culture is German?"],"info":{}}
{"id":"train_17533","question":"How many things did Juventus F.C. found?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q1422 wdt:P112 ?obj }","paraphrases":["Which is the number of things that Juventus F.C. found?"],"info":{}}
{"id":"train_17534","question":"What is the chemical structure of polypropylene?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q146174 wdt:P4600 ?obj . ?obj wdt:P31 wd:Q11173 }","paraphrases":["What is the chemical structure of polypropylene?"],"info":{}}
{"id":"train_17535","question":"What is the official website of Capua?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q58477 wdt:P856 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17536","question":"Is it true that the median lethal dose of the arsenic equals to 20?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q871 wdt:P2240 ?obj filter ( ?obj = 20 ) }","paraphrases":["Is it genuine that the middle deadly measurements of the arsenic rises to to 20?"],"info":{}}
{"id":"train_17537","question":"Mention the population of Rouen at the time of 2013?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q30974 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["What was the population of Rouen in 2013?"],"info":{}}
{"id":"train_17538","question":"What significant event happened to Sarah Bernhardt and where did it happen?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q4605 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P276 ?value1 . }","paraphrases":["What noteworthy occasion happened to Sarah Bernhardt and where did it happen?"],"info":{}}
{"id":"train_17539","question":"What is the current issue of Rolling Stone magazine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q33511 wdt:P747 ?obj . ?obj wdt:P31 wd:Q41298 }","paraphrases":["What is the current issue of Rolling Stone magazine?"],"info":{}}
{"id":"train_17540","question":"The Magic Flute is music composed by which artist, who has a mother named Anna Maria Mozart?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5064 wdt:P86 ?answer . ?answer wdt:P25 wd:Q167981 }","paraphrases":["The Magic Flute is music composed by which artist, who has a mother named Anna Maria Mozart?"],"info":{}}
{"id":"train_17541","question":"When did Charlton Heston receive the Golden Globe Cecil B. DeMille Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q80739 p:P166 ?s . ?s ps:P166 wd:Q640353 . ?s pq:P585 ?value }","paraphrases":["On what date did Chartol Heston Receive the Golden Globe Cecil B. DeMille Award?"],"info":{}}
{"id":"train_17543","question":"Name a famous military offensive operation that starts with letter O","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2001676 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which renowned military offensive operation begins with letter O?"],"info":{}}
{"id":"train_17544","question":"Is the time in space of Jan Davis greater than 32357.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q29527 wdt:P2873 ?obj filter ( ?obj > 32357.6 ) }","paraphrases":["Is the time in space of Jan Davis more prominent than 32357.6?"],"info":{}}
{"id":"train_17545","question":"WHEN DID THE SPALDEEN ESTABLISHED AND BUILT?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7572957 wdt:P176 ?X . ?X wdt:P112 ?answer }","paraphrases":["WHEN DID THE SPALDEEN Built up AND BUILT?"],"info":{}}
{"id":"train_17546","question":"Mention the fictional extraterrestrial for the disciples of Luke Skywalker","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P802 wd:Q51746 . ?sbj wdt:P31 wd:Q1307329 }","paraphrases":["Specify the anecdotal extraterrestrial for the devotees of Luke Skywalker"],"info":{}}
{"id":"train_17549","question":"Which is the instant messaging client of the Tizen operating system that starts with the letter w?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2462003 . ?sbj wdt:P306 wd:Q609306 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the immediate messaging consumer of the Tizen working gadget that starts offevolved with the letter w?"],"info":{}}
{"id":"train_17550","question":"What was the population of Barcelona in 1830?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1492 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1830' ) ) }","paraphrases":["Barcelona's population was what in 1830?"],"info":{}}
{"id":"train_17551","question":"Which railroad line that connects with Novosibirsk and which contains the word railway in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q728937 . ?sbj wdt:P2789 wd:Q883 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'railway' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which railroad line that connects with Novosibirsk and which includes the phrase railway in their name"],"info":{}}
{"id":"train_17554","question":"What is the name of a dwarf planet that starts with the letter p.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2199 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a predominate planet that begins with the letter p."],"info":{}}
{"id":"train_17555","question":"Who is the leader of the nominee for The Heiress","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1141493 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["The nominee leader for the Heiress is who?"],"info":{}}
{"id":"train_17556","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2522402 wdt:P20 ?answer . ?answer wdt:P2633 wd:Q645208 }","paraphrases":["what it is?"],"info":{}}
{"id":"train_17561","question":"When did æstel for country of Kingdom of Wessex?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P17 wd:Q105313 . ?sbj wdt:P31 wd:Q60172605 }","paraphrases":[],"info":{}}
