{"id":"train_15156","question":"Vladimir Lenin is the head of government for what organization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q1394 . ?sbj wdt:P31 wd:Q43229 }","paraphrases":["For which organization is Vladimir Lenin the head of government?"],"info":{}}
{"id":"train_15157","question":"What is the smallest village in Bernried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5084 . ?ent wdt:P4080 ?obj . ?ent wdt:P131 wd:Q260902 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["The smallest village in Bernried is?"],"info":{}}
{"id":"train_15159","question":"When did David Cameron, First Lord of the Treasury, begin his position?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q192 p:P39 ?s . ?s ps:P39 wd:Q609884 . ?s pq:P580 ?value }","paraphrases":["When did David Cameron take over as First Lord of the Treasury?"],"info":{}}
{"id":"train_15160","question":"Which nuclear isomer that is an isotope of indium has the highest atomic number ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q785466 . ?ent wdt:P1086 ?obj . ?ent wdt:P31 wd:Q846110 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the atomic number of the nuclear isomer that is indium's isotope?"],"info":{}}
{"id":"train_15161","question":"Who is the partner of James Joyce?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q6882 wdt:P451 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15162","question":"Which is {principle office} of {member of party} of {Zhang Zuolin} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q197358 wdt:P102 ?X . ?X wdt:P159 ?answer }","paraphrases":["Who is the principle office member of the party of Zhang Zuolin?"],"info":{}}
{"id":"train_15163","question":"Who is George II of Great Britain","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1074 wd:Q131981 . ?sbj wdt:P31 wd:Q15632617 }","paraphrases":["Who is George II of Extraordinary Britain"],"info":{}}
{"id":"train_15164","question":"What are the  airline which start with the letter pan","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q46970 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the airline which begin with the letter pan"],"info":{}}
{"id":"train_15165","question":"Who has the greatest number of victories with a name of Zaur?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1355 ?obj . ?ent wdt:P735 wd:Q10394931 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["How many victories has Zaur claimed during his career?"],"info":{}}
{"id":"train_15169","question":"What location is Beauty and the Beast set in, that is a rural city in the Midi-Pyrenees?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q179673 wdt:P840 ?answer . ?answer wdt:P150 wd:Q16393 }","paraphrases":["What location is Beauty and the Beast set in, that is a rural town in the Midi-Pyrenees?"],"info":{}}
{"id":"train_15170","question":"Which is the game of skill which contains the word tidllywinks in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1368898 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tiddlywinks' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the amusement of aptitude which contains the word tidllywinks in it's name?"],"info":{}}
{"id":"train_15171","question":"What is the audio pronunciation of Litchi chinensis in German language?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q13182 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q188 }","paraphrases":["How do you pronounce Litchi chinensis in German?"],"info":{}}
{"id":"train_15173","question":"At what time has Allan Nevins received the Bancroft Prize ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3380712 p:P166 ?s . ?s ps:P166 wd:Q724144 . ?s pq:P585 ?value }","paraphrases":["When did Allan Nevins got the Bancroft Prize ?"],"info":{}}
{"id":"train_15176","question":"Which is the chemical monomer composition of polypropylene?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4599 wd:Q146174 . ?sbj wdt:P31 wd:Q11173 }","paraphrases":["What is polypropylene's chemical monomer composition?"],"info":{}}
{"id":"train_15178","question":"Is the number of registered users/contributors of Arabic Wikipedia less than 1852275.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q199700 wdt:P1833 ?obj filter ( ?obj < 1852275.6 ) }","paraphrases":["Is the number of enrolled users/contributors of Arabic Wikipedia less than 1852275.6?"],"info":{}}
{"id":"train_15179","question":"Which high school(s) are located in Milwaukee?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q37836 . ?sbj wdt:P31 wd:Q9826 }","paraphrases":["Which secondary school(s) are in Milwaukee?"],"info":{}}
{"id":"train_15181","question":"Name the year and the place on which Marilyn Monroe married to Joe DiMaggio","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q4616 p:P26 ?s . ?s ps:P26 wd:Q297142 . ?s pq:P582 ?value1 . ?s pq:P2842 ?value2 }","paraphrases":["When and where did Marilyn Monroe marry Joe DiMaggio?"],"info":{}}
{"id":"train_15183","question":"What is the previous occupation of German Empire, with the construction date of 1867-7-1","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43287 wdt:P1365 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1867' ) ) }","paraphrases":["What is the previous occupation of German Empire, with the construction date of 1867-7-1"],"info":{}}
{"id":"train_15184","question":"What is the Munzinger Sport number for Alex Ferguson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q44980 wdt:P1285 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15185","question":"who was the partner of Jean-Luc Godard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q53001 wdt:P451 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["who was the accomplice of Jean-Luc Godard?"],"info":{}}
{"id":"train_15187","question":"\"Who is {tutor} of {Luke Skywalker}, which has {pupil} is {Ki-Adi-Mundi} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51746 wdt:P1066 ?answer . ?answer wdt:P802 wd:Q54271 }","paraphrases":["\"Who is {tutor} of {Luke Skywalker}, which has {pupil} is {Ki-Adi-Mundi} ?\""],"info":{}}
{"id":"train_15189","question":"What animated character's identity is also known as Superman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P460 wd:Q79015 . ?sbj wdt:P31 wd:Q15711870 }","paraphrases":["What is also known as Superman's identity of the animated character?"],"info":{}}
{"id":"train_15190","question":"When did Miklós Horthy and Magdolna Purgly divorce?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q117144 p:P26 ?s . ?s ps:P26 wd:Q835405 . ?s pq:P582 ?value }","paraphrases":["what year did Miklos Horthy and Magdolna Purgly divorce"],"info":{}}
{"id":"train_15191","question":"What are the war which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q198 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the war which begin with the letter w"],"info":{}}
{"id":"train_15192","question":"What is the county seat of Pamplona, which has GPS co-ordinates of 42.816944444444 -1.6427777777778?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10282 wdt:P1376 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '42.816944444444 -1.6427777777778' ) ) }","paraphrases":["What is the province situate of Pamplona, which has GPS co-ordinates of 42.816944444444 -1.6427777777778?"],"info":{}}
{"id":"train_15194","question":"who place of filming of described by work of david levinson} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q54852902 wdt:P1441 ?X . ?X wdt:P915 ?answer }","paraphrases":["What place is decribed by David Levinson's films?"],"info":{}}
{"id":"train_15196","question":"How many countries of origin are by Kyivska Rus'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P495 wd:Q1108445 }","paraphrases":["Kyivska Rus named how many countries of origin?"],"info":{}}
{"id":"train_15197","question":"In what year was Edward Heath elected to the 47th Parliament of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q128967 p:P39 ?s . ?s ps:P39 wd:Q41582617 . ?s pq:P2715 ?value }","paraphrases":["Name the year that Edward Heath was elected to the UK's 47th Parliament."],"info":{}}
{"id":"train_15198","question":"What are the science which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q336 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the science which begin with the letter t"],"info":{}}
{"id":"train_15199","question":"What is the subitem of the history of Morocco, which has diplomatic relation to Russia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q472658 wdt:P1269 ?answer . ?answer wdt:P530 wd:Q159 }","paraphrases":["What is the subitem of the history of Morocco, which has diplomatic relation to Russia?"],"info":{}}
{"id":"train_15201","question":"What is the geographical region of Shikoku where the Albion River is located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13991 wdt:P706 ?answer . ?answer wdt:P974 wd:Q4060606 }","paraphrases":["What is Shikoku's geographical area where the Albion River is located?"],"info":{}}
{"id":"train_15202","question":"Which is the transliteration for Guangzhou Metro?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q660751 wdt:P2440 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15205","question":"Which is the IDLH of osmium tetroxide?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q422021 wdt:P2129 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15206","question":"What town was Nikolai Vavilov born in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q214926 wdt:P19 ?X . ?X wdt:P150 ?answer }","paraphrases":["What town was Nikolai Vavilov born in?"],"info":{}}
{"id":"train_15207","question":"what is the population of prato in 2017-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q13377 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2017' ) ) }","paraphrases":["In 2017-1-1, what was Prato's population?"],"info":{}}
{"id":"train_15208","question":"What is the track listing for the successor of Highway 61 Revisited?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q217211 wdt:P156 ?X . ?X wdt:P658 ?answer }","paraphrases":["What is the track list for the successor of Highway sixty one Revisited?"],"info":{}}
{"id":"train_15209","question":"na","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q567 p:P69 ?s . ?s ps:P69 wd:Q49738 . ?s pq:P184 ?value1 . ?s pq:P1026 ?value2 }","paraphrases":["na"],"info":{}}
{"id":"train_15212","question":"Name a person involved in World War II","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1344 wd:Q362 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Title a individual included in World War II"],"info":{}}
{"id":"train_15213","question":"What is the current population of Rio de Janerio?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8678 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1900' ) ) }","paraphrases":["How many people live in Rio de Janerio?"],"info":{}}
{"id":"train_15216","question":"What is the trademark of Barcelona, and where is their headquarters located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q1492 . ?sbj wdt:P31 wd:Q167270 }","paraphrases":["Where is the headquarters of Barcelona and what is the trademark?"],"info":{}}
{"id":"train_15217","question":"What is the parent company of Twitch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P355 wd:Q4555537 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["What's Twitch's parent company?"],"info":{}}
{"id":"train_15218","question":"Who has diplomatic relations with the state of News of the World?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190534 wdt:P17 ?X . ?X wdt:P530 ?answer }","paraphrases":["Who has conciliatory relations with the state of News of the World?"],"info":{}}
{"id":"train_15220","question":"Which is the Elite Prospects staff ID of Jaromír Jágr?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q295345 wdt:P4319 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15221","question":"Who died in Montreal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P20 wd:Q340 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who passed on in Montreal?"],"info":{}}
{"id":"train_15222","question":"What is the name of the operating system that is written in Assembly language and contains 'vm' in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9135 . ?sbj wdt:P277 wd:Q165436 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the identify of the working gadget that is written in Assembly language and incorporates 'vm' in its name?"],"info":{}}
{"id":"train_15229","question":"When did the Kabul Shahi dynasties rule over the land now known as Istanbul?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q654380 wdt:P36 ?answer . ?answer wdt:P190 wd:Q406 }","paraphrases":["Over which period of years did the Kabul Shahi dynasties rule over modern day Istanbul?"],"info":{}}
{"id":"train_15231","question":"What Ernst Heinrich Weber member has 48.1415 11.5806 co-ords?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q76889 wdt:P463 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '48.1415 11.5806' ) ) }","paraphrases":["What Ernst Heinrich Weber part has 48.1415 11.5806 co-ords?"],"info":{}}
{"id":"train_15232","question":"Who was the chief executive officer of Einsatzgruppen who began work in the year 1939?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q152543 p:P169 ?s . ?s ps:P169 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1939' ) ) }","paraphrases":["Give me the name of the chief executive officer of Einsatzgruppen who began work in the year 1939?"],"info":{}}
{"id":"train_15234","question":"Which is the motto text of New Jersey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1408 wdt:P1451 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15235","question":"Was Monica Lewinsky educated at the Lycee Francais de Los Angeles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q212659 wdt:P69 wd:Q3269090 }","paraphrases":["Did Monica Lewinsky attend the Lycee Francais in LA?"],"info":{}}
{"id":"train_15237","question":"In what year was the sixteenth century sculpture David created?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q179900 p:P571 ?s . ?s ps:P571 ?x filter ( contains ( YEAR ( ?x ) , '1500' ) ) . ?s pq:P580 ?value }","paraphrases":["The 16th century scupture David was created in what year?"],"info":{}}
{"id":"train_15240","question":"Which space station has completed maximum orbits?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q25956 . ?ent wdt:P1418 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What space station has orbited the most?"],"info":{}}
{"id":"train_15241","question":"Who is the chairperson for Emil du Bois-Reymond","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P488 wd:Q76571 }","paraphrases":[],"info":{}}
{"id":"train_15244","question":"What is the date of Abu Hurairah al-Dawsiyy's death, which, at its latest, is 679?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q69326 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1326 ?x filter ( contains ( ?x , '679-0-0' ) ) }","paraphrases":["Abu-Hurairah al-Dawsiyy died in which year prior to 679?"],"info":{}}
{"id":"train_15245","question":"What city was the birthplace of Johann Peter Gustav Lejeune Dirichlet and has a population of 11311.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q29193 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '11311.0' ) ) }","paraphrases":["What metropolis was once the birthplace of Johann Peter Gustav Lejeune Dirichlet and has a populace of 11311.0?"],"info":{}}
{"id":"train_15246","question":"What is the name given to the border between Oklahoma and Kansas?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1649 p:P47 ?s . ?s ps:P47 wd:Q1558 . ?s pq:P805 ?value }","paraphrases":["The border between Oklahoma and Kansas is called what?"],"info":{}}
{"id":"train_15248","question":"When did Javier Perez de Cuiellar become the UN Secretary-General?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1259 p:P39 ?s . ?s ps:P39 wd:Q81066 . ?s pq:P580 ?value }","paraphrases":["In what year did Javier Perez de Cuiellar become Secretary-General of the UN?"],"info":{}}
{"id":"train_15249","question":"When was Klemens von Metternich of Cathrine Bagration of mother of child?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q45662 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P25 wd:Q276487 }","paraphrases":["When was Klemens von Metternich born to Cathrine Bagration?"],"info":{}}
{"id":"train_15250","question":"What what is animated nonprofit organization distributed by MGM and English","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q163740 . ?sbj wdt:P37 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'nova' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is energized nonprofit organization dispersed by MGM and English"],"info":{}}
{"id":"train_15251","question":"Which is the doctoral adviser for Samuel Flagg Bemis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P184 wd:Q3946617 }","paraphrases":[],"info":{}}
{"id":"train_15254","question":"Is it true that the spin quantum number of zinc-75 equals to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q18845225 wdt:P1122 ?obj filter ( ?obj = 0 ) }","paraphrases":["Is it genuine that the turn quantum number of zinc-75 equivalents to 0?"],"info":{}}
{"id":"train_15255","question":"What languages does Kenneth Tynan speak?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q374900 wdt:P1412 ?X . ?X wdt:P737 ?answer }","paraphrases":["Which dialects does Kenneth Tynan speak?"],"info":{}}
{"id":"train_15256","question":"\"Which is {taxon parent} of {Invertebrata}, whose {vernacular name} is {动物界} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43806 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , '动物界' ) ) }","paraphrases":["\"Which is {taxon parent} of {Invertebrata}, whose {vernacular name} is {动物界} ?\""],"info":{}}
{"id":"train_15257","question":"What is the orbital inclination of Triton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3359 wdt:P2045 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15260","question":"When did James V of Scotland begin his position as Monarch of Scotland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q137814 p:P39 ?s . ?s ps:P39 wd:Q18810063 . ?s pq:P580 ?value }","paraphrases":["On what date did James V of Scotland start his role as King of Scotland?"],"info":{}}
{"id":"train_15261","question":"Who inhabits the administrative headquarters of Spanish East Indies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q910648 wdt:P36 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Who occupies the regulatory base camp of Spanish East Indies?"],"info":{}}
{"id":"train_15262","question":"What is the gamma-ray burst with the farthest distance from Earth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22247 . ?ent wdt:P2583 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the most distant gamma-ray burst observed from Earth?"],"info":{}}
{"id":"train_15263","question":"Who is the {city} for {twinned administrative body} of {Hamburg}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1055 wdt:P190 ?obj . ?obj wdt:P31 wd:Q515 }","paraphrases":["Who is the { city } of { Hamburg } for the { twined administrative body }"],"info":{}}
{"id":"train_15264","question":"Which day and what are the traditional foods of Thanksgiving?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q13959 wdt:P837 ?ans_1 . wd:Q13959 wdt:P868 ?ans_2 }","paraphrases":["What foods are traditionally eaten on Thanksgiving, and when is it celebrated?"],"info":{}}
{"id":"train_15265","question":"Where was Kristen Stewart born and where is her citizenship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q126599 wdt:P19 ?ans_1 . wd:Q126599 wdt:P27 ?ans_2 }","paraphrases":["Where is Kristen Stewart from?"],"info":{}}
{"id":"train_15266","question":"What outcome of diabetes mellitus has an ICD-9-CM of 362.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12206 wdt:P1542 ?answer . ?answer wdt:P1692 ?x FILTER ( contains ( ?x , '362.0' ) ) }","paraphrases":["What is the result of diabetes mellitus with a 362.0 ICD-9-CM?"],"info":{}}
{"id":"train_15267","question":"Is the Sandbox-Quantity from December 16 less than 12.8","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5248921 wdt:P1106 ?obj filter ( ?obj < 12.8 ) }","paraphrases":["Is the December 16 sandbox quantity less than 12.8"],"info":{}}
{"id":"train_15268","question":"Which is the hotel designed by architect Frank Gehry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P84 wd:Q180374 . ?sbj wdt:P31 wd:Q27686 }","paraphrases":[],"info":{}}
{"id":"train_15269","question":"Is the river head a tributary of the Yellow River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7355 wdt:P974 ?X . ?X wdt:P885 ?answer }","paraphrases":["Is the waterway head a tributary of the Yellow River?"],"info":{}}
{"id":"train_15274","question":"Name a maritime republic that used to speak Latin and that contains the word \"Republic\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43185013 . ?sbj wdt:P2936 wd:Q397 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'republic' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a sea republic that utilized to talk Latin which contains the word \"Republic\" in its name"],"info":{}}
{"id":"train_15275","question":"When did educated at of Sheryl Sandberg and academic major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q234653 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["When was the education at Sheryl Sandberg and major school?"],"info":{}}
{"id":"train_15276","question":"In what year did Miguel Ángel Revilla become President of Cantabria?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3946 p:P6 ?s . ?s ps:P6 wd:Q2733616 . ?s pq:P580 ?value }","paraphrases":["When did Miguel Angel Revilla become the President of Cantabria?"],"info":{}}
{"id":"train_15277","question":"Were Karachi and Kunming adminstrators of Kolkata?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1348 wdt:P190 wd:Q8660 . wd:Q1348 wdt:P190 wd:Q182852 }","paraphrases":["Did Kolkata have Karachi and Kunming as administrators?"],"info":{}}
