{"id":"train_10738","question":"Tell me me a character from Star Wars whose name consist of the word \"woman\" and whose noble title princess leia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33125444 . ?sbj wdt:P97 wd:Q863048 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'leia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know me a character from Star Wars whose title comprise of the word \"lady\" and whose respectable title princess leia"],"info":{}}
{"id":"train_10739","question":"Based on reading Dick Wolf's language, is he a grammatical person?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q550381 wdt:P1412 ?X . ?X wdt:P5110 ?answer }","paraphrases":["Do you think by reading Dick Wolf's language does he use grammar correctly?"],"info":{}}
{"id":"train_10742","question":"What award did Richard Rogers receive in the year 2006?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q237412 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2006' ) ) }","paraphrases":["What 2006 award did Richard Rogers receive?"],"info":{}}
{"id":"train_10743","question":"which is the sovereign state for the renminbi currency?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P38 wd:Q39099 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_10744","question":"What Rear Window was nominated for at 27th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q34414 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q608130 }","paraphrases":["At the 27th Academy Awards, what was Rear Window nominated?"],"info":{}}
{"id":"train_10748","question":"What was Fred Zinnemann nominated for in the 26th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q55420 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q516479 }","paraphrases":["Which was the nomination that Fred Zinnermann got in the 26th Academy Awards?"],"info":{}}
{"id":"train_10749","question":"What is FI WarSampo person ID for Carl Gustaf Emil Mannerheim","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q152306 wdt:P3817 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10750","question":"What type education was completed by Paul Samuelson in 1936?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q102454 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1936' ) ) }","paraphrases":["What education did Paul Samuelson complete in 1936?"],"info":{}}
{"id":"train_10752","question":"Where is the business headquarters location in Hong Kong","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q8646 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Where is the Hong Kong headquarters located?"],"info":{}}
{"id":"train_10753","question":"With whom did Skrillex receive the Grammy Award for Best Dance Recording?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q19004 p:P166 ?s . ?s ps:P166 wd:Q740968 . ?s pq:P1706 ?value }","paraphrases":["who received the prize for the best dance recording with skrillex?"],"info":{}}
{"id":"train_10757","question":"What is newton conversion to SI unit ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q215571 wdt:P2370 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10758","question":"How many cool liquids are there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P588 wd:Q11435 }","paraphrases":["What is the number of cool liquids that exist?"],"info":{}}
{"id":"train_10760","question":"\"What is {written by} of {Symphony No. 5}, which has {master} of {Eduard Marxsen} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q231144 wdt:P86 ?answer . ?answer wdt:P1066 wd:Q509843 }","paraphrases":["\"What is composed by of Symphony No. 5, which has ace of Eduard Marxsen ?\""],"info":{}}
{"id":"train_10761","question":"What is the HQ location of the Hermitage Museum whose twin town is Krakow?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132783 wdt:P159 ?answer . ?answer wdt:P190 wd:Q31487 }","paraphrases":["What is the Hermitage Museum's headquarters location whose twin town is Krakow?"],"info":{}}
{"id":"train_10762","question":"What animation technique starts with the letter \"s\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3516833 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What animation technique begins  with the letter \"s\"?"],"info":{}}
{"id":"train_10764","question":"How is the {medical condition treated} with {subject has role} of {Doxycycline} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q422442 wdt:P2175 ?ans_1 . wd:Q422442 wdt:P2868 ?ans_2 }","paraphrases":["What illness is treated with the medication Doxycycline?"],"info":{}}
{"id":"train_10765","question":"Of all the streak colors, how many are pink?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P534 wd:Q429220 }","paraphrases":["How many of the streak colors are pink?"],"info":{}}
{"id":"train_10766","question":"What are the lunar calendar which start with the letter calendar","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185688 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'calendar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the lunar calendar which begin with the letter calendar"],"info":{}}
{"id":"train_10769","question":"What is the woven fabric that comes from wool?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P186 wd:Q42329 . ?sbj wdt:P31 wd:Q5295538 }","paraphrases":["Which woven fabric is made from wool?"],"info":{}}
{"id":"train_10770","question":"What is Decathlon sport and it;s record progression?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q184654 wdt:P641 ?ans_1 . wd:Q184654 wdt:P2869 ?ans_2 }","paraphrases":["How do they keep score in a Decathlon?"],"info":{}}
{"id":"train_10772","question":"Were the House of Lancaster and the House of Neville participants in the Wars of the Roses?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q127751 wdt:P710 wd:Q2364167 . wd:Q127751 wdt:P710 wd:Q105278 }","paraphrases":["Were the House of Neville and the House of Lancaster both participants in the Wars of the Roses?"],"info":{}}
{"id":"train_10773","question":"WHat treaty serves as the main regulatory text in Soviet Union","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q15180 wdt:P92 ?obj . ?obj wdt:P31 wd:Q131569 }","paraphrases":["What is the Soviet Union's main regulatory treaty?"],"info":{}}
{"id":"train_10774","question":"Is QCOM the stock exchange ticker symbol for Qualcomm?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q544847 p:P414 ?s . ?s ps:P414 ?obj . ?s pq:P249 ?x filter ( contains ( ?x , 'QCOM' ) ) }","paraphrases":["Is Qualcomm's Stock exchange symbol QCOM?"],"info":{}}
{"id":"train_10775","question":"In what year did Marion Cotillard receive an Academy Award for Best Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8927 p:P166 ?s . ?s ps:P166 wd:Q103618 . ?s pq:P585 ?value }","paraphrases":["At what time did Marion Cotillard receive an Academy Award for Best Actress?"],"info":{}}
{"id":"train_10777","question":"Who is The Sims: Hot Date developed and co-founded by?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1991302 wdt:P178 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who is The Sims: Hot Date created and co-founded by?"],"info":{}}
{"id":"train_10778","question":"What sovereign state starts with the letter \"y\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3624078 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH SOVEREIGN STATE STARTS WITH THE LETTER Y"],"info":{}}
{"id":"train_10780","question":"when was the  date of death and date of birth  of abigail adams  who has a child named  abigail adams smith?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q4667661 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["when was the date of demise and date of start of abigail adams who has a infant named abigail adams smith?"],"info":{}}
{"id":"train_10781","question":"What was Leo Tolstoy nominated for in 1905?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7243 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1905' ) ) }","paraphrases":["what appointment did Leo Tolstoy receive in 1905?"],"info":{}}
{"id":"train_10782","question":"WHICH IS THE STATE OF AUSTRALIA THAT CONTAINS THE WORDS VICTORIA IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5852411 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'victoria' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE STATE OF AUSTRALIA THAT CONTAINS THE WORDS VICTORIA IN THEIR NAME"],"info":{}}
{"id":"train_10783","question":"What edition of \"On the Origin of Species\" was published in 1906?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q20124 p:P747 ?s . ?s ps:P747 ?obj . ?s pq:P577 ?x filter ( contains ( YEAR ( ?x ) , '1906' ) ) }","paraphrases":["In 1906, what \"On the Origin of Species\" edition was published?"],"info":{}}
{"id":"train_10784","question":"Which article was published in Rolling Stones magazine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1433 wd:Q33511 . ?sbj wdt:P31 wd:Q13406463 }","paraphrases":["Rolling Stones magazine published which article?"],"info":{}}
{"id":"train_10785","question":"What is the head of government of north Rhine -Westphalia that has start time is 1956-2-20?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1198 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1956' ) ) }","paraphrases":["Who was the head of the government of north Rhine-Westphalia beginning in 1956-2-20?"],"info":{}}
{"id":"train_10786","question":"What was the Human Development Index of Chile in 2012?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q298 p:P1081 ?s . ?s ps:P1081 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2012' ) ) }","paraphrases":["Index of human develpopment of Chile in 2012"],"info":{}}
{"id":"train_10788","question":"How many work locations are for Hans Hofmann?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q215461 wdt:P937 ?obj }","paraphrases":["In what locations has Hans Hofmann worked?"],"info":{}}
{"id":"train_10789","question":"Name the honorary title given to Jack Kilby whose leader is Herwig Kogelnik?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q182031 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q1528517 }","paraphrases":["Title the privileged title given to Jack Kilby whose pioneer is Herwig Kogelnik?"],"info":{}}
{"id":"train_10790","question":"the inventory number guernica","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q175036 wdt:P217 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10791","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51641 wdt:P1889 ?answer . ?answer wdt:P364 wd:Q1860 }","paraphrases":["What is it?"],"info":{}}
{"id":"train_10792","question":"Is Al Pacino graduate at Hurst Lodge School","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41163 wdt:P69 wd:Q15227061 }","paraphrases":["Did Al Pacino graduate from Hurst Lodge School?"],"info":{}}
{"id":"train_10793","question":"Who won the Juno Award for The Weekend?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1346 wd:Q2121062 . ?sbj wdt:P31 wd:Q507057 }","paraphrases":["Who won The Weekend's Juno Award?"],"info":{}}
{"id":"train_10794","question":"Is the residence time of the water in the Sea of Galilee 4.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q126982 wdt:P3020 ?obj filter ( ?obj = 4.8 ) }","paraphrases":["The Sea of Galilee may have a residence time of water as 4.8."],"info":{}}
{"id":"train_10795","question":"What is the population of the capital of Italy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17167 wdt:P36 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Specify the population of the Italian capital."],"info":{}}
{"id":"train_10796","question":"What is the Christian name of James Hetfield that is the same as Jacques?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q484302 wdt:P735 ?answer . ?answer wdt:P460 wd:Q941049 }","paraphrases":["What is the Christian title of James Hetfield that is the same as Jacques?"],"info":{}}
{"id":"train_10797","question":"How many people are commanded by Konstantin Rokossovsky?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q40482 wdt:P598 ?obj }","paraphrases":["What number of people are under the command of Konstantin Rokossovsky?"],"info":{}}
{"id":"train_10798","question":"Which is the magnetic confinement fusion that contains the word tokamak in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q939954 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tokamak' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the attractive control combination that contains the word tokamak in it's title?"],"info":{}}
{"id":"train_10800","question":"When did Rolf-Dieter Heuer stop being the director of CERN?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42944 p:P1037 ?s . ?s ps:P1037 wd:Q65092 . ?s pq:P582 ?value }","paraphrases":["Rolf-Dieter Heure left the position of director of CERN in what year?"],"info":{}}
{"id":"train_10803","question":"How many CEOs does Apple, Inc., have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q312 wdt:P169 ?obj }","paraphrases":["Which is the number of CEOs that Apple, Inc. has?"],"info":{}}
{"id":"train_10805","question":"when did Geneva become the capital of the republic of Geneva?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q71 p:P1376 ?s . ?s ps:P1376 wd:Q23366230 . ?s pq:P582 ?value }","paraphrases":["Geneva was declared the capitol of the republic of Geneva on what date?"],"info":{}}
{"id":"train_10806","question":"Who is the author of The Merchant of Venice and who are it's characters?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q206400 wdt:P674 ?ans_1 . wd:Q206400 wdt:P50 ?ans_2 }","paraphrases":["Who wrote The Merchant of Venice and what are the names of the characters?"],"info":{}}
{"id":"train_10808","question":"Who is the doctoral supervisor and founder of clinical psychology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q199906 wdt:P112 ?X . ?X wdt:P184 ?answer }","paraphrases":["Who is clinical psychology's doctoral supervisor and founder?"],"info":{}}
{"id":"train_10809","question":"Name a profession based on female dominance that contains the word \"dominatrix\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28640 . ?sbj wdt:P1269 wd:Q1404482 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dominatrix' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a female - dominated profession containing the word \"dominatrix\" in its name"],"info":{}}
{"id":"train_10810","question":"When did Robert Evans marry Ali MacGrawMacGraw","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1826885 p:P26 ?s . ?s ps:P26 wd:Q229983 . ?s pq:P580 ?value }","paraphrases":["In which year Robert Evans married Ali MacGrawMacGraw?"],"info":{}}
{"id":"train_10812","question":"Is the maximum Strahler number of Black Creek equal to 3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4920591 wdt:P1548 ?obj filter ( ?obj = 3 ) }","paraphrases":["Was 3 the maximum Strahler number for Black Creek?"],"info":{}}
{"id":"train_10813","question":"How many street address are located in Einsatzgruppen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q152543 wdt:P969 ?obj }","paraphrases":["Which is the number of the street addresses that are located in Einsatzgruppen?"],"info":{}}
{"id":"train_10814","question":"TELL ME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q914 wdt:P190 ?X . ?X wdt:P281 ?answer }","paraphrases":["Describe to me"],"info":{}}
{"id":"train_10820","question":"How many residences are there for Mikhail Bulgakov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q835 wdt:P551 ?obj }","paraphrases":["What is the number of residences for Mikhail Bulgakov?"],"info":{}}
{"id":"train_10821","question":"is it true that Osama bin Laden used to live in Osama bin Laden's house in Khartoum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1317 wdt:P551 wd:Q7105667 }","paraphrases":["Did Osama Bin Laden previously reside in a house in Khartoum?"],"info":{}}
{"id":"train_10823","question":"Who did Alexander Hamilton marry at Schuyler Mansion?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q178903 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P2842 wd:Q1666617 }","paraphrases":["what was alexander hamilton wifes name  ?"],"info":{}}
{"id":"train_10824","question":"When did Sigismund end his term as King of Bohemia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q57124 p:P39 ?s . ?s ps:P39 wd:Q45341328 . ?s pq:P582 ?value }","paraphrases":["When did Sigismund conclusion his term as Lord of Bohemia?"],"info":{}}
{"id":"train_10825","question":"Is 65 the retirement age in Czech Republic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q213 wdt:P3001 ?obj filter ( ?obj = 65 ) }","paraphrases":["In Czech Republic, is 65 the retirement age?"],"info":{}}
{"id":"train_10826","question":"\"Where is {grave at} of {James Bond}, which {partner town} is {Incheon} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q241031 wdt:P119 ?answer . ?answer wdt:P190 wd:Q20934 }","paraphrases":["\"Where is {grave at} of {James Bond}, which {accomplice town} is {Incheon} ?\""],"info":{}}
{"id":"train_10831","question":"Who is record producer Vento del sud married to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4009726 wdt:P162 ?X . ?X wdt:P26 ?answer }","paraphrases":["record producer Vento del sudis married to who?"],"info":{}}
{"id":"train_10832","question":"Tell me highly urbanized city whose name has the word valenzuela in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29946056 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'valenzuela' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know profoundly urbanized city whose title has the word valenzuela in it."],"info":{}}
{"id":"train_10834","question":"Tell me the longest-distance sport in which Rudolf Caracciola is champion.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16510064 . ?ent wdt:P3157 ?obj . ?ent wdt:P1346 wd:Q57365 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which longest-distance sport made Rudolf Caracciola a champion?"],"info":{}}
{"id":"train_10835","question":"Where is the headquarters of Georg Rabuse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1505690 wdt:P102 ?X . ?X wdt:P159 ?answer }","paraphrases":["Where is the central station of Georg Rabuse?"],"info":{}}
{"id":"train_10837","question":"What shape is a rectangle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1419 wd:Q209 }","paraphrases":["Describe the shape of a rectangle."],"info":{}}
{"id":"train_10838","question":"Is it true that the thickness of the \"Portrait of a Man\" is less than .72\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28016117 wdt:P2610 ?obj filter ( ?obj < 0.72 ) }","paraphrases":["Is it correct to say that the thickness of \"Portrait of a Man\" is less than 0.72?"],"info":{}}
{"id":"train_10839","question":"In the science of language, what is being working on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q315 wdt:P2579 ?X . ?X wdt:P2578 ?answer }","paraphrases":["What is the is being worked on the science of language?"],"info":{}}
{"id":"train_10840","question":"How many partners does Iron man have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P451 wd:Q180704 }","paraphrases":["How many partner with Ironman?"],"info":{}}
{"id":"train_10842","question":"what is the start time and end time of barnaul  which is located  in the administrative  territorial entity  as west sibirean krai?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q6014 p:P131 ?s . ?s ps:P131 wd:Q4186485 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["When did Barnaul start and end?"],"info":{}}
{"id":"train_10847","question":"Who oversees the clergy of Saint Petersburg University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28729082 wdt:P1075 ?X . ?X wdt:P184 ?answer }","paraphrases":["Who directs the clergy of Holy person Petersburg University? ?"],"info":{}}
{"id":"train_10848","question":"What is the shape of the compact flash with the rectangular base?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q678615 wdt:P1419 ?answer . ?answer wdt:P3263 wd:Q209 }","paraphrases":["What is the form of the compact flash with the rectangular base?"],"info":{}}
{"id":"train_10849","question":"What is brought by epoch of Selkirk Mountains ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1420547 wdt:P2348 ?X . ?X wdt:P155 ?answer }","paraphrases":["What did epoch of Selkirk Mountains bring?"],"info":{}}
{"id":"train_10850","question":"WHat are the band that contain the word \"Nightwish\" in their name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215380 . ?sbj wdt:P358 wd:Q960630 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'nightwish' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat are the band that contain the word \"Nightwish\" in their title ?"],"info":{}}
{"id":"train_10851","question":"What is Thomas Aquinas' profession?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9438 wdt:P106 ?obj . ?obj wdt:P31 wd:Q28640 }","paraphrases":["What is Thomas Aquinas' profession?"],"info":{}}
{"id":"train_10852","question":"What is the Who's Who UK ID of Albert Einstein?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q937 wdt:P4789 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10854","question":"Is the kinematic viscosity of Unleaded 91 equal to 0.475?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q50740556 wdt:P2118 ?obj filter ( ?obj = 0.475 ) }","paraphrases":["Does Unleaded 91 have a kinematic viscosity of 0.475?"],"info":{}}
{"id":"train_10856","question":"Mention the publishing year of Grand Theft Auto III","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q149106 wdt:P400 ?X . ?X wdt:P577 ?answer }","paraphrases":["Specify the distributing year of Terrific Burglary Auto III"],"info":{}}
{"id":"train_10857","question":"Tell me the TMA most apoapsis","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2425489 . ?ent wdt:P2243 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Let me know the most apoapsis TMA."],"info":{}}
