{"id":"train_16126","question":"What sports team was Brendon McCullum a member in the year 2008?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3345051 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2008' ) ) }","paraphrases":["During the year 2008. what sports team was Bendon McCullum a part of?"],"info":{}}
{"id":"train_16127","question":"what is date of death  of diophantus is latest date is 299-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q178217 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1326 ?x filter ( contains ( ?x , '299-0-0' ) ) }","paraphrases":["When did Diaphantus die?"],"info":{}}
{"id":"train_16128","question":"Is Kiva Andru's specific age inside fictional universe under 20?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q61890789 wdt:P6249 ?obj filter ( ?obj < 20.0 ) }","paraphrases":["Is Kiva Andru under 20 years old?"],"info":{}}
{"id":"train_16131","question":"How many airline hubs are by Beijing Capital International Airport?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P113 wd:Q32190 }","paraphrases":["Beijing Capital Intl Airport is by how many airline hubs?"],"info":{}}
{"id":"train_16135","question":"Was James Brown on the Hollywood Records and King Records record labels?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5950 wdt:P264 wd:Q387539 . wd:Q5950 wdt:P264 wd:Q1328605 }","paraphrases":["Did James Brown appear on the Hollywood Records and King Records record labels?"],"info":{}}
{"id":"train_16136","question":"For which company is Mark Zuckerberg the CEO?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P169 wd:Q36215 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Marc Zuckerberg is the CEO of what company?"],"info":{}}
{"id":"train_16137","question":"Is Sicily located in the UTC+02:00 time zone?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1460 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value }","paraphrases":["What time zone is Sicily located in? the UTC+2:00 time zone?"],"info":{}}
{"id":"train_16140","question":"Tell me Public policy whose name has the words racial in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q546113 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'racial' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know Open arrangement whose title has the words racial in it."],"info":{}}
{"id":"train_16141","question":"What are the historical motorcycle manufacturer which start with the letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15081032 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the chronicled cruiser producer which begin with the letter W"],"info":{}}
{"id":"train_16142","question":"What is Paul Cézanne's Belvedere artist ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q35548 wdt:P3421 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16143","question":"Quentin Tarantino is nominated for which Golden Globe Award ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3772 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q1011547 }","paraphrases":["Quentin Tarantino is designated for which Brilliant Globe Grant ?"],"info":{}}
{"id":"train_16145","question":"What is a diplomatic relation of El Salvador that is a member of NAFTA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q792 wdt:P530 ?answer . ?answer wdt:P463 wd:Q181574 }","paraphrases":["What may be a conciliatory connection of El Salvador that's a part of NAFTA?"],"info":{}}
{"id":"train_16146","question":"When did Bob Kahn receive the Marconi Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q62843 p:P166 ?s . ?s ps:P166 wd:Q473292 . ?s pq:P585 ?value }","paraphrases":["Did Bob get his Marconi Prize?"],"info":{}}
{"id":"train_16147","question":"Which is the significant event of Gérard Debreu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q210960 wdt:P793 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16148","question":"What is the {death location} of {John Hancock}, which has the {sister city} of {Johannesburg}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6237556 wdt:P20 ?answer . ?answer wdt:P190 wd:Q34647 }","paraphrases":["What is the {passing area} of {John Hancock}, which has the {sister city} of {Johannesburg}?"],"info":{}}
{"id":"train_16149","question":"What is the Wikisource index page for The Age of Innocence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1045464 wdt:P1957 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16150","question":"What is the Italian municipality for Cardiff's sister administration?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10690 wdt:P190 ?obj . ?obj wdt:P31 wd:Q747074 }","paraphrases":["What is the Italian region for Cardiff's sister administration?"],"info":{}}
{"id":"train_16151","question":"Who replaced Luchino Visconti as President of the Jury at the Cannes Festival?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q13888 p:P39 ?s . ?s ps:P39 wd:Q23958341 . ?s pq:P1365 ?value }","paraphrases":["Who was Luchino Visconti's replacement as President of the Jury at the Cannes Festival?"],"info":{}}
{"id":"train_16152","question":"How many basin countries are there in Azerbaijan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P205 wd:Q227 }","paraphrases":["Azerbaijan has how many basin countries?"],"info":{}}
{"id":"train_16153","question":"What are the mixture which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q169336 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What mixture starts with \"t\"?"],"info":{}}
{"id":"train_16154","question":"Who was Paul von Hindenburg's wife ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2667 wdt:P26 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was Paul von Hindenburg's spouse ?"],"info":{}}
{"id":"train_16155","question":"What is { award received } from { Chiune Sugihara } that is { point in time } is { 1985 - 1 - 1 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q161381 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1985' ) ) }","paraphrases":["Give me the name of the { award received } from { Chiume Sugihara } that is { point in time } { 1985 - 1 - 1 }?"],"info":{}}
{"id":"train_16162","question":"Which film was written by screenwriter Sergei Eisenstein?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P58 wd:Q8003 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Which film was composed by screenwriter Sergei Eisenstein?"],"info":{}}
{"id":"train_16166","question":"What what is philosophical movement practiced by atheist  and also which that starts with a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2915955 . ?sbj wdt:P3095 wd:Q13211738 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is philosophical motion practiced by using atheist and additionally which that starts with a"],"info":{}}
{"id":"train_16167","question":"Who is Star Wars' director and composer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q462 wdt:P57 ?ans_1 . wd:Q462 wdt:P86 ?ans_2 }","paraphrases":["Who directed the Stars Wars movies? (include all of them; prequels, trilogy, etc)\nWho composed the soundtrack?"],"info":{}}
{"id":"train_16168","question":"Who is the half brother of Joseph Stalin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q855 p:P1038 ?s . ?s ps:P1038 ?obj . ?s pq:P1039 wd:Q15312935 }","paraphrases":["Give the name of Joseph Stalin's half brother."],"info":{}}
{"id":"train_16173","question":"Is it true that the ranking of the Netherlands national football team equals to 4.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47050 wdt:P1352 ?obj filter ( ?obj = 4.0 ) }","paraphrases":["Is the ranking of the Netherlands National football team equal to 4?"],"info":{}}
{"id":"train_16174","question":"Is amisulpride a drug used for treatment of borderline personality disorder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q208166 wdt:P2176 wd:Q418785 }","paraphrases":["Is borderline personality disorder treated with amisulpride?"],"info":{}}
{"id":"train_16175","question":"Tell me the inhabitants that originated in the Bachelor.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q700722 wdt:P495 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Who is the original Bachelor?"],"info":{}}
{"id":"train_16177","question":"Was Eminem a film producer for an occupation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5608 wdt:P106 wd:Q3282637 }","paraphrases":["Did Eminem ever work as a film producer?"],"info":{}}
{"id":"train_16178","question":"Are Kim and Idina given names of Idina Menzel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q157400 wdt:P735 wd:Q637123 . wd:Q157400 wdt:P735 wd:Q5988758 }","paraphrases":["is it idina menzel name was given by kim and idina?"],"info":{}}
{"id":"train_16179","question":"What is the patronym or matronym for Mahathir Mohamed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q181383 wdt:P5056 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16181","question":"When did John Glenn become an astronaut?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q182642 p:P106 ?s . ?s ps:P106 wd:Q11631 . ?s pq:P580 ?value }","paraphrases":["In what year did John Glenn achieve becoming an astronaut?"],"info":{}}
{"id":"train_16182","question":"What is the continent of South America?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P30 wd:Q18 }","paraphrases":[],"info":{}}
{"id":"train_16183","question":"Is the production rate of the Maury AOC equal 4299?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2120260 wdt:P2197 ?obj filter ( ?obj = 4299 ) }","paraphrases":["Does Maury AOC produce at a rate of 4299?"],"info":{}}
{"id":"train_16186","question":"Which principle that contains the word ätialprinzip in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q211364 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ätialprinzip' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which rule that contains the word ätialprinzip in their name"],"info":{}}
{"id":"train_16188","question":"Who is the inventor of the Triangulum Galaxy who worked in the area of astronomy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13724 wdt:P61 ?answer . ?answer wdt:P101 wd:Q333 }","paraphrases":["Who is the inventor of the Triangulum Galaxy who labored in the vicinity of astronomy?"],"info":{}}
{"id":"train_16189","question":"Does acetone peroxide have an explosive velocity equal to 5300?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q329022 wdt:P2231 ?obj filter ( ?obj = 5300 ) }","paraphrases":["Is 5300 the explosive velocity of acetone peroxide?"],"info":{}}
{"id":"train_16191","question":"Give me a cellular component structure, that starts with an alphabet 'v'.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5058355 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me a structure of cellular components that begins with an ' v ' alphabet."],"info":{}}
{"id":"train_16192","question":"Tell my a liquid that contains the word vinegar in its name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q906356 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vinegar' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What liquid contains the word 'vinegar' in its name?"],"info":{}}
{"id":"train_16193","question":"Who was elected for the position of the Member of the 30th Parliament of the United Kingdom held by Stanley Baldwin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q166635 p:P39 ?s . ?s ps:P39 wd:Q41582581 . ?s pq:P2715 ?value }","paraphrases":["Who was elected as Member of Parliament after Stanley Baldwin?"],"info":{}}
{"id":"train_16194","question":"Tell me economic branch whose name has the word transport in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q268592 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'transport' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me economic branch whose name has the word transport in it."],"info":{}}
{"id":"train_16197","question":"What are the legal order which start with the letter sharia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q858700 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sharia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which legal order starts with the Sharia letter?"],"info":{}}
{"id":"train_16199","question":"Tell me fallen angel whose name has the word zaqiel in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q581450 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zaqiel' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know fallen blessed messenger whose title has the word zaqiel in it."],"info":{}}
{"id":"train_16200","question":"Is it true that the vibration of makita JR3030T is equal to 27.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23775469 wdt:P2806 ?obj filter ( ?obj = 27.8 ) }","paraphrases":["Is it genuine that the vibration of makita JR3030T is rise to to 27.8?"],"info":{}}
{"id":"train_16202","question":"TELL ME KETONE WHOSE NAME HAS THE WORD PENTANONE IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q170744 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pentanone' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["REVEAL ME KETONE WHOSE NAME HAS THE WORD PENTANONE IN IT."],"info":{}}
{"id":"train_16205","question":"Tell me which is the physical object that contains the word zrzez in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223557 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zrzez' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which item has the word zrzez in its name?"],"info":{}}
{"id":"train_16206","question":"Which is an ensemble for the architectural style of Bauhaus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P149 wd:Q124354 . ?sbj wdt:P31 wd:Q1497375 }","paraphrases":[],"info":{}}
{"id":"train_16208","question":"Who is the publisher of the track on Nickel-Catalyzed Coupling Reactions of Alkenes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35141061 wdt:P1433 ?X . ?X wdt:P123 ?answer }","paraphrases":["Who is Alkenes ' track publisher on Nickel - Catalyzed Coupling Reactions?"],"info":{}}
{"id":"train_16209","question":"What is a tributary of the Madeira River:","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q118251 wdt:P403 ?X . ?X wdt:P974 ?answer }","paraphrases":["What could be a tributary of the Madeira River:"],"info":{}}
{"id":"train_16210","question":"What is the music series of the Discourses of Politics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24577368 wdt:P179 ?X . ?X wdt:P136 ?answer }","paraphrases":["In the Discourses of Politics, can you provide the name of the music series?"],"info":{}}
{"id":"train_16212","question":"Tell me Nishiki-e whose name has the word sea in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1683337 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sea' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What may be a human action that has the word zurgriff in it."],"info":{}}
{"id":"train_16213","question":"Is the number of registered users/contributors French Wikipedia equal to 2421469?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q8447 wdt:P1833 ?obj filter ( ?obj = 2421469 ) }","paraphrases":["Is the number of enrolled users/contributors French Wikipedia break even with to 2421469?"],"info":{}}
{"id":"train_16215","question":"When was Hermann Hesse nominated for the Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q25973 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["What was the date that Hermann Hesse received his nomination for the Nobel Prize in Literature?"],"info":{}}
{"id":"train_16218","question":"Is Stephen Curry married to Rachael Ray?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q352159 wdt:P26 wd:Q257943 }","paraphrases":["Are Stephen Curry and Rachael Ray married to each other?"],"info":{}}
{"id":"train_16220","question":"What enterprise is Hans Zimmer the director of","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1037 wd:Q76364 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["What undertaking is Hans Zimmer the chief of"],"info":{}}
{"id":"train_16221","question":"Which female organ is the counterpart to the testicle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9384 wdt:P4545 ?obj . ?obj wdt:P31 wd:Q25553420 }","paraphrases":["Which organ is  counterpart to the testicle of female?"],"info":{}}
{"id":"train_16224","question":"What professional sport does Kristi Yamaguchi participate in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1327 wd:Q237651 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Which professional sport is involved in by Kristi Yamaguchi?"],"info":{}}
{"id":"train_16226","question":"was Akbar in given birth in 1542-10-15?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8597 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( YEAR ( ?x ) , '1542' ) ) . ?s pq:P31 ?value }","paraphrases":["True or false:  Akbar was given in birth October 15, 1542."],"info":{}}
{"id":"train_16227","question":"How many works are depicted by Richard III/","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q652011 wdt:P1299 ?obj }","paraphrases":["Which is the number of works depicted by Richard III?"],"info":{}}
{"id":"train_16229","question":"TELL ME THE AGE THAT STARTS WITH G","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185836 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know THE AGE THAT Begins WITH G"],"info":{}}
{"id":"train_16230","question":"Who is the defendant for Hans Frank?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1591 wd:Q60087 }","paraphrases":[],"info":{}}
{"id":"train_16231","question":"Who gave the{collateral descendant} of {Developer} of {Winter} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23693561 wdt:P88 ?X . ?X wdt:P1038 ?answer }","paraphrases":["What is the developer of the collateral descendant of winter?"],"info":{}}
{"id":"train_16235","question":"What is the national flower of the territorial entity of Yukon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2009 wdt:P131 ?X . ?X wdt:P2238 ?answer }","paraphrases":["What is Yukon's national flower?"],"info":{}}
{"id":"train_16236","question":"Which is {target} of {dedicated item} {COMINFIL} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1023998 wdt:P805 ?X . ?X wdt:P533 ?answer }","paraphrases":["Which is the { target } of the { COMINFIL } item?"],"info":{}}
{"id":"train_16238","question":"Name a non-science partially coincident with Geisteswissenschaft that starts with letter H","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28954762 . ?sbj wdt:P1382 wd:Q944537 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a non-science partially coincident with Geisteswissenschaft that begins with letter H"],"info":{}}
{"id":"train_16239","question":"Rio Grande","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26590 wdt:P190 ?answer . ?answer wdt:P1376 wd:Q108494 }","paraphrases":["Grande River"],"info":{}}
{"id":"train_16240","question":"What activity of Irini Rodnina has the twin city of Krasnoyarsk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q233812 wdt:P937 ?answer . ?answer wdt:P190 wd:Q919 }","paraphrases":["What movement of Irini Rodnina has the twin city of Krasnoyarsk?"],"info":{}}
{"id":"train_16241","question":"Who is the publisher for the publishing the Society of Jesus","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P123 wd:Q36380 . ?sbj wdt:P31 wd:Q732577 }","paraphrases":[],"info":{}}
{"id":"train_16242","question":"Where are the papers of the daughters of Frederick Marryat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q467770 wdt:P40 ?X . ?X wdt:P485 ?answer }","paraphrases":["WHERE IS THE PAPAERS OF THE DAUGHTERS OF FREDERICK MARRYAT"],"info":{}}
{"id":"train_16243","question":"Who is the Story Adaptation storyboard artist for Snow White and the Seven Drawfs?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q134430 p:P3275 ?s . ?s ps:P3275 ?obj . ?s pq:P1932 ?x filter ( contains ( ?x , 'Story Adaptation' ) ) }","paraphrases":["The Story Adaptation storyboard artist for Snow White and the Seven Dwarfs is whom?"],"info":{}}
{"id":"train_16247","question":"Tell me cave whose name has the word sesselfelsgrotte in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q35509 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'sesselfelsgrotte' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me cave whose name is contained in the word sesselfelsgrotte."],"info":{}}
{"id":"train_16248","question":"Is the Internet different from the World Wide Web?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q75 wdt:P1889 wd:Q466 }","paraphrases":["Does the internet differ from the World Wide Web?"],"info":{}}
{"id":"train_16254","question":"Was Alex Ferguson a member of Falkirk F.C. and Ayr United F.C.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44980 wdt:P54 wd:Q219241 . wd:Q44980 wdt:P54 wd:Q793241 }","paraphrases":["Did Alex Ferguson play for Falkirk F.C. and Ayr United F.C.?"],"info":{}}
{"id":"train_16257","question":"Tell me the number of games played as well as number of goals Roger Milla scored while with team Utrera.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q168540 p:P54 ?s . ?s ps:P54 wd:Q19513 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How many games were played and how many goals did Roger Milla score while a member of the team Utrera?"],"info":{}}
{"id":"train_16258","question":"What is {attendee} in {conflict} of {Curt Badinski} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2574334 wdt:P607 ?X . ?X wdt:P710 ?answer }","paraphrases":["What is {attendee} in {struggle} of {Terse Badinski} ?"],"info":{}}
