{"id":"train_9155","question":"What is the atomic nucleus with the most sospin z-component whose follows is deuteron ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q37147 . ?ent wdt:P1127 ?obj . ?ent wdt:P155 wd:Q503527 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the atomic nucleus that has the most sospin z-component that follows deuteron?"],"info":{}}
{"id":"train_9156","question":"When did Gabon have a population of 692,535?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1000 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '692535.0' ) ) . ?s pq:P585 ?value }","paraphrases":["When did the popluation of Gabon reach almost 695,000"],"info":{}}
{"id":"train_9157","question":"What kind of specialty doctor diagnoses schizotypal personality disorder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q861560 wdt:P1995 ?X . ?X wdt:P3095 ?answer }","paraphrases":["What type of doctor looks at schizotypal personality disorder?"],"info":{}}
{"id":"train_9159","question":"Assassin's Creed are present in how much work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1441 wd:Q420292 }","paraphrases":["How many works is the Assassin's Creed present in?"],"info":{}}
{"id":"train_9160","question":"\"What is the {domain} of {unconformity} which is {associated with} is {geologist} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q876798 wdt:P2579 ?answer . ?answer wdt:P3095 wd:Q520549 }","paraphrases":["\"What is the {space} of {unconformity} which is {related with} is {geologist} ?\""],"info":{}}
{"id":"train_9161","question":"What is an interesting historical topic about Zambia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q953 wdt:P2184 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9162","question":"What is a photographic technique which includes the word vignetting in the name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1439691 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vignetting' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a photographic technique which consists of the word vignetting in the title"],"info":{}}
{"id":"train_9165","question":"What is the total revenue for ExxonMobil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q156238 wdt:P2139 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9166","question":"Who had the title of Mary in the Spanish Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q80702 wdt:P417 ?obj . ?obj wdt:P31 wd:Q1509831 }","paraphrases":["Who had the title of Mary within the Spanish Empire?"],"info":{}}
{"id":"train_9167","question":"when did Aemlius Papinianus die in relation to gregoria\"s statement before 1584","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q315765 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["Did Aemlius Papinianus die before or after greroria's statement?"],"info":{}}
{"id":"train_9169","question":"Who replaced Isabel Martinez de Peron as the President of Argentina?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q191014 p:P39 ?s . ?s ps:P39 wd:Q12969145 . ?s pq:P1365 ?value }","paraphrases":["Who succeeded the President of Argentina Isabel Martinez de Peron?"],"info":{}}
{"id":"train_9170","question":"What is the address for the University of Barcelona with a postal code of 08007?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q219615 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P281 ?x filter ( contains ( ?x , '08007' ) ) }","paraphrases":["Which address for the University of Barcelona has a postal code of 08007?"],"info":{}}
{"id":"train_9171","question":"What is Kitaro's Myspace ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q273652 wdt:P3265 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9172","question":"Give the name of the football tournament which has lowest score point in Uruguay?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1478437 . ?ent wdt:P1351 ?obj . ?ent wdt:P17 wd:Q77 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What football event scored the lowest in Uruguay?"],"info":{}}
{"id":"train_9173","question":"Which Norwegian holiday commemorates the resurrection of Jesus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P547 wd:Q51624 . ?sbj wdt:P31 wd:Q2398229 }","paraphrases":["Which Norwegian vacation commemorates Jesus ' resurrection?"],"info":{}}
{"id":"train_9175","question":"What is the twin town of Sakie Akiyama's birthplace?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11594958 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the twin town of Sakie Akiyama's birthplace?"],"info":{}}
{"id":"train_9176","question":"What was the population of Hobart on August 9, 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q40191 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["What was Hobart's population in August 2016?"],"info":{}}
{"id":"train_9179","question":"How was the population of Alberta determined to be 4,306,039?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1951 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '4306039' ) ) . ?s pq:P459 ?value }","paraphrases":["Albert has a population of 4,306,039, how was this number derived?"],"info":{}}
{"id":"train_9181","question":"Who is the  {Wikidata property for an identifier} for {subject item of this property} of {Nazi Party}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1629 wd:Q7320 . ?sbj wdt:P31 wd:Q19847637 }","paraphrases":["Who is the { Wikidata for an identifier } property of { Nazi Party } for { subject item of this property }"],"info":{}}
{"id":"train_9182","question":"\"Who is from Yes, and has a Ocean in the River Thames?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184386 wdt:P740 ?answer . ?answer wdt:P206 wd:Q19686 }","paraphrases":["\"Who is from Yes, having an Ocean in the Thames River?\""],"info":{}}
{"id":"train_9183","question":"How many are followed by Oracle Corporation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P156 wd:Q19900 }","paraphrases":["The Oracle Corporation has now many followers?"],"info":{}}
{"id":"train_9186","question":"Which is {influenced by} and {followed by} of {Alexander_the_Great} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q8409 wdt:P737 ?ans_1 . wd:Q8409 wdt:P156 ?ans_2 }","paraphrases":["Which is {influenced by} and {followed by} of {Alexander_the_Great} Which is {influenced by} and {followed by} of {Alexander_the_Great} ?"],"info":{}}
{"id":"train_9187","question":"Is this taxon is source of goji?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1672 wd:Q2617260 }","paraphrases":[],"info":{}}
{"id":"train_9188","question":"What national historic trails in the country of the USA have the word trail in their name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6973377 . ?sbj wdt:P17 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trail' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What countrywide historical trails in the usa of the USA have the word trail in their name?"],"info":{}}
{"id":"train_9189","question":"What is the full address of Glencore's headquarters located at Baaremattstrasse 3?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q169339 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P969 ?x filter ( contains ( ?x , 'Baarermattstrasse 3' ) ) }","paraphrases":["What is Glencore's headquarters' address?"],"info":{}}
{"id":"train_9190","question":"Tell me the name of a high-rise building designed by structural engineer Atkins, and which starts with \"a\".","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18142 . ?sbj wdt:P631 wd:Q1510450 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the title of a high-rise constructing designed through structural engineer Atkins, and which starts with \"a\"."],"info":{}}
{"id":"train_9192","question":"What did Jean-Luc Godard receive a Honorary Cesar award for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q53001 p:P166 ?s . ?s ps:P166 wd:Q727282 . ?s pq:P1346 ?value }","paraphrases":["For what reason did Cesar Honorario give a bonus to Jean-Luc Godard?"],"info":{}}
{"id":"train_9197","question":"How many places of publication are in Brasília?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P291 wd:Q2844 }","paraphrases":["Are there many places where someone can publish in Brasilia?"],"info":{}}
{"id":"train_9198","question":"Is Ibn Taymiyyah's place of birth the country known as Harran?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q491558 p:P19 ?s . ?s ps:P19 wd:Q199547 . ?s pq:P17 ?value }","paraphrases":["is harran Ibn Taymiyyah's birth place?"],"info":{}}
{"id":"train_9199","question":"Which {subject has role} and the {significant drug interaction} of {Amphetamine} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q179452 wdt:P2868 ?ans_1 . wd:Q179452 wdt:P769 ?ans_2 }","paraphrases":["What are the roles and significant interactions with the drugs that are categorized as Amphetamines?"],"info":{}}
{"id":"train_9200","question":"How many types of sports are in San Marino?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1532 wd:Q238 }","paraphrases":["What is the number of sports in San Marino?"],"info":{}}
{"id":"train_9202","question":"Which is {denomination} of {writers} of {Executive Order 3800} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19107125 wdt:P50 ?X . ?X wdt:P140 ?answer }","paraphrases":["Which is {group} of {scholars} of {Official Arrange 3800} ?"],"info":{}}
{"id":"train_9204","question":"tell me demographic profile replaced by early childhood  starts with letter b","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5932254 . ?sbj wdt:P1366 wd:Q3377398 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["inform me demographic profile changed through early childhood starts with letter b"],"info":{}}
{"id":"train_9206","question":"Tell me fictional detective whose name has the word hydro in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1244922 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hydro' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the fictional detective character whose name has \"hydro\" in it."],"info":{}}
{"id":"train_9207","question":"What are the Magnetic confinement fusion which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q939954 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the fusion of magnetic containment that begins with letter t"],"info":{}}
{"id":"train_9209","question":"Was Barry Kooser a film crew member on The Lion King?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q36479 wdt:P3092 wd:Q16204825 }","paraphrases":["Did The Lion King have as a crew member Barry Kooser?"],"info":{}}
{"id":"train_9211","question":"Which  bodies of water basin category of Peace River ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2220 wdt:P1200 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9213","question":"What is the Śūnyatā transliteration of শূন্যতা?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q546054 p:P1705 ?s . ?s ps:P1705 ?x filter ( contains ( ?x , 'শূন্যতা' ) ) . ?s pq:P2440 ?value }","paraphrases":["How do you say শূন্যতা in the Śūnyatā transliteration?"],"info":{}}
{"id":"train_9216","question":"What position did Athelstan hold in 927?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q170017 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( ?x , '927-0-0' ) ) }","paraphrases":["In 927, what position did Athelstan hold?"],"info":{}}
{"id":"train_9220","question":"Los Angeles is located in which county of California ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P150 wd:Q65 . ?sbj wdt:P31 wd:Q13212489 }","paraphrases":["Los Angeles is in what county of CA?"],"info":{}}
{"id":"train_9222","question":"When did Dally Messenger join the Australia national rugby union team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3012496 p:P54 ?s . ?s ps:P54 wd:Q622443 . ?s pq:P580 ?value }","paraphrases":["On what date did  Dally Messenger join the Australia national rugby UT?"],"info":{}}
{"id":"train_9223","question":"What is the name of the painting that depicts Jesus Christ","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P180 wd:Q302 . ?sbj wdt:P31 wd:Q3305213 }","paraphrases":["What is the title of the portray that delineates Jesus Christ"],"info":{}}
{"id":"train_9224","question":"What was the population of New Jersey in the year 2001?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q785 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["In 2001, what was the population of New Jersey?"],"info":{}}
{"id":"train_9225","question":"What state of Sud Chicas Province is next to Tarapacá Region?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2114 wdt:P47 ?answer . ?answer wdt:P150 wd:Q1425463 }","paraphrases":["What state of the province of Sud Chicas is next to the region of Tarapacá?"],"info":{}}
{"id":"train_9226","question":"\"Which actor in The Godfather was educated at Hofstra University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q47703 wdt:P161 ?answer . ?answer wdt:P69 wd:Q1623314 }","paraphrases":["\"Which actor in The Godfather used to be educated at Hofstra University?"],"info":{}}
{"id":"train_9227","question":"Mention the Wikimedia categorization related to the civilians of Manipur.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1193 wdt:P1792 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["Specify the Wikimedia categorization related to the civilians of Manipur."],"info":{}}
{"id":"train_9228","question":"Is the number of speakers of Sanskrit equal 2654.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q11059 wdt:P1098 ?obj filter ( ?obj = 2654.4 ) }","paraphrases":["Are there 2,654.4 people who speak Sanskrit?"],"info":{}}
{"id":"train_9229","question":"Is it true that the maximum operating altitude of the Airbus A400M equals to 11275?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6496 wdt:P2254 ?obj filter ( ?obj = 11275 ) }","paraphrases":["Does the Airbus A400M run at a max height of 11275?"],"info":{}}
{"id":"train_9231","question":"What is the participant and member of XI Jinping?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q15031 wdt:P1344 ?ans_1 . wd:Q15031 wdt:P463 ?ans_2 }","paraphrases":["Which organizations have Xi Jinping as a member?"],"info":{}}
{"id":"train_9232","question":"Were Vincent Pastore and Peter Onaorati cast in the film Goodfellas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q42047 wdt:P161 wd:Q512986 . wd:Q42047 wdt:P161 wd:Q328409 }","paraphrases":["Did Vincent Pastore and Peter Onaorati star in the movie Goodfellas?"],"info":{}}
{"id":"train_9233","question":"\"Which Label from Lars Ulrich, has the Date of Commencement Jan 1, 1929?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q106193 wdt:P264 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1929' ) ) }","paraphrases":["\"Which Label from Lars Ulrich, has the Date of Commencement Jan 1, 1929?\""],"info":{}}
{"id":"train_9234","question":"What derivative of platinum is named after Francis Louis Sperry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q880 wdt:P186 ?answer . ?answer wdt:P138 wd:Q27908788 }","paraphrases":["What subsidiary of platinum is named after Francis Louis Sperry?"],"info":{}}
{"id":"train_9235","question":"What sports team did Nicklas Lidstrom join in 1994?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q434200 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["When Nicklas Lidstrom became part of an athletic team in 1994, what team was it?"],"info":{}}
{"id":"train_9236","question":"What is a time of day that starts with the letter m.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1260524 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What's a time of day with letter m beginning."],"info":{}}
{"id":"train_9239","question":"Tell me mineral supergroup whose name has the word tourmalines in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3977918 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tourmalines' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know mineral supergroup whose title has the word tourmalines in it."],"info":{}}
{"id":"train_9241","question":"Name a Catholic cathedral dedicated to Virgin Mary that contains the word \"dame\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56242215 . ?sbj wdt:P825 wd:Q345 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dame' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a Catholic cathedral committed to Virgin Mary that contains the word \"woman\" in its name"],"info":{}}
{"id":"train_9242","question":"What is the LSWR 177 class 2-4-0WT} with the lowest number of cylinders whose instance of is LSWR 177 class 2-4-0WT ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12061393 . ?ent wdt:P1100 ?obj . ?ent wdt:P31 wd:Q12061393 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which LSWR 177 class 2-4*OWT has the lowest number of cylinders?"],"info":{}}
{"id":"train_9243","question":"Tell me time whose name has the word  prehistory in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11471 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'prehistory' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know time whose title has the word ancient times in it."],"info":{}}
{"id":"train_9247","question":"What is the leader of the nominee for of The Lavender Hill Mob ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1168531 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What is the pioneer of the candidate for of The Lavender Slope Swarm"],"info":{}}
{"id":"train_9248","question":"Who played the role of wizard in the Harry Potter universe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q8337 . ?sbj wdt:P31 wd:Q15298259 }","paraphrases":["Who played the part of wizard within the Harry Potter universe?"],"info":{}}
{"id":"train_9250","question":"When was Abigail Adams' child Charles Adams born, and when did he die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q5074968 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["When was Abigail Adams' Child Charles Adams born and die?"],"info":{}}
{"id":"train_9252","question":"How many electrical plug types are used for Saint Kitts and Nevis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q763 wdt:P2853 ?obj }","paraphrases":["Let me know the electrical plug types which are used for saint kitts and nevis?"],"info":{}}
{"id":"train_9253","question":"When did Pliny the Elder leave his position as Procurator?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q82778 p:P39 ?s . ?s ps:P39 wd:Q499165 . ?s pq:P582 ?value }","paraphrases":["On what date did the Procurator Pliny the Elder leave his job?"],"info":{}}
{"id":"train_9256","question":"Which Orly attach had the lowest amount of deaths?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q81672 . ?ent wdt:P1120 ?obj . ?ent wdt:P710 wd:Q30141823 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which Orly annex had the lowest death toll?"],"info":{}}
{"id":"train_9259","question":"Which is the CTHS person ID for François Quesnay?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q13575 wdt:P2383 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9262","question":"What is the Christian name for Peter Garrett, it is said to the same as Petelo","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q528907 wdt:P735 ?answer . ?answer wdt:P460 wd:Q18640816 }","paraphrases":["What is the Christian title for Dwindle Garrett, it is said to the same as Petelo"],"info":{}}
{"id":"train_9263","question":"What are the love deity which contains the word inanna in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1670614 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'inanna' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the affection god which contains the word inanna in their name"],"info":{}}
{"id":"train_9264","question":"When did country for sport of Michael Schumacher and start time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q9671 p:P1532 ?s . ?s ps:P1532 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["When did Michael Schumacher's sport country and start time?"],"info":{}}
{"id":"train_9267","question":"TELL ME INTERNATIONAL ORGANIZATION WHICH START WITH THE LETTER W.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q484652 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know Worldwide ORGANIZATION WHICH Begin WITH THE LETTER W."],"info":{}}
{"id":"train_9269","question":"What is the birth date of the book by Avenue Q?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q790583 wdt:P87 ?X . ?X wdt:P569 ?answer }","paraphrases":["What is the birth date of the book by Road Q?"],"info":{}}
{"id":"train_9270","question":"Was Michael Bloomberg a residence in Medford and Allston?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q607 wdt:P551 wd:Q54145 . wd:Q607 wdt:P551 wd:Q572788 }","paraphrases":["Did Michael Bloomberg live in Medford and Allston?"],"info":{}}
{"id":"train_9272","question":"Is Bhumibol Adulyadej the child of Sirikit and Chulabhorn Walailak?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q855252 wdt:P40 wd:Q164518 . wd:Q855252 wdt:P40 wd:Q1089410 }","paraphrases":["Are  Sirikit and Chulabhorn Walailak the parents of Bhumibol Adulyadej?"],"info":{}}
{"id":"train_9273","question":"Who is the {human} for {spouse} of {Sean Hannity}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q557730 wdt:P26 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {companion} of {Sean Hannity}"],"info":{}}
