{"id":"train_6590","question":"What time zone is Antarctica/Macquarie?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q51 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P518 wd:Q4771017 }","paraphrases":["What time is it in Antartica/Macquarie?"],"info":{}}
{"id":"train_6591","question":"What is the KMRB film rating of The Dark Knight?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q163872 wdt:P3818 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6593","question":"give me the name of determination method for Belo Horizonte has population as 2.50256e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42800 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '2.50256e+06' ) ) . ?s pq:P459 ?value }","paraphrases":["How was Belo Horizonte's population count of 2.50256e+06 determined?"],"info":{}}
{"id":"train_6596","question":"What is branch of developer of Julia set ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q848427 wdt:P61 ?X . ?X wdt:P241 ?answer }","paraphrases":["What is department of designer of Julia set ?"],"info":{}}
{"id":"train_6597","question":"Based on sourcing circumstances, when is Lysippos' birthday?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q192222 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1480 wd:Q5727902 }","paraphrases":["Lysippos (/laɪˈsɪpɒs/; Greek: Λύσιππος)[1] was a Greek sculptor of the 4th century BC. Together with Scopas and Praxiteles, he is considered one of the three greatest sculptors of the Classical Greek era, bringing transition into the Hellenistic period. Problems confront the study of Lysippos because of the difficulty of identifying his style among the copies which survive. Not only did he have a large workshop and a large number of disciples in his immediate circle,[2] but there is understood to have been a market for replicas of his work, supplied from outside his circle, both in his lifetime and later in the Hellenistic and Roman periods.[3] The Victorious Youth or Getty bronze, which resurfaced around 1972, has been associated with him."],"info":{}}
{"id":"train_6598","question":"What is BVMC id of Málaga?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q8851 wdt:P4098 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6599","question":"tell  me province of China that capital Chengdu  starts with letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1615742 . ?sbj wdt:P36 wd:Q30002 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tell me province of China that capital Chengdu starts with letter s"],"info":{}}
{"id":"train_6600","question":"Tell me the road bridge that contains the word 'bridge' in its name and that is designed by Joseph Strauss","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q537127 . ?sbj wdt:P287 wd:Q261174 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'bridge' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the street bridge that contains the word 'bridge' in its name and that is designed through Joseph Strauss"],"info":{}}
{"id":"train_6601","question":"What is the structure built at Olympia that has the geographical coordinates of 2.35183?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q737062 wdt:P1071 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '2.35183' ) ) }","paraphrases":["What is the shape built at Olympia that has the geographical coordinates of 2.35183?"],"info":{}}
{"id":"train_6602","question":"Name an international football competition  that starts in November and contains the word \"cup\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34542827 . ?sbj wdt:P4794 wd:Q125 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'cup' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an international football competition that starts in November and contains the word \"cup\" in its name"],"info":{}}
{"id":"train_6603","question":"What is the game artist for Naoto Ohshima?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3080 wd:Q658384 }","paraphrases":[],"info":{}}
{"id":"train_6604","question":"On which series of Appetite for Destruction is Paradise City?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q270690 p:P658 ?s . ?s ps:P658 wd:Q843032 . ?s pq:P1545 ?value }","paraphrases":["On Appetite for Destruction, Paradise City is in what series?"],"info":{}}
{"id":"train_6605","question":"DOES THE PRESSURE OF THE MARK 91 LESS THAN 2206.4","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q39997381 wdt:P2077 ?obj filter ( ?obj < 2206.4 ) }","paraphrases":["What is th pressure of Mark 91?"],"info":{}}
{"id":"train_6606","question":"What was Burt Lancaster nominated for in 1953?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q160528 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1953' ) ) }","paraphrases":["nominated in 1953, what was the title of Burt Lancaster?"],"info":{}}
{"id":"train_6607","question":"What is  in the GLAM Identifier of Kunsthaus Zürich ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q685038 wdt:P3066 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6608","question":"What award did Dilip Kumar receive in 1994?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q377789 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["Dilip Kumar won which award in 1994?"],"info":{}}
{"id":"train_6609","question":"What number of households did a census, as a determination method, find in Tifariti?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2360337 p:P1538 ?s . ?s ps:P1538 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["What determination method defined the number of households in a census for Tifariti?"],"info":{}}
{"id":"train_6611","question":"How many high ways systems are there in the  {Interstate Highway System} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P16 wd:Q94247 }","paraphrases":["The Interstate Highway System contains what number of high way systems?"],"info":{}}
{"id":"train_6613","question":"How many commemorates were given to Giuseppe Garibaldi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P547 wd:Q539 }","paraphrases":["How many celebrations were held for Giuseppe Garibaldi?"],"info":{}}
{"id":"train_6617","question":"How can Juneau's population of 31,275 be counted?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q29445 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '31275.0' ) ) . ?s pq:P459 ?value }","paraphrases":["What methods can be used to calculate Juneau's population of 31,275 people?"],"info":{}}
{"id":"train_6618","question":"What are the people which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2472587 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the individuals which begin with the letter w"],"info":{}}
{"id":"train_6621","question":"What films have been shot in Yokohama?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q38283 wdt:P1740 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["What movies were filmed in Yokohama?"],"info":{}}
{"id":"train_6624","question":"Is the total liability of the Humana equal to 14711000000 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q910866 wdt:P2138 ?obj filter ( ?obj = 14711000000 ) }","paraphrases":["Some say the total liability of the Himana is equal to 14711000000 , is this correct?"],"info":{}}
{"id":"train_6628","question":"What was the unemployment rate in Germany as of March 1, 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8046 p:P1198 ?s . ?s ps:P1198 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["As of March 1, 2014, what was the unemployment rate in Germany?"],"info":{}}
{"id":"train_6629","question":"What is Julius Wellhausen's Marburger Professorenkatalog ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q76897 wdt:P3187 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6630","question":"What is next to Almeria and has 4288.0 inhabitants?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10400 wdt:P47 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '4288.0' ) ) }","paraphrases":["What's next to Almeria and has a population of 4288.0?"],"info":{}}
{"id":"train_6637","question":"Which is the magazine that has Jann Wenner as an editor and starts with the letter r?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41298 . ?sbj wdt:P98 wd:Q519143 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the journal that has Jann Wenner as an editor and starts offevolved with the letter r?"],"info":{}}
{"id":"train_6638","question":"Is the median income of the United Kingdom less than 25293.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q145 wdt:P3529 ?obj filter ( ?obj < 25293.6 ) }","paraphrases":["Is 25293.6 greater than the median income of the UK?"],"info":{}}
{"id":"train_6640","question":"What college did Aleksandr Solzhenitsyn go to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34474 wdt:P69 ?X . ?X wdt:P3761 ?answer }","paraphrases":["What school did Aleksandr Solzhenitsyn go to?"],"info":{}}
{"id":"train_6643","question":"Which international governing body governs association football?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2736 wdt:P797 ?obj . ?obj wdt:P31 wd:Q11422536 }","paraphrases":["Which universal overseeing body oversees affiliation football?"],"info":{}}
{"id":"train_6644","question":"Since when has Joseph Lyons been a member of the Australian House of Representatives?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q370966 p:P39 ?s . ?s ps:P39 wd:Q18912794 . ?s pq:P580 ?value }","paraphrases":["Give the date Joseph Lyons became a member of the Australian House of Representative."],"info":{}}
{"id":"train_6645","question":"Who is the owner of the Society of Jesus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q36380 wdt:P749 ?ans_1 . wd:Q36380 wdt:P1830 ?ans_2 }","paraphrases":["Who is the proprietor of the Society of Jesus?"],"info":{}}
{"id":"train_6647","question":"What is the waterfall for Lewis and Clark Expedition?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q505802 wdt:P276 ?obj . ?obj wdt:P31 wd:Q34038 }","paraphrases":["What is the cascade for Lewis and Clark Expedition?"],"info":{}}
{"id":"train_6648","question":"Tell me newspaper whose name has the word şalom in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11032 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'şalom' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know daily paper whose title has the word şalom in it."],"info":{}}
{"id":"train_6649","question":"Who are the sons of Alphonse Mucha, who is the daughter of Marie Chytilová?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q146691 wdt:P40 ?answer . ?answer wdt:P25 wd:Q15111563 }","paraphrases":["Who are the children of Alphonse Mucha, who is the girl of Marie Chytilová?"],"info":{}}
{"id":"train_6650","question":"When did J.K. Rowling receive the Andre Norton Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q34660 p:P166 ?s . ?s ps:P166 wd:Q285568 . ?s pq:P585 ?value }","paraphrases":["What year did J.K Rowling recieve the Andre Norton Award?"],"info":{}}
{"id":"train_6651","question":"What astronaut mission did Gordon Cooper use the Gemini spacecraft for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q312833 wdt:P450 ?obj . ?obj wdt:P31 wd:Q831109 }","paraphrases":["What space traveler mission did Gordon Cooper utilize the Gemini shuttle for?"],"info":{}}
{"id":"train_6652","question":"Mention the year span in which Ruhollah Khomeini married and lasted with Khadijeh Saqafi","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q38823 p:P26 ?s . ?s ps:P26 wd:Q686560 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["How long where Ruhollah Khomeini and Khadijeh Saqafi married in years?"],"info":{}}
{"id":"train_6654","question":"What skyscraper did architect Zaha Hadid design?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P84 wd:Q47780 . ?sbj wdt:P31 wd:Q11303 }","paraphrases":["What high rise did planner Zaha Hadid design?"],"info":{}}
{"id":"train_6655","question":"Is the clock speed of GP32 equal to 106.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q426119 wdt:P2149 ?obj filter ( ?obj = 106.4 ) }","paraphrases":["Is the clock speed of GP32 break even with to 106.4?"],"info":{}}
{"id":"train_6656","question":"What nomination for prizewinner Lester B. Pearson was received of D.T. Suzuki?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44847 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q128604 }","paraphrases":["What nomination for prizewinner Lester B. Pearson was once acquired of D.T. Suzuki?"],"info":{}}
{"id":"train_6658","question":"Which is the part of the orchestra?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P361 wd:Q42998 }","paraphrases":[],"info":{}}
{"id":"train_6659","question":"Steward Brand is a board member of what?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3320 wd:Q971994 }","paraphrases":[],"info":{}}
{"id":"train_6660","question":"What business does CBS participate in and what materials do they produce?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1056 wd:Q43380 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["What commerce does CBS take an interest in and what materials do they produce?"],"info":{}}
{"id":"train_6661","question":"What award did Michael Gough achieve in 1979?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q299302 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1979' ) ) }","paraphrases":["What prize did Michale Gough receive in 1979?"],"info":{}}
{"id":"train_6662","question":"Birth place of Elizabeth Wurtzel has a population of 152056.0.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q442854 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '152056.0' ) ) }","paraphrases":["Birth location of Elizabeth Wurtzel has a populace of 152056.0."],"info":{}}
{"id":"train_6666","question":"What are Wilt Chamberlain's winning statistics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3279 wd:Q182455 }","paraphrases":["What are Wilt Chamberlain's victorious figures?"],"info":{}}
{"id":"train_6667","question":"How many lines are connecting the Acela Express} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P81 wd:Q481759 }","paraphrases":["The Acela Express has now many lines connecting to it?"],"info":{}}
{"id":"train_6669","question":"When was John F. Kennedy the United States representative?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9696 p:P39 ?s . ?s ps:P39 wd:Q13218630 . ?s pq:P582 ?value }","paraphrases":["What date was John F. Kennedy a United States representative?"],"info":{}}
{"id":"train_6671","question":"Is the partition coefficient water/octanol of acetic acid equal to -0.17?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47512 wdt:P2993 ?obj filter ( ?obj = -0.17 ) }","paraphrases":["Is the water / octanol acetic acid partition coefficient equal to -0.17?"],"info":{}}
{"id":"train_6672","question":"What's buried at Jean Pierre Boyer's on the street?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q449421 wdt:P119 ?X . ?X wdt:P669 ?answer }","paraphrases":["What's buried at Jean Pierre Boyer's on the street?"],"info":{}}
{"id":"train_6673","question":"What is the script of the language that Hans Kelsen speaks?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q84165 wdt:P1412 ?X . ?X wdt:P282 ?answer }","paraphrases":["What is the script of the dialect that Hans Kelsen speaks?"],"info":{}}
{"id":"train_6675","question":"Whar are the months that compose winter ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1311 wdt:P2922 ?obj . ?obj wdt:P31 wd:Q47018901 }","paraphrases":["Whar are the months that compose winter ?"],"info":{}}
{"id":"train_6677","question":"What natural language has been influenced by English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1860 wdt:P737 ?obj . ?obj wdt:P31 wd:Q33742 }","paraphrases":["What characteristic dialect has been impacted by English?What characteristic dialect has been impacted by English?"],"info":{}}
{"id":"train_6679","question":"Which is the US National Archives Identifier for scouts?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q872181 wdt:P1225 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6680","question":"Which is the BoxRec ID for Mickey Rourke?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q178552 wdt:P1967 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6682","question":"what is summit  located on astronological body of reykholt","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24065207 wdt:P376 ?X . ?X wdt:P610 ?answer }","paraphrases":["what is summit found on astronological body of reykholt"],"info":{}}
{"id":"train_6683","question":"Which is the standards organization that is affiliated with United Nations Economic and Social Council that contains the word international in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1328899 . ?sbj wdt:P1416 wd:Q170075 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'international' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the benchmarks organization that's associated with Joined together Countries Financial and Social Chamber that contains the word worldwide in it's name?"],"info":{}}
{"id":"train_6684","question":"What is the taxon common name of hoatzin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q188660 wdt:P1843 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6686","question":"Which is the enclosure of the dome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3158 wd:Q12493 }","paraphrases":[],"info":{}}
{"id":"train_6687","question":"Which is the church building for religion of the United Methodist Church?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P140 wd:Q329646 . ?sbj wdt:P31 wd:Q16970 }","paraphrases":["Which is the church building for religion of the Joined together Methodist Church?"],"info":{}}
{"id":"train_6688","question":"Tell me the association football sport FA Cup Final with the lowest attendance.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4484477 . ?ent wdt:P1110 ?obj . ?ent wdt:P641 wd:Q2736 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the association football sport FA Cup Final with the lowest attendance?"],"info":{}}
{"id":"train_6689","question":"When did Septimius Severus's reign as Roman Emperor end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1442 p:P39 ?s . ?s ps:P39 wd:Q842606 . ?s pq:P582 ?value }","paraphrases":["Regarding the Roman Emperor, what was the time that Septimius Severu's reign ended?"],"info":{}}
{"id":"train_6691","question":"What are the image compression which start with the letter g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q412438 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What image compression starts with \"g\"?"],"info":{}}
{"id":"train_6692","question":"At which point in time, Pat Summit has received the USBWA award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q460394 p:P166 ?s . ?s ps:P166 wd:Q23055174 . ?s pq:P585 ?value }","paraphrases":["Pat Summit received the USBWA award at what time?"],"info":{}}
{"id":"train_6693","question":"Who is nominated for the time of 2001-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q316246 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["What were the nominations at the beginning of 2001?"],"info":{}}
{"id":"train_6694","question":"What animated film did Ellen DeGeneres do voice acting?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P725 wd:Q483325 . ?sbj wdt:P31 wd:Q202866 }","paraphrases":["What energized film did Ellen DeGeneres do voice acting?"],"info":{}}
{"id":"train_6697","question":"Where did W.H. Auden go to college, and what was his major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q178698 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["Where did W.H. Auden go to college, and what was his major?"],"info":{}}
{"id":"train_6698","question":"What software uses Hebrew language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q9288 . ?sbj wdt:P31 wd:Q218616 }","paraphrases":["What computer program employments Hebrew language?"],"info":{}}
{"id":"train_6699","question":"Tell me hole whose name has the word depletion in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20204151 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'depletion' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know gap whose title has the word exhaustion in it."],"info":{}}
{"id":"train_6700","question":"What is located in the administrative territorial entity and capital of Lagos?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q8673 wdt:P131 ?ans_1 . wd:Q8673 wdt:P1376 ?ans_2 }","paraphrases":["What is found within the authoritative regional substance and capital of Lagos?"],"info":{}}
{"id":"train_6702","question":"What are the philosophical concept which start with the letter übermensch","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33104279 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'übermensch' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the philosophical concept which begin with the letter übermensch"],"info":{}}
{"id":"train_6703","question":"Richard Dawkins is influenced by which generalization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P737 wd:Q44461 . ?sbj wdt:P31 wd:Q170084 }","paraphrases":["Which generalization is Richard Dawkins known for?"],"info":{}}
{"id":"train_6704","question":"Who is the child of Charlemagne and when did he died?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P570 ?value1 . }","paraphrases":["Who is the child of Charlemagne and when did he kicked the bucket?"],"info":{}}
