{"id":"train_0","question":"What periodical literature does Delta Air Lines use as a moutpiece?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q188920 wdt:P2813 ?obj . ?obj wdt:P31 wd:Q1002697 }","paraphrases":["What is Delta Air Line's periodical literature mouthpiece?"],"info":{}}
{"id":"train_1","question":"Who is the child of Ranavalona I's husband?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q169794 wdt:P26 ?X . ?X wdt:P22 ?answer }","paraphrases":["What is the name of Ranavalona I's husband's child?"],"info":{}}
{"id":"train_4","question":"Which is the operating income for Qantas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q32491 wdt:P3362 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5","question":"which cola starts with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134041 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which cola begins with the letter p"],"info":{}}
{"id":"train_6","question":"Is the right ascension of malin 1 less than 15.1398?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4180017 wdt:P6257 ?obj filter ( ?obj < 15.1398 ) }","paraphrases":["Does malin 1 have a right ascension lower than 15.1398?"],"info":{}}
{"id":"train_8","question":"What's Mary Lou Retton's International Olympic Committee athlete ID.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q235975 wdt:P3171 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11","question":"Tell me the female beauty pageant that operates in all countries and contains the word model in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q58863414 . ?sbj wdt:P2541 wd:Q62900839 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'model' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the female splendor festival that operates in all countries and contains the phrase model in it is name?"],"info":{}}
{"id":"train_13","question":"When position did Angela Merkel hold on November 10, 1994?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q567 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["On November 10, 1994, what was Angela Merkel's role?"],"info":{}}
{"id":"train_19","question":"After what is Marathon named and what is the current record?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q40244 wdt:P1000 ?ans_1 . wd:Q40244 wdt:P138 ?ans_2 }","paraphrases":["why Marathon had this name and the current record is?"],"info":{}}
{"id":"train_21","question":"What did Clifton Chenier get nominated for in 1983-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1101377 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1983' ) ) }","paraphrases":["In 1983, what nomination did Clifton Chenier receive?"],"info":{}}
{"id":"train_22","question":"Which is the wear for Ambrose Burnside?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q355444 wdt:P3828 ?answer }","paraphrases":[],"info":{}}
{"id":"train_24","question":"What is the material used and approved by Mojito?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q487338 wdt:P186 ?ans_1 . wd:Q487338 wdt:P790 ?ans_2 }","paraphrases":["What is the material used and accredited by means of Mojito?"],"info":{}}
{"id":"train_25","question":"Could you summarize Korea's history of this topic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q18097 wdt:P2184 ?obj . ?obj wdt:P31 wd:Q17544377 }","paraphrases":["In this topic, give a summary of Korea's history"],"info":{}}
{"id":"train_27","question":"Is Kevin Costner owner of Fielders Stadium?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q11930 wdt:P1830 wd:Q5447154 }","paraphrases":["Is the Fielders Stadium owned by Kevin Costner?"],"info":{}}
{"id":"train_29","question":"What is a skill that starts with the letter s.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q205961 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a aptitude that begins with the letter s."],"info":{}}
{"id":"train_31","question":"What award did Danila Kozlovsky receive in 2017?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3015088 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2017' ) ) }","paraphrases":["What award did Danila Kozlovsky get in 2017?"],"info":{}}
{"id":"train_32","question":"Who is the student that coined the Euler-Lagrange equation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q875744 wdt:P61 ?X . ?X wdt:P802 ?answer }","paraphrases":["Who is the understudy that coined the Euler-Lagrange equation?"],"info":{}}
{"id":"train_35","question":"Who is the person that was a student of Ivan Pavlov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q42985 wdt:P1066 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the person Ivan Pavlov's student?"],"info":{}}
{"id":"train_36","question":"is the clock speed of the Watara Supervision smaller than 3.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q732683 wdt:P2149 ?obj filter ( ?obj < 3.2 ) }","paraphrases":["is the clock speed of the Watara Supervision littler than 3.2?"],"info":{}}
{"id":"train_38","question":"Who works for the accused Mariposa Folk Festival 1974?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q54554872 wdt:P710 ?X . ?X wdt:P108 ?answer }","paraphrases":["The accused Mariposa Folk Festival in 1974 employed whom?"],"info":{}}
{"id":"train_39","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q65 wdt:P47 ?obj . ?obj wdt:P31 wd:Q123705 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_40","question":"What sister city was born in of Zakhar Oskotsky?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4338004 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["Which sister city in Zakhar Oskotsky was born?"],"info":{}}
{"id":"train_41","question":"Tell me the name of a fantastique genre that starts with the letter s.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20076756 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the title of a fantastique sort that begins with the letter s."],"info":{}}
{"id":"train_43","question":"What is the musical score by Missa Solemnis that has mother Maria Magdalena van Beethoven?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q723790 wdt:P86 ?answer . ?answer wdt:P25 wd:Q14507972 }","paraphrases":["What is the musical rating by means of Missa Solemnis that has mother Maria Magdalena van Beethoven?"],"info":{}}
{"id":"train_44","question":"When did Robert De Niro reside in Marbletown?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36949 p:P551 ?s . ?s ps:P551 wd:Q3708911 . ?s pq:P585 ?value }","paraphrases":["When did Robert De Nirolive in Marbletown?"],"info":{}}
{"id":"train_45","question":"Tell me organization whose name has the word  zollkriminalamt  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43229 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zollkriminalamt' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know organization whose title has the word zollkriminalamt in it."],"info":{}}
{"id":"train_46","question":"Which member state of the International Centre for Settlement of Investment Disputes has the maximum inflation rate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7275 . ?ent wdt:P1279 ?obj . ?ent wdt:P463 wd:Q899770 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which country in the International Centre for Settlement of Investment Disputes has the highest inflation rate?"],"info":{}}
{"id":"train_47","question":"Was Brittany Murphy a citizen of the USA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q168847 wdt:P27 wd:Q30 }","paraphrases":["Did Brittany Murphy have USA citizenship?"],"info":{}}
{"id":"train_52","question":"When was Pablo Picasso's partnership with Fernade Oliver over?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5593 p:P451 ?s . ?s ps:P451 wd:Q453775 . ?s pq:P582 ?value }","paraphrases":["On what date did Pablo Picasso end his partnership with Fernade Oliver?"],"info":{}}
{"id":"train_54","question":"What are the coordinates for the geographic center of Michigan, as determined by the center of gravity of the surface?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1166 p:P5140 ?s . ?s ps:P5140 ?obj . ?s pq:P459 wd:Q53329492 }","paraphrases":["Where is the geographic center of Michigan using the gravity center of the surface?"],"info":{}}
{"id":"train_55","question":"Is the life expectancy of Indonesia 55.3528?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q252 wdt:P2250 ?obj filter ( ?obj = 55.3528 ) }","paraphrases":["In Indonesia, is the average life expectancy 55.3528?"],"info":{}}
{"id":"train_57","question":"What kind of career does Grigori Kozintsev have in the screenwriting field?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q553072 wdt:P106 ?answer . ?answer wdt:P425 wd:Q3429919 }","paraphrases":["What kind of career in the screenwriting field does Grigori Kozintsev have?"],"info":{}}
{"id":"train_58","question":"what is hypothetical protein ecia139-4120 habitat of found in species?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q22226273 wdt:P703 ?X . ?X wdt:P2974 ?answer }","paraphrases":["Which species is the ecia139-4120 protein found in?"],"info":{}}
{"id":"train_63","question":"When did Nicaragua count a population of 3.87732e+06 inhabitants?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q811 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '3.87732e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["In what year was Nicaragua's population 3.87732 million?"],"info":{}}
{"id":"train_64","question":"What does emigration mean?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P805 wd:Q187668 }","paraphrases":[],"info":{}}
{"id":"train_65","question":"Which is the meta-organization that is regulated by the football association?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2736 wdt:P3719 ?obj . ?obj wdt:P31 wd:Q37178026 }","paraphrases":["The football association regulates what organization?"],"info":{}}
{"id":"train_66","question":"When was the spouse divorced Nero in 9-6-68","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1413 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( ?x , '68-6-9' ) ) }","paraphrases":["When was the companion separated Nero in 9-6-68?"],"info":{}}
{"id":"train_67","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P747 wd:Q29334 . ?sbj wdt:P31 wd:Q47461344 }","paraphrases":["Not applicable"],"info":{}}
{"id":"train_68","question":"Former champion Francisco Alarcon gave what award to Art Spiegelaman?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q325945 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q5484051 }","paraphrases":["Former champion Francisco Alarcon gave what award to Art Spiegelaman?"],"info":{}}
{"id":"train_69","question":"Are there more than 0 survivors of the Charkhi Dadri mid-air collision","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q118373 wdt:P1561 ?obj filter ( ?obj = 0 ) }","paraphrases":["Are there more than survivors of the Charkhi Dadri mid-air collision"],"info":{}}
{"id":"train_70","question":"When did Secretariat receive the Triple Crown Trophy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1151926 p:P166 ?s . ?s ps:P166 wd:Q7843370 . ?s pq:P585 ?value }","paraphrases":["On what date was Triple Crown Trophy given to Secretariat?"],"info":{}}
{"id":"train_71","question":"Which borders of borders of Riverside have a start date of 1984-0-0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49243 wdt:P47 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["Which borders of borders of Riverside have a begin date of 1984-0-0?"],"info":{}}
{"id":"train_72","question":"Which is the facility of the defensive wall?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P912 wd:Q57346 }","paraphrases":[],"info":{}}
{"id":"train_74","question":"Which is the fictional analog of Hippocampus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1074 wd:Q74363 }","paraphrases":[],"info":{}}
{"id":"train_75","question":"What is a cause of death that begins with the letter \"p\" and can be found on a CT scan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1931388 . ?sbj wdt:P923 wd:Q32566 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a purpose of dying that begins with the letter \"p\" and can be located on a CT scan?"],"info":{}}
{"id":"train_81","question":"What method did the census use to determine the population of Taguig?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1643 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["wich method was used by the census to determine the population of Taguig?"],"info":{}}
{"id":"train_82","question":"What award did Olga Tokarczuk receive in 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q254032 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["Olga Tokarczuk was the winner of what award in 2015?"],"info":{}}
{"id":"train_83","question":"What is Porky Pig in right now?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q937186 wdt:P1441 ?answer }","paraphrases":[],"info":{}}
{"id":"train_86","question":"What is {located next to Quincy,} in the {novel, Infinite Jest}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1077445 wdt:P840 ?answer . ?answer wdt:P47 wd:Q49143 }","paraphrases":["What is {located next to Quincy,} in the {novel, Infinite Jest}?"],"info":{}}
{"id":"train_87","question":"Who awarded Eric Hobsbawm an honorary doctorate?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q34933 p:P166 ?s . ?s ps:P166 wd:Q11415564 . ?s pq:P1027 ?value }","paraphrases":["Eric Hobsbawm was presented with an honorary doctorate by what institution?"],"info":{}}
{"id":"train_89","question":"Give me a film character from a fictional universe, such as Marvel comics that starts with a W.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15773347 . ?sbj wdt:P1080 wd:Q931597 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me a movie personality from a fictional universe, such as Marvel comics that starts with a W."],"info":{}}
{"id":"train_90","question":"Mention the fictional universe described or included in The Matrix.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1445 wd:Q83495 . ?sbj wdt:P31 wd:Q559618 }","paraphrases":["Say the anecdotal universe depicted or included within The Framework."],"info":{}}
{"id":"train_91","question":"What is {award received} of {Hans Krebs} where {point in time} is {1966-0-0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q57191 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1966' ) ) }","paraphrases":["What is {grant gotten} of {Hans Krebs} where {point in time} is {1966-0-0} ?"],"info":{}}
{"id":"train_92","question":"Which record label signed Janet Jackson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q131324 wdt:P264 ?obj . ?obj wdt:P31 wd:Q18127 }","paraphrases":["What is the record label signed by Janet Jackson?"],"info":{}}
{"id":"train_94","question":"Does the slope rating of the Merion Golf Club equal 149","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3962734 wdt:P3840 ?obj filter ( ?obj = 149 ) }","paraphrases":["Is the slope rating of the Merion Golf Club 149?"],"info":{}}
{"id":"train_95","question":"What is the density of hydrogen peroxide at a temperature of 20.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q171877 p:P2054 ?s . ?s ps:P2054 ?obj . ?s pq:P2076 ?x filter ( contains ( ?x , '20.0' ) ) }","paraphrases":["What is hydrogen peroxide's density at twenty degrees?"],"info":{}}
{"id":"train_97","question":"Which { meansseason starts} in {February} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4794 wd:Q109 }","paraphrases":[],"info":{}}
{"id":"train_98","question":"Who is {champ} of {prize awarded} {Lily Tomlin} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q229271 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who is {champ} of {prize granted} {Lily Tomlin} ?TARD ?"],"info":{}}
{"id":"train_99","question":"What is the ammunition of the weapon, that has been used in the war in Southeast Asia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q864060 wdt:P739 ?answer . ?answer wdt:P607 wd:Q8740 }","paraphrases":["What is the ammunition of the weapon, that has been used in the conflict in Southeast Asia?"],"info":{}}
{"id":"train_100","question":"Tell me every horse breed whose name starts with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1160573 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me each and every horse breed whose identify begins with the letter z"],"info":{}}
{"id":"train_102","question":"Who is the brother in law of the writer Quran?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q428 wdt:P50 ?X . ?X wdt:P1038 ?answer }","paraphrases":["Give me the name of the brother in law of the writer of Quran."],"info":{}}
{"id":"train_103","question":"What is the New Zealand Gazetteer place id for Auckland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q37100 wdt:P5104 ?answer }","paraphrases":[],"info":{}}
{"id":"train_105","question":"Name an empire that contains the word \"british\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q48349 . ?sbj wdt:P237 wd:Q165762 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'british' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title an realm that contains the word \"british\" in its name"],"info":{}}
{"id":"train_106","question":"What is the instance of Antonio da Correggio whose date of birth is 1489-8-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8457 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( YEAR ( ?x ) , '1489' ) ) . ?s pq:P31 ?value }","paraphrases":["Give me the instance of Antonio da Correggio, whose birthdate is 1489-8-1?"],"info":{}}
{"id":"train_108","question":"What is the SANDRE ID for Rhine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q584 wdt:P1717 ?answer }","paraphrases":[],"info":{}}
{"id":"train_110","question":"What business does Alexander McQueen have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q207939 wdt:P108 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":["What's the name of Alexander McQueen's business?"],"info":{}}
{"id":"train_112","question":"Who organizes the order of Ultima III: Exodus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2240236 wdt:P179 ?X . ?X wdt:P479 ?answer }","paraphrases":["Who organizes the arrange of Ultima III: Departure?"],"info":{}}
{"id":"train_114","question":"Mention the musical related work highlighting the work of Sasha Grey.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2709 wdt:P3919 ?obj . ?obj wdt:P31 wd:Q9212979 }","paraphrases":["Say the melodic related work highlighting the work of Sasha Grey."],"info":{}}
{"id":"train_115","question":"What award did John de Mol receive in 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q470847 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["in 2011 John de Mol won which award?"],"info":{}}
{"id":"train_117","question":"When will the pressure and temperature of water reach the triple point stage?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q106410 . ?s pq:P2077 ?value1 . ?s pq:P2076 ?value2 }","paraphrases":["When does the temperature and pressure of water hit the triple point stage?"],"info":{}}
{"id":"train_118","question":"Tell me physical phenomenon whose name has the word surface in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1293220 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'surface' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know physical marvel whose title has the word surface in it."],"info":{}}
{"id":"train_119","question":"where does Vladimir putin reside?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q7747 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P2046 ?value1 . }","paraphrases":["where does Vladimir putin reside?"],"info":{}}
{"id":"train_124","question":"Mention the temperature and the state of the matter of water upon achieving the critical point","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q111059 . ?s pq:P2076 ?value1 . ?s pq:P515 ?value2 }","paraphrases":["What is the temperature and state of matter of water when it reaches the critical point?"],"info":{}}
{"id":"train_125","question":"which is the point time for syria has population as 8.08815e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q858 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '8.08815e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["which is the point time for syria has populace as 8.08815e+06?"],"info":{}}
{"id":"train_127","question":"WHICH IS THE STAGE RACE WITH THE MAXIMUM FREQUENCY OF EVENT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1318941 . ?ent wdt:P2257 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["WHAT IS THE MAXIMUM FREQUENCY OF EVENT RACE"],"info":{}}
{"id":"train_128","question":"WHICH IS THE AUSTRIAN MUNICIPALITY KEY OF  KLAGENFURT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41753 wdt:P964 ?answer }","paraphrases":[],"info":{}}
{"id":"train_129","question":"Tell me the autonomous region of the People's Republic of China which contains the word xinjiang in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q57362 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'xinjiang' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the self sustaining area of the People's Republic of China which consists of the phrase xinjiang in it's name?"],"info":{}}
