{"id":"train_1603","question":"Who is profession's field is musician having a timeline of topic of history of music?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q639669 wdt:P425 ?answer . ?answer wdt:P2184 wd:Q846047 }","paraphrases":["Who is profession's field is performer having a timeline of subject of history of music?"],"info":{}}
{"id":"train_1606","question":"When did Oliver Sacks move to New York City?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q258662 p:P551 ?s . ?s ps:P551 wd:Q60 . ?s pq:P580 ?value }","paraphrases":["Tell me when Oliver Sacks moved to the Big Apple."],"info":{}}
{"id":"train_1607","question":"Name the musical instrument used in song Face to the Sky song","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14951082 wdt:P676 ?X . ?X wdt:P1303 ?answer }","paraphrases":["Title the melodic instrument utilized in tune Confront to the Sky song"],"info":{}}
{"id":"train_1609","question":"What is the biomedical measurement for the medical condition treated by phenol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q130336 wdt:P2175 ?obj . ?obj wdt:P31 wd:Q42014143 }","paraphrases":["What is the biomedical estimation for the restorative condition treated by phenol?"],"info":{}}
{"id":"train_1611","question":"Which institution has over nineteen thousand students?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11942 p:P2196 ?s . ?s ps:P2196 ?x filter ( contains ( ?x , '19233.0' ) ) . ?s pq:P813 ?value }","paraphrases":["What school has an enrollment of over 19,000?"],"info":{}}
{"id":"train_1612","question":"who is the empire for diplomatic relation of ottoman empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12560 wdt:P530 ?obj . ?obj wdt:P31 wd:Q48349 }","paraphrases":["For the ottoman empire who is the empire for diplomatic relation"],"info":{}}
{"id":"train_1613","question":"What is the founder of the located in of The Parnassus ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2715152 wdt:P276 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who is the founder of the location of The Parnassus?"],"info":{}}
{"id":"train_1614","question":"Who are the writers of Mahabharata with children in Dhritarashtra?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8276 wdt:P50 ?answer . ?answer wdt:P40 wd:Q926150 }","paraphrases":["Who are the scholars of Mahabharata with children in Dhritarashtra?"],"info":{}}
{"id":"train_1618","question":"What is the weapon model with the maximum rate of fire whose subclass of is naval artillery?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15142894 . ?ent wdt:P3792 ?obj . ?ent wdt:P279 wd:Q511450 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What weapon has the highest rate of fire in naval artillery?"],"info":{}}
{"id":"train_1619","question":"Which is the religion text that has as an edition that of King James Version?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P747 wd:Q623398 . ?sbj wdt:P31 wd:Q179461 }","paraphrases":["What religious text has a King James Version edition?"],"info":{}}
{"id":"train_1621","question":"What award did Karl von Frisch receive in 1921?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q60060 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1921' ) ) }","paraphrases":["In 1921, Karl von Firsch won what award?"],"info":{}}
{"id":"train_1622","question":"Who is the discoverer of runes that has a girlfriend in Gunnloo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q82996 wdt:P61 ?answer . ?answer wdt:P451 wd:Q166380 }","paraphrases":["Who is the pioneer of runes that incorporates a sweetheart in Gunnloo?"],"info":{}}
{"id":"train_1623","question":"When did Anne Hathaway begin attending New York University and when did she graduate?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q36301 p:P69 ?s . ?s ps:P69 wd:Q49210 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["When did Anne Hathaway start going to Unused York College and when did she graduate?"],"info":{}}
{"id":"train_1624","question":"which public educational institution of the United States starts with letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23002039 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which U.S. public educational institution begins with letter u"],"info":{}}
{"id":"train_1626","question":"Is the earthquake magnitude on the Richter magnitude scale of the 2000 Yunnan earthquake more than 7.08?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4598012 wdt:P2528 ?obj filter ( ?obj > 7.08 ) }","paraphrases":["In 2000, Yunnan suffered from an earthquake; was it's magnitude according to the Richter magnitude scale more than 7.08?"],"info":{}}
{"id":"train_1628","question":"What part of Songhua River is located at 127.224?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q210326 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '127.224' ) ) . ?s pq:P518 ?value }","paraphrases":["coordinates 127.224 is what part of the songhua river?"],"info":{}}
{"id":"train_1629","question":"Name the appointment cause and the halt reason for Eugenio Montale while serving as a senatore a vita","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q83174 p:P39 ?s . ?s ps:P39 wd:Q826589 . ?s pq:P748 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["what was the appointment cause for eugenio montale while serving as a senatore a vita and what was the halt reason"],"info":{}}
{"id":"train_1631","question":": What are the Cyprinus rubrofuscus which start with the letter k","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3246258 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'k' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":[": What are the Cyprinus rubrofuscus which begin with the letter k"],"info":{}}
{"id":"train_1632","question":"Is the perimeter of Lai Lung .11?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q682014 wdt:P2547 ?obj filter ( ?obj = 0.11 ) }","paraphrases":["Is 0.11 the perimeter of Lai Lung?"],"info":{}}
{"id":"train_1633","question":"Are the number of cases of the yellow fever equal to 136000.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q154874 wdt:P1603 ?obj filter ( ?obj = 136000.0 ) }","paraphrases":["Does the number of cases of yellow fever equal 136000.0?"],"info":{}}
{"id":"train_1634","question":"The antiparticle of an elementary particle is what premium particle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43116 wdt:P2152 ?obj . ?obj wdt:P31 wd:Q22675015 }","paraphrases":["What premium particle is the opposite of an elementary particle"],"info":{}}
{"id":"train_1635","question":"Who are the kids of Shiva whose life partner is Devasena?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11378 wdt:P40 ?answer . ?answer wdt:P26 wd:Q27957747 }","paraphrases":["Who are the kids of Shiva whose life accomplice is Devasena?"],"info":{}}
{"id":"train_1636","question":"When was Daniel Ellsberg granted the American Book Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q431085 p:P166 ?s . ?s ps:P166 wd:Q463606 . ?s pq:P585 ?value }","paraphrases":["When did Daniel Ellsberg recieve the American Book Award?"],"info":{}}
{"id":"train_1639","question":"What is Sächsische Biografie of Lucas Cranach the Elder ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q191748 wdt:P1710 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1640","question":"Michael Dell is CEO of what privately held company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P169 wd:Q218630 . ?sbj wdt:P31 wd:Q1589009 }","paraphrases":["Michael Dell is CEO of what secretly held company?"],"info":{}}
{"id":"train_1641","question":"Which political ideology is Leon Trotsky associated with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q33391 wdt:P135 ?obj . ?obj wdt:P31 wd:Q14934048 }","paraphrases":["What political party is Leon Trotsky associated with?"],"info":{}}
{"id":"train_1642","question":"Is it true that the magnetic moment of the helion is -0.000000000000000000000000010746174?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q902715 wdt:P2069 ?obj filter ( ?obj = -0.000000000000000000000000010746174 ) }","paraphrases":["Is it genuine that the attractive minute of the helion is -0.000000000000000000000000010746174?"],"info":{}}
{"id":"train_1643","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41484 wdt:P1038 ?obj . ?obj wdt:P31 wd:Q22988604 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_1644","question":"Is the personal best of Caster Semenya greater than 138.396","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5834 wdt:P2415 ?obj filter ( ?obj > 138.396 ) }","paraphrases":["Is Caster Semenya's personal best more than 138.396?"],"info":{}}
{"id":"train_1647","question":"Who is the birth parent of Stalin's kid, when was the kid born, and what was his name?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q459216 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["Who is Stalin kid's parents, when was he born and what was his name?"],"info":{}}
{"id":"train_1648","question":"Tell me milk tea whose name has the word tarik in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1884224 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tarik' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know drain tea whose title has the word tarik in it."],"info":{}}
{"id":"train_1649","question":"Is it true that the production rate of Jumilla more than 203978.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1112057 wdt:P2197 ?obj filter ( ?obj > 203978.4 ) }","paraphrases":["Is it true that the production rate of Jumilla more than 203978.4?"],"info":{}}
{"id":"train_1650","question":"What can you develop with Autodesk Vault?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4826246 wdt:P178 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What can you create with Autodesk Vault?"],"info":{}}
{"id":"train_1652","question":"When did was Natalia Revuelta Clews the partner of Fidel Castro.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11256 p:P451 ?s . ?s ps:P451 wd:Q19516418 . ?s pq:P580 ?value }","paraphrases":["At what time was Natalia Revuelta Clews the partner of Fidel Castro."],"info":{}}
{"id":"train_1653","question":"What prequel of plasma state of matter is using condensation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q166583 wdt:P2283 ?answer . ?answer wdt:P156 wd:Q29148313 }","paraphrases":["What's in the Cosmodrome Baikonur shire?"],"info":{}}
{"id":"train_1654","question":"What is the birthplace of Saint Wenceslaus I, Duke of Bohemia, where the country is Czech Republic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q196527 wdt:P19 ?answer . ?answer wdt:P3896 ?x FILTER ( contains ( ?x , 'Data:Czech Republic/Hlavní město Praha.map' ) ) }","paraphrases":["What is the birthplace of Saint Wenceslaus I, Duke of Bohemia, where the united states is Czech Republic?"],"info":{}}
{"id":"train_1655","question":"Tell me the name of a religious denomination which starts with the letter u.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13414953 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the name of a religious denomination that begins with the letter u."],"info":{}}
{"id":"train_1656","question":"Tell me me a allotrope of carbon whose name consist of the word \"carbon\" and whose shape crystal structure","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q622460 . ?sbj wdt:P1419 wd:Q895901 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'carbon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me me a allotrope of carbon whose name consist of the word \"carbon\" and whose shape crystal structure"],"info":{}}
{"id":"train_1657","question":"Who is the fallen angel that is worshiped by Christianity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1049 wd:Q5043 . ?sbj wdt:P31 wd:Q581450 }","paraphrases":["Who is the fallen blessed messenger that's worshiped by Christianity?"],"info":{}}
{"id":"train_1659","question":"What is the principle basis, for the Special Region Law of Hong Kong.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8646 wdt:P457 ?obj . ?obj wdt:P31 wd:Q10872094 }","paraphrases":["What is the guideline premise, for the Extraordinary Locale Law of Hong Kong."],"info":{}}
{"id":"train_1660","question":"What is the Women's Sports Foundation ID for Jennie Finch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2406028 wdt:P4377 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1663","question":"When did educated at of Venus Williams and academic major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q11578 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["When was Venus Williams and academic major educated?"],"info":{}}
{"id":"train_1664","question":"Which empire did the Parthian follow?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1986139 wdt:P156 ?obj . ?obj wdt:P31 wd:Q48349 }","paraphrases":["Which domain did the Parthian follow?"],"info":{}}
{"id":"train_1666","question":"Is the employment by economic sector of Amsterdam equal to 209100.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9899 wdt:P2297 ?obj filter ( ?obj = 209100.0 ) }","paraphrases":["Is 209100.0 the employment by economic sector of Amsterdam?"],"info":{}}
{"id":"train_1667","question":"Who was Richard I of England's mother?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q42305 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was Richard I of England's mother?"],"info":{}}
{"id":"train_1668","question":"What is the middle name of {Frederick I whose nick name is Frederick?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q79789 wdt:P735 ?answer . ?answer wdt:P460 wd:Q3273004 }","paraphrases":["What is the middle title of {Frederick I whose nick name is Frederick?"],"info":{}}
{"id":"train_1669","question":"who movie director of part of series of home court disadvantage ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q50383471 wdt:P179 ?X . ?X wdt:P57 ?answer }","paraphrases":["who movie director of part of series of domestic court downside ?"],"info":{}}
{"id":"train_1670","question":"Tell me programming paradigm whose name the word programming in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188267 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'programming' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the condiment which begin with the letter y"],"info":{}}
{"id":"train_1671","question":"What is the alma mater of Elgin Baylor whose position is -122.319?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q357458 wdt:P69 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-122.319' ) ) }","paraphrases":["What is the alma mater of Elgin Baylor whose position is -122.319?"],"info":{}}
{"id":"train_1672","question":"What are the mythological serpent which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16326794 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ž' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the legendary serpent which begin with the letter z"],"info":{}}
{"id":"train_1676","question":"Who followed Victor Hugo as a member of the Académie française?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q535 p:P463 ?s . ?s ps:P463 wd:Q161806 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Who observed Victor Hugo as a member of the Académie française?"],"info":{}}
{"id":"train_1677","question":"What is Q48460 language official of Khwarazmian dynasty ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q486918 wdt:P37 ?X . ?X wdt:P1036 ?answer }","paraphrases":["What is Q48460 dialect official of Khwarazmian line ?"],"info":{}}
{"id":"train_1678","question":"What position did Arthur Griffith hold in East Cavan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q342765 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 wd:Q5328039 }","paraphrases":["Which was the position that Arthur Griffith held in East Cavan?"],"info":{}}
{"id":"train_1679","question":"Which is the BDCYL authority ID for José Echegaray?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q127349 wdt:P3964 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1680","question":"Is the vapor pressure of the Nonane equal to 3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q150694 wdt:P2119 ?obj filter ( ?obj = 3 ) }","paraphrases":["Is 3 equal to the vapor pressure of the Nonane?"],"info":{}}
{"id":"train_1681","question":"How does Mariano Rivera make use of the sport he plays?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q382303 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["How does Mariano Rivera make utilize of the wear he plays?"],"info":{}}
{"id":"train_1682","question":"Which is the discontinued date of PlayStation 3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q10683 wdt:P2669 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1684","question":"What governor of Aosta Valley was also a veterinarian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1222 wdt:P6 ?answer . ?answer wdt:P106 wd:Q202883 }","paraphrases":["What representative of Aosta Valley was too a veterinarian?"],"info":{}}
{"id":"train_1686","question":"Which is the age of candidacy for South Korea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q884 wdt:P2998 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1687","question":"How many medical examinations are required for medical ultrasonography} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P923 wd:Q234904 }","paraphrases":["For medical ultrasonography, how many medical examinations are required?"],"info":{}}
{"id":"train_1690","question":"Was Benedict Arnold from the military branch of the Royal Navy and Continental Army?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q298237 wdt:P241 wd:Q172771 . wd:Q298237 wdt:P241 wd:Q54122 }","paraphrases":["Was Benedict Arnold from the military division of the Royal Navy and Continental Army?"],"info":{}}
{"id":"train_1692","question":"What markup language is HTML5 based on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P747 wd:Q2053 . ?sbj wdt:P31 wd:Q37045 }","paraphrases":[],"info":{}}
{"id":"train_1693","question":"What is the diplomatic relationship between Algeria and Indonesia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q262 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q15948965 }","paraphrases":["Describe diplomatic relations between Algeria and Indonesia."],"info":{}}
{"id":"train_1694","question":"When was Tomas Garrigue masaryk nominated for Nobel peace prize award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q78492 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value }","paraphrases":["Tomas Garrique Masaryk nomination for the Nobel peace prize occured in what year?"],"info":{}}
{"id":"train_1695","question":"Which is the cardinality of this set of 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2820 wd:Q199 }","paraphrases":[],"info":{}}
{"id":"train_1696","question":"Which is the British Book Trade Index ID for John Knox?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q189937 wdt:P2945 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1697","question":"Was the period of Margaret Thatcher ended as member ended on 2013-4-8?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7416 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2013' ) ) }","paraphrases":["Did Margaret Thatcher stop being a member on 2013/4/8?"],"info":{}}
{"id":"train_1698","question":"Which television series did {Francis Ford Coppola produce?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1431 wd:Q56094 . ?sbj wdt:P31 wd:Q5398426 }","paraphrases":["Which TV series were produced by Francis Ford Coppola?"],"info":{}}
{"id":"train_1699","question":"What are the United States Supreme Court decision which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19692072 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Joined together States Incomparable Court choice which begin with the letter v"],"info":{}}
{"id":"train_1700","question":"Who is the songwriter of the song, Rhapsody in Blue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q722599 wdt:P86 ?answer . ?answer wdt:P106 wd:Q753110 }","paraphrases":["Who is Rhapsody in Blue, the song's songwriter?"],"info":{}}
{"id":"train_1704","question":"DOES THE MAXIMUM THRUST OF THE CONCORDE EQUALS 676800","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6505 wdt:P2228 ?obj filter ( ?obj = 676800 ) }","paraphrases":["What is the maximum thrust of the concorde?"],"info":{}}
{"id":"train_1706","question":"What is Vancouver Island bordered by in administrative units?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170479 wdt:P131 ?X . ?X wdt:P47 ?answer }","paraphrases":["What is Vancouver Island bordered by in regulatory units?"],"info":{}}
{"id":"train_1707","question":"Which Class IIIA combustible liquid has the highest IDLH?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009058 . ?ent wdt:P2129 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["State the Class IIIA combustible liquid with highest IDLH."],"info":{}}
{"id":"train_1708","question":"What custom contains the word zwänzgerle in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q251777 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zwänzgerle' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What custom contains the word zwänzgerle in its name?"],"info":{}}
{"id":"train_1709","question":"What position did Mahathir Mohamad hold starting 2018-5-10?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q181383 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2018' ) ) }","paraphrases":["In 2018-5-10, what position did Mahathir Mohamad hold?"],"info":{}}
{"id":"train_1710","question":"Which ensemble of buildings has the smallest intensity of luminosity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1497375 . ?ent wdt:P3041 ?obj . ?ent wdt:P31 wd:Q1497375 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which group of buildings has the lowest intensity of luminosity?"],"info":{}}
{"id":"train_1712","question":"What role does John Hope Franklin have in the American Historical Association?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1367397 p:P463 ?s . ?s ps:P463 wd:Q464915 . ?s pq:P2868 ?value }","paraphrases":["What is John Hope Franklin's role in the AHA?"],"info":{}}
