{"id":"train_12218","question":"Which programming language did Dennis M. Ritchie create?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P178 wd:Q45575 . ?sbj wdt:P31 wd:Q9143 }","paraphrases":[],"info":{}}
{"id":"train_12220","question":"What is the location of death, which has arrondissements with Podoli, of Jan Palach?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192893 wdt:P20 ?answer . ?answer wdt:P150 wd:Q2638290 }","paraphrases":["What is the location of death, which has arrondissements with Podoli, of Jan Palach?"],"info":{}}
{"id":"train_12222","question":"What is that is of","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1130849 wdt:P127 ?answer . ?answer wdt:P112 wd:Q1186372 }","paraphrases":["What is that's of"],"info":{}}
{"id":"train_12223","question":"which is the country of citizenship and occupation of William_Shatner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q16297 wdt:P27 ?ans_1 . wd:Q16297 wdt:P106 ?ans_2 }","paraphrases":["In what country was William Shatner born and what was his occupation?"],"info":{}}
{"id":"train_12224","question":"What does happen when you put Q48460 and gauge boson in contact ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q105580 wdt:P517 ?X . ?X wdt:P1036 ?answer }","paraphrases":["What does take place when you put Q48460 and gauge boson in contact ?"],"info":{}}
{"id":"train_12225","question":"Who is the fictional person whose name starts with the letter t?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15632617 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Who is the anecdotal individual whose title begins with the letter t?"],"info":{}}
{"id":"train_12227","question":"Is the upper flammable limit of pentane equal to 7.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q150429 wdt:P2203 ?obj filter ( ?obj = 7.8 ) }","paraphrases":["is 7.8 the upper flammable limit of pentane?"],"info":{}}
{"id":"train_12228","question":"What continent did Paco Moncayo have fidelity to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2335730 wdt:P945 ?X . ?X wdt:P30 ?answer }","paraphrases":["Where did Paco Moncayo have loyalty to?"],"info":{}}
{"id":"train_12229","question":"Which municipal election which featured at least one Centre Party Candidate had the most eligible voters?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q152450 . ?ent wdt:P1867 ?obj . ?ent wdt:P726 wd:Q506591 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which election had the most voters?"],"info":{}}
{"id":"train_12230","question":"Which disease is treated with cortisol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q190875 wdt:P2175 ?obj . ?obj wdt:P31 wd:Q12136 }","paraphrases":["Cortisol is used to treat which disease?"],"info":{}}
{"id":"train_12232","question":"Was Michael Douglas nominated for a BAFTA for Best Film?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q119798 wdt:P1411 wd:Q139184 }","paraphrases":["Was Michael Douglas short-listed for a BAFTA for Best Film?"],"info":{}}
{"id":"train_12233","question":"is the {start time} for {New York City} has {head of government} as {Robert F. Wagner} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q60 p:P6 ?s . ?s ps:P6 wd:Q439156 . ?s pq:P580 ?value }","paraphrases":["is the {begin time} for {Unused York City} has {head of government} as {Robert F. Wagner} ?"],"info":{}}
{"id":"train_12234","question":"What is the name of Tina Turner's filmography?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q131814 wdt:P1283 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12235","question":"What was Adlai Stevenson II nominated for in the year 1965?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q311719 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1965' ) ) }","paraphrases":["In 1965, Aldlai Stevenson II was nominated for what?"],"info":{}}
{"id":"train_12237","question":"What was the population of the Araucanía Region in the census?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2176 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["According to the census, how many people live in the Araucanía Region?"],"info":{}}
{"id":"train_12238","question":"Tell me the kingdom which contains the world \"joseon\" in its name and whose office is headed by King of Joseon Dynasty.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q417175 . ?sbj wdt:P1906 wd:Q22304810 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'joseon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the kingdom which contains the world \"joseon\" in its title and whose office is headed by Ruler of Joseon Line."],"info":{}}
{"id":"train_12239","question":"Who directed the movie Brokeback Mountain ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q160618 wdt:P57 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Brokeback Mountain was directed by whom?"],"info":{}}
{"id":"train_12240","question":"Who is the {Wikidata property for astronomical objects} for {subject item of this property} of {parallax","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1629 wd:Q165074 . ?sbj wdt:P31 wd:Q21451142 }","paraphrases":["Who is the {Wikidata property for cosmic objects} for {subject thing of this property} of {parallax"],"info":{}}
{"id":"train_12241","question":"Did Johnnie Cochran die of natural causes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1346641 wdt:P1196 wd:Q3739104 }","paraphrases":["Were natural causes the reason for Johnnie Cochran's death?"],"info":{}}
{"id":"train_12242","question":"Does the Giotto consume power equal to 196?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q660356 wdt:P2791 ?obj filter ( ?obj = 196 ) }","paraphrases":["Does the Giotto consume 196 power?"],"info":{}}
{"id":"train_12243","question":"Who was the previous captain of Soyuz TM-32","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1424029 wdt:P155 ?X . ?X wdt:P1029 ?answer }","paraphrases":["Give me the previous captain for Soyuz TM-32."],"info":{}}
{"id":"train_12244","question":"What was Jennifer Jones nominated for during the 17th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q189895 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917159 }","paraphrases":["During the 17th Academy Awards, Jennifer Jones was nominated for what?"],"info":{}}
{"id":"train_12245","question":"When did child of Louis VIII of France and date of birth?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q315916 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["When did child of Louis VIII of France and date of birth?"],"info":{}}
{"id":"train_12246","question":"what is bibcode for physical review?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q869847 wdt:P1300 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12249","question":"When was Schutzstaffel the manager/director of Erhard Heiden?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q44687 p:P1037 ?s . ?s ps:P1037 wd:Q60222 . ?s pq:P580 ?value }","paraphrases":["What were the dates when Schutzstaffel held the title of manager/director at the Erhard Heiden company."],"info":{}}
{"id":"train_12250","question":"When was Concerto for Piano and Orchestra no. 1 in E minor, op. 11 written?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q162884 wdt:P86 ?X . ?X wdt:P569 ?answer }","paraphrases":["When was Piano and Orchestra Concerto No. 1 written in E minor, op. 11?"],"info":{}}
{"id":"train_12251","question":"What country whose archives are located in the National Library of Wales contains the word \"wales\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6256 . ?sbj wdt:P485 wd:Q666063 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wales' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What nation whose chronicles are found within the National Library of Ridges contains the word \"grains\" in its title"],"info":{}}
{"id":"train_12252","question":"What is {formed} which {represents} {Portrait of a Boy with a Golf Club and a Dog} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24521998 wdt:P180 ?X . ?X wdt:P186 ?answer }","paraphrases":["Portrait of a Boy with a Golf Club and a Dog is represented by what form?"],"info":{}}
{"id":"train_12253","question":"Whet academic degree did Zaha Hadid recieve?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q47780 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["Stimulate scholarly degree did Zaha Hadid recieve?"],"info":{}}
{"id":"train_12254","question":"Who is known for sculpting groups of mountain climbers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18173437 wdt:P170 ?X . ?X wdt:P800 ?answer }","paraphrases":["Who is known for chiseling bunches of mountain climbers?"],"info":{}}
{"id":"train_12256","question":"What was the population of Azerbaijan in 1994?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q227 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1994' ) ) }","paraphrases":["How many people lived in Azerbaijan in 1994 ?"],"info":{}}
{"id":"train_12257","question":"In what year did Deborah Kerr receive an award for Best Foreign Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q104146 p:P166 ?s . ?s ps:P166 wd:Q3404521 . ?s pq:P585 ?value }","paraphrases":["Tell me what year Deborah Kerr won \"Best Foreign Actress\"."],"info":{}}
{"id":"train_12258","question":"What award was presented to Lars Peter Hansen and Eugene Fama?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1386049 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q359317 }","paraphrases":["Lars Peter Hansen and Eugene Fama received which award?"],"info":{}}
{"id":"train_12259","question":"When did Minnie Mouse receive a star on the Hollywood Walk of Fame?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11936 p:P166 ?s . ?s ps:P166 wd:Q17985761 . ?s pq:P585 ?value }","paraphrases":["On what day did minnie mouse receive a star on the hollywood walk of fame?"],"info":{}}
{"id":"train_12260","question":"Tell me the component that has hyperboloid shape and contains the word cooling in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1310239 . ?sbj wdt:P1419 wd:Q505628 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'cooling' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the component that has hyperboloid shape and contains the word cooling in it's name?"],"info":{}}
{"id":"train_12262","question":"Which railway company does the owner of the Gotthard Base Tunnel have","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1830 wd:Q193002 . ?sbj wdt:P31 wd:Q249556 }","paraphrases":["What railway company does the owner of GBT possess?"],"info":{}}
{"id":"train_12263","question":"The Seventh-day Adventist Church practices which religion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P140 wd:Q104319 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["The Adventist Church of the Seventh Day practices what religion?"],"info":{}}
{"id":"train_12264","question":"What type of craft does Earl Strom work with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q735731 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["In what craft does Earl Strom work in?"],"info":{}}
{"id":"train_12265","question":"What is Barbarian F.C. ID for Martin Johnson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2036406 wdt:P4493 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12266","question":"Which is {faculty} of {cohabitant} of {Carla Bruni} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q143945 wdt:P451 ?X . ?X wdt:P69 ?answer }","paraphrases":["What is Carla Bruni's cohabitant's faculty?"],"info":{}}
{"id":"train_12268","question":"When are Sunflowers instead classed as a Sunflower?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q157541 p:P1889 ?s . ?s ps:P1889 wd:Q383480 . ?s pq:P1013 ?value }","paraphrases":["In reference to the Sunflower, when are Sunflowers classified as a sunflower?"],"info":{}}
{"id":"train_12269","question":"What takes place in Macaronesia having tributary for Owenmore River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q105472 wdt:P706 ?answer . ?answer wdt:P974 wd:Q23959779 }","paraphrases":["What takes area in Macaronesia having tributary for Owenmore River?"],"info":{}}
{"id":"train_12271","question":"What political part does Silvio Berlusconi represent","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P210 wd:Q11860 . ?sbj wdt:P31 wd:Q7278 }","paraphrases":["What political portion does Silvio Berlusconi represent"],"info":{}}
{"id":"train_12272","question":"What is the job of emergency management?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2868 wd:Q1460420 }","paraphrases":[],"info":{}}
{"id":"train_12273","question":"Tell me fictional detective whose name has the word sam in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q748720 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'european' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know anecdotal criminologist whose title has the word sam in it."],"info":{}}
{"id":"train_12275","question":"When did Abigail Adams' child Charles Adams die, and who was his father?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q5074968 . ?s pq:P22 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When did Abigail Adams' infant Charles Adams die, and who was once his father?"],"info":{}}
{"id":"train_12276","question":"What was Berkshire Hathaway's total revenue in 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q217583 p:P2139 ?s . ?s ps:P2139 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["In 2015, what was the total revenue of Berkshire Hathaway?"],"info":{}}
{"id":"train_12277","question":"What´s the musical score by the Nutcracker, that has representatived the work of Violin Concerto","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q193705 wdt:P86 ?answer . ?answer wdt:P800 wd:Q372907 }","paraphrases":["What's the melodic score by the Nutcracker, that has representatived crafted by Violin Concerto"],"info":{}}
{"id":"train_12279","question":"What sports team did Tillakaratne Dilshan join in 2007?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2724503 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2007' ) ) }","paraphrases":["Tillakaratne Dilshan joined which sports team in the year 2007?"],"info":{}}
{"id":"train_12280","question":"Which are the points classification of Chris Froome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3494 wd:Q319591 }","paraphrases":[],"info":{}}
{"id":"train_12282","question":"What is the area of the college attended of Helen Allingham?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q444581 wdt:P69 ?X . ?X wdt:P101 ?answer }","paraphrases":["Where did Helen Allingham attend college in?"],"info":{}}
{"id":"train_12283","question":"Who is the  {enterprise} for {chief executive officer} of {Michael Dell}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P169 wd:Q218630 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["Michel Dell is the CEO of what company?"],"info":{}}
{"id":"train_12285","question":"Which is the field of work for Giotto di Bondone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7814 wdt:P101 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12287","question":"Overwatch features a number of different game modes, principally designed around squad-based combat with two opposing teams of six players each. ... Other modes set aside for casual matches include solo and team deathmatch, capture-the-flag, and unique modes run during various seasonal events.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18515944 wdt:P400 ?X . ?X wdt:P179 ?answer }","paraphrases":["Overwatch features several different game modes, designed primarily around squad - based fighting with two opposing teams of six players each. ... During various seasonal events, other modes set aside for casual matches include solo and team deathmatch, capture the flag, and unique modes."],"info":{}}
{"id":"train_12288","question":"What era followed apartheid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P156 wd:Q11409 . ?sbj wdt:P31 wd:Q17524420 }","paraphrases":["What period followed apartheid in South Africa?"],"info":{}}
{"id":"train_12290","question":"Where is the headquarters and home venue of FC Porto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q128446 wdt:P159 ?ans_1 . wd:Q128446 wdt:P115 ?ans_2 }","paraphrases":["Where is FC Porto's headquarters and home location?"],"info":{}}
{"id":"train_12291","question":"The birthplace of the Ku Klux Klan is in what country?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q47131 wdt:P740 ?ans_1 . wd:Q47131 wdt:P17 ?ans_2 }","paraphrases":["What country gave rise to the Ku Klux Klan?"],"info":{}}
{"id":"train_12293","question":"When did WikiLeaks receive the Sam Adams Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q359 p:P166 ?s . ?s ps:P166 wd:Q7407078 . ?s pq:P585 ?value }","paraphrases":["WikiLeaks received the Sam Adams Award when?"],"info":{}}
{"id":"train_12296","question":"Who is the father of Diocletian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P22 wd:Q43107 }","paraphrases":[],"info":{}}
{"id":"train_12297","question":"Who was the chairperson for the Social Democratic Party of Germany in 2004-3-21?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q49768 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["In 2004-3-21, who was the chairperson of the Social Democratic Party of Germany?"],"info":{}}
{"id":"train_12298","question":"Which is the symbol of the physical quantity of the millisecond?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q723733 wdt:P111 ?X . ?X wdt:P416 ?answer }","paraphrases":["What is the symbol of the millisecond's physical quantity?"],"info":{}}
{"id":"train_12299","question":"which is the single with the maximum strahler number whose drainage basin is susquehanna river basin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q134556 . ?ent wdt:P1548 ?obj . ?ent wdt:P4614 wd:Q46129179 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the single with the maximum strahler number in in which their drainge basin is in the susquehanna river basin?"],"info":{}}
{"id":"train_12300","question":"What is the first language of Michael Richards whose grammatical person is third-person masculine singular?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q314945 wdt:P103 ?answer . ?answer wdt:P5110 wd:Q52431955 }","paraphrases":["What is the first language of Michael Richards whose grammatical person is third-person masculine singular?"],"info":{}}
{"id":"train_12302","question":"Which is the hometown of Kevin Martin, that is next to Beaumont?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q511414 wdt:P551 ?answer . ?answer wdt:P47 wd:Q253903 }","paraphrases":["Which is the hometown of Kevin Martin, that's following to Beaumont?"],"info":{}}
{"id":"train_12303","question":"Name a state church that contain the word \" movement\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2325038 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'movement' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a state church that contain the word \" development\" in its name"],"info":{}}
{"id":"train_12305","question":"Who is the manager of Hans Zimmer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1037 wd:Q76364 . ?sbj wdt:P31 wd:Q1917775 }","paraphrases":["Who's Hans Zimmer's manager?"],"info":{}}
{"id":"train_12306","question":"Who held the position of archbishop at the diocese of Ambrose.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q43689 p:P39 ?s . ?s ps:P39 wd:Q49476 . ?s pq:P708 ?value }","paraphrases":["Who was the archbishop at the diocese of Ambrose."],"info":{}}
{"id":"train_12308","question":"\"What is the official language for Khanate of Sibir, based in Crimean Peninsula?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190513 wdt:P37 ?answer . ?answer wdt:P131 wd:Q7835 }","paraphrases":["\"What is the legit language for Khanate of Sibir, based in Crimean Peninsula?\""],"info":{}}
{"id":"train_12309","question":"Jules Michelet influences how many?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q310791 wdt:P737 ?obj }","paraphrases":["How many did Jules Michelet influence?"],"info":{}}
{"id":"train_12311","question":"What position did Stanisław Koniecpolski held where he was replaced by Mikołaj Potock?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q722463 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1366 wd:Q2626598 }","paraphrases":["What position did Mikolaj Potock replace that was held by Stainslaw Konicpolski."],"info":{}}
{"id":"train_12312","question":"What is the median lethal dose of antimony administered orally?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1099 p:P2240 ?s . ?s ps:P2240 ?obj . ?s pq:P636 wd:Q285166 }","paraphrases":["The median lethal dose of orally administered antimony is?"],"info":{}}
{"id":"train_12313","question":"When did Kobe start as the twinned administrative body at Haifa?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q48320 p:P190 ?s . ?s ps:P190 wd:Q41621 . ?s pq:P580 ?value }","paraphrases":["When did Kobe begin as the twinned managerial body at Haifa?"],"info":{}}
{"id":"train_12315","question":"What religious text is a translation of Septuagint ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q29334 wdt:P629 ?obj . ?obj wdt:P31 wd:Q179461 }","paraphrases":["Give me the name of the religious text that's a translation of Septuagint."],"info":{}}
{"id":"train_12316","question":"Where has Thelonious Monk studied?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q109612 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q3367000 }","paraphrases":["Thelonious Monk studied where?"],"info":{}}
{"id":"train_12318","question":"Who is the family of Henry II of England?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q160311 wdt:P53 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12319","question":"What award was received by Amy Winehouse and who follows her?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q15897 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What award has Amy Winehouse received and who is following her?"],"info":{}}
