{"id":"train_4033","question":"Name an airline company using the Chennai International Airport as a hub that contains the word \"spicejet\"\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q46970 . ?sbj wdt:P113 wd:Q502670 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'spicejet' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title an carrier company utilizing the Chennai Worldwide Air terminal as a center that contains the word \"spicejet\"\" in its name"],"info":{}}
{"id":"train_4035","question":"Who is the operator of Sydney Metro?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P137 wd:Q14774571 }","paraphrases":[],"info":{}}
{"id":"train_4036","question":"When was Kenny Rogers given the American Music Award for Favorite Country Album?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q217160 p:P166 ?s . ?s ps:P166 wd:Q1441539 . ?s pq:P585 ?value }","paraphrases":["What year was Kenny Rogers receive the American Music Award for Favorite Country Album?"],"info":{}}
{"id":"train_4037","question":"how is remake of makes use of Roman numerals?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q38918 wdt:P2283 ?X . ?X wdt:P144 ?answer }","paraphrases":["How are Roman numerals made?"],"info":{}}
{"id":"train_4038","question":"What number of awards has Andrei Gromyko received from the Order of Lenin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q184267 p:P166 ?s . ?s ps:P166 wd:Q185493 . ?s pq:P2598 ?value }","paraphrases":["How many awards has the Order of Lenin given to Andrei Gromyko?"],"info":{}}
{"id":"train_4039","question":"Is the decomposition point of citric acid greater than 140.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q159683 wdt:P2107 ?obj filter ( ?obj > 140.0 ) }","paraphrases":["What is citric acid's decomposition point?"],"info":{}}
{"id":"train_4040","question":"Is the IDLH of carbon dioxide equal to 72000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1997 wdt:P2129 ?obj filter ( ?obj = 72000 ) }","paraphrases":["Is 72000 the IDLH of carbon dioxide?"],"info":{}}
{"id":"train_4041","question":"Tell me postgraduate degree whose name has the word philosophy in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015928 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'philosophy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know postgraduate degree whose title has the word reasoning in it"],"info":{}}
{"id":"train_4042","question":"Who is the  {horse} for {owner of} of {Ulysses S. Grant}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q34836 wdt:P1830 ?obj . ?obj wdt:P31 wd:Q726 }","paraphrases":["Who is the {horse} for {proprietor of} of {Ulysses S. Grant}"],"info":{}}
{"id":"train_4043","question":"Is power pop the genre of Phil Collins' music?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q144622 wdt:P136 wd:Q837837 }","paraphrases":["Would Phil Collins music be in the genre of power pop?"],"info":{}}
{"id":"train_4044","question":"Which musical artist went on The Trip into the Light World Tour?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28405906 wdt:P175 ?X . ?X wdt:P463 ?answer }","paraphrases":["Which melodic craftsman went on The Trip into the Light World Tour?"],"info":{}}
{"id":"train_4045","question":"Which is the film the was produced by Isabelle Adjani?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P162 wd:Q106383 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Isabelle Adjani was the producer of what movie?"],"info":{}}
{"id":"train_4046","question":"What is a genetic component of heart disease determined through TAS?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q389735 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q23190853 }","paraphrases":["What does TAS determine as a genetic component of heart disease?"],"info":{}}
{"id":"train_4047","question":"What is the rate of fire of a VAP submachine gun?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q61235737 wdt:P3792 ?obj filter ( ?obj = 900 ) }","paraphrases":["What's the rate of fire of a VAP submachine gun?"],"info":{}}
{"id":"train_4048","question":"Mention the year and the prize amount received by Niels Bohr for Nobel Prize in Physics.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q7085 p:P166 ?s . ?s ps:P166 wd:Q38104 . ?s pq:P2121 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["What was the year Niels Bohr won the Nobel Prize in Physics and the dollar amount awarded?"],"info":{}}
{"id":"train_4049","question":"Which animated film series whose distributor Metro-Goldwyn-Mayer and which that starts with the letter j","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56884562 . ?sbj wdt:P750 wd:Q179200 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'j' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which animated film sequence whose distributor Metro-Goldwyn-Mayer and which that begins with the letter j"],"info":{}}
{"id":"train_4050","question":"Mention the federal  state responsible for the Soviet Union's diplomatic relation.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P530 wd:Q15180 . ?sbj wdt:P31 wd:Q43702 }","paraphrases":["Specify the government state capable for the Soviet Union's political relation."],"info":{}}
{"id":"train_4052","question":"What's the Discogs artist ID of Henrich Heine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q44403 wdt:P1953 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4053","question":"How is {inception} of {Nefertiti Bust} where {earliest date} is {-1353-0-0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q582172 p:P571 ?s . ?s ps:P571 ?obj . ?s pq:P1319 ?x filter ( contains ( YEAR ( ?x ) , '1353' ) ) }","paraphrases":["What was the earliest date of inception for Nefertiti Bust with a early date of -1353-0-0?"],"info":{}}
{"id":"train_4054","question":"Tell me baseball league whose name has the word professional in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6631808 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'professional' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know baseball alliance whose title has the word proficient in it."],"info":{}}
{"id":"train_4056","question":"What kind of activity of Lotte Jacobi in Berg an Laim is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q70006 wdt:P937 ?answer . ?answer wdt:P150 wd:Q533054 }","paraphrases":["What kind of action of Lotte Jacobi in Berg an Laim is it?"],"info":{}}
{"id":"train_4057","question":"When did the Magna Carta become the Memory of the World?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q12519 p:P1435 ?s . ?s ps:P1435 wd:Q473858 . ?s pq:P580 ?value }","paraphrases":["When was the Memory of the World the Magna Carta?"],"info":{}}
{"id":"train_4058","question":"What is {prize money} at {point in time} of {{Thomas Hunt Morgan} {received award} as {Nobel Prize in Physiology or Medicine}}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q177681 p:P166 ?s . ?s ps:P166 wd:Q80061 . ?s pq:P2121 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["How much money did Thomas Hunt Morgan receive when he won the Nobel Prize in Physiology or Medicine?"],"info":{}}
{"id":"train_4059","question":"What country was Jiangsu a part of in October 1949?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q16963 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1949' ) ) }","paraphrases":["What nation was Jiangsu a piece of in October 1949?"],"info":{}}
{"id":"train_4060","question":"Which is the TAXREF ID for Salvia officinalis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1111359 wdt:P3186 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4061","question":"Who are the characters of the series Civilization V: Gods & Kings?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2418673 wdt:P179 ?X . ?X wdt:P674 ?answer }","paraphrases":["Who are the characters of the arrangement Civilization V: Divine beings & Kings?"],"info":{}}
{"id":"train_4062","question":"Tell meGerman nationalism whose name has the word national in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q370744 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'national' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell meGerman patriotism whose title has the word national in it."],"info":{}}
{"id":"train_4064","question":"What is the movement in Les Demoiselles d'Avignon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q910199 wdt:P135 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4066","question":"What is the disjointed union between cartridge and rimfire?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q37144 p:P2738 ?s . ?s ps:P2738 ?obj . ?s pq:P642 wd:Q1289462 }","paraphrases":["What is the incoherent union between cartridge and rimfire?"],"info":{}}
{"id":"train_4067","question":"Name a MediaWiki website located in Amsterdam that starts with letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15633582 . ?sbj wdt:P276 wd:Q727 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a MediaWiki internet site positioned in Amsterdam that starts offevolved with letter W"],"info":{}}
{"id":"train_4070","question":"When did Yerevan's population reach 1.0547e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1953 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '1.0547e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["When did Yerevan's populace reach 1.0547e+06?"],"info":{}}
{"id":"train_4071","question":"Is the magnetic moment of the Ganymede equal to 1.056e+20?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3169 wdt:P2069 ?obj filter ( ?obj = 1.056e+20 ) }","paraphrases":["Is 1.056e+20 the magnetic moment of Ganymede?"],"info":{}}
{"id":"train_4074","question":"Which team member of Lucien Laurent has scored 4.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q315286 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?x filter ( contains ( ?x , '4.0' ) ) }","paraphrases":["Which group part of Lucien Laurent has scored 4.0?"],"info":{}}
{"id":"train_4076","question":"Which is the film character of the husband of Princess Leia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P26 wd:Q51797 . ?sbj wdt:P31 wd:Q15773347 }","paraphrases":["Which is the film character of the spouse of Princess Leia?"],"info":{}}
{"id":"train_4079","question":"What is the important event of Edgar Michell at the time of 1971-7-01?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q295873 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1971' ) ) }","paraphrases":["What important event happened to Edgar Muchell at 1971-07-01?"],"info":{}}
{"id":"train_4080","question":"During the 18th Academy Awards, what awards were Bing Crosby nominated for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q72984 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917178 }","paraphrases":["What awards did Bing Crosby nominate for at the time of the 18th Academy Awards?"],"info":{}}
{"id":"train_4083","question":"Tell me if the number of cases of malaria is 343527.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12156 wdt:P1603 ?obj filter ( ?obj = 343527 ) }","paraphrases":["Were there 343527 cases of malaria?"],"info":{}}
{"id":"train_4084","question":"Tell me chemical property whose name has the word tetravalence in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q764285 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tetravalence' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me chemical property whose name has the word tetravalence in it."],"info":{}}
{"id":"train_4085","question":"Is the tuition fee of Indian Institute of Technology Kanpur equal to 100000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q782682 wdt:P5894 ?obj filter ( ?obj = 100000 ) }","paraphrases":["Does it cost 100000 to go to the Indian Institute of Technology Kanpur?"],"info":{}}
{"id":"train_4089","question":"What date in 1949 was Erich Honecker born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2607 wdt:P463 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1949' ) ) }","paraphrases":["What date in 1949 was Erich Honecker born?"],"info":{}}
{"id":"train_4090","question":"When was Ben Chifley the Prime Minister of Australia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23379 p:P39 ?s . ?s ps:P39 wd:Q319145 . ?s pq:P580 ?value }","paraphrases":["At what time was Ben Chifley the Prime Minister of Australia?"],"info":{}}
{"id":"train_4091","question":"What are thewater deity which start with the letter'y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q319141 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the water deity that begins with the letter y."],"info":{}}
{"id":"train_4092","question":"Which daylght saving time is valid in the timezone of Stockholm?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1754 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q36669 }","paraphrases":["When does daylight saving time begin in Stockholm?"],"info":{}}
{"id":"train_4093","question":"What is the human population of the administrative headquarters of French Indochina?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q185682 wdt:P36 ?X . ?X wdt:P1082 ?answer }","paraphrases":["What is the human populace of the regulatory central station of French Indochina?"],"info":{}}
{"id":"train_4097","question":"Which research institute is owned by the University of Oxford?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P127 wd:Q34433 . ?sbj wdt:P31 wd:Q31855 }","paraphrases":["Which inquire about organized is possessed by the College of Oxford?"],"info":{}}
{"id":"train_4098","question":"In Venice, do you know the work location of human?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P937 wd:Q641 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Do you know the human workplace in Venice?"],"info":{}}
{"id":"train_4104","question":"What operating system did Dennis M. Ritchie develop?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P178 wd:Q45575 . ?sbj wdt:P31 wd:Q9135 }","paraphrases":["What did Dennis M. Ritchie develop?"],"info":{}}
{"id":"train_4105","question":"What part of Saxony is Cottbus District located?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1202 p:P1365 ?s . ?s ps:P1365 wd:Q48046 . ?s pq:P518 ?value }","paraphrases":["Where is Saxony of Cottbus District?"],"info":{}}
{"id":"train_4106","question":"Where was P. J. Patterson last educated in 1953?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q109130 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1953' ) ) }","paraphrases":["which place was  P. J. Patterson completed his education in 1953?"],"info":{}}
{"id":"train_4109","question":"What weapon family starts with the letter \"u\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15142889 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What weapon family begins with the letter \"u\"?"],"info":{}}
{"id":"train_4111","question":"Is the perimeter of the Lai da Schmorras equal to 0.168?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q42308574 wdt:P2547 ?obj filter ( ?obj = 0.168 ) }","paraphrases":["Is the border of the Lai da Schmorras break even with to 0.168?"],"info":{}}
{"id":"train_4112","question":"What is the antonym of midnight sun whose timespan is 20?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q774621 wdt:P461 ?answer . ?answer wdt:P2047 ?x FILTER ( contains ( ?x , '20' ) ) }","paraphrases":["What is the antonym of midnight sun whose timespan is 20?"],"info":{}}
{"id":"train_4113","question":"In 1930, what was the capital of Türkmenabat?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q487684 p:P1376 ?s . ?s ps:P1376 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1930' ) ) }","paraphrases":["What was the capital of Türkmenabat in 1930"],"info":{}}
{"id":"train_4114","question":"What is the ingredients in beer whose phase point is the critical point?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44 wdt:P186 ?answer . ?answer wdt:P873 wd:Q111059 }","paraphrases":["What is the fixings in brew whose stage point is the basic point?"],"info":{}}
{"id":"train_4116","question":"Tell me the performing arts genre that contains the word videotanz in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q45971958 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'videotanz' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the performing expressions class that contains the word videotanz in their name"],"info":{}}
{"id":"train_4117","question":"Which character from Star Wars is the husband of Princess Leia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P26 wd:Q51797 . ?sbj wdt:P31 wd:Q33125444 }","paraphrases":[],"info":{}}
{"id":"train_4118","question":"What is {oblateness} of {orbits} {Amalthea} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3257 wdt:P397 ?X . ?X wdt:P1102 ?answer }","paraphrases":["What is {oblateness} of {circles} {Amalthea} ?"],"info":{}}
{"id":"train_4120","question":"How tall is the actor who played of one of the Wise Men?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51671 wdt:P1299 ?X . ?X wdt:P2048 ?answer }","paraphrases":["How tall is the performing artist who played of one of the Astute Men?"],"info":{}}
{"id":"train_4121","question":"Is Gini coefficient of 47.7 native to American English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7976 wdt:P2341 ?answer . ?answer wdt:P1125 ?x FILTER ( contains ( ?x , '47.7' ) ) }","paraphrases":["Is Gini coefficient of 47.7 local to American English?"],"info":{}}
{"id":"train_4123","question":"Who is the person that composed La Traviata?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q186162 wdt:P86 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who composed La Traviata?"],"info":{}}
{"id":"train_4126","question":"TELL ME THE IDEOLOGY OF RYO SHUHAMA POLITICALPARTY?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7385266 wdt:P102 ?X . ?X wdt:P1142 ?answer }","paraphrases":["what is the IDEOLOGY OF RYO SHUHAMA POLITICALPARTY?"],"info":{}}
{"id":"train_4127","question":"who  is the sports venue for operator of Indianapolis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P137 wd:Q6346 . ?sbj wdt:P31 wd:Q1076486 }","paraphrases":["who is the sports scene for administrator of Indianapolis?"],"info":{}}
{"id":"train_4128","question":"Where did Hans Bethe get his doctoral and academic degree from?T","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q155794 p:P512 ?s . ?s ps:P512 wd:Q849697 . ?s pq:P276 ?value1 . ?s pq:P184 ?value2 }","paraphrases":["From where did Hans Bethe obtain his doctoral and academic degree?"],"info":{}}
{"id":"train_4129","question":"Which is the Wikimedia duplicate page for energy measurement?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11379 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q17362920 }","paraphrases":["Which is the Wikimedia copy page for vitality measurement?"],"info":{}}
{"id":"train_4130","question":"Which is the lowest note of Mariah Carey","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41076 wdt:P1898 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4131","question":"Where did Kang Sheng die that is near Tokoyo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q544432 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1490 }","paraphrases":["Where did Kang Sheng kick the bucket that's close Tokoyo?"],"info":{}}
{"id":"train_4132","question":"What type of art were the famous works of Severin Roesen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q88498 wdt:P800 ?X . ?X wdt:P180 ?answer }","paraphrases":["Severin Roesen was famous for what type of art?"],"info":{}}
{"id":"train_4134","question":"what is a year for Venice Film Festival?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q49024 wdt:P2922 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4135","question":"What is the computer network protocol for Hypertext Transfer Protocols?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1547 wd:Q8777 . ?sbj wdt:P31 wd:Q15836568 }","paraphrases":["What is the computer arrange convention for Hypertext Exchange Protocols?"],"info":{}}
{"id":"train_4136","question":"What unfinished/abandoned film project does screenwriter Mike Myers have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P58 wd:Q185724 . ?sbj wdt:P31 wd:Q18011171 }","paraphrases":["What unfinished/abandoned film extend does screenwriter Mike Myers have?"],"info":{}}
{"id":"train_4137","question":"\"What is {etymology} of {Riemann sum}, which has {studied at} is {Humboldt University of Berlin} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1156903 wdt:P138 ?answer . ?answer wdt:P69 wd:Q152087 }","paraphrases":["What is the thing of Vedanta, that has Universal Decimal Classification as 233?"],"info":{}}
{"id":"train_4139","question":"In what television show did Jennifer Lopez play a character named Lynn?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q40715 p:P735 ?s . ?s ps:P735 wd:Q3841018 . ?s pq:P1545 ?value }","paraphrases":["Name the television show, in which Jennifer Lopez played a character named Lynn?."],"info":{}}
{"id":"train_4140","question":"what are the essential medicine which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q35456 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the fundamental medication which begin with the letter v"],"info":{}}
{"id":"train_4141","question":"who is member of sports team of Franco Baresi that has number of matches played is 531.0 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q189984 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter ( contains ( ?x , '531.0' ) ) }","paraphrases":["who is part of sports group of Franco Baresi that has number of matches played is 531.0 ?"],"info":{}}
