{"id":"train_608","question":"Who was the head of government in Palestine on June 2, 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q219060 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["On June 2, 2014 who was the leader of Palestine?"],"info":{}}
{"id":"train_609","question":"What non-metropolitan county shares a border with Hampshire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q23204 . ?sbj wdt:P31 wd:Q769603 }","paraphrases":[],"info":{}}
{"id":"train_610","question":"Is the position angle of northwest by north equal to 391.5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q20968407 wdt:P2211 ?obj filter ( ?obj = 391.5 ) }","paraphrases":["What is the position angle of northwest by north?"],"info":{}}
{"id":"train_614","question":"What is the location in New York City for Edward Hopper's place death?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q203401 p:P20 ?s . ?s ps:P20 wd:Q60 . ?s pq:P131 ?value }","paraphrases":["Where is Edward Hopper buries in New York City?"],"info":{}}
{"id":"train_615","question":"Which is Parks & Gardens UK Record ID for National Maritime Museum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1199924 wdt:P3481 ?answer }","paraphrases":[],"info":{}}
{"id":"train_616","question":"What was Ray Rennahan from Gone with the Wind nominated for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2875 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q367614 }","paraphrases":["In what category did Tay Rennahan receive a nomination for Gone with the Wind?"],"info":{}}
{"id":"train_619","question":"What is the 2.1 with the highest speed whose participating teams is Katusha 2016?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22231112 . ?ent wdt:P2052 ?obj . ?ent wdt:P1923 wd:Q21955186 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Out of the participating teams in the Katusha 2016, who with a 2.1 had the highest speed?"],"info":{}}
{"id":"train_621","question":"How many carry things by road?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2505 wd:Q34442 }","paraphrases":["Which is the number of the carry things by road?"],"info":{}}
{"id":"train_622","question":"What city became a twin city of Klagenfurt in 1990?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41753 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1990' ) ) }","paraphrases":["In 1990, what city became a twin city of Klagenfurt?"],"info":{}}
{"id":"train_625","question":"Who is the person for the military branch of KGB?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P241 wd:Q80919 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the individual for the military department of KGB?"],"info":{}}
{"id":"train_628","question":"What district of Liguria originated in 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1256 p:P150 ?s . ?s ps:P150 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["Name the district of Liguria created in 2015?"],"info":{}}
{"id":"train_629","question":"WHICH IS THE CATEGORY FOR RECIPIENTS OF THEIS WARD FOR HONOR","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2517 wd:Q207333 }","paraphrases":[],"info":{}}
{"id":"train_630","question":"when did Okinawa Prefecture have the Santa Cruz Department as its twinned administrative body?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q766445 p:P190 ?s . ?s ps:P190 wd:Q235106 . ?s pq:P580 ?value }","paraphrases":["When was The Santa Cruz Department wasOkinawa Prefecture administrative body?"],"info":{}}
{"id":"train_632","question":"Freddy Krueger and Fred Krueger, is a serial killer and the main antagonist of the A Nightmare on Elm Street series. A family man on the surface, Krueger was actually the serial killer known as the \"Springwood Slasher\". When he was caught and subsequently released on a technicality, the parents of his victims tracked him to the boiler room of the power plant he once worked at and burned him alive. Krueger was offered the chance to continue after his physical death, becoming a Dream Demon that could enter his victims' dreams and kill them in the Dream World, which would thus cause their death in the physical world and absorb their souls afterwards.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q329466 wdt:P21 ?ans_1 . wd:Q329466 wdt:P27 ?ans_2 }","paraphrases":["Freddy Krueger and Fred Krueger, is a serial killer and the principal antagonist of the A Nightmare on Elm Street series. A family man on the surface, Krueger used to be in reality the serial killer known as the \"Springwood Slasher\". When he was once caught and consequently released on a technicality, the parents of his victims tracked him to the boiler room of the power plant he as soon as worked at and burned him alive. Krueger was supplied the threat to proceed after his physical death, turning into a Dream Demon that could enter his victims' dreams and kill them in the Dream World, which would consequently reason their dying in the bodily world and absorb their souls afterwards."],"info":{}}
{"id":"train_633","question":"What award did Claude Brasseur receive in 1977-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q106544 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1977' ) ) }","paraphrases":["Which award was given to Claude Brasseur in 1977?"],"info":{}}
{"id":"train_635","question":"What is the earliest date of Alexander Pushkin's residency in Ulyanovsk?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q7200 p:P551 ?s . ?s ps:P551 wd:Q5627 . ?s pq:P1319 ?value1 . ?s pq:P1706 ?value2 }","paraphrases":["What is the earliest date of Alexander Pushkin's residency in Ulyanovsk?"],"info":{}}
{"id":"train_637","question":"When is the location born in Jamshid Mashayekhi which is a partner town of Havana?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3026288 wdt:P19 ?answer . ?answer wdt:P190 wd:Q1563 }","paraphrases":["When is the area born in Jamshid Mashayekhi which may be a accomplice town of Havana?"],"info":{}}
{"id":"train_639","question":"WHO THE DUBBER OF RUKH FROM WORK?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q30060903 wdt:P1441 ?X . ?X wdt:P725 ?answer }","paraphrases":["WHO THE DUBBER OF RUKH FROM WORK?"],"info":{}}
{"id":"train_640","question":"Where did Christopher Wren major in Latin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q170373 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q397 }","paraphrases":["At what location did Christopher Wren major in Latin?"],"info":{}}
{"id":"train_642","question":"Which language is used in Gibraltar that has a quality of second language?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1410 p:P2936 ?s . ?s ps:P2936 ?obj . ?s pq:P1552 wd:Q125421 }","paraphrases":["Wich language is used as a second language in Gibraltar?"],"info":{}}
{"id":"train_643","question":"Who is the human partner of Chow Yun-fat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P451 wd:Q181425 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the human accomplice of Chow Yun-fat?"],"info":{}}
{"id":"train_644","question":"Which is the candidature that Gustav Winckler took part of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q715063 wdt:P1344 ?X . ?X wdt:P710 ?answer }","paraphrases":["What is the candidature that Gustav Wincklet took part of?"],"info":{}}
{"id":"train_646","question":"Who plays the current role of the title character in Deadpool?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1631090 p:P1441 ?s . ?s ps:P1441 ?obj . ?s pq:P2868 wd:Q3246821 }","paraphrases":["What actor plays the currect role of Deadpool?"],"info":{}}
{"id":"train_647","question":"What is in the administrative region of Fukuoka Prefecture, whose total fertility rate is 1.39?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q123258 wdt:P131 ?answer . ?answer wdt:P4841 ?x FILTER ( contains ( ?x , '1.39' ) ) }","paraphrases":["What is in the administrative location of Fukuoka Prefecture, whose complete fertility rate is 1.39?"],"info":{}}
{"id":"train_648","question":"What is field of exercise for affiliated with Terje Langli ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q954719 wdt:P1416 ?X . ?X wdt:P452 ?answer }","paraphrases":["What is field of work out for partnered with Terje Langli ?"],"info":{}}
{"id":"train_649","question":"How can you tell migraines have PRDM16?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q133823 p:P2293 ?s . ?s ps:P2293 wd:Q18045527 . ?s pq:P459 ?value }","paraphrases":["What are the indicators that PRDM16 is present in a migraine?"],"info":{}}
{"id":"train_650","question":"When did Riga become the capital of Latvia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1773 p:P17 ?s . ?s ps:P17 wd:Q211 . ?s pq:P580 ?value }","paraphrases":["November 18, 1918"],"info":{}}
{"id":"train_651","question":"Is the operating temperature of the Nesjavellir power station 190?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q693330 wdt:P5066 ?obj filter ( ?obj = 190 ) }","paraphrases":["Is 190 the temp of the Nesjavellir power station?"],"info":{}}
{"id":"train_652","question":"How much was the population of Normandy in 2005?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q18677875 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2005' ) ) }","paraphrases":["How many people lived in Normandy in 2005?"],"info":{}}
{"id":"train_653","question":"What is the name of the theatrical character of Hamlet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41567 wdt:P674 ?obj . ?obj wdt:P31 wd:Q3375722 }","paraphrases":["What is the title of the showy character of Hamlet?"],"info":{}}
{"id":"train_655","question":"Tell me the brain region that contains the word thalamus in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620186 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'thalamus' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the brain locale that contains the word thalamus in their name"],"info":{}}
{"id":"train_657","question":"What was Leonardo Bonacci's date of death in the year 1240?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8763 p:P570 ?s . ?s ps:P570 ?obj . ?s pq:P1319 ?x filter ( contains ( YEAR ( ?x ) , '1240' ) ) }","paraphrases":["On what date did Leonardo Bonacci die in 1240?"],"info":{}}
{"id":"train_658","question":"Which is the parity of Higgs boson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q402 wdt:P1123 ?answer }","paraphrases":[],"info":{}}
{"id":"train_660","question":"Who was the manager/director of the Metropolitan Museum of Art starting in 1910?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q160236 p:P1037 ?s . ?s ps:P1037 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1910' ) ) }","paraphrases":["Starting in 1910, who was the manager/director of the Metropolitan Museum of Art?"],"info":{}}
{"id":"train_661","question":"what is the using of the remake of smoothsort?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1714823 wdt:P144 ?X . ?X wdt:P2283 ?answer }","paraphrases":["what is the utilizing of the change of smoothsort?"],"info":{}}
{"id":"train_663","question":"Which career did the character Buffy the Vampire Slayer choose?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q183513 wdt:P674 ?X . ?X wdt:P106 ?answer }","paraphrases":["Which career did the character Buffy the Vampire Slayer choose?"],"info":{}}
{"id":"train_665","question":"What country was started in the year 1871 in Wiesbaden?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1721 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1871' ) ) }","paraphrases":["In 1871 what country was started in Wiesbaden?"],"info":{}}
{"id":"train_666","question":"When did Nantes begin having Johanna Rolland as head of government?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q12191 p:P6 ?s . ?s ps:P6 wd:Q16037012 . ?s pq:P580 ?value }","paraphrases":["When did Johanna Rolland become Mayor of Nantes?"],"info":{}}
{"id":"train_667","question":"How many occupants are there with {Shah} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P106 wd:Q184299 }","paraphrases":["Shah contains how many occupants?"],"info":{}}
{"id":"train_669","question":"Who is the Head of State  of the Austrian Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q131964 wdt:P35 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the Austrian Empire's Head of State?"],"info":{}}
{"id":"train_671","question":"What is the ship with the lowest payload mass whose manufacturer is ERROR1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11446 . ?ent wdt:P4519 ?obj . ?ent wdt:P176 wd:Q16606610 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which ship made by ERROR1 has the lowest payload mass?"],"info":{}}
{"id":"train_675","question":"how many activated neurotransmitters are in y-aminobutyric acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P928 wd:Q210021 }","paraphrases":["y-aminobutyric acid has activated neurotransmitters, how many?"],"info":{}}
{"id":"train_676","question":"What is the stainless steel with the highest operating temperature whose has part is nitrogen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q172587 . ?ent wdt:P5066 ?obj . ?ent wdt:P527 wd:Q627 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the highest operating temperature for stainless steel with part nitrogen?"],"info":{}}
{"id":"train_679","question":"Which is the ISBN-13 for Watership Down?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q936801 wdt:P212 ?answer }","paraphrases":[],"info":{}}
{"id":"train_680","question":"Name the subtopic of the tagline \"Free, Sovereign, and Independent\", a history of Honduras.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q687152 wdt:P1269 ?answer . ?answer wdt:P1451 ?x FILTER ( contains ( ?x , 'Free, Sovereign and Independent' ) ) }","paraphrases":["Title the subtopic of the tagline \"Free, Imperial, and Free\", a history of Title the subtopic of the tagline \"Free, Imperial, and Free\", a history of Honduras."],"info":{}}
{"id":"train_681","question":"David Letterman is producer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P162 wd:Q217298 }","paraphrases":[],"info":{}}
{"id":"train_682","question":"Which French killer had the most victims ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1345 ?obj . ?ent wdt:P103 wd:Q150 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What killer from France had the most victims?"],"info":{}}
{"id":"train_683","question":"What is the mascot for the Stanford University athletics department?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41506 wdt:P1830 ?obj . ?obj wdt:P31 wd:Q3628059 }","paraphrases":["What is the mascot for the Stanford College sports department?"],"info":{}}
{"id":"train_687","question":"The Moon is found in which subtopic of the geological history of the Earth that has moon in the name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2389585 wdt:P1269 ?answer . ?answer wdt:P398 wd:Q405 }","paraphrases":["The Moon is found in which subtopic of the geographical history of the Soil that has moon within the name?"],"info":{}}
{"id":"train_688","question":"Since when was Manichaeism found in Egypt?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q131165 p:P706 ?s . ?s ps:P706 wd:Q202311 . ?s pq:P1319 ?value }","paraphrases":["Manichaeism was discovered in Egypt when?"],"info":{}}
{"id":"train_689","question":"whos is owner of the kiss that have members of is g20","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2418237 wdt:P127 ?answer . ?answer wdt:P463 wd:Q19771 }","paraphrases":["whos is proprietor of the kiss that have individuals of is g20"],"info":{}}
{"id":"train_693","question":"Who is born at Charlotte Dujardin, which has a zip code of E?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q272533 wdt:P19 ?answer . ?answer wdt:P281 ?x FILTER ( contains ( ?x , 'E' ) ) }","paraphrases":["Who is born in Charlotte Dujardin with an E zip code?"],"info":{}}
{"id":"train_695","question":"Who first described the element osmium and was born in Selby?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q751 wdt:P61 ?answer . ?answer wdt:P19 wd:Q527846 }","paraphrases":["Give me the name of the person that first described the element osmium and was born in Selby."],"info":{}}
{"id":"train_697","question":"Who was Bill Gates's mother?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5284 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What is the name of Bill Gate's mother?"],"info":{}}
{"id":"train_698","question":"What is Lysimachus's noble title and who follows?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q32133 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What is Lysimachus's respectable title and who follows?"],"info":{}}
{"id":"train_699","question":"Can you say which national library has the smallest collection?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22806 . ?ent wdt:P1436 ?obj . ?ent wdt:P31 wd:Q22806 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which national library has the smallest collection?"],"info":{}}
{"id":"train_700","question":"What was F. Murray Abraham nominated for in the 57th academy awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q181936 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q427425 }","paraphrases":["When F. Murray Abraham was nominated at the 57th academy awards, what category was the nomination for?"],"info":{}}
{"id":"train_702","question":"In what field of work does José Luis Rodríguez Zapatero work in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41395 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["In what discipline of work does José Luis Rodríguez Zapatero work in?"],"info":{}}
{"id":"train_703","question":"Is the end time for the spouse of Larry King 1967-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q213430 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1967' ) ) }","paraphrases":["Does 1967-0-0 Is the death date of Larry King wife?"],"info":{}}
{"id":"train_704","question":"What is {temperature} {on river} of {Iberian Peninsula} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12837 wdt:P206 ?X . ?X wdt:P2076 ?answer }","paraphrases":["What is the { temperature } of { Iberian Peninsula } on the river?"],"info":{}}
{"id":"train_706","question":"WHICH ARE THE NUT THAT CONTAINS THE WORD NUT IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11009 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'nut' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH ARE THE NUT THAT CONTAINS THE WORD NUT IN THEIR Title"],"info":{}}
{"id":"train_707","question":"Which isotope of indium has the most parity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q785466 . ?ent wdt:P1123 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What isotope has most parity with indium?"],"info":{}}
{"id":"train_709","question":"When did Dan Rowan receive his star on the Hollywood Walk of Fame","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3013195 p:P166 ?s . ?s ps:P166 wd:Q17985761 . ?s pq:P585 ?value1 . ?s pq:P1706 ?value2 }","paraphrases":["What date did Dan Rowan get a star on the Hollywood Walk of Fame?"],"info":{}}
{"id":"train_710","question":"What work did Jacques Brel publish in 1963?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1666 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P577 ?x filter ( contains ( YEAR ( ?x ) , '1963' ) ) }","paraphrases":["What was published of Jacques Brel publish in 1963?"],"info":{}}
{"id":"train_713","question":"Which is the poetry collection that has traditional Chinese characters as writing system?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P282 wd:Q178528 . ?sbj wdt:P31 wd:Q12308638 }","paraphrases":["Which is the verse collection that has conventional Chinese characters as composing system?"],"info":{}}
{"id":"train_715","question":"When did Ahmedabad become Presidency of Bombay which was located in the administrative territorial entity?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1070 p:P131 ?s . ?s ps:P131 wd:Q891827 . ?s pq:P580 ?value }","paraphrases":["In what year did Ahmedabad become the capital of Bombay?"],"info":{}}
{"id":"train_716","question":"What award was received by Valeri Polyakov on April 4, 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q317792 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["What was the award Valeri received on April 4th 2011"],"info":{}}
{"id":"train_718","question":"What award was John Williams nominated for in Close Encounters of the Third Kind?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q320588 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q131285 }","paraphrases":["When John Williams was nominated for an award for the film Close Encounters of the Third Kind, which award was it?"],"info":{}}
{"id":"train_719","question":"What is budget for Grand Theft Auto V?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q17452 wdt:P2769 ?answer }","paraphrases":[],"info":{}}
{"id":"train_720","question":"when was samuel beckett nominated for nobel prize in literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q37327 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["What year was Samuel Beckett nominated for a literary Nobel prize?"],"info":{}}
{"id":"train_721","question":"Who is the child of Ofelia Medina's life partner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1986025 wdt:P26 ?X . ?X wdt:P22 ?answer }","paraphrases":["Who is the child of Ofelia Medina's life partner?"],"info":{}}
{"id":"train_722","question":"What is the connecting line of Chulalongkorn University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q855730 wdt:P81 ?answer }","paraphrases":[],"info":{}}
{"id":"train_723","question":"Tell me hole that contains the word d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20204151 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know gap that contains the word d"],"info":{}}
