{"id":"train_16487","question":"How many  head of the organisations are under the  {president} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2388 wd:Q30461 }","paraphrases":["The {president} has how many organisation heads under him?"],"info":{}}
{"id":"train_16492","question":"Is the place of death for Billy Graham located in the administrative territorial entity of Montreal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q213550 p:P20 ?s . ?s ps:P20 wd:Q736831 . ?s pq:P131 ?value }","paraphrases":["Did Billy Graham die in Montreal?"],"info":{}}
{"id":"train_16496","question":"Did Tom Selleck play sports for the USA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q213706 wdt:P1532 wd:Q30 }","paraphrases":["Was Tom Selleck an athlete for the USA?"],"info":{}}
{"id":"train_16498","question":"What is basin country  for Vättern","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q188195 wdt:P205 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16499","question":"Which is {twinned administrative body} of {Dortmund} where {start time} is {1981-0-0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1295 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1981' ) ) }","paraphrases":["Which is {twinned regulatory body} of {Dortmund} where {begin time} is {1981-0-0} ?"],"info":{}}
{"id":"train_16500","question":"Which record company owns the record label for Peter Gabriel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q175195 wdt:P264 ?obj . ?obj wdt:P31 wd:Q2442401 }","paraphrases":[],"info":{}}
{"id":"train_16501","question":"How many connectors are in a Universal Serial Bus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2935 wd:Q42378 }","paraphrases":["What is the number of connectors in a USB"],"info":{}}
{"id":"train_16505","question":"What type of government and what was the most common language of the Spaniards?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q80702 wdt:P122 ?ans_1 . wd:Q80702 wdt:P37 ?ans_2 }","paraphrases":["What is the administration and popular language of the Spaniards?"],"info":{}}
{"id":"train_16506","question":"In 1985, what award did Michael J. Fox receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q395274 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1985' ) ) }","paraphrases":["Michael J. Fox received an award in 1985 for which role?"],"info":{}}
{"id":"train_16507","question":"In what series does Nanette Fabray play a character called Ruby?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1291104 p:P735 ?s . ?s ps:P735 wd:Q1061262 . ?s pq:P1545 ?value }","paraphrases":["Nanette Fabray is Ruby in what series?"],"info":{}}
{"id":"train_16509","question":"What Yasushi Inoue was awarded at 1980-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q712734 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["In 1980-0-0, what was Yasushi Inoue rewarded?"],"info":{}}
{"id":"train_16511","question":"Which makes belong to Aveeno Baby product line?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23730375 wdt:P127 ?X . ?X wdt:P1056 ?answer }","paraphrases":["Which makes have a place to Aveeno Infant item line?"],"info":{}}
{"id":"train_16512","question":"dorothy gale has a pet","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2583524 wdt:P1429 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16513","question":"What year was Seville population becomes 442300.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8717 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '442300.0' ) ) . ?s pq:P585 ?value }","paraphrases":["On which year was seville population becomes 442300.0?"],"info":{}}
{"id":"train_16514","question":"What award did George Gervin receive in 1982?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q352110 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1982' ) ) }","paraphrases":["Give me the name of the award won by George Gervin in 1982?"],"info":{}}
{"id":"train_16516","question":"WHat form of energy is measured by joule ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1880 wd:Q25269 . ?sbj wdt:P31 wd:Q3935690 }","paraphrases":["WHat frame of vitality is measured by joule ?"],"info":{}}
{"id":"train_16517","question":"Who is the operator and manufacturer of Luckheed C-130 Hercules?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q182027 wdt:P137 ?ans_1 . wd:Q182027 wdt:P176 ?ans_2 }","paraphrases":["Give me the name of the operator and manufacturer of Luckheed C-130 Hercules."],"info":{}}
{"id":"train_16518","question":"Name a television channel related to Al Jazeera Media Network that starts with letter A","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1616075 . ?sbj wdt:P749 wd:Q4704134 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a tv channel associated to Al Jazeera Media Network that starts offevolved with letter A"],"info":{}}
{"id":"train_16519","question":"What has a surface of 4017.36 and is next to Gifu Prefecture?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131277 wdt:P47 ?answer . ?answer wdt:P2046 ?x FILTER ( contains ( ?x , '4017.36' ) ) }","paraphrases":["What encompasses a surface of 4017.36 and is another to Gifu Prefecture?"],"info":{}}
{"id":"train_16521","question":"Name the animated film based on \"Twelfth Night\".","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P144 wd:Q221211 . ?sbj wdt:P31 wd:Q202866 }","paraphrases":[],"info":{}}
{"id":"train_16522","question":"W.H. Auden received what degree and from where?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q178698 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["W.H. Auden gotten what degree and from where?"],"info":{}}
{"id":"train_16524","question":"What has died in Stephen, which has inhabitants of 345600.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q161775 wdt:P20 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '345600.0' ) ) }","paraphrases":["What has passed on in Stephen, which has tenants of 345600.0?"],"info":{}}
{"id":"train_16527","question":"What institute of technology whose mascot is Buzz starts with letter G","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1371037 . ?sbj wdt:P822 wd:Q5003507 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What institute of technology whose mascot is Buzz begins with letter G"],"info":{}}
{"id":"train_16528","question":"Name the death location of Marguerite Henry, which has a partner city called Edinburgh.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6760787 wdt:P20 ?answer . ?answer wdt:P190 wd:Q23436 }","paraphrases":["Name the death region of Marguerite Henry, which has a accomplice city referred to as Edinburgh."],"info":{}}
{"id":"train_16530","question":"Which Latin phrase that partially coincident with course and which contains the word curriculum in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3062294 . ?sbj wdt:P1382 wd:Q600134 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'curriculum' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the recorded Salzburg town landmarks containing the word Salzburg in their name."],"info":{}}
{"id":"train_16531","question":"Is the number of processor cores of the AMD Ryzen 7 1700 equal to 9.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28972964 wdt:P1141 ?obj filter ( ?obj = 9.6 ) }","paraphrases":["AMD Ryzen 7 1700 has how many processor cores?"],"info":{}}
{"id":"train_16532","question":"Who is {champion} of {nomination received} of {Lila Kedrova} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q232879 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who is the champion of Lila Kedrova's received nomination?"],"info":{}}
{"id":"train_16533","question":"What orbits the planetary system of Omega Centauri?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14275 wdt:P397 ?X . ?X wdt:P398 ?answer }","paraphrases":["Which orbits the planetary system of Omega Centauri?"],"info":{}}
{"id":"train_16534","question":"Which was  the election and end cause of Enoch Powell in the position as the Member of the 49th Parliament of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q333028 p:P39 ?s . ?s ps:P39 wd:Q41582621 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["Which was the decision and conclusion cause of Enoch Powell within the position as the Part of the 49th Parliament of the Joined together Kingdom?"],"info":{}}
{"id":"train_16535","question":"What are the political affiliations that contain the word \"right\" in their name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28819924 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'right' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the political affiliations that incorporate the phrase \"right\" in their name ?"],"info":{}}
{"id":"train_16536","question":"What are the technique which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2695280 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the method which begin with the letter t"],"info":{}}
{"id":"train_16538","question":"What is the champ of Benny Goodman, that was also the champ of Carol Burnett?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q46755 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q255565 }","paraphrases":["What is the champ of Benny Goodman, that was too the champ of Carol What is the champ of Benny Goodman, that was too the champ of Carol Burnett?"],"info":{}}
{"id":"train_16540","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q33391 wdt:P607 ?obj . ?obj wdt:P31 wd:Q10931 }","paraphrases":["n/a"],"info":{}}
{"id":"train_16541","question":"Who are the kids that inspired the Color Purple","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q223299 wdt:P1877 ?X . ?X wdt:P40 ?answer }","paraphrases":["Who are the kids that propelled the Color Purple"],"info":{}}
{"id":"train_16542","question":"How many physical interacts are with the cookware and bakeware} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q154038 wdt:P129 ?obj }","paraphrases":["With baking and cookware, how many physical interactions are there?"],"info":{}}
{"id":"train_16543","question":"What is {developed} and {published on} {Need for Speed} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55679 wdt:P400 ?X . ?X wdt:P178 ?answer }","paraphrases":["Who developed and who published Need for Speed?"],"info":{}}
{"id":"train_16544","question":"In which country is Saint Petersburg, where Modest Mussorgsky died?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132682 p:P20 ?s . ?s ps:P20 wd:Q656 . ?s pq:P17 ?value }","paraphrases":["In what country of Saint Petersburg did Modest Mussorgsky die?"],"info":{}}
{"id":"train_16545","question":"What is the Canada's Sports Hall of Fame athlete ID for Ray Bourque?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q715566 wdt:P4398 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16546","question":"tell me academic degree which name has the word science in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q189533 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'science' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know cattle breed which title has the word wagtu in it"],"info":{}}
{"id":"train_16547","question":"When did Raúl Castro marry Vilma Espín?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q46809 p:P26 ?s . ?s ps:P26 wd:Q466662 . ?s pq:P580 ?value }","paraphrases":["When did Raul Castro marry Vilma Espin?"],"info":{}}
{"id":"train_16548","question":"What are the inner planet which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3504248 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the inner planet which begins with the letter v"],"info":{}}
{"id":"train_16549","question":"Is the number of constituencies of the municipal chamber of Londrina equal to zero?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q56450237 wdt:P4253 ?obj filter ( ?obj = 0 ) }","paraphrases":["Are there any constituencies of the municipal chamber of Londrina?"],"info":{}}
{"id":"train_16552","question":"What is the country club with the lowest par whose instance of is country club ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1137210 . ?ent wdt:P3530 ?obj . ?ent wdt:P31 wd:Q1137210 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which low par country club instanced of is country club?"],"info":{}}
{"id":"train_16554","question":"Tell me the multiple that contains the word harmonic in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1055293 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'harmonic' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the numerous that contains the word consonant in their title"],"info":{}}
{"id":"train_16555","question":"What is the largest quantity of campaign medals?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q973011 . ?ent wdt:P1114 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which is the largest quantity of campaign medals"],"info":{}}
{"id":"train_16556","question":"Is it true that the number of pages of Papyrus Oxyrhynchus 20 equals to 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7133374 wdt:P1104 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is it true that Papyrus Oxyrhynchus 20's number of pages is equal to 1?"],"info":{}}
{"id":"train_16557","question":"What net profit did eBay have on January 1st, 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q58024 p:P2295 ?s . ?s ps:P2295 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["What was eBay's net profit on January 1, 2015?"],"info":{}}
{"id":"train_16558","question":"How many religions are there with the {Han Chinese} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q42740 wdt:P140 ?obj }","paraphrases":["What is the number of Han Chinese religions?"],"info":{}}
{"id":"train_16559","question":"Where is the work location of Harthacanute which belongs to Asian Development Bank","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190091 wdt:P937 ?answer . ?answer wdt:P463 wd:Q188822 }","paraphrases":["Where is the work area of Harthacanute which has a place to Asian Improvement Bank"],"info":{}}
{"id":"train_16560","question":"tell me musikdrama is starts with p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q279272 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know musikdrama is begins with p"],"info":{}}
{"id":"train_16561","question":"Where was Alexander Radishchev going to school at the start of 1766?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q217470 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1766' ) ) }","paraphrases":["What school did Alexander Radishchev attend beginning in 1766?"],"info":{}}
{"id":"train_16562","question":"How many are approved by the United States Congress?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P790 wd:Q11268 }","paraphrases":["Give me the number approved by the U.S. Congress."],"info":{}}
{"id":"train_16563","question":"In 1859 -1-24, Bucharest was in a country which changed its name from Moldova to what new name?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q19660 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1859' ) ) }","paraphrases":["As of 1859/1/24, the country that Bucharest was located in, formerly known as Moldova, was known as what?"],"info":{}}
{"id":"train_16565","question":"What was the movie about Jacques Cousteau that was nominated for a Best Documentary Feature Academy Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q83233 p:P1411 ?s . ?s ps:P1411 wd:Q111332 . ?s pq:P805 ?value }","paraphrases":["What was the name of the film about Jacques Cousteau that was nominated for a Best Documentary Feature Academy Award?"],"info":{}}
{"id":"train_16571","question":"What did Fats Everett play in the conflict?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1398254 wdt:P607 ?X . ?X wdt:P710 ?answer }","paraphrases":["Fats Everett played what in the conflict?"],"info":{}}
{"id":"train_16573","question":"Which is the position that applies to the jurisdiction of Bucharest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1001 wd:Q19660 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["Which is the position that applies to the ward of Bucharest?"],"info":{}}
{"id":"train_16574","question":"Which award received of T. S. Eliot that is prize money is 159773.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q37767 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter ( contains ( ?x , '159773.0' ) ) }","paraphrases":["T.S. Eliot received a prize of 159773.0 for what award?"],"info":{}}
{"id":"train_16575","question":"What is the country with the highest water as percent of area whose diplomatic relation is Taiwan ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q6256 . ?ent wdt:P2927 ?obj . ?ent wdt:P530 wd:Q865 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What country has the highest water percent of area whose diplomatic relation is Taiwan ?"],"info":{}}
{"id":"train_16576","question":"In what year did Charles Martel fight in the Battle of the River Berre?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3301 p:P607 ?s . ?s ps:P607 wd:Q1508114 . ?s pq:P585 ?value }","paraphrases":["In the Battle of the River Berre, in what specific year did Charles Martel fight?"],"info":{}}
{"id":"train_16579","question":"who has local government areas of headquarters of galileo ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q193902 wdt:P159 ?X . ?X wdt:P150 ?answer }","paraphrases":["who has neighborhood government regions of central station of galileo ?"],"info":{}}
{"id":"train_16581","question":"What party is friend of society NSDAP a member of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8425 wdt:P3342 ?answer . ?answer wdt:P102 wd:Q7320 }","paraphrases":["Which party is a member of the NSDAP society friend?"],"info":{}}
{"id":"train_16582","question":"Which is the BD Gest' author ID of Hugo Pratt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12113 wdt:P5491 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16583","question":"Was Ron Howard nominated for Nebula Award for Best Script?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q103646 wdt:P1411 wd:Q644077 }","paraphrases":["Did Ron Howard ever receive a nomination for Nebula Award for Best Script?"],"info":{}}
{"id":"train_16584","question":"What are the province of China which start with the letter zhejiang","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1615742 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zhejiang' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the area of China which begin with the letter zhejiang"],"info":{}}
{"id":"train_16587","question":"who art collection of portrayed by  thorvaldsen Museum ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1992413 wdt:P1299 ?X . ?X wdt:P195 ?answer }","paraphrases":["who craftsmanship collection of depicted by thorvaldsen Exhibition hall"],"info":{}}
{"id":"train_16588","question":"What is award received of Mary Steenburgen that of winner is Allison Janney ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q108935 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q229487 }","paraphrases":["What award did Mary Steenburgen receive for Allsion Janney"],"info":{}}
{"id":"train_16591","question":"Tell me landscape type whose name has the word tundra in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1803829 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tundra' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know scene sort whose title has the word tundra in it."],"info":{}}
{"id":"train_16592","question":"When did Ivan Turgenev leave his residence in Berlin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42831 p:P551 ?s . ?s ps:P551 wd:Q64 . ?s pq:P1326 ?value }","paraphrases":["on what date did Ivan Turgenev leave his residence in Berlin?"],"info":{}}
{"id":"train_16595","question":"Who is the chairperson of CERN?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q42944 wdt:P488 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the chairperson of CERN?"],"info":{}}
{"id":"train_16596","question":"What is General Electric's snapchat username?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q54173 wdt:P2984 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16597","question":"What people are assocated with Al-Andalus and start with the letter A?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2221906 . ?sbj wdt:P1792 wd:Q9073671 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What humans are assocated with Al-Andalus and begin with the letter A?"],"info":{}}
{"id":"train_16598","question":"What what is Christian Church office held by head of the organisation pope and which that starts with c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34651 . ?sbj wdt:P2388 wd:Q19546 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is Christian Church workplace held by way of head of the business enterprise pope and which that starts with c"],"info":{}}
{"id":"train_16599","question":"Name a movie whose costumes were designed by Theoni V. Aldredge that contains the word \"ghostbusters \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24869 . ?sbj wdt:P2515 wd:Q451071 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ghostbusters' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a motion picture whose ensembles were planned by Theoni V. Aldredge that contains the word \"ghostbusters \" in its title"],"info":{}}
