{"id":"train_19805","question":"Tell me the position that starts with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4164871 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the position that begins with the letter y"],"info":{}}
{"id":"train_19806","question":"What is the union lacking cohesion  for sedan","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2738 wd:Q190578 }","paraphrases":[],"info":{}}
{"id":"train_19808","question":"When did South Asia have 113,000,000 out of school children?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q771405 p:P2573 ?s . ?s ps:P2573 ?x filter ( contains ( ?x , '1.13e+08' ) ) . ?s pq:P585 ?value }","paraphrases":["During what period of time did South Asia have 113,000,000 children that were out of school?"],"info":{}}
{"id":"train_19812","question":"Which is the biological process that contains the word viral in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2996394 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'viral' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the organic process that contains the phrase viral in it's name?"],"info":{}}
{"id":"train_19813","question":"What does the academic minor of ethnology entail?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P811 wd:Q43455 }","paraphrases":[],"info":{}}
{"id":"train_19814","question":"Which Parlophone label artist was the song “Yesterday” written by?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q202698 wdt:P86 ?answer . ?answer wdt:P264 wd:Q208909 }","paraphrases":["Which Parlophone name craftsman was the melody “Yesterday” composed by?"],"info":{}}
{"id":"train_19815","question":"Is Beijing a twinned administrative body with Nur-Sultan and Salo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q956 wdt:P190 wd:Q1520 . wd:Q956 wdt:P190 wd:Q210987 }","paraphrases":["Are Nur-Sultan and Salo similar to Beijing?"],"info":{}}
{"id":"train_19817","question":"Who was killed by William the Silent?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q78454 wdt:P157 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19818","question":"What medicine is essential for the treatment of mental disorders?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12135 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q35456 }","paraphrases":["What prescription is fundamental for the treatment of mental issue?"],"info":{}}
{"id":"train_19820","question":"tell me about the position that martin McGuinness elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q57689 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["inform me about the function that martin McGuinness elected in?"],"info":{}}
{"id":"train_19821","question":"Who is subdivided into Federal Republic of Central America which has a human population of 4,872,166?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190025 wdt:P150 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '4872166' ) ) }","paraphrases":["Who is subdivided into Federal Republic of Central America which has a human population of 4,872,166?"],"info":{}}
{"id":"train_19823","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11299 wdt:P47 ?obj . ?obj wdt:P31 wd:Q408804 }","paraphrases":["n/a"],"info":{}}
{"id":"train_19824","question":"What what is research program objective of project or mission by human genome and which that starts with g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7315176 . ?sbj wdt:P3712 wd:Q720988 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is research program objective of project or mission by human genome and which that begins with g"],"info":{}}
{"id":"train_19827","question":"What position did Vannevar Bush hold for the MIT Corporation?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q299595 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P642 wd:Q17379555 }","paraphrases":["What was Vannevar Bush's rule in the MIT Corporation?"],"info":{}}
{"id":"train_19829","question":"What user of Concord has Concorde 211 in it's fleet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6505 wdt:P137 ?answer . ?answer wdt:P121 wd:Q41345596 }","paraphrases":["What client of Harmony has Concorde 211 in it's fleet?"],"info":{}}
{"id":"train_19830","question":"When did Gina Haspel begin working as the Deputy Director of the CIA?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q28606502 p:P39 ?s . ?s ps:P39 wd:Q5261025 . ?s pq:P580 ?value }","paraphrases":["The year Gina Haspel began working as Deputy Director of the CIA?"],"info":{}}
{"id":"train_19832","question":"What is the name of the airline that operated Airbus A300?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P121 wd:Q6437 . ?sbj wdt:P31 wd:Q46970 }","paraphrases":["Airbus A300 is operated by which airline?"],"info":{}}
{"id":"train_19833","question":"What position did Hubert Humphrey hold that ended in 1964?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q209989 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1964' ) ) }","paraphrases":["What job did Hubert Humphrey have that ended in 1964?"],"info":{}}
{"id":"train_19834","question":"Where is the Comarca of Catalonia, which shares border with Noguera, with the lowest nominal GDP per capita?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q937876 . ?ent wdt:P2132 ?obj . ?ent wdt:P47 wd:Q12726 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Does Comarca of Catalonia, on the border of Noguera, have the lowest per capita GDP?"],"info":{}}
{"id":"train_19840","question":"Where where the rural scenes for the first Star Wars movie filmed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17738 wdt:P915 ?X . ?X wdt:P150 ?answer }","paraphrases":["Where where the rustic scenes for the primary Star Wars motion picture filmed?"],"info":{}}
{"id":"train_19841","question":"Google is in partnerships with how many","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2652 wd:Q95 }","paraphrases":["How many partnerships does Google have?"],"info":{}}
{"id":"train_19842","question":"What's is Weimar Republic's official anthem?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41304 wdt:P85 ?obj . ?obj wdt:P31 wd:Q7366 }","paraphrases":["What is the official anthem of the Weimar Republic?"],"info":{}}
{"id":"train_19843","question":"How many places located in time zone of {Oceania} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q538 wdt:P421 ?obj }","paraphrases":["Which is the number of places that are located in time zone of Oceania?"],"info":{}}
{"id":"train_19845","question":"What is it that is located in the administrative unit of Menshikov Palace in Saint Petersburg, which has administrative divisions in Solnechnoye, Saint Petersburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q975426 wdt:P131 ?answer . ?answer wdt:P150 wd:Q3489533 }","paraphrases":["What is it that is located in the administrative unit of Menshikov Palace in Saint Petersburg, which has administrative divisions in Solnechnoye, Saint Petersburg?"],"info":{}}
{"id":"train_19846","question":"When was Malala Yousafzai nominated for the National Malala Peace Prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q32732 p:P1411 ?s . ?s ps:P1411 wd:Q6974223 . ?s pq:P585 ?value }","paraphrases":["On what date did Malala Yousafzai receive a nomination for the National Malala Peace Prize?"],"info":{}}
{"id":"train_19847","question":"What is the place where filmed Andrei Rublev whose village is Ryazansky District?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q503046 wdt:P915 ?answer . ?answer wdt:P150 wd:Q1963165 }","paraphrases":["What is the vicinity the place filmed Andrei Rublev whose village is Ryazansky District?"],"info":{}}
{"id":"train_19850","question":"which unit  of mass starts with z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3647172 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me the name of the unit of mass that starts with Z."],"info":{}}
{"id":"train_19851","question":"What is Forth Bridge's Brueckenweb ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q275 wdt:P4328 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19854","question":"What type of fantasy film is Peter Pan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q107190 wdt:P1441 ?answer . ?answer wdt:P136 wd:Q132311 }","paraphrases":["What sort of daydream film is Diminish Pan?"],"info":{}}
{"id":"train_19855","question":"What is the process of Gram staining used with Lactobacillus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1061596 wdt:P2597 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19856","question":"Did Netherlands participate in Korean War?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q8663 wdt:P710 wd:Q55 }","paraphrases":["Was Netherlands in the Korean War?"],"info":{}}
{"id":"train_19857","question":"What has Jon Landau of Avatar fame been nominated for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q24871 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q132451 }","paraphrases":["What nominated did Jon Landau get for Avatar?"],"info":{}}
{"id":"train_19859","question":"What was the sixth position that Samuel Pepys held?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q106143 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '6' ) ) }","paraphrases":["Was was Samuel Pepys sixth position?"],"info":{}}
{"id":"train_19860","question":"What are the mausoleum which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162875 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the mausoleum which begin  with the letter z"],"info":{}}
{"id":"train_19862","question":"Is the block size of the CAST-256 less than 102.4","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1022875 wdt:P2599 ?obj filter ( ?obj < 102.4 ) }","paraphrases":["Is the CAST-256 block size less than 102.4"],"info":{}}
{"id":"train_19863","question":"The natural script of the Arabic alphabet has what uses?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2283 wd:Q8196 . ?sbj wdt:P31 wd:Q29517555 }","paraphrases":["The normal script of the Arabic letter set has what employments?"],"info":{}}
{"id":"train_19864","question":"Was Blade Runner nominated for Saturn Award for Best Actor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q184843 wdt:P1411 wd:Q1259362 }","paraphrases":["Which award was Blade Runner nominated for at the Saturn Awards"],"info":{}}
{"id":"train_19868","question":"What did the census find as the population for Halifax?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2141 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["Which is the number of population that the census determined for Halifax?"],"info":{}}
{"id":"train_19870","question":"Is 57.6 the correct focal length of the Hubble Space Telescope?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2513 wdt:P2151 ?obj filter ( ?obj = 57.6 ) }","paraphrases":["Is 57.6 the proper central length of the Hubble Space Telescope?"],"info":{}}
{"id":"train_19871","question":"What is an umbrella term that starts with u?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q210588 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is an umbrella term that begins with u?"],"info":{}}
{"id":"train_19872","question":"When did Edward Henry Bush step down as manager/director of the University of London?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q170027 p:P1037 ?s . ?s ps:P1037 wd:Q5343409 . ?s pq:P582 ?value }","paraphrases":["On what date did Edward Henry Bush quit as manager/director of the University of London?"],"info":{}}
{"id":"train_19875","question":"Was Billy the kid a cowboy and an outlaw?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44200 wdt:P106 wd:Q178521 . wd:Q44200 wdt:P106 wd:Q254508 }","paraphrases":["Was Billy the kid a rancher and an ban?"],"info":{}}
{"id":"train_19876","question":"Who, named after Bio-Savart law, died on 1862-2-3?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q171340 wdt:P138 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( YEAR ( ?x ) , '1862' ) ) }","paraphrases":["Who, named after Bio-Savart law, kicked the bucket on 1862-2-3?"],"info":{}}
{"id":"train_19877","question":"How long were Jimmy Wales and Pamela Green married?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q181 p:P26 ?s . ?s ps:P26 wd:Q21476682 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["How long were Jimmy Grains and Pamela Green married?"],"info":{}}
{"id":"train_19879","question":"Name the stepparent of Sally Field.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q187033 wdt:P3448 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Sally Field's stepparent?"],"info":{}}
{"id":"train_19881","question":"According to Theodora's birthdate, was Gregorian born earlier than 1584?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q204843 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["Was Gregorian born earlier than 1584, according to Theodora's birthdate?"],"info":{}}
{"id":"train_19882","question":"Sulfate ion has what conjugate acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q172290 wdt:P4147 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19883","question":"What kind of benign neoplasm starts with the letter \"b\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18553645 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What kind of generous neoplasm begins with the letter \"b\"?"],"info":{}}
{"id":"train_19884","question":"What is the mentioned in of the characters of Prince Lestat ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18209462 wdt:P674 ?X . ?X wdt:P1441 ?answer }","paraphrases":["Which is mentioned in of the characters of Prince Lestat?"],"info":{}}
{"id":"train_19886","question":"What were John Updike's degree and major from Harvard University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q105756 p:P69 ?s . ?s ps:P69 wd:Q13371 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["Which degree and major did John Updike graduate with from Harvard University?"],"info":{}}
{"id":"train_19887","question":"When did Marrakesh become a city in Morocco?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q101625 p:P17 ?s . ?s ps:P17 wd:Q1028 . ?s pq:P580 ?value }","paraphrases":["On what date was Marrakesh incorporated into Morocco?"],"info":{}}
{"id":"train_19889","question":"Is the luminous intensity of the Bathurst Lighthouse equal to 13800?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q605609 wdt:P3041 ?obj filter ( ?obj = 13800 ) }","paraphrases":["What is the luminous intensity of the Bathurst Lighthouse?"],"info":{}}
{"id":"train_19892","question":"Is the quantity of the Borkumer Kleinbahn Moritz 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q893878 wdt:P1114 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is it true that 1 is the quantity of Borkumer Kleinbahn Moritz?"],"info":{}}
{"id":"train_19893","question":"Who is the {G-type main-sequence star} for {child astronomical body} of {Pluto}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P398 wd:Q339 . ?sbj wdt:P31 wd:Q5864 }","paraphrases":["Who is the {human} for {creator} of {Star Trek}"],"info":{}}
{"id":"train_19895","question":"What sovereign state is classical antiquity associated with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q486761 wdt:P706 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What paramount state is classical relic related with?"],"info":{}}
{"id":"train_19897","question":"What award William Friedkin received at 1971-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q51582 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1971' ) ) }","paraphrases":["Which award did William Friedkin receive in 1971?"],"info":{}}
{"id":"train_19899","question":"Which is the mountain with the highest point in South Australia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q35715 wdt:P610 ?obj . ?obj wdt:P31 wd:Q8502 }","paraphrases":["Name the mountain in South Australia with the highest peak?"],"info":{}}
{"id":"train_19901","question":"Which is the integrated circuit design that was designed by ARM Holdings and starts with the letter a?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1074539 . ?sbj wdt:P287 wd:Q296782 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the integrated circuit sketch that was once designed via ARM Holdings and starts with the letter a?"],"info":{}}
{"id":"train_19902","question":"Which research university is Niels Bohr affiliated with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7085 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q62078547 }","paraphrases":[],"info":{}}
{"id":"train_19903","question":"Tell me about series of Chrysler Building and follows?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q11274 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["Let me know around arrangement of Chrysler Building and takes after?"],"info":{}}
{"id":"train_19904","question":"What is themed after the An-225 Mriya, that has been operated by the Russian Air Force?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178351 wdt:P144 ?answer . ?answer wdt:P137 wd:Q209833 }","paraphrases":["What is themed after the An-225 Mriya, that has been worked by the Russian Discuss Force?"],"info":{}}
{"id":"train_19907","question":"What effect does the disease diabetes mellitus have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12206 wdt:P1542 ?obj . ?obj wdt:P31 wd:Q12136 }","paraphrases":["What does Diabetes. mellitus give?"],"info":{}}
{"id":"train_19914","question":"Is it true that Wallis Simpson is the spouse of Edward VIII?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q209417 wdt:P26 wd:Q590227 }","paraphrases":["Is Wallis Simpson Edward VIII's wife?"],"info":{}}
{"id":"train_19915","question":"Mention the enterprise responsible for owning YouTube.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q866 wdt:P127 ?obj . ?obj wdt:P31 wd:Q6881511 }","paraphrases":["Specify the endeavor dependable for owning YouTube."],"info":{}}
{"id":"train_19916","question":"Which film is named after David Bowie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P138 wd:Q5383 . ?sbj wdt:P31 wd:Q1371849 }","paraphrases":[],"info":{}}
{"id":"train_19919","question":"Which online database contains information about the foundation of University of Toronto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P740 wd:Q180865 . ?sbj wdt:P31 wd:Q7094076 }","paraphrases":["Which online database contains data around the establishment of College of Toronto?"],"info":{}}
{"id":"train_19921","question":"Tell me the rock band that has PureVolume as website and contains the word u2 in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5741069 . ?sbj wdt:P553 wd:Q1508912 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'u2' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the shake band that has PureVolume as site and contains the word u2 in it's name?"],"info":{}}
{"id":"train_19922","question":"What was the position held by Mary II of England in the year 1689?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q130812 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1689' ) ) }","paraphrases":["Mary II of England held what title in 1689?"],"info":{}}
{"id":"train_19923","question":"Which is the Metacritic ID for Titanic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q44578 wdt:P1712 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19924","question":"what award did Friedrich Wöhler achieve at the time of 1872-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q58575 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1872' ) ) }","paraphrases":["What was Friedrich Wöhler nominated for at the time of 1872-1-1?"],"info":{}}
{"id":"train_19927","question":"Which is the woodblock print of the exemplar of The Great Wave off Kanagawa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1574 wd:Q252485 . ?sbj wdt:P31 wd:Q28913685 }","paraphrases":["Which is the woodblock print of the model of The Awesome Wave off Kanagawa?"],"info":{}}
{"id":"train_19928","question":"When is {national holiday} of {comes from} of {Battle Royale} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q864592 wdt:P495 ?X . ?X wdt:P832 ?answer }","paraphrases":["When is {national occasion} of {comes from} of {Fight Royale} ?"],"info":{}}
{"id":"train_19929","question":"What is Salt Lake City's category for films shot and the associated people?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q23337 wdt:P1740 ?ans_1 . wd:Q23337 wdt:P1792 ?ans_2 }","paraphrases":["What films were shot in Salt Lake City and who is associated with it?"],"info":{}}
{"id":"train_19930","question":"Who gave the{voice actors} of {part of series} of {The Butterjunk Effect} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4050992 wdt:P179 ?X . ?X wdt:P725 ?answer }","paraphrases":["Give me the name of the person who gave the voice actors parts in the series The Butterjunk Effect."],"info":{}}
{"id":"train_19932","question":"What is a type of food or dish that starts with the letter t?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19861951 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the kind of food or dish that begins with the letter t"],"info":{}}
{"id":"train_19933","question":"tell me wine color that starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8024923 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me wine color that begins with w"],"info":{}}
