{"id":"train_20920","question":"Who is {premier} of {national} {Denis Leary} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q310283 wdt:P27 ?X . ?X wdt:P6 ?answer }","paraphrases":["Who is {premier} of {national} {Denis Leary} ?"],"info":{}}
{"id":"train_20921","question":"How do you pronounce pasta in Georgian?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q178 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q8108 }","paraphrases":["In Georgian, how is the word pasta pronounced?"],"info":{}}
{"id":"train_20923","question":"Who is the leader of the Mathematical Reviews published by?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q211172 wdt:P123 ?X . ?X wdt:P488 ?answer }","paraphrases":["Who publishes the leader of the Mathematical Reviews?"],"info":{}}
{"id":"train_20924","question":"What is doctoral student  for Jonas Salk ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P185 wd:Q200101 }","paraphrases":[],"info":{}}
{"id":"train_20928","question":"When did Omar Bongo start his position as Vice President of Gabon?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q172083 p:P39 ?s . ?s ps:P39 wd:Q17030478 . ?s pq:P580 ?value }","paraphrases":["When did Omar Bongo begin his position as Bad habit President of Gabon?"],"info":{}}
{"id":"train_20929","question":"Who is the Kang Youwei's NLC authorities.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q360135 wdt:P1213 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20931","question":"What is the ProCyclingStats cyclist ID for Greg LeMond","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q312697 wdt:P1663 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20932","question":"What is a facet of the history of the city of Amsterdam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1269 wd:Q727 . ?sbj wdt:P31 wd:Q28747937 }","paraphrases":["What is an aspect of the historical backdrop of the city of Amsterdam?"],"info":{}}
{"id":"train_20933","question":"Do the daily patronage of the Yakumo Station equal 280?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q848309 wdt:P1373 ?obj filter ( ?obj = 280 ) }","paraphrases":["Is the number of Yakumo Station patrons 280 on a daily basis?"],"info":{}}
{"id":"train_20934","question":"Tell me when  Mark Burnett, executive producer started for the Apprentice?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q863122 p:P1431 ?s . ?s ps:P1431 wd:Q3294019 . ?s pq:P580 ?value }","paraphrases":["At what time did Mark Burnett start as executive producer for the Apprentice?"],"info":{}}
{"id":"train_20935","question":"What is Jane Fonda's AFI person ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41142 wdt:P5340 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20936","question":"which is the {point in time} for {Grigory Potemkin} that has {award received} as {Order of St. George, 3rd class} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q243201 p:P166 ?s . ?s ps:P166 wd:Q14905809 . ?s pq:P585 ?value }","paraphrases":["What is the point received for reward as 3rd class?"],"info":{}}
{"id":"train_20938","question":"Is the Great Gatsby's country of origin in the United States of America?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q214371 wdt:P495 wd:Q30 }","paraphrases":["Did the Great Gatsby take place in the US?"],"info":{}}
{"id":"train_20940","question":"Does Ac sparta prague net profit equals to 22564000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q193481 wdt:P2295 ?obj filter ( ?obj = 22564000 ) }","paraphrases":["Does Ac sparta prague net benefit rises to to 22564000?"],"info":{}}
{"id":"train_20941","question":"What is the film genre of the movie 'Big Bad Wolf'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2476581 wdt:P1441 ?X . ?X wdt:P136 ?answer }","paraphrases":["What is the genre of film for the movie 'Big Bad Wolf?'"],"info":{}}
{"id":"train_20943","question":"Give me the name of earthquake with highest magnitude on magnitude scale?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7944 . ?ent wdt:P2527 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What earthquake has had the most magnitude ever?"],"info":{}}
{"id":"train_20945","question":"Does Easter occur annually?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q21196 wdt:P837 wd:Q50701 }","paraphrases":["Does Easter happen every year?"],"info":{}}
{"id":"train_20947","question":"For how long was Lionel Messi convicted of tax fraud?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q615 p:P1399 ?s . ?s ps:P1399 wd:Q3806932 . ?s pq:P2047 ?value }","paraphrases":["How long was Lionel Messi's sentence for tax fraud?"],"info":{}}
{"id":"train_20951","question":"Where was Peter Abelard buried in 1801-5-4?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4295 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1801' ) ) }","paraphrases":["Where was Peter Abelard buried on May 4, 1801?"],"info":{}}
{"id":"train_20952","question":"Who is the corporate officer of ESPN?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q217776 wdt:P2828 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20953","question":"What is the jurisdiction of the area of {East Nusa Tenggara Province}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5061 wdt:P47 ?X . ?X wdt:P131 ?answer }","paraphrases":["What is the ward of the zone of {East Nusa Tenggara Territory}"],"info":{}}
{"id":"train_20954","question":"Which is the ground that Aly Raisman competes in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q238663 wdt:P1344 ?X . ?X wdt:P115 ?answer }","paraphrases":["Which is the ground that Aly Raisman competes in?"],"info":{}}
{"id":"train_20955","question":"What chemical compound that's part carbon has the least global-warming potential?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2565 ?obj . ?ent wdt:P527 wd:Q623 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["what chemical has the least greenhouse potency?"],"info":{}}
{"id":"train_20959","question":"What occupation did Bob Dole have in 1952?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q319079 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1952' ) ) }","paraphrases":["Bob Dole's occupation in 1952?"],"info":{}}
{"id":"train_20962","question":"What is series after Mihira Bhoja?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q1279558 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P156 ?value1 . }","paraphrases":["What is arrangement after Mihira Bhoja?"],"info":{}}
{"id":"train_20965","question":"What is a mythical serpent that contains the word žaltys is it's name/","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16326794 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'žaltys' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the mythical serpent whose name includes the term  \"žaltys\"."],"info":{}}
{"id":"train_20967","question":"What branch of science did Claude Shannon work in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q92760 wdt:P101 ?obj . ?obj wdt:P31 wd:Q2465832 }","paraphrases":["What department of science did Claude Shannon work in?"],"info":{}}
{"id":"train_20968","question":"Who are the owners working for Simon Ambrose?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7518162 wdt:P108 ?X . ?X wdt:P127 ?answer }","paraphrases":["Who are the current owners of Simon Ambrose?"],"info":{}}
{"id":"train_20970","question":"Which company owns American Airlines ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q32396 wdt:P749 ?obj . ?obj wdt:P31 wd:Q6881511 }","paraphrases":["Which company possesses American Aircrafts ?"],"info":{}}
{"id":"train_20972","question":"What is developed and made from cottonseed oil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q811663 wdt:P1582 ?X . ?X wdt:P3094 ?answer }","paraphrases":["How is developed and made from cottonseed oil"],"info":{}}
{"id":"train_20973","question":"What is dissolved, abolished or demolished by Knossos at the statement with Gregorian date earlier than 1584?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q173527 p:P576 ?s . ?s ps:P576 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["What did Knossos dissolve, abolish or demolish at the Gregorian date earlier than 1584 statement?"],"info":{}}
{"id":"train_20975","question":"Is Lucifer the same as Priapus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q185498 wdt:P460 wd:Q206878 }","paraphrases":["Is Priapus the same person as Lucifer?"],"info":{}}
{"id":"train_20976","question":"What what is de facto standard named after by luminiferous aether by  and which that starts with e","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q385853 . ?sbj wdt:P138 wd:Q208702 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is de facto trendy named after via luminiferous aether by and which that starts offevolved with e"],"info":{}}
{"id":"train_20977","question":"Who owns the Oracle Corporation and what are subsidiaries?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q19900 wdt:P127 ?ans_1 . wd:Q19900 wdt:P355 ?ans_2 }","paraphrases":["Who claims the Prophet Enterprise and what are subsidiaries?"],"info":{}}
{"id":"train_20978","question":"What is a relation that starts with the letter z.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q930933 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a connection that begins with the letter z."],"info":{}}
{"id":"train_20981","question":"What are the naval battle which start with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1261499 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the maritime fight which begin with the letter u"],"info":{}}
{"id":"train_20982","question":"What borough of Volyn Oblast has a Human Development Index of 0.713?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q167859 wdt:P131 ?answer . ?answer wdt:P1081 ?x FILTER ( contains ( ?x , '0.713' ) ) }","paraphrases":["What borough of Volyn Oblast includes a Human Advancement File of 0.713?"],"info":{}}
{"id":"train_20983","question":"What is load set of the order?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1851 wd:Q133250 }","paraphrases":[],"info":{}}
{"id":"train_20984","question":"Who are the voice actors in season 9 of television series American Dad?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15238288 wdt:P179 ?X . ?X wdt:P725 ?answer }","paraphrases":["Who are the voice on-screen characters in season 9 of tv arrangement American Dad?"],"info":{}}
{"id":"train_20985","question":"Is contact dermatitis a symptom of mercury poisoning?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q408089 p:P636 ?s . ?s ps:P636 ?obj . ?s pq:P780 wd:Q783903 }","paraphrases":["Tell me whether mercury poisoning have symptom of contact dermatitis?"],"info":{}}
{"id":"train_20986","question":"What is the dairy product that has the pronunciation audio of Ar-جبن.ogg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q637776 wdt:P1056 ?answer . ?answer wdt:P443 ?x FILTER ( contains ( ?x , 'Ar-جبن.ogg' ) ) }","paraphrases":["What is the dairy item that has the elocution sound of Ar-جبن.ogg?"],"info":{}}
{"id":"train_20988","question":"What is the name of Richard III of Englands' sibling","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3373 wd:Q133028 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is the name of the English sibling Richard III?"],"info":{}}
{"id":"train_20990","question":"In 2004, what was the population of Kenya?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q114 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["In 2004, what was the populace of Kenya?"],"info":{}}
{"id":"train_20991","question":"What is the songwriter of Concerto for Two Violins? They have major works such as Mein Herze schwimmt im Blut and BMW 199.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1094801 wdt:P86 ?answer . ?answer wdt:P800 wd:Q124835 }","paraphrases":["What is the songwriter of Concerto for Two Violins? They have major works such as Mein Herze schwimmt im Blut and BMW 199."],"info":{}}
{"id":"train_20992","question":"Who is {spouse} of {Isabel Allende} where {end time} is {2015-0-0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q83566 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["Who was Isabel Allende's husband in 2015?"],"info":{}}
{"id":"train_20993","question":"What teacher has influence of Sufism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9603 wdt:P737 ?X . ?X wdt:P1066 ?answer }","paraphrases":["Sufism influenced which teacher?"],"info":{}}
{"id":"train_20994","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5558546 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , '♂' ) ) }","paraphrases":["What is it?"],"info":{}}
{"id":"train_20995","question":"When did Elinor Ostrom leave their position at Indiana University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q153761 p:P108 ?s . ?s ps:P108 wd:Q6608367 . ?s pq:P582 ?value }","paraphrases":["Elinor Ostrom left her position at Indiana University on what date?"],"info":{}}
{"id":"train_20996","question":"Which is {diplomatic relation} of {citizenship} of {Bosley Crowther} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q894444 wdt:P27 ?X . ?X wdt:P530 ?answer }","paraphrases":["Which is {diplomatic relation} of {citizenship} of {Bosley Crowther} ?"],"info":{}}
{"id":"train_20997","question":"Name the website of a business enterprise with the lowest number of registered users.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q35127 . ?ent wdt:P1833 ?obj . ?ent wdt:P31 wd:Q4830453 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which business enterprise's website has the fewest registered users."],"info":{}}
{"id":"train_20999","question":"What profession are the characters of Dumbo involved in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40895 wdt:P674 ?X . ?X wdt:P106 ?answer }","paraphrases":["The characters of Dumbo are involved in what profession?"],"info":{}}
{"id":"train_21002","question":"What is the sexual orientation and sex or gender of Little Richard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q82222 wdt:P91 ?ans_1 . wd:Q82222 wdt:P21 ?ans_2 }","paraphrases":["What is Little Richard's gender, in addition to sexual orientation?"],"info":{}}
{"id":"train_21003","question":"When was the De Morgan Medal received by G.H.Hardy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q184337 p:P166 ?s . ?s ps:P166 wd:Q507299 . ?s pq:P585 ?value }","paraphrases":["When G.H.Hardy received the De Morgan Medal?"],"info":{}}
{"id":"train_21006","question":"How many editions or translations of the Diary of Anne Frank are there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P629 wd:Q6911 }","paraphrases":["Which is the number of editions or translations of the Diary of Anne Frank?"],"info":{}}
{"id":"train_21007","question":"Which is the time of earliest written record for Brazzaville?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3844 wdt:P1249 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21008","question":"Which is Web umenia creator ID for Käthe Kollwitz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q142472 wdt:P4887 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21011","question":"Where does Edvard Westermarck work? His sister lives in Copenhagen.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q722835 wdt:P937 ?answer . ?answer wdt:P190 wd:Q1748 }","paraphrases":["Where does Edvard Westermarck work? His sister lives in Copenhagen."],"info":{}}
{"id":"train_21013","question":"How many matches did Gheorghe Hagi play for Galatasaray S.K. and how many goals did he score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q189892 p:P54 ?s . ?s ps:P54 wd:Q495299 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How many games did Gheorghe Hagi play and how many goals did he get?"],"info":{}}
{"id":"train_21016","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41542 wdt:P840 ?answer . ?answer wdt:P948 ?x FILTER ( contains ( ?x , 'Oarda Alba banner.jpg' ) ) }","paraphrases":["What's that?"],"info":{}}
{"id":"train_21020","question":"What is Mir's type of orbit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q48604 wdt:P522 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21021","question":"What airport serves Salt Lake City?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P931 wd:Q23337 . ?sbj wdt:P31 wd:Q1248784 }","paraphrases":["What is Salt Lake City airport?"],"info":{}}
{"id":"train_21022","question":"WHICH IS THE MUNICIPALITY OF GERMANY THAT STARTS WITH W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q262166 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE Region OF GERMANY THAT Begins WITH W"],"info":{}}
{"id":"train_21023","question":"does the hydrazine upper flammable limit equal 98?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q58447 wdt:P2203 ?obj filter ( ?obj = 98 ) }","paraphrases":["Is it true that the hydrazine upper ignitable limit is equal to 98?"],"info":{}}
{"id":"train_21025","question":"Is the PPP GDP per capita of Denmark more than 36429.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q35 wdt:P2299 ?obj filter ( ?obj > 36429.6 ) }","paraphrases":["Is the PPP GDP per capita of Denmark more than 36429.6?"],"info":{}}
{"id":"train_21027","question":"Who is the {anthropomorphic character} for {said to be the same as} of {Goofy}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q111135 wdt:P460 ?obj . ?obj wdt:P31 wd:Q27921916 }","paraphrases":["Who performed as the character Goofy?"],"info":{}}
{"id":"train_21029","question":"who  is the language of work or name of hebrew alphabet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q33513 wdt:P407 ?obj . ?obj wdt:P31 wd:Q34770 }","paraphrases":["What language is the Hebrew alphabet?"],"info":{}}
{"id":"train_21031","question":"When was Harvey Williams Cushing nominated for the Nobel Prize in Physiology or Medicine?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q380038 p:P1411 ?s . ?s ps:P1411 wd:Q80061 . ?s pq:P585 ?value }","paraphrases":["In which year was Harvey Williams Cushing nominated for the Nobel Prize in Physiology or Medicine?"],"info":{}}
{"id":"train_21032","question":"Who is Quentin Tarantino's partner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3772 wdt:P451 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Quentin Tarantino's partner?"],"info":{}}
{"id":"train_21033","question":"Tell me Seven Wonders of the Ancient World whose name has the word mausoleum in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q489772 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'mausoleum' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which of the Seven Wonders of the Ancient World has the word 'mausoleum' in it?"],"info":{}}
{"id":"train_21034","question":"What mineral variety is in the Trigonal Crystal System and starts with the letter \"s\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q429795 . ?sbj wdt:P556 wd:Q588274 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What mineral variety is in the Trigonal Crystal System and begins with the letter \"s\"?"],"info":{}}
{"id":"train_21037","question":"Was Harry Houdini jewish and Romanian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q131545 wdt:P172 wd:Q7325 . wd:Q131545 wdt:P172 wd:Q485150 }","paraphrases":["Was Houdini's background Romanian and Jewish?"],"info":{}}
{"id":"train_21038","question":"Which TV show did Amanda Bynes cast in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P161 wd:Q212002 . ?sbj wdt:P31 wd:Q506240 }","paraphrases":["Amanda Bynes was cast in which tv show?"],"info":{}}
{"id":"train_21039","question":"Why was Theodore von Kármán received the title of doctor honoris causa?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q164384 p:P166 ?s . ?s ps:P166 wd:Q11415564 . ?s pq:P1027 ?value }","paraphrases":["Theodore von Karman became a Doctor of Honoris Causa because of what?"],"info":{}}
{"id":"train_21042","question":"What degree did Dwayne Johnson receive from the University of Miami?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q10738 p:P69 ?s . ?s ps:P69 wd:Q738258 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What degree did Dwayne Johnson receive from the University of Miami?"],"info":{}}
{"id":"train_21044","question":"What are the literary work which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7725634 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the scholarly work which begin with the letter t"],"info":{}}
{"id":"train_21046","question":"What is the denomination of the mechanic patron saint?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q327029 wdt:P417 ?X . ?X wdt:P140 ?answer }","paraphrases":["What is the category of the technician benefactor saint?"],"info":{}}
{"id":"train_21047","question":"What are the polymer that contains the word tyloxapol in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q81163 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tyloxapol' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the polymer that contains the word tyloxapol in their name"],"info":{}}
{"id":"train_21048","question":"What is Czech Olympic Committee athlete ID for Dominik Hašek?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q312695 wdt:P4062 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21049","question":"what are the personal hygiene item which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q53911696 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the individual cleanliness thing which begin with the letter w"],"info":{}}
