{"id":"train_21389","question":"When was ARD owned by Nordwestdeutscher Rundfunk?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q49653 p:P127 ?s . ?s ps:P127 wd:Q446604 . ?s pq:P582 ?value }","paraphrases":["What was the timeline Nordwestdeutscher Rundfunk owned ARD ?"],"info":{}}
{"id":"train_21390","question":"What what is divide and conquer algorithm discoverer or inventor Tony Hoare  \n and also which starts with letter q","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q671298 . ?sbj wdt:P61 wd:Q92602 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'q' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is divide and conquer algorithm discoverer or inventor Tony Hoare and also which begins with letter q"],"info":{}}
{"id":"train_21391","question":"What is the short term exposure limit for benzene?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q2270 wdt:P2407 ?obj }","paraphrases":["The limit for short term exposure to benzene is what?"],"info":{}}
{"id":"train_21393","question":"Is Sarah Palin ethnic group afrikaner or english people?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q43144 wdt:P172 wd:Q841351 . wd:Q43144 wdt:P172 wd:Q42406 }","paraphrases":["Is Sarah Palin's ethnicity Afrikaner or English?"],"info":{}}
{"id":"train_21394","question":"Are linezolid and cinchonidine used to treat malaria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12156 wdt:P2176 wd:Q411377 . wd:Q12156 wdt:P2176 wd:Q412713 }","paraphrases":["Can malaria be treated with linezolid and cinchonidine?"],"info":{}}
{"id":"train_21395","question":"When did Roger B. Taney stop holding the position of United States Attorney General?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q359470 p:P39 ?s . ?s ps:P39 wd:Q636207 . ?s pq:P582 ?value }","paraphrases":["When did Roger B. Taney step down from US Attorney General?"],"info":{}}
{"id":"train_21396","question":"Which is the airline that operates Airbus A320?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P121 wd:Q6475 . ?sbj wdt:P31 wd:Q46970 }","paraphrases":["Which is the aircraft that works Airbus A320?"],"info":{}}
{"id":"train_21397","question":"What place, starting with the letter s, has town rights and privileges as well as listed monuments and objects in Salzburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13539802 . ?sbj wdt:P1456 wd:Q1188436 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What place, beginning with the letter s, has town rights and privileges as nicely as listed monuments and objects in Salzburg?"],"info":{}}
{"id":"train_21398","question":"Where in the Soviet Union did Mikhail Romm die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q461726 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q15180 }","paraphrases":["At which place in Soviet Union did Mikhail Romm die?"],"info":{}}
{"id":"train_21399","question":"What is the relative level of taxon of Indian rhinoceros?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q47910 wdt:P171 ?X . ?X wdt:P105 ?answer }","paraphrases":["What is the relative level of taxon of Indian rhinoceros?"],"info":{}}
{"id":"train_21400","question":"When did James Dean win the Henrietta Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q83359 p:P166 ?s . ?s ps:P166 wd:Q1534911 . ?s pq:P1346 ?value }","paraphrases":["On which date James Dean did win the Henrietta Award?"],"info":{}}
{"id":"train_21402","question":"Which painting is the widest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3305213 . ?ent wdt:P2049 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which portray is the largest?"],"info":{}}
{"id":"train_21406","question":"What is the themed after gray whose unit conversion is 0.001?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190095 wdt:P144 ?answer . ?answer wdt:P2442 ?x FILTER ( contains ( ?x , '0.001' ) ) }","paraphrases":["What is the themed after grey whose unit conversion is 0.001?"],"info":{}}
{"id":"train_21407","question":"Which is the hydraulic head of Grand Coulee Dam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q930391 wdt:P4441 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21408","question":"What is Tanzania method in determining total fertility rate of 5.616?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q924 p:P4841 ?s . ?s ps:P4841 ?x filter ( contains ( ?x , '5.616' ) ) . ?s pq:P459 ?value }","paraphrases":["How did Tanzania determine the fertility rate of 5.616?"],"info":{}}
{"id":"train_21409","question":"When Karl Jaspers was nominated for Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q76509 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["When did Karl Jaspers get nominated for Noble Prize in Literature?"],"info":{}}
{"id":"train_21410","question":"Which is the allegiance of Knights Templar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41300 wdt:P945 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21411","question":"What is the twin city of the birth city of Francisco Javier Rodríguez Hernández?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q54152861 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["What city is the twin city to the birthplace of Francisco Javier Rodriguez Hernandez?"],"info":{}}
{"id":"train_21412","question":"Who is nominated for RoboCop that of nominee is Aaron Rochin ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q372514 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q302535 }","paraphrases":["Who is nominated in RoboCop which was nominated by Aaron Rochin ?"],"info":{}}
{"id":"train_21414","question":"What is the abjad that starts with a and is a facet of Judæo-Persian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q185087 . ?sbj wdt:P1269 wd:Q33367 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the abjad that begins with a and is a facet of Judæo-Persian?"],"info":{}}
{"id":"train_21416","question":"What is the subtopic of the spin proton decay} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1065997 wdt:P1269 ?X . ?X wdt:P1122 ?answer }","paraphrases":["What is the subtopic of the turn proton rot} ?"],"info":{}}
{"id":"train_21417","question":"What is DNF ID for Elle Macpherson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q224097 wdt:P2626 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21420","question":"Which is the piano cycle with the lowest number of parts of a work of art, whose parts of the class is variation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1746056 . ?ent wdt:P2635 ?obj . ?ent wdt:P2670 wd:Q214981 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the least amount of varied artwork pieces within a piano cycle?"],"info":{}}
{"id":"train_21423","question":"Which is the WIldflowers of Israel ID for Prunus dulcis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q39918 wdt:P3746 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21425","question":"What song by Johnny Hallyday has sold the most?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7366 . ?ent wdt:P2664 ?obj . ?ent wdt:P175 wd:Q212015 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What Johnny Halladay song has sold the most?"],"info":{}}
{"id":"train_21426","question":"Who is the painters for the series By Royal Command?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1531057 wdt:P179 ?X . ?X wdt:P170 ?answer }","paraphrases":["Who is the painters for the arrangement By Regal Command?"],"info":{}}
{"id":"train_21427","question":"Name a music genre that starts with letter M","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188451 . ?sbj wdt:P1382 wd:Q62908818 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a music sort that begins with letter M"],"info":{}}
{"id":"train_21428","question":"Name the Duplex stainless steel that is used in the food industry and has the most amount of Young's modulus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q48769471 . ?ent wdt:P5480 ?obj . ?ent wdt:P366 wd:Q27721689 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the Duplex stainless steel that is used in the food enterprise and has the most amount of Young's modulus?"],"info":{}}
{"id":"train_21429","question":"Who is {member of} {discoverer} to {berkelium} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1882 wdt:P61 ?X . ?X wdt:P463 ?answer }","paraphrases":["Who is {part of} {pioneer} to {berkelium} ?"],"info":{}}
{"id":"train_21430","question":"What connects to the cochlea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2789 wd:Q317857 }","paraphrases":[],"info":{}}
{"id":"train_21431","question":"Are the Bee Gees from the United Kingdom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q133405 wdt:P495 wd:Q145 }","paraphrases":["Did the UK produce the Bee Gees?"],"info":{}}
{"id":"train_21433","question":"Who invented the Turing machine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q163310 wdt:P61 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["The Turing machine was invented by who?"],"info":{}}
{"id":"train_21434","question":"which is the medical speciality of murder methods of ulrike meinhof","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q76543 wdt:P509 ?X . ?X wdt:P1995 ?answer }","paraphrases":["Which is the medical specialty for murder methods of Ulrike Meinhof?"],"info":{}}
{"id":"train_21435","question":"What sports team is Gheorghe Hagi a member of and how many matches did he play?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q189892 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["What sports group is Gheorghe Hagi a member of and how many suits did he play?"],"info":{}}
{"id":"train_21436","question":"WHICH IS THE TRAIN SERVICE THAT CONTAINS THE WORD VERMONTER IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15141321 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vermonter' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT TRAIN SERVICE CARRY THE WORD VERMONTER IN THEIR NAME"],"info":{}}
{"id":"train_21437","question":"Where was Pays de la Loire shares border with on 2015-12-31?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q16994 p:P47 ?s . ?s ps:P47 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["Who did Pays de la Loire share it's border with in 2016?"],"info":{}}
{"id":"train_21438","question":"What is the musical instrument the lyricist uses in We Are the Champions?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q238564 wdt:P676 ?X . ?X wdt:P1303 ?answer }","paraphrases":["What is the musical instrument the lyricist makes use of in We Are the Champions?"],"info":{}}
{"id":"train_21440","question":"Tell me the dimensionless quantity that contains the word strain in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q126818 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'strain' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the dimensionless quantity that carries the phrase stress in their identify"],"info":{}}
{"id":"train_21442","question":"What interger sequence has the lowest limit and is a natural number?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2297602 . ?ent wdt:P5447 ?obj . ?ent wdt:P527 wd:Q21199 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What sequence of integers has both the lowest limit and is a natural number?"],"info":{}}
{"id":"train_21443","question":"The history of Azerbaijan, which contains the Masally District, falls under which topic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q188328 wdt:P1269 ?answer . ?answer wdt:P150 wd:Q476695 }","paraphrases":["The records of Azerbaijan, which carries the Masally District, falls underneath which topic?"],"info":{}}
{"id":"train_21444","question":"When did Grigori Kozintsev receive the award for People's Artist of the USSR?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q553072 p:P166 ?s . ?s ps:P166 wd:Q403569 . ?s pq:P585 ?value }","paraphrases":["When did Grigori Kozintsev get the grant for People's Craftsman of the USSR?"],"info":{}}
{"id":"train_21446","question":"When was Leigh Matthews awarded as Coleman Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6519630 p:P166 ?s . ?s ps:P166 wd:Q5143019 . ?s pq:P585 ?value }","paraphrases":["When was the Coleman Medal awarded to Leigh Matthews?"],"info":{}}
{"id":"train_21447","question":"What record did Tye Harvey win in which sport?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3546003 wdt:P2416 ?X . ?X wdt:P1000 ?answer }","paraphrases":["What record did Tye Harvey win in which sport?"],"info":{}}
{"id":"train_21448","question":"What work did Dante Alighieri write or translate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P50 wd:Q1067 . ?sbj wdt:P31 wd:Q3331189 }","paraphrases":[],"info":{}}
{"id":"train_21449","question":"Who is the subsidiary for Air France?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q131005 wdt:P355 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21450","question":"Where was Wladyslaw  Reymount given birth to in Kobiele Wielkie?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q121180 p:P19 ?s . ?s ps:P19 wd:Q2248969 . ?s pq:P17 ?value }","paraphrases":["Where was Wladyslaw Reymount brought forth in Kobiele Wielkie?"],"info":{}}
{"id":"train_21452","question":"Which is British Museum place ID for Egypt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q79 wdt:P3633 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21453","question":"What type of money do they use in Hong Kong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8646 wdt:P38 ?obj . ?obj wdt:P31 wd:Q8142 }","paraphrases":["What is the currency in Hong Kong?"],"info":{}}
{"id":"train_21457","question":"Does the cost of the Bigmoon Nights equal 3600.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4327733 wdt:P2130 ?obj filter ( ?obj = 3600.0 ) }","paraphrases":["Does the Bigmoon Nights cost 3600?"],"info":{}}
{"id":"train_21458","question":"Mention the person related to veganism","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q181138 wdt:P3938 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Specify the individual related to veganism"],"info":{}}
{"id":"train_21459","question":"IS THE FUSION ENTHALPY OF THE LITHIUM HYDRIDE EQUALS -26.16","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q79583 wdt:P2066 ?obj filter ( ?obj = -26.16 ) }","paraphrases":["IS IT TRUE THAT THE FUSION ENTHALPY OF THE LITHIUM HYDRIDE IS EQUIVALENT TO -26.16?"],"info":{}}
{"id":"train_21461","question":"Who directed the series Win Some, Lose Some?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51126677 wdt:P179 ?X . ?X wdt:P57 ?answer }","paraphrases":["Who managed the Win Some series, Lose Some?"],"info":{}}
{"id":"train_21463","question":"Is it true that the number of seats of the Ginninderra equals to 5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2973614 wdt:P1342 ?obj filter ( ?obj = 5 ) }","paraphrases":["Is it genuine that the number of seats of the Ginninderra rises to to 5?"],"info":{}}
{"id":"train_21464","question":"Is the networth of Rihanna less than 276,000,000 $?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q36844 wdt:P2218 ?obj filter ( ?obj < 276000000.0 ) }","paraphrases":["Is Rihanna's net worth less than $ 276,000,000?"],"info":{}}
{"id":"train_21465","question":"Name the aerospace manufacturer located in Otrokovice that has the least total revenue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q936518 . ?ent wdt:P2139 ?obj . ?ent wdt:P159 wd:Q1009095 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What's the name of the aerospace manufacturer located in Otrokovice with the least total revenue"],"info":{}}
{"id":"train_21467","question":"Which is the Tennis Temple player ID for Margaret Court?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q202342 wdt:P4544 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21469","question":"How much is owned by the Deutsche Bank?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q66048 wdt:P127 ?obj }","paraphrases":["What is the total dollar value of the Deutsch Bank holdings?"],"info":{}}
{"id":"train_21470","question":"Tell me which Web API contains the word xmlhttprequest in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20202982 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'xmlhttprequest' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose to me which Web API contains the word xmlhttprequest in its name"],"info":{}}
{"id":"train_21471","question":"Tell me a legal case that begins with the letter \"u\" and applies jurisdiction to the United States.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2334719 . ?sbj wdt:P1001 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a legal case that starts with the letter \"u\" and applies jurisdiction to the United States."],"info":{}}
{"id":"train_21472","question":"Is Moses same as Moses in Islam and Moses in rabbinic literature?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9077 wdt:P460 wd:Q1990155 . wd:Q9077 wdt:P460 wd:Q6916012 }","paraphrases":["Is the Moses in Islam and Moses in rabbinic literature the same?"],"info":{}}
{"id":"train_21473","question":"What character did Maureen McCormick play in The Brady Bunch?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q250767 p:P161 ?s . ?s ps:P161 wd:Q454374 . ?s pq:P453 ?value }","paraphrases":["Who did Maureen McCormick play in The Brady Bunch?"],"info":{}}
{"id":"train_21475","question":"What was the award Kenzo Tange received in 1987-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q151794 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1987' ) ) }","paraphrases":["Kenzo Tange received what award n 01/01/1987?"],"info":{}}
{"id":"train_21476","question":"What is a sports team whose name starts with the letter w.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12973014 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is a sports team whose name begins with the letter w."],"info":{}}
{"id":"train_21478","question":"What position did Rajiv Gandhi hold that ended on December 2, 1989?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4593 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1989' ) ) }","paraphrases":["What position did Rajiv Gandhi hold that finished on December 2, 1989?"],"info":{}}
{"id":"train_21479","question":"Which is the direction relative to location of back?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q133279 wdt:P654 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21482","question":"Tell me economics crisis whose name has the word period in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q290178 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'period' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know financial matters emergency whose title has the word period in it."],"info":{}}
{"id":"train_21483","question":"What are the parabolic differential equation which start with the letter equation","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1575416 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'equation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the illustrative differential condition which begin with the letter equation"],"info":{}}
{"id":"train_21484","question":"{Balto} is {animal breed}.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q805807 wdt:P4743 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21486","question":"When did Mia Farrow break up with Woody Allen?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q202725 p:P451 ?s . ?s ps:P451 wd:Q25089 . ?s pq:P582 ?value }","paraphrases":["When did Mia Farrow split with Woody Allen?"],"info":{}}
{"id":"train_21487","question":"Which is the city designated by government ordinance which contains the word ōsaka in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1749269 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ōsaka' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the city assigned by government law which contains the word ōsaka in it's name?"],"info":{}}
{"id":"train_21488","question":"When did Neil Gaiman receive his award for Hugo?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q210059 p:P166 ?s . ?s ps:P166 wd:Q1056240 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["On what date did Neil Gaiman get his award for the movie Hugo?"],"info":{}}
{"id":"train_21490","question":"When did Gottlob Frege acquire his academic degree in habilitation.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q60028 p:P512 ?s . ?s ps:P512 wd:Q308678 . ?s pq:P585 ?value }","paraphrases":["Gottlob Frege graduated with a degree in habilitation when?"],"info":{}}
{"id":"train_21491","question":"Is Ryan Giggs the head coach of the national association football team?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P286 wd:Q10524 . ?sbj wdt:P31 wd:Q6979593 }","paraphrases":["Is Ryan Giggs the national football team's head coach?"],"info":{}}
{"id":"train_21492","question":"Who is the mentor of Strabo, who has the profession as a philosopher?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q45936 wdt:P1066 ?answer . ?answer wdt:P106 wd:Q4964182 }","paraphrases":["Who is the tutor of Strabo, who has the calling as a philosopher?"],"info":{}}
{"id":"train_21493","question":"Are Daniel Day-Lewis and Michael Balcon related?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q166389 wdt:P1038 wd:Q1362106 }","paraphrases":["Is Michael Balcon related to Daniel Day-Lewis?"],"info":{}}
