{"id":"train_24061","question":"Tell me psychoactive drug  whose name has the word opium  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3706669 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'opium' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a psychoactive medicine whose name contains the word opium."],"info":{}}
{"id":"train_24076","question":"Which {human population} {head quarters} is {Gemäldegalerie} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q165631 wdt:P159 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Which { human population } is { Painting Gallery }?"],"info":{}}
{"id":"train_24078","question":"what is computer model collection by museum of modern art  and also which starts with letter m","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55990535 . ?sbj wdt:P195 wd:Q188740 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is computer demonstrate collection by gallery of cutting edge craftsmanship conjointly which begins with letter m"],"info":{}}
{"id":"train_24079","question":"Who replaced Felipe González in the position of Prime Minister of Spain?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q156799 p:P39 ?s . ?s ps:P39 wd:Q844587 . ?s pq:P1366 ?value }","paraphrases":["Who succeeded Felipe González as Prime Minister of Spain?"],"info":{}}
{"id":"train_24085","question":"Tell me the history of Texas which towns are apart of this country.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1149383 wdt:P1269 ?X . ?X wdt:P150 ?answer }","paraphrases":["Let me know the history of Texas which towns are separated of this nation."],"info":{}}
{"id":"train_24095","question":"Where was the sculpture \"Sunflowers\" created?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q157541 wdt:P170 ?X . ?X wdt:P937 ?answer }","paraphrases":["WHERE IS THE SCULPTURE OF SUNFLOWERS CREATED"],"info":{}}
{"id":"train_24098","question":"Does Alice Cooper play the harmonica?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q332032 wdt:P1303 wd:Q51290 }","paraphrases":["Alice Cooper is an American singer, songwriter, and actor whose career spans over fifty years. With his distinctive raspy voice and a stage show that features guillotines, electric chairs, fake blood, .."],"info":{}}
{"id":"train_24109","question":"Where is Bjørnstjerne Bjørnson's burial plot in Vår Frelsers gravlund?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q46405 p:P119 ?s . ?s ps:P119 wd:Q1069938 . ?s pq:P965 ?value }","paraphrases":["In Var Freslers gravlund where is Bjornstjerne Bjornson buried?"],"info":{}}
{"id":"train_24118","question":"What new religious movement starts with the letter \"s\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q477544 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What modern devout development begins with the letter \"s\"?"],"info":{}}
{"id":"train_24120","question":"IS THE BOILING POINT OF THE METHANOL EQUALS TO 117.6","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q14982 wdt:P2102 ?obj filter ( ?obj = 117.6 ) }","paraphrases":["IS THE Bubbling POINT OF THE METHANOL Breaks even with TO 117.6"],"info":{}}
