{"id":"train_12555","question":"What is the maximum cruising speed of a Maersk E-class container ship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q559026 . ?ent wdt:P2217 ?obj . ?ent wdt:P155 wd:Q5274902 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["The Maersk E-class container ship has what maximum cruising speed?"],"info":{}}
{"id":"train_12556","question":"Who gave the{portrayed by} of {fork of} of {Can't Help Falling in Love} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27921434 wdt:P144 ?X . ?X wdt:P175 ?answer }","paraphrases":["Who gave the{portrayed by} of {fork of} of {Can't Offer assistance Falling in Cherish} ?"],"info":{}}
{"id":"train_12557","question":"What is the twinned administrative body of Ljubljana that started at 1997-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q437 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1997' ) ) }","paraphrases":["Explain and name the twinned administrative body of Ljubljana that started January 1, 1997."],"info":{}}
{"id":"train_12559","question":"What physical theory starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9357058 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What physical hypothesis begins with the letter \"t\"?"],"info":{}}
{"id":"train_12561","question":"Which epistle is present in work of Melchizedek?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q219395 wdt:P1441 ?obj . ?obj wdt:P31 wd:Q215495 }","paraphrases":[],"info":{}}
{"id":"train_12562","question":"When was Sofia located in the time zone of UTC+03:00?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q472 p:P421 ?s . ?s ps:P421 wd:Q6760 . ?s pq:P1264 ?value }","paraphrases":["At what point was Sofia found in the UTC+03:00 time zone?"],"info":{}}
{"id":"train_12563","question":"Which is the temporal range start of Cambrian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P523 wd:Q79064 }","paraphrases":[],"info":{}}
{"id":"train_12564","question":"Who built the computing platform MS-DOS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q47604 wdt:P400 ?X . ?X wdt:P176 ?answer }","paraphrases":["Who built the computing stage MS-DOS?"],"info":{}}
{"id":"train_12565","question":"Which award was received by Ilya Frank together with Pavel Cherenkov?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q192703 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q76970 }","paraphrases":["Name the award received by Ilya Frank and Pavel Cherenkov."],"info":{}}
{"id":"train_12571","question":"Name a website published by News Corporation that starts with letter M","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q35127 . ?sbj wdt:P749 wd:Q185278 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a internet site posted by News Corporation that begins with letter M"],"info":{}}
{"id":"train_12573","question":"Who is the discoverer of californium whose birthyear is 1912-3-9 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1888 wdt:P61 ?answer . ?answer wdt:P569 ?x FILTER ( contains ( YEAR ( ?x ) , '1912' ) ) }","paraphrases":["Who is the pioneer of californium whose birthyear is 1912-3-9 ?"],"info":{}}
{"id":"train_12577","question":"Which legal station has high life expectancy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q4209223 . ?ent wdt:P2250 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which legal station has long operating life?"],"info":{}}
{"id":"train_12582","question":"Does Lionel Messi play Rugby union","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q615 wdt:P641 wd:Q5849 }","paraphrases":["Is Lionel Messi playing Rugby union?"],"info":{}}
{"id":"train_12585","question":"What championship starts with the letter \"w\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1079023 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What championship does the letter \"w\" start with?"],"info":{}}
{"id":"train_12586","question":"What are Symptoms of Leukemia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q29496 wdt:P780 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12587","question":"What is the genetic association of obesity that is determined by TAS?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12174 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q23190853 }","paraphrases":["What has TAS determined is the genetic association of obesity?"],"info":{}}
{"id":"train_12591","question":"When did Paul Dirac receive the Helmholtz Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47480 p:P166 ?s . ?s ps:P166 wd:Q1562616 . ?s pq:P585 ?value }","paraphrases":["On which date did Paul Dirac receive the Helmholtz Medal?"],"info":{}}
{"id":"train_12592","question":"When did Qarshi's population reach 212,200?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q644008 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '212200.0' ) ) . ?s pq:P585 ?value }","paraphrases":["The number of people living in Quarshi grew to 212,000 what year?"],"info":{}}
{"id":"train_12593","question":"Is Diana Ross genre from Southern soul?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q36290 wdt:P136 wd:Q1567032 }","paraphrases":["Does Diana Ross's genre belong to the Southern Soul?"],"info":{}}
{"id":"train_12594","question":"What is the satellite that orbits Earth and has \"international\" in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q195339 . ?sbj wdt:P397 wd:Q2 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'international' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the satellite that orbits Earth and has \"international\" in it is name?"],"info":{}}
{"id":"train_12595","question":"Which diagnostic test contains the word zweigläserprobe in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1762591 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zweigläserprobe' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which demonstrative test contains the word zweigläserprobe in their title"],"info":{}}
{"id":"train_12596","question":"Which is Rockipedia artist ID for Andraé Crouch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q493028 wdt:P5172 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12597","question":"What's the mkhare for Bilbao's twinned administrative body?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q8692 . ?sbj wdt:P31 wd:Q1210300 }","paraphrases":["What is the mkhare for the twinning administrative body of Bilbao?"],"info":{}}
{"id":"train_12600","question":"Is the admission rate of McGill University 46.3%?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q201492 wdt:P5822 ?obj filter ( ?obj = 0.463 ) }","paraphrases":["Is McGill University's admission rate 46.3 %?"],"info":{}}
{"id":"train_12601","question":"What is the extreme point lowest of United States Virgin Islands, that has tributary is Magdalena River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11703 wdt:P1589 ?answer . ?answer wdt:P974 wd:Q191829 }","paraphrases":["What is the extreme point lowest of United States Virgin Islands, that has tributary is Magdalena River?"],"info":{}}
{"id":"train_12603","question":"What city or area in the Philippines governed by a mayor has the lowest fiscal tax revenue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q24764 . ?ent wdt:P3087 ?obj . ?ent wdt:P1313 wd:Q30185 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What Filipino area or city is governed by a mayor that has the lowest fiscal tax revenue?"],"info":{}}
{"id":"train_12604","question":"What atmospheric optical phenomenon starts with s?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29564129 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What air optical marvel begins with s?"],"info":{}}
{"id":"train_12605","question":"What is the sovereign state of Citizenship country of Vladimir Lenin","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1394 wdt:P27 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_12607","question":"What is the { start time } for { Kaifeng } { in the territorial administrative entity } like { Henan }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q208471 p:P131 ?s . ?s ps:P131 wd:Q43684 . ?s pq:P580 ?value }","paraphrases":["which is an the { start time } for { Kaifeng } { in the territorial administrative entity } like { Henan }?"],"info":{}}
{"id":"train_12608","question":"What is {trend} of {scriptwriter} by {The Europeans} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1405838 wdt:P58 ?X . ?X wdt:P135 ?answer }","paraphrases":["Name the Europeans' scriptwriter trend."],"info":{}}
{"id":"train_12611","question":"Who is the student of Odilon Redon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P802 wd:Q154349 }","paraphrases":[],"info":{}}
{"id":"train_12613","question":"Was Beastie_Boys genre alternative hip hop and nu metal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q214039 wdt:P136 wd:Q438503 . wd:Q214039 wdt:P136 wd:Q263734 }","paraphrases":["Was Beastie_Boys class elective hip jump and nu metal?"],"info":{}}
{"id":"train_12614","question":"What is the history and location of origin of The Velvet Underground?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q103550 wdt:P740 ?ans_1 . wd:Q103550 wdt:P138 ?ans_2 }","paraphrases":["Provide the history and location of the origin of The Velvet Underground?"],"info":{}}
{"id":"train_12615","question":"When did Augusto Pinochet become President of Chile?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q368 p:P39 ?s . ?s ps:P39 wd:Q466956 . ?s pq:P580 ?value }","paraphrases":["On what date did Augusto Pinochet begin serving as the President of Chile?"],"info":{}}
{"id":"train_12617","question":"Which is the single entity of population for the official residence of Parthian Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1986139 wdt:P263 ?obj . ?obj wdt:P31 wd:Q3055118 }","paraphrases":[],"info":{}}
{"id":"train_12619","question":"Who operated the Boeing 747 on June 28, 2000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q179 p:P137 ?s . ?s ps:P137 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["Who was the Boeing 747's operator on June 28, 2000?"],"info":{}}
{"id":"train_12621","question":"When was the Hyogo Prefecture first known as \"Western Australia\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q130290 p:P190 ?s . ?s ps:P190 wd:Q3206 . ?s pq:P580 ?value }","paraphrases":["When was the first Hyogo Prefecture was called \"Wester Australia\"?"],"info":{}}
{"id":"train_12622","question":"Which is {afflicts} {result} of {lindane} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q282003 wdt:P1542 ?X . ?X wdt:P689 ?answer }","paraphrases":["Which is {harrows} {result} of {lindane} ?"],"info":{}}
{"id":"train_12623","question":"What is family of Akhenaten ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P53 wd:Q81794 }","paraphrases":[],"info":{}}
{"id":"train_12624","question":"which means {Ballotpedia ID} at the{New York} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1384 wdt:P2390 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12626","question":"Who  is sponsor of Neymar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q142794 wdt:P859 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12627","question":"which sports  laegue starts with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q623109 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which sports laegue begins with the letter s"],"info":{}}
{"id":"train_12628","question":"What are the slave rebellion  which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1155622 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the slave disobedience which begin with the letter w"],"info":{}}
{"id":"train_12629","question":"Name a supercomputer by Oracle.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P156 wd:Q19900 . ?sbj wdt:P31 wd:Q121117 }","paraphrases":[],"info":{}}
{"id":"train_12630","question":"Which is the Tennis Archives player ID for Richard Sears?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q470242 wdt:P3670 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12631","question":"What follows the next series of \"The Godfather Part II\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q184768 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What takes after the following arrangement of \"The Adoptive parent Portion II\"?"],"info":{}}
{"id":"train_12633","question":"How much money did Karl Adolph Gjellerup win for getting the Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q131487 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P2121 ?value }","paraphrases":["What was the Nobel Prize in Literature monetary payout for Karl Adolph Gjellerup?"],"info":{}}
{"id":"train_12637","question":"Which is the brand for the product which is produced by The Coca-Cola Company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3295867 wdt:P1056 ?obj . ?obj wdt:P31 wd:Q431289 }","paraphrases":["Which is the brand for the item which is delivered by The Coca-Cola Company?"],"info":{}}
{"id":"train_12639","question":"Who influenced Roald Dahl's career?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q25161 wdt:P737 ?X . ?X wdt:P106 ?answer }","paraphrases":["Who impacted Roald Dahl's career?"],"info":{}}
{"id":"train_12642","question":"Which is the location of discovery of lanthanum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1801 wdt:P189 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12643","question":"Where is the location of death for Henry VI of England, whose partner town is Berlin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q160337 wdt:P20 ?answer . ?answer wdt:P190 wd:Q64 }","paraphrases":["Where is England's death location for Henry VI, whose partner city is Berlin?"],"info":{}}
{"id":"train_12644","question":"Tell me  television station whose name has the word åland24  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1616075 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'åland24' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me television station whose name has the word åland24 in it."],"info":{}}
{"id":"train_12645","question":"Tell me legal status whose name has the word status in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2628882 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'status' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know legitimate status whose title has the word status in it."],"info":{}}
{"id":"train_12646","question":"What is the female population of Lucknow?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q47916 wdt:P1539 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12647","question":"Name a space probe launched from Cape Canaveral that contains the word \"voyager\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26529 . ?sbj wdt:P1427 wd:Q1034348 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'voyager' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a space observatory wose starting point is ELA-3, containing in its name the word \"space\""],"info":{}}
{"id":"train_12648","question":"Is the decomposition point of 1,1,2,2-tetrabromoethane 474","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q161271 wdt:P2107 ?obj filter ( ?obj = 474 ) }","paraphrases":["Is 474 the decomposition point of 1,1,2,2-tetrabromoethane?"],"info":{}}
{"id":"train_12649","question":"What is in the category of Pyrros Dimas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q366824 wdt:P4489 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12652","question":"What is the character already performed by Basil Rathbone that contains the word \" holmes\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15773317 . ?sbj wdt:P175 wd:Q336865 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'holmes' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the character previously performed by Basil Rathbone that contains the word \" holmes\" in its name ?"],"info":{}}
{"id":"train_12653","question":"Name a measurable physical quantity that contains the word \"mass\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3386703 . ?sbj wdt:P1880 wd:Q843816 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'mass' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a measurable physical quantity that incorporates the phrase \"mass\" in its name"],"info":{}}
{"id":"train_12654","question":"Who was the student of Ludwig van Beethoven in 1795?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q255 p:P1066 ?s . ?s ps:P1066 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1795' ) ) }","paraphrases":["What was the name of Ludwig van Beethoven's student in 1795?"],"info":{}}
{"id":"train_12656","question":"Give me the series ordinal for the Lion King with film crew member Lisa Keene.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36479 p:P3092 ?s . ?s ps:P3092 wd:Q3242412 . ?s pq:P1545 ?value }","paraphrases":["donate to me series ordinal for the Lion King with film crew member Lisa Keene."],"info":{}}
{"id":"train_12657","question":"When did John C. Fremont leave the United States Senate as a Senator?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q169011 p:P39 ?s . ?s ps:P39 wd:Q13217683 . ?s pq:P582 ?value }","paraphrases":["When did John C. Fremont retire from the United States Senate?"],"info":{}}
{"id":"train_12658","question":"Was Rupert Murdoch educated at London School of Economics and Worcester College?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q53944 wdt:P69 wd:Q174570 . wd:Q53944 wdt:P69 wd:Q780745 }","paraphrases":["Did Rupert Murdoch study at the London School or Economics or at Worcester College?"],"info":{}}
{"id":"train_12659","question":"Where in Connecticut did Addison Mort Walker die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q719973 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P131 wd:Q779 }","paraphrases":["Addison Mort Walker died in which part of Connecticut?"],"info":{}}
{"id":"train_12660","question":"Is the power consumption of the Toulouse 46,600,600?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1129485 wdt:P2791 ?obj filter ( ?obj = 46600000 ) }","paraphrases":["Is Toulouse's electricity consumption 46,600,600?"],"info":{}}
{"id":"train_12661","question":"What school did Antonin Scalia attend and what was his major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q11156 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["What school did Antonin Scalia attend and what used to be his major?"],"info":{}}
{"id":"train_12665","question":"Who is the player that was part of the player event of Juan Gris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q151152 wdt:P1344 ?X . ?X wdt:P710 ?answer }","paraphrases":["Which player participated in the player event of Juan Gris?"],"info":{}}
{"id":"train_12666","question":"What is the birth place of Antonius Pius which is located in the administrative territorial entity of Lanuvium?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1429 p:P19 ?s . ?s ps:P19 wd:Q2832670 . ?s pq:P131 ?value }","paraphrases":["Where in Lanuvium was Antonius Pius born?"],"info":{}}
{"id":"train_12667","question":"What is the name of the cat owned by Jacinda Ardern?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3606816 wdt:P1429 ?obj . ?obj wdt:P31 wd:Q146 }","paraphrases":["What is the title of the cat claimed by Jacinda Ardern?"],"info":{}}
{"id":"train_12670","question":"What is pronunciation audio of Mentha language of work or name is Punjabi?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q47859 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q58635 }","paraphrases":["How do you say Mentha language of work or name in Punjabi?"],"info":{}}
{"id":"train_12671","question":"What is the birthplace of Rudolf Koegel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1505788 wdt:P19 ?X . ?X wdt:P190 ?answer }","paraphrases":["Where was Rudolf Koegel born?"],"info":{}}
{"id":"train_12672","question":"What is in the Indian reserve of Jiangxi, that is located in China?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57052 wdt:P131 ?answer . ?answer wdt:P3896 ?x FILTER ( contains ( ?x , 'Data:China.map' ) ) }","paraphrases":["What is in the Indian reserve of Jiangxi, that is positioned in China?"],"info":{}}
{"id":"train_12673","question":"What are the names of Joseph Stalin's child?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P22 ?value1 . }","paraphrases":["What are the names of Joseph Stalin's child?"],"info":{}}
{"id":"train_12674","question":"TELL ME THERMODYNAMIC PROCESS WHICH START WITH THE LETTER P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q213016 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know THERMODYNAMIC Prepare WHICH Begin WITH THE LETTER P"],"info":{}}
{"id":"train_12678","question":"'o'","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q149537 . ?sbj wdt:P1433 wd:Q19084241 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["'o'"],"info":{}}
