{"id":"train_3506","question":"Where in Sweden Max von Sydow was born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q203215 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q34 }","paraphrases":["Where in Sweden was Max von Sydow was born?"],"info":{}}
{"id":"train_3508","question":"Is the wavelength of the Hydrogen Line 25.327336865?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1406191 wdt:P2808 ?obj filter ( ?obj = 25.327336865 ) }","paraphrases":["Does Hydrogen Line have a wavelength of 25.327336865?"],"info":{}}
{"id":"train_3509","question":"Where is the headquarters of the national museum of Prague?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q188112 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P276 wd:Q43755714 }","paraphrases":["Where is Prague's national museum headquartered?"],"info":{}}
{"id":"train_3510","question":"What is the number of Parkinson's disease genetic associations?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2293 wd:Q11085 }","paraphrases":["How many genetic markers are associated with Parkinson's disease?"],"info":{}}
{"id":"train_3511","question":"What was Mary Martin nominated for in 1967?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q285483 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1967' ) ) }","paraphrases":["What nominations did Mary Martin receive in 1967?"],"info":{}}
{"id":"train_3512","question":"What is the way to pronunciation taxon parent of Mentha spicata?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q160114 wdt:P171 ?X . ?X wdt:P443 ?answer }","paraphrases":["How is taxon parent of Mentha spicata pronounced?"],"info":{}}
{"id":"train_3513","question":"What are the physical consequences and drug interactions of Cocaine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q41576 wdt:P129 ?ans_1 . wd:Q41576 wdt:P769 ?ans_2 }","paraphrases":["What are some complications that may arise from interaction with cocaine?"],"info":{}}
{"id":"train_3514","question":"How many matches did Dixie Dean of Sligo Rovers F.C. play and what was his statistics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q316323 p:P54 ?s . ?s ps:P54 wd:Q244874 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["Tell me how many matches Dixie Dean of Sligo Rovers FC played and what his main statistics were."],"info":{}}
{"id":"train_3516","question":"What type of expression does Wayne Carey use?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7976079 wdt:P1412 ?X . ?X wdt:P4132 ?answer }","paraphrases":["How does Wayne Carey emote?"],"info":{}}
{"id":"train_3517","question":"What award did Roger Federer receive in 2009?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1426 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["In 2009, what away did Roger Federer win?"],"info":{}}
{"id":"train_3519","question":"What is the  Q48460  faith of Pala Empire ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q668412 wdt:P140 ?X . ?X wdt:P1036 ?answer }","paraphrases":["What's the meaning of \"Q48460 faith of Pala Empire\"?"],"info":{}}
{"id":"train_3523","question":"WHAT ARE THE KING IN GREEK MYTHOLOGY STARTS WITH t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24434794 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE KING IN GREEK MYTHOLOGY BEGINS WITH t"],"info":{}}
{"id":"train_3524","question":"What are the series ordinal for hydrazine whose ionization energy is 8.93?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q58447 p:P2260 ?s . ?s ps:P2260 ?x filter ( contains ( ?x , '8.93' ) ) . ?s pq:P1545 ?value }","paraphrases":["If hydrazine's ionization energy is 8.93, what is the series ordinal?"],"info":{}}
{"id":"train_3527","question":"When was Innsbruck twinned with Kraków?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1735 p:P190 ?s . ?s ps:P190 wd:Q31487 . ?s pq:P580 ?value }","paraphrases":["When was Innsbruck paired with Kraków?"],"info":{}}
{"id":"train_3528","question":"How many quadrupedal means of locomotion are there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3512 wd:Q21907045 }","paraphrases":["Provide the number of quadrupedal means of locomotion that exist."],"info":{}}
{"id":"train_3529","question":"Who is the leader of the Etruschi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2596 wd:Q17161 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the pioneer of the Etruschi?"],"info":{}}
{"id":"train_3530","question":"is jay-z's native language Icelandic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q62766 wdt:P103 wd:Q294 }","paraphrases":["Is Icelandic Jay-Z's native language?"],"info":{}}
{"id":"train_3531","question":"What are the condiment which start with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2596997 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the condiment which begin with the letter y"],"info":{}}
{"id":"train_3532","question":"When did João Havelange step down as chairperson of FIFA?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q253414 p:P488 ?s . ?s ps:P488 wd:Q207358 . ?s pq:P582 ?value }","paraphrases":["The Year Joao Havelange resigned as FIFA chairperson"],"info":{}}
{"id":"train_3533","question":"When did educated at of Carl Sagan and academic degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q410 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["When did taught at of Carl Sagan and scholarly degree?"],"info":{}}
{"id":"train_3534","question":"At what point in time did the Dominican Republic have 385433 children who were out of school?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q786 p:P2573 ?s . ?s ps:P2573 ?x filter ( contains ( ?x , '385433.0' ) ) . ?s pq:P585 ?value }","paraphrases":["The Dominican Republic is a Caribbean nation that shares the island of Hispaniola with Haiti to the west. It's known for its beaches, resorts and golfing. Its terrain comprises rainforest, savannah and highlands, including Pico Duarte"],"info":{}}
{"id":"train_3536","question":"What is synonymous with assault but unlike murder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q365680 wdt:P460 ?answer . ?answer wdt:P1889 wd:Q149086 }","paraphrases":["What is synonymous with ambush but not at all like murder?"],"info":{}}
{"id":"train_3538","question":"What are the Beer festival which start with the letter o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2919327 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Brew celebration which begin with the letter o"],"info":{}}
{"id":"train_3539","question":"How many vegan cuisines are there?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2012 wd:Q181138 }","paraphrases":["What is the total number of vegan cuisines?"],"info":{}}
{"id":"train_3541","question":"When was Dwayne Johnson nominated for the MTV Movie Award for Best Villain?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q10738 p:P1411 ?s . ?s ps:P1411 wd:Q1062026 . ?s pq:P585 ?value }","paraphrases":["Dwayne Johnson was nominated for the MTV Movie Award for Best Villain on what date?"],"info":{}}
{"id":"train_3542","question":"What is the significant incident of Anna Berliner's marriage?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q53834036 wdt:P26 ?X . ?X wdt:P793 ?answer }","paraphrases":["What is the noteworthy occurrence of Anna Berliner's marriage?"],"info":{}}
{"id":"train_3544","question":"Where is the headquarters of the car manufacturer Lyon","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q456 . ?sbj wdt:P31 wd:Q786820 }","paraphrases":["Name the location of the car manufacturer Lyon's headquarters."],"info":{}}
{"id":"train_3546","question":"What is the magnetic ordering which starts with the letter p?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15706549 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the magnetic ordering which starts offevolved with the letter p?"],"info":{}}
{"id":"train_3548","question":"Which person is the founder of Futurism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P135 wd:Q131221 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Which individual is the author of Futurism?"],"info":{}}
{"id":"train_3549","question":"Which operas are in Russian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q7737 . ?sbj wdt:P31 wd:Q1344 }","paraphrases":["Can you name the Russian operas?"],"info":{}}
{"id":"train_3554","question":"What is the Norwegian DRM called?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q9043 . ?sbj wdt:P31 wd:Q192532 }","paraphrases":["What is the name of the Norwegian DRM?"],"info":{}}
{"id":"train_3555","question":"What is FIDE ID for Anatoly Karpov ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q131674 wdt:P1440 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3556","question":"Who is a team member of the Chicago Cubs?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P54 wd:Q246782 }","paraphrases":[],"info":{}}
{"id":"train_3558","question":"When did Tallahassee have a population of 181376?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q37043 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '181376' ) ) . ?s pq:P585 ?value }","paraphrases":["When did Tallahassee grow to 181376 people?"],"info":{}}
{"id":"train_3559","question":"What topic of meditation has its originating source in Tripitaka?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q108458 wdt:P1269 ?answer . ?answer wdt:P248 wd:Q1321432 }","paraphrases":["What theme of meditation has its originating supply in Tripitaka?"],"info":{}}
{"id":"train_3560","question":"Who is the business owner of Barbie the doll maker","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1830 wd:Q167447 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Who is the commerce proprietor of Barbie the doll maker"],"info":{}}
{"id":"train_3561","question":"What sub-province-level division starts with the letter \"x\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q250811 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What sub-province-level division begins with the letter \"x\"?"],"info":{}}
{"id":"train_3562","question":"Who gave the{type of music} of {working place} of {Derek Blasberg} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5261816 wdt:P108 ?X . ?X wdt:P136 ?answer }","paraphrases":["Who are {inhabitants} of {originates} in {glima} ?"],"info":{}}
{"id":"train_3563","question":"Who owns the label that released Korn albums ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P264 wd:Q80304 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who claims the name that discharged Korn collections ?"],"info":{}}
{"id":"train_3564","question":"When did position for officeholder of Mauricio Macri?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1308 wd:Q561837 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":[],"info":{}}
{"id":"train_3566","question":"How many captains are there for the Montreal Canadiens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q188143 wdt:P634 ?obj }","paraphrases":["How many captains do Montreal Canadiens have?"],"info":{}}
{"id":"train_3567","question":"Is the electric dipole moment of pyrrole less than 2.1204?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q242627 wdt:P2201 ?obj filter ( ?obj < 2.1204 ) }","paraphrases":["is the moment of pyrrole of an electric dipole less than 2.1204?"],"info":{}}
{"id":"train_3568","question":"What was the population of Galicia in Jan. 1st, 2018","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3908 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2018' ) ) }","paraphrases":["What was the residents  of Galicia in Jan. 1st, 2018"],"info":{}}
{"id":"train_3569","question":"Which is the candidacy in election for Felipe González?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q156799 wdt:P3602 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3575","question":"Give me a social class name that contains the word 'zeugitae' in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q187588 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zeugitae' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Provide me a social lesson title that contains the word 'zeugitae' in it."],"info":{}}
{"id":"train_3577","question":"Tell me the course of Lord Strethcona`s Horse mascot from Royal Canadians?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3259400 wdt:P155 ?X . ?X wdt:P822 ?answer }","paraphrases":["Let me know the course of Ruler Strethcona`s Horse mascot from Regal Canadians?"],"info":{}}
{"id":"train_3578","question":"What is the mushroom ecological type of a parasite?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P788 wd:Q186517 }","paraphrases":["What type of parasite is a mushroom ecological type?"],"info":{}}
{"id":"train_3579","question":"Who is the patron saint active in Innocent III?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q128076 wdt:P937 ?X . ?X wdt:P417 ?answer }","paraphrases":["In Innocent 3, who is the active patron saint?"],"info":{}}
{"id":"train_3580","question":"Were there 6265 votes received on the Sixth Amendment of the Constitution of Ireland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7533104 wdt:P1111 ?obj filter ( ?obj = 6265 ) }","paraphrases":["Were there 6265 votes gotten on the 6th Correction of the Structure of Ireland?"],"info":{}}
{"id":"train_3581","question":"What city does Curtis Institute of Music reside in, and has wards in Cameron County?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q60450 wdt:P131 ?answer . ?answer wdt:P150 wd:Q494142 }","paraphrases":["What metropolis does Curtis Institute of Music stay in, and has wards in Cameron County?"],"info":{}}
{"id":"train_3582","question":"What is the subcellular localization of the EH-domain containing 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21498376 wdt:P681 ?X . ?X wdt:P1535 ?answer }","paraphrases":["What is the subcellular localization of the EH-domain containing 1?"],"info":{}}
{"id":"train_3583","question":"who is rector of Karl Weierstraß ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1075 wd:Q57103 }","paraphrases":[],"info":{}}
{"id":"train_3585","question":"How many diocese are there in the Russian Orthodox Church?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P708 wd:Q60995 }","paraphrases":["How many diocese are recorded as members of the Russian Orthodox Church?"],"info":{}}
{"id":"train_3588","question":"Who is the husband of the costume designer from The Fuller Brush Girl?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3604163 wdt:P2515 ?X . ?X wdt:P26 ?answer }","paraphrases":["Who is the spouse of the outfit creator from The More full Brush Girl?"],"info":{}}
{"id":"train_3590","question":"What type of government runs the city of Dezful?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q605142 wdt:P17 ?X . ?X wdt:P530 ?answer }","paraphrases":["What sort of government runs the city of Dezful?"],"info":{}}
{"id":"train_3591","question":"What subject had role of sidekick on Heihei?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27048565 wdt:P2546 ?X . ?X wdt:P2868 ?answer }","paraphrases":["Which subject had role of sidekick on Heihei?"],"info":{}}
{"id":"train_3593","question":"Tell me metropolitan city of South Korea whose name has the word ulsan in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q482821 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ulsan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know metropolitan city of South Korea whose title has the word ulsan in it."],"info":{}}
{"id":"train_3596","question":"Which is the Thyssen-Bornemisza artist ID of Maurice de Vlaminck?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q241098 wdt:P2431 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3597","question":"What award did Frank Herbert receive in 1966?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7934 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1966' ) ) }","paraphrases":["Name the award which Frank Herbert received in 1966."],"info":{}}
{"id":"train_3599","question":"Whats the California Sports Hall of Fame athlete ID of Greg Louganis","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q311332 wdt:P4507 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3603","question":"Abu Musab al-Zarqawir is chairperson of what organization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P488 wd:Q181049 . ?sbj wdt:P31 wd:Q43229 }","paraphrases":["What organization is chairman of Abu Musab al - Zarqawir?"],"info":{}}
{"id":"train_3607","question":"For what subject was Citizen Kane nominated for an Academy Award for Best Direction, Black and White?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q24815 p:P1411 ?s . ?s ps:P1411 wd:Q22253133 . ?s pq:P805 ?value }","paraphrases":["In which category was Citizen Kane short-listed for an Academy Award for Best Direction, Black and White?"],"info":{}}
{"id":"train_3608","question":"What city of Isla Grande de Tierra del Fuego has 6801 inhabitants?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1674067 wdt:P131 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '6801' ) ) }","paraphrases":["What city of Isla Grande de Tierra del Fuego has 6801 inhabitants?"],"info":{}}
{"id":"train_3609","question":"Mention the time and the  election year of Angela Merkel for being appointed as the member of the German Bundestag","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q567 p:P39 ?s . ?s ps:P39 wd:Q1939555 . ?s pq:P580 ?value1 . ?s pq:P2715 ?value2 }","paraphrases":["Specify the time and the decision year of Angela Merkel for being named as the part of the German Bundestag"],"info":{}}
{"id":"train_3610","question":"What award did Barbara Cook receive in 1955?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2883930 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1955' ) ) }","paraphrases":["Barbara Cook won what award in 1955?"],"info":{}}
{"id":"train_3611","question":"When did Dwyane Wade win the Sports Illustrated Sportsperson of the Year award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q31683 p:P166 ?s . ?s ps:P166 wd:Q1653207 . ?s pq:P585 ?value }","paraphrases":["on what year Dwyane Wade win the Sports Illustrated Sportsperson  the  award?"],"info":{}}
{"id":"train_3614","question":"Did Manuel I Komnenos hold his position in 1143-4-8","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41610 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1143' ) ) }","paraphrases":["when did a Manuel I Komnenos hold his position in 1143-4-8?"],"info":{}}
{"id":"train_3615","question":"What technique used in tapestry is not used for upholstery?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184296 wdt:P2079 ?answer . ?answer wdt:P1889 wd:Q1123578 }","paraphrases":["What strategy utilized in embroidered artwork isn't utilized for upholstery?"],"info":{}}
{"id":"train_3616","question":"What is the opposite of led to when referencing a family?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8436 wdt:P1542 ?X . ?X wdt:P461 ?answer }","paraphrases":["When referencing a family the opposite of led to is?"],"info":{}}
{"id":"train_3617","question":"IS THE NUMBER OF PAGES OF PERCEPTIONS ABOUT POSTDOCS EQUALS 1","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q22121983 wdt:P1104 ?obj filter ( ?obj = 1 ) }","paraphrases":["IS THE NUMBER OF PAGES OF Discernments Approximately POSTDOCS Breaks even with 1"],"info":{}}
{"id":"train_3622","question":"When was Frederick William I of Prussia's child Princess Friederike Luise of Prussia born, and when did she die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q288925 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When was Prussia's Princess Friederike Luise born to Frederick William I, and when was she dead?"],"info":{}}
{"id":"train_3624","question":"Where is the location of the Samsung headquarters with the postal code of 443-742?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q20716 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P281 ?x filter ( contains ( ?x , '443-742' ) ) }","paraphrases":["What is the address in postal code 443-742, where Samsung's headquarters is located?"],"info":{}}
{"id":"train_3626","question":"tWhich comic is from fictional universe Marvel Universe and which that starts with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1004 . ?sbj wdt:P1080 wd:Q931597 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tWhich comedian is from anecdotal universe Wonder Universe and which that begins with the letter p"],"info":{}}
{"id":"train_3628","question":"Who has the highest Elo rating?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P1087 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["State the player with the highest Elo rating."],"info":{}}
{"id":"train_3631","question":"Is it true that the volume as quantity of Barragem Canrobert 1 equals to 0.0056?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q62012350 wdt:P2234 ?obj filter ( ?obj = 0.0056 ) }","paraphrases":["Is it true that Barragem Canrobert 1 volume as a quantity is equal to 0.0056?"],"info":{}}
{"id":"train_3632","question":"Is the maximum capacity of the Zipflbob less than 1.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q205443 wdt:P1083 ?obj filter ( ?obj < 1.2 ) }","paraphrases":["is 1.2 the maximum capacity of the zipflbob?"],"info":{}}
{"id":"train_3633","question":"What are the video game series which start with the letter W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7058673 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the video games which start with the letter W?"],"info":{}}
