{"id":"train_8646","question":"WHat are the biomedical measurands that contain the word \"waist\" in their name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q42014143 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'waist' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat are the biomedical measurands that incorporate the phrase \"waist\" in their title ?"],"info":{}}
{"id":"train_8648","question":"Name te football team that was coached by tite and that contains the word \"Brazil\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6979593 . ?sbj wdt:P286 wd:Q40652 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'brazil' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title te football group that was coached by tite which contains the word \"Brazil\" in its name"],"info":{}}
{"id":"train_8652","question":"who won by of honorary title of P. H. Newby ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q531194 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["who won by of privileged title of P. H. Newby ?"],"info":{}}
{"id":"train_8653","question":"What position did Alexander VI begin in 1483?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q108316 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1483' ) ) }","paraphrases":["Alexander VI position in 1483?"],"info":{}}
{"id":"train_8655","question":"What is the first name of this person James Hargreaves?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q140696 wdt:P735 ?answer . ?answer wdt:P460 wd:Q4537101 }","paraphrases":["What is the primary title of this individual James Hargreaves?"],"info":{}}
{"id":"train_8656","question":"What is the mean lifetime of a neutron?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q2348 wdt:P2645 ?obj }","paraphrases":["For a neutron, what is the mean lifetime?"],"info":{}}
{"id":"train_8657","question":"IS THE ROTATION PERIOD OF 15 EUNOMIA IS GREATER THAN 7.2996","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q107528 wdt:P2147 ?obj filter ( ?obj > 7.2996 ) }","paraphrases":["IS THE Revolution PERIOD OF 15 EUNOMIA IS More prominent THAN 7.2996"],"info":{}}
{"id":"train_8658","question":"What is the name of the project affiliated with Harvard University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1416 wd:Q13371 . ?sbj wdt:P31 wd:Q170584 }","paraphrases":["What is the title of the venture associated with Harvard University?"],"info":{}}
{"id":"train_8660","question":"In what year were Philip II of France and Isabella of Hainault divorced?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q34428 p:P26 ?s . ?s ps:P26 wd:Q230050 . ?s pq:P582 ?value }","paraphrases":["Philip II of France and Isabella of Hainault were divorced in which year?"],"info":{}}
{"id":"train_8661","question":"For what point Marc Chagall has received Erasmus prize award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q93284 p:P166 ?s . ?s ps:P166 wd:Q974780 . ?s pq:P585 ?value }","paraphrases":["For what point Marc Chagall has gotten Erasmus prize honor?"],"info":{}}
{"id":"train_8662","question":"What is the Abrahamic religion of the Jewish people?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3095 wd:Q7325 . ?sbj wdt:P31 wd:Q47280 }","paraphrases":["What is the Jewish people's Abrahamic religion?"],"info":{}}
{"id":"train_8663","question":"which sect starts with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19097 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which faction begins with the letter v"],"info":{}}
{"id":"train_8666","question":"What is capable of inhibiting or preventing pathological process of treated by  bleeding ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q166019 wdt:P2176 ?X . ?X wdt:P2175 ?answer }","paraphrases":["What can inhibit or prevent the pathological process of treating bleeding?"],"info":{}}
{"id":"train_8667","question":"What town is the Walmart headquarters located at 702 Southwest 8th St?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q483551 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P969 ?x filter ( contains ( ?x , '702 Southwest 8th ST' ) ) }","paraphrases":["Walmart's main office at 702 Southwest 8th St. is located in what town?"],"info":{}}
{"id":"train_8668","question":"Where is the work location of Arturo Toscanini on Staten Island?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13003 wdt:P937 ?answer . ?answer wdt:P150 wd:Q18432 }","paraphrases":["Where is the work location of Arturo Toscanini on Staten Island?"],"info":{}}
{"id":"train_8669","question":"Who is the {book} for {author} of {Cheryl Strayed}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P50 wd:Q5092780 . ?sbj wdt:P31 wd:Q571 }","paraphrases":["Who is the {book} for {creator} of {Cheryl Strayed}"],"info":{}}
{"id":"train_8670","question":"What are the programming language implementation that contains the word yarv in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4117406 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yarv' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the implementation of the programming language that contains the word yarv in its name"],"info":{}}
{"id":"train_8671","question":"Name a magazine article published in Rolling Stone.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1433 wd:Q33511 . ?sbj wdt:P31 wd:Q30070590 }","paraphrases":["Title a magazine article distributed in Rolling Stone."],"info":{}}
{"id":"train_8672","question":"Who is Wonder Woman's sibling in the film?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q338430 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q15773347 }","paraphrases":["What are the stock market crash which start with the letter m"],"info":{}}
{"id":"train_8674","question":"What are the baseball teams that start with the letter A","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13027888 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'á' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the baseball teams that begin with the letter A"],"info":{}}
{"id":"train_8678","question":"What is Abu Hanifa Dinawari's field of this profession of botany?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q293520 wdt:P106 ?answer . ?answer wdt:P425 wd:Q441 }","paraphrases":["What is Abu Hanifa Dinawari's field of this calling of botany?"],"info":{}}
{"id":"train_8680","question":"What sport does Team England play?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7691477 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["What don does Group Britain play?"],"info":{}}
{"id":"train_8681","question":"Did Will Smith received a Grammy Award for best rap performance as a duo or group?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q40096 wdt:P166 wd:Q4809486 }","paraphrases":["The Grammy Award for Best Rap Performance is an honor presented to recording artists for quality rap performances. It was first presented at the 31st Annual Grammy Awards in 1989 and again at the 32nd Annual Grammy Awards in 1990, after which point the award was split into two categories: Best Rap Solo Performance and Best Rap Performance by a Duo or Group. These two categories were combined again in 2012 as a result of a restructure of Grammy categories, and the reinstated Award for Best Rap Performance was presented at the 54th Grammy Awards in 2012."],"info":{}}
{"id":"train_8682","question":"Which essential medicine has the most surface tension?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q35456 . ?ent wdt:P3013 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What remedy has the biggest tension on the surface?"],"info":{}}
{"id":"train_8684","question":"Which is the birth place of Robert Rayford with abbreviation as","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q288055 wdt:P19 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'ארה\"ב' ) ) }","paraphrases":["Which is the delivery location of Robert Rayford with abbreviation as"],"info":{}}
{"id":"train_8686","question":"When did significant event of Nicholas II of Russia and place of marriage?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q40787 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P2842 ?value1 . }","paraphrases":["When did Russia's significant Nicholas II event and place of marriage take place?"],"info":{}}
{"id":"train_8687","question":"Is Dirk Nowitzki a relative of Martin Olsson and Marcus Olsson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44068 wdt:P1038 wd:Q312935 . wd:Q44068 wdt:P1038 wd:Q1374528 }","paraphrases":["Is Dirk Nowitzki related to Martin and Marcus Olsson?"],"info":{}}
{"id":"train_8688","question":"Which {tributary} is {outlet} of {Amazon} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3783 wdt:P403 ?X . ?X wdt:P974 ?answer }","paraphrases":["Which {tributary} is {outlet} of {Amazon} ?"],"info":{}}
{"id":"train_8690","question":"What is the shape of penis whose domain is geometry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q58 wdt:P1419 ?answer . ?answer wdt:P2579 wd:Q8087 }","paraphrases":["Which is the shape of penis in the geometry domain?"],"info":{}}
{"id":"train_8691","question":"Which is the single entity of the population of the capital of Seville?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1376 wd:Q8717 . ?sbj wdt:P31 wd:Q3055118 }","paraphrases":["What is the population of the capital of Seville?"],"info":{}}
{"id":"train_8692","question":"Which is the Paris Faculty of Letters professor ID in 1809-1908 for Émile Durkheim?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q15948 wdt:P5545 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8693","question":"What political catch phrase used in the United States of America which applies to jurisdiction starts with the letter d?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3377406 . ?sbj wdt:P1001 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What political capture state utilized within the Joined together States of America which applies to ward begins with the letter d?"],"info":{}}
{"id":"train_8694","question":"What is an ethnic conflict that begins with the letter w?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q766875 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is an ethnic conflict that starts with the letter w?"],"info":{}}
{"id":"train_8696","question":"Is the minimum age at which education is compulsory in Brazil equal to 8.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q155 wdt:P3270 ?obj filter ( ?obj = 8.4 ) }","paraphrases":["Is the youngest age education is mandatory in Brazil 8.4?"],"info":{}}
{"id":"train_8699","question":"Who follows Berengar 1 of Italy as monarch of Italy","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q274606 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["What Italian monarch followed Berengar 1?"],"info":{}}
{"id":"train_8700","question":"na","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q187238 p:P54 ?s . ?s ps:P54 wd:Q19487 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["na"],"info":{}}
{"id":"train_8701","question":"How many members are there for the United Arab Emirates} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q878 wdt:P463 ?obj }","paraphrases":["Which is the number of members that are for the United Arab Emirates?"],"info":{}}
{"id":"train_8702","question":"who is the Christian chapel for patron saint of Anthony of Padua?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P417 wd:Q167477 . ?sbj wdt:P31 wd:Q108325 }","paraphrases":["who is the Christian chapel for supporter holy person of Anthony of Padua?"],"info":{}}
{"id":"train_8703","question":"Which charitable organization is McGill University affiliated with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q201492 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q708676 }","paraphrases":["Which charitable organization is McGill College partnered with?"],"info":{}}
{"id":"train_8704","question":"Name an alphabet based on Proto Sinitaic symbols that contains the word \"alpahabet\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9779 . ?sbj wdt:P144 wd:Q1065250 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'alphabet' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title an letter set based on Proto Sinitaic images that contains the word \"alpahabet\" in its name"],"info":{}}
{"id":"train_8710","question":"Which is the end of work period for Joan Crawford?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q40475 wdt:P2032 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8711","question":"What is the name of the parent organisation of alliance of Abu Musab al-Zarqawir?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q181049 wdt:P945 ?obj . ?obj wdt:P31 wd:Q1156831 }","paraphrases":["What is Abu Musab al - Zarqawir's parent organization name?"],"info":{}}
{"id":"train_8713","question":"Who was nominated for the Academy Award for Best Sound Mixing because of their work in Saving Private Ryan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q165817 p:P1411 ?s . ?s ps:P1411 wd:Q830079 . ?s pq:P2453 ?value }","paraphrases":["Who was the nominee for the Academy Award for Best Sound Mixing because of their work in Saving Private Ryan?"],"info":{}}
{"id":"train_8714","question":"Does the LOHAS park station have less than 2.4 number of platform faces","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q718069 wdt:P5595 ?obj filter ( ?obj < 2.4 ) }","paraphrases":["Is there less than 2.4 platform faces at the LOHAS park station?"],"info":{}}
{"id":"train_8716","question":"What is the date of death and birth date of Charlemagne? Is her child as Charles the Younger?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q283107 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["When was Charlemagne born, and when did he die?"],"info":{}}
{"id":"train_8719","question":"What does sociology teach that's said to be the same as sex?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21201 wdt:P2578 ?answer . ?answer wdt:P460 wd:Q290 }","paraphrases":["What does human science instruct that's said to be the same as sex?"],"info":{}}
{"id":"train_8722","question":"Tell me government agency whose name has the word yuan in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q327333 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yuan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know government organization whose title has the word yuan in it."],"info":{}}
{"id":"train_8723","question":"A series of 1 would be followed by what?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q199 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P156 ?value1 . }","paraphrases":["What would follow a series of one's?"],"info":{}}
{"id":"train_8724","question":"What are the private university which start with the letter university","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902104 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'university' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the private college which begin with the letter university"],"info":{}}
{"id":"train_8725","question":"Who edited Francisco Jimenez de Cisneros that was published at Alcala de Henares?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q342392 p:P98 ?s . ?s ps:P98 ?obj . ?s pq:P291 wd:Q46940 }","paraphrases":["Who was the editor of Francisco Jimenez de Cisneros, published at Alcala de Henares?"],"info":{}}
{"id":"train_8726","question":"Irving Berling was the founder of which nonprofit organization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P112 wd:Q128746 . ?sbj wdt:P31 wd:Q163740 }","paraphrases":["Irving Berling was the originator of which nonprofit organization?"],"info":{}}
{"id":"train_8727","question":"Which extinct language is the indigenous to the Khazars?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2341 wd:Q173282 . ?sbj wdt:P31 wd:Q38058796 }","paraphrases":["What is the name of the extinct language that is indigenous to the Khazars?"],"info":{}}
{"id":"train_8730","question":"What is in the  OKPD code of the good or service of grapefruit juice ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1138468 wdt:P3245 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8731","question":"What is the street address of the headquarters of Netflix in Los Gatos?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q907311 p:P159 ?s . ?s ps:P159 wd:Q747509 . ?s pq:P969 ?value }","paraphrases":["The Netflix headquarters is at what street address?"],"info":{}}
{"id":"train_8732","question":"When did the Salta Province reach a population of 1333365?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q44803 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '1333365' ) ) . ?s pq:P585 ?value }","paraphrases":["When did the Salta Area reach a populace of 1333365?"],"info":{}}
{"id":"train_8733","question":"What is BNE ID for Bo Diddle} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q208881 wdt:P950 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8735","question":"Which attendee of the meeting on Brexit has the acronym Соединённое Королевство?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7888194 wdt:P710 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'Соединённое Королевство' ) ) }","paraphrases":["Which attendee of the assembly on Brexit has the acronym Соединённое Королевство?"],"info":{}}
{"id":"train_8736","question":"What award did Titanic receive in 1997?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q44578 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1997' ) ) }","paraphrases":["Award Titanic obtained in 1997."],"info":{}}
{"id":"train_8737","question":"When did David Ben-Gurion become a member of the Knesset?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q37610 p:P39 ?s . ?s ps:P39 wd:Q4047513 . ?s pq:P580 ?value }","paraphrases":["Give the date on which David Ben-Gurion became a Knesset member."],"info":{}}
{"id":"train_8740","question":"Was John Mayer a singer and blogger?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q215215 wdt:P106 wd:Q177220 . wd:Q215215 wdt:P106 wd:Q8246794 }","paraphrases":["Is it true that John Mayer was a singer and blogger?"],"info":{}}
{"id":"train_8741","question":"What drugs are used in the treatment of malaria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12156 wdt:P2176 ?X . ?X wdt:P769 ?answer }","paraphrases":["What drugs are utilized within the treatment of malaria?"],"info":{}}
{"id":"train_8742","question":"Where was Rock Hudson born and buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q184378 wdt:P119 ?ans_1 . wd:Q184378 wdt:P19 ?ans_2 }","paraphrases":["Whhat was the birth and death place of Rock Hudson."],"info":{}}
{"id":"train_8743","question":"What tributary is the watercourse outflow of Po?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q643 wdt:P403 ?X . ?X wdt:P974 ?answer }","paraphrases":["Name the tributary  that is the watercourse outflow of Po?"],"info":{}}
{"id":"train_8744","question":"What are the ballet which start with the letter terpsichore","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15079786 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'terpsichore' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the expressive dance which begin with the letter terpsichore"],"info":{}}
{"id":"train_8746","question":"Who designed Fortran and won the Turing Award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83303 wdt:P287 ?answer . ?answer wdt:P166 wd:Q185667 }","paraphrases":["Who outlined Fortran and won the Turing Award?"],"info":{}}
{"id":"train_8748","question":"Name the successor of Tokhtamysh as Khan.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q309585 p:P39 ?s . ?s ps:P39 wd:Q181888 . ?s pq:P1365 ?value }","paraphrases":["Who is Tokhtamysh as Khan's successor?"],"info":{}}
{"id":"train_8751","question":"Is Katy Perry's family name Hudson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q42493 wdt:P734 wd:Q2720681 }","paraphrases":["is it true that katy perrys family name is hudson?"],"info":{}}
{"id":"train_8755","question":"What are the medical and drug tests needed to treat colorectal cancer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q188874 wdt:P923 ?ans_1 . wd:Q188874 wdt:P2176 ?ans_2 }","paraphrases":["Which supplies are used to treat colorectal cancer?"],"info":{}}
{"id":"train_8756","question":"Who is the {awarded} of {Le Duc Tho} whose {champion} is {Tunisian National Dialogue Quartet}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q233969 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q21078159 }","paraphrases":["Who is the {granted} of {Le Duc Tho} whose {winner} is {Tunisian National Exchange Quartet}?"],"info":{}}
{"id":"train_8758","question":"What is Mizoram?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1502 wdt:P3403 ?obj . ?obj wdt:P31 wd:Q57156205 }","paraphrases":["Explain Mizoram."],"info":{}}
{"id":"train_8760","question":"Does Ibuprofen treat TMJ and enthesopathy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q186969 wdt:P2175 wd:Q1068323 . wd:Q186969 wdt:P2175 wd:Q52844 }","paraphrases":["Can Ibuprofen be used to treat TMJ and enthesopathy?"],"info":{}}
{"id":"train_8761","question":"Which is the Historia de la Medicina person ID of John Hunter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q505981 wdt:P5468 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8765","question":"When did Durham had a population of 6679 people?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q49229 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '6679.0' ) ) . ?s pq:P585 ?value }","paraphrases":["At what time did Durham have 6679 people living there?"],"info":{}}
{"id":"train_8766","question":"Is the maximum duration of antimicrobial therapy for pediatric pneumonia 12","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q61707499 wdt:P4135 ?obj filter ( ?obj = 12.0 ) }","paraphrases":["Is the greatest length of antimicrobial treatment for pediatric pneumonia 12"],"info":{}}
{"id":"train_8768","question":"Who is the {version, edition, or translation} for {author} of {Salman Rushdie}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P50 wd:Q44306 . ?sbj wdt:P31 wd:Q3331189 }","paraphrases":["Who does the translation for Salman Rushdie?"],"info":{}}
