{"id":"train_2543","question":"What is the notation that implies centrifugal force ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178733 wdt:P1542 ?X . ?X wdt:P2534 ?answer }","paraphrases":["What is the documentation that infers centrifugal constrain ?"],"info":{}}
{"id":"train_2545","question":"What is the country with the lowest median income whose member of is International Bank for Reconstruction and Development ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q6256 . ?ent wdt:P3529 ?obj . ?ent wdt:P463 wd:Q191384 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Name the country with the smallest median income and is a member of International Bank for Reconstruction and Development."],"info":{}}
{"id":"train_2548","question":"How many software programs are written in PHP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1547 wd:Q59 }","paraphrases":["PHP is the programming language for how many software programs?"],"info":{}}
{"id":"train_2549","question":"Tell me theme park whose name has the word  woman  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2416723 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me park theme whose name contains the word woman."],"info":{}}
{"id":"train_2550","question":"Which is the superhero from the fictional universe of DC Universe that starts with the letter s?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188784 . ?sbj wdt:P1080 wd:Q1152150 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the superhero from the fictional universe of DC Universe that starts offevolved with the letter s?"],"info":{}}
{"id":"train_2551","question":"Is it true that the attendance of the 47th World Science Fiction Convention equals to 6837?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4638583 wdt:P1110 ?obj filter ( ?obj = 6837 ) }","paraphrases":["Was 6837 the attendance of the 47th World Science Fiction Convention?"],"info":{}}
{"id":"train_2552","question":"Who is the executive director at Christopher Wylie's company?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q50845422 wdt:P108 ?X . ?X wdt:P169 ?answer }","paraphrases":["Who is the executive director at Christopher Wylie's company?"],"info":{}}
{"id":"train_2553","question":"What is The Fleet of the Service Branch of Robert D. Russ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7343340 wdt:P241 ?X . ?X wdt:P121 ?answer }","paraphrases":["What is Robert D. Russ's Service Branch's Fleet?"],"info":{}}
{"id":"train_2554","question":"WHO IS THE TREND ROLE MODEL OF BUCKMINSTER FULLER?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q102289 wdt:P737 ?X . ?X wdt:P135 ?answer }","paraphrases":["WHO IS THE Slant Part Show OF BUCKMINSTER More full?"],"info":{}}
{"id":"train_2556","question":"is the M sin i of HD 181342 b equal to 2.54?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4039888 wdt:P2051 ?obj filter ( ?obj = 2.54 ) }","paraphrases":["s M sin I equal to 2.54 in HD 181342 b?"],"info":{}}
{"id":"train_2558","question":"What key is the Symphony No. 40 written in that was previously F-sharp minor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q231390 wdt:P826 ?answer . ?answer wdt:P155 wd:Q283910 }","paraphrases":["What is the key written in Symphony No. 40 that was F - sharp minor in the past?"],"info":{}}
{"id":"train_2560","question":"What type of taxon is Xynenon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15872518 wdt:P171 ?X . ?X wdt:P105 ?answer }","paraphrases":["What sort of taxon is Xynenon?"],"info":{}}
{"id":"train_2563","question":"The physical quantity of a millimetre is represented by the symbol L. Which is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q174789 wdt:P111 ?answer . ?answer wdt:P416 ?x FILTER ( contains ( ?x , 'L' ) ) }","paraphrases":["The symbol L represents the physical quantity of a millimetre. Which one is that?"],"info":{}}
{"id":"train_2564","question":"What is Charity Commission no. of British Library ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q23308 wdt:P3057 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2566","question":"How many surface tensions are there for ethyl acetate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q407153 wdt:P3013 ?obj }","paraphrases":["ethyl acetate includes how many surface tensions?"],"info":{}}
{"id":"train_2570","question":"What are the feminist movement which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15580856 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the women's activist development which begin with the letter w"],"info":{}}
{"id":"train_2572","question":"Which lake outflow's from the Nile?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P201 wd:Q3392 }","paraphrases":[],"info":{}}
{"id":"train_2573","question":"Is the decomposition point of the limestone equal to 1820.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23757 wdt:P2107 ?obj filter ( ?obj = 1820.4 ) }","paraphrases":["What is the decomposition point of limestone?"],"info":{}}
{"id":"train_2576","question":"Does the Sigma baryon have isospin z-component that is more than 0.8","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q424078 wdt:P1127 ?obj filter ( ?obj > 0.8 ) }","paraphrases":["Is the z-component in Sigma baryon more than 0.8?"],"info":{}}
{"id":"train_2577","question":"Which is the Lambiek Comiclopedia ID for Carl Barks?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11941 wdt:P5035 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2578","question":"What is the gender of Cecilia Bartoli, which has the abbreviation 'жін'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18828 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'жін' ) ) }","paraphrases":["What is Cecilia Bartoli's gender, which has the abbreviation ' admissible? '"],"info":{}}
{"id":"train_2579","question":"Who was the spouse of Jim Carrey prior to their divorce in 1997?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q40504 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1997' ) ) }","paraphrases":["Who did Jim Carrey divorce in 1997?"],"info":{}}
{"id":"train_2580","question":"Which daughter of Apollo has a male son?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37340 wdt:P40 ?answer . ?answer wdt:P21 wd:Q6581097 }","paraphrases":["Which girl of Apollo encompasses a male son?"],"info":{}}
{"id":"train_2582","question":"Who is the mother of Hadrian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1427 wdt:P25 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Hadrian's mother?"],"info":{}}
{"id":"train_2583","question":"When did John W. Henry become the owner of Boston Globe?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q824451 p:P127 ?s . ?s ps:P127 wd:Q1186372 . ?s pq:P580 ?value }","paraphrases":["On what date did John W. Henry become the owner of Boston Globe?"],"info":{}}
{"id":"train_2584","question":"What is the asteroid with the lowest rotation period whose site of astronomical discovery is Bishop Observatory ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2147 ?obj . ?ent wdt:P65 wd:Q4329955 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["At the Bishop Observatory, which asteroid was discovered with the lowest rotation period?"],"info":{}}
{"id":"train_2587","question":"What is HGNC gene symbol for RHO?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q14859555 wdt:P353 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2589","question":"Who is the professional or sports partner of Madge Syers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q49292 wdt:P1327 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2590","question":"Is it true that the standard enthalpy of formation of hydrogen fluoride is greater than -218.64?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2468 wdt:P3078 ?obj filter ( ?obj > -218.64 ) }","paraphrases":["Is it genuine that the standard enthalpy of arrangement of hydrogen fluoride is more prominent than -218.64?"],"info":{}}
{"id":"train_2591","question":"What country is Santa Monica in where Fred MacMurray died?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q356309 p:P20 ?s . ?s ps:P20 wd:Q47164 . ?s pq:P17 ?value }","paraphrases":["Where is the county Fred MacMurray died?"],"info":{}}
{"id":"train_2592","question":"William Shakespeare is the famous for writing's in the Sonnet 72.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3490580 wdt:P50 ?X . ?X wdt:P800 ?answer }","paraphrases":["William Shakespeare is the well-known for writing's in the Sonnet seventy two"],"info":{}}
{"id":"train_2595","question":"Who did Juan Domingo Perón get married to on 1929-1-5?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q93330 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1929' ) ) }","paraphrases":["Who became Juan Domingo Peron's wife on 1929-1-5?"],"info":{}}
{"id":"train_2596","question":"When did member of sports team of Andriy Shevchenko and number of matches played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q41244 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["When did member of sports team of Andriy Shevchenko and variety of matches played?"],"info":{}}
{"id":"train_2597","question":"Is the drag coefficient of the Hummer H2 equal to 0.424?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q618590 wdt:P6497 ?obj filter ( ?obj = 0.424 ) }","paraphrases":["Is 0.424 the drag coefficient of the Hummer H2?"],"info":{}}
{"id":"train_2599","question":"tell  me Nishiki-e that depict motion sicknessand  starts with letter g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1683337 . ?sbj wdt:P180 wd:Q309067 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know Nishiki-e that portray movement sicknessand begins with letter g"],"info":{}}
{"id":"train_2600","question":"Who is the wife of Pierre Curie that is married him in Sceaux?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q37463 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P2842 wd:Q370498 }","paraphrases":["What was the name of Pierre Curie wife ?"],"info":{}}
{"id":"train_2601","question":"TELL ME PHYSICAL CONSTANT WHOSE NAME HAS THE WORD WAVELENGTH IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q173227 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wavelength' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know PHYSICAL Steady WHOSE Title HAS THE WORD WAVELENGTH IN IT."],"info":{}}
{"id":"train_2604","question":"what is comics character of mickey mouse universe from the fictional universe  and also which starts with letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1114461 . ?sbj wdt:P1080 wd:Q3260246 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is comics character of mickey mouse universe from the anecdotal universe additionally which begins with letter t"],"info":{}}
{"id":"train_2605","question":"Who works with Willy Brandt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2514 wdt:P937 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Who does works with Willy Brandt?"],"info":{}}
{"id":"train_2606","question":"Which is the website affiliated with Harvard University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1416 wd:Q13371 . ?sbj wdt:P31 wd:Q35127 }","paraphrases":["Which is the site subsidiary with Harvard University?"],"info":{}}
{"id":"train_2607","question":"Which actor portrayed Batman in the movie Batman?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2695156 p:P175 ?s . ?s ps:P175 ?obj . ?s pq:P642 wd:Q116852 }","paraphrases":["Who played Batman in the movie Batman?"],"info":{}}
{"id":"train_2608","question":"Is it true that the angular resolution of Hobby-Eberly Telescope equals to 1.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q139605 wdt:P3439 ?obj filter ( ?obj = 1.8 ) }","paraphrases":["Is the angular resolution of the  Hobby-Eberly Telescope 1.8?"],"info":{}}
{"id":"train_2609","question":"What was the population of Sierra Leone in the year 1982?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1044 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1982' ) ) }","paraphrases":["In the year 1982 Sierra Leone had a population of how many?"],"info":{}}
{"id":"train_2610","question":"What is the antonym of Pol Pot?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q39464 wdt:P140 ?X . ?X wdt:P461 ?answer }","paraphrases":["What is the antonym of Pol Pot?"],"info":{}}
{"id":"train_2611","question":"What what is  property measured by Wechsler Intelligence Scale for Children   which that starts with letters i","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q937228 . ?sbj wdt:P1880 wd:Q1572850 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is property measured by Wechsler Insights Scale for Children which that begins with letters i"],"info":{}}
{"id":"train_2612","question":"Which is the streak color for apatite?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q178397 wdt:P534 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2613","question":"What is the designer of iPad whose output is Apple Pay?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2796 wdt:P287 ?answer . ?answer wdt:P1056 wd:Q18010990 }","paraphrases":["What is the iPad designer with Apple Pay output?"],"info":{}}
{"id":"train_2614","question":"What type of sport is jujutsu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P641 wd:Q163770 }","paraphrases":[],"info":{}}
{"id":"train_2616","question":"Who is the officeholder of the pope?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q19546 wdt:P1308 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who holds the office of the pope?"],"info":{}}
{"id":"train_2617","question":"Name the native German speaker and songwriter who wrote \"Leck mich im Arsch.\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1373720 wdt:P86 ?answer . ?answer wdt:P103 wd:Q188 }","paraphrases":["Title the local German speaker and lyricist who composed \"Leck mich im Arsch.\""],"info":{}}
{"id":"train_2618","question":"Mention the electoral area and duration reigned by Arthur Henderson while serving as the Member of the 29th Parliament of the United Kingdom.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q208665 p:P39 ?s . ?s ps:P39 wd:Q41582579 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["Mention of Arthur Henderson's electoral area and duration while serving as a member of the United Kingdom's 29th Parliament."],"info":{}}
{"id":"train_2619","question":"Is it true that the median income of the Australia equal 37244.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q408 wdt:P3529 ?obj filter ( ?obj = 37244.0 ) }","paraphrases":["37244.0 may be the median income of Australia."],"info":{}}
{"id":"train_2620","question":"Does the Norwegian krone price equal 0.13","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q132643 wdt:P2284 ?obj filter ( ?obj = 0.13 ) }","paraphrases":["Is Norwegian krone's price 0.13?"],"info":{}}
{"id":"train_2621","question":"Who is the {person} for {place of birth} in {Chicago}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P19 wd:Q1297 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the {individual} for {put of birth} in {Chicago}?"],"info":{}}
{"id":"train_2622","question":"Who is the {music genre} for {based on} of {country music}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P144 wd:Q83440 . ?sbj wdt:P31 wd:Q188451 }","paraphrases":["Who is the {music class} for {based on} of {nation music}"],"info":{}}
{"id":"train_2624","question":"What are the diplomatic relations of the Kam people living in South Sudan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q958 wdt:P530 ?answer . ?answer wdt:P172 wd:Q216096 }","paraphrases":["What are the conciliatory relations of the Kam individuals living in South Sudan?"],"info":{}}
{"id":"train_2626","question":"Name a semitic language that used Phoenician alphabet","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P282 wd:Q26752 . ?sbj wdt:P31 wd:Q34049 }","paraphrases":["What's a semitic language utilizing the Phoenician alphabet?"],"info":{}}
{"id":"train_2628","question":"Who is followed by Oliver Twist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q164974 wdt:P156 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2629","question":"When did position held of Gianni Agnelli and appointed by?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q356351 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P748 ?value1 . }","paraphrases":["When was Gianni Agnelli's position held and appointed by?"],"info":{}}
{"id":"train_2631","question":"When did Mickey Rourke divorce Carré Otis?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q178552 p:P26 ?s . ?s ps:P26 wd:Q508366 . ?s pq:P582 ?value }","paraphrases":["When was the marriage between Mickey Rourke and Carre Otis dissolved?"],"info":{}}
{"id":"train_2632","question":"Which is the annexation that contains the word war in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q194465 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'war' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the annexation that consists of the phrase fighting in it's name?"],"info":{}}
{"id":"train_2633","question":"What takes place in the House of Cards, if the highest judicial authority is the DC Court of Appeals?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3330940 wdt:P840 ?answer . ?answer wdt:P209 wd:Q5283409 }","paraphrases":["What takes put within the House of Cards, in the event that the most noteworthy legal specialist is the DC Court of Appeals?"],"info":{}}
{"id":"train_2634","question":"What is the subclass and model number of a belt sander that uses the least power?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23811260 . ?ent wdt:P2791 ?obj . ?ent wdt:P279 wd:Q1327701 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["For the belt sander that uses the least power, what is it's subclass and model number?"],"info":{}}
{"id":"train_2635","question":"What is the birth location of Johann Heinrich Pestalozzi, which has a population of 360980?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q105428 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '360980.0' ) ) }","paraphrases":["What is the birth area of Johann Heinrich Pestalozzi, which incorporates a populace of 360980?"],"info":{}}
{"id":"train_2636","question":"What was Spider Man's role in \"Spider Man: Shattered Dimensions\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q79037 wdt:P1441 wd:Q729212 }","paraphrases":["What role does Spider Man take in \"Spider Man: Shattered Dimensions\"?"],"info":{}}
{"id":"train_2638","question":"Who replaced Maurice Maeterlink as member of Belgium Royal Academy of French language and literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q49747 p:P463 ?s . ?s ps:P463 wd:Q2166029 . ?s pq:P1366 ?value }","paraphrases":["I want to know the name of the replacement of Maurice Maeterlink as member of Belgium Royal Academy of French language and literature!"],"info":{}}
{"id":"train_2640","question":"What is the data controller (GDPR) for Facebook?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q355 wdt:P137 ?obj . ?obj wdt:P31 wd:Q59859818 }","paraphrases":["What is the information controller (GDPR) for Facebook?"],"info":{}}
{"id":"train_2642","question":"What is the namesake of Hall effect whose craft is university teacher?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10656 wdt:P138 ?answer . ?answer wdt:P106 wd:Q1622272 }","paraphrases":["What is the namesake of Corridor impact whose create is college educator?"],"info":{}}
{"id":"train_2647","question":"When was Palestine the instance of historical region ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23792 p:P31 ?s . ?s ps:P31 wd:Q1620908 . ?s pq:P580 ?value }","paraphrases":["On what date was Palestine declared to be a historical region?"],"info":{}}
{"id":"train_2648","question":"When did Uganda have an inflation rate of 146.7?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1036 p:P1279 ?s . ?s ps:P1279 ?x filter ( contains ( ?x , '146.7' ) ) . ?s pq:P585 ?value }","paraphrases":["A Ugandan inflation rate of 146.7 happened when?"],"info":{}}
{"id":"train_2649","question":"Which creative works used HTML5","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P747 wd:Q2053 . ?sbj wdt:P31 wd:Q17537576 }","paraphrases":["What are some examples of HTML5 creative works?"],"info":{}}
{"id":"train_2652","question":"What is the solvent with the lowest Mohs' hardness whose instance of is food ingredient ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q146505 . ?ent wdt:P1088 ?obj . ?ent wdt:P31 wd:Q25403900 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What solvent with the lowest Mohs' hardness is also a food ingredient?"],"info":{}}
{"id":"train_2655","question":"who first language of executive power headed by of North Rhine-Westphalia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1198 wdt:P6 ?X . ?X wdt:P103 ?answer }","paraphrases":["who to begin with dialect of official control headed by of North Rhine-Westphalia?"],"info":{}}
{"id":"train_2657","question":"When did the Technical University of Munich become a member of the German Universities Excellence Initiative?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q157808 p:P463 ?s . ?s ps:P463 wd:Q705657 . ?s pq:P580 ?value }","paraphrases":["When did the Technical University of Munich join the German Universities Excellence Initiative?"],"info":{}}
{"id":"train_2658","question":"What language pronounces egg as Sv-ägg.ogg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q17147 p:P443 ?s . ?s ps:P443 ?x filter ( contains ( ?x , 'Sv-ägg.ogg' ) ) . ?s pq:P407 ?value }","paraphrases":["Egg is called as Sv-ägg.ogg in which language?"],"info":{}}
{"id":"train_2665","question":"Where was Henri Poincare born, who has the shire of Meurthe-et-Moselle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q81082 wdt:P19 ?answer . ?answer wdt:P131 wd:Q12626 }","paraphrases":["Where was once Henri Poincare born, who has the shire of Meurthe-et-Moselle?"],"info":{}}
