{"id":"train_5511","question":"What's the official language for Patna?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q80484 wdt:P37 ?obj }","paraphrases":["What is Patna's official language?"],"info":{}}
{"id":"train_5513","question":"Who is the person in the significant event of the dissolution of the Soviet Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P793 wd:Q5167679 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the individual within the noteworthy occasion of the disintegration of the Soviet Union?"],"info":{}}
{"id":"train_5516","question":"WHICH IS THE SPORT IN A GEOGRAPHIC REGION WITH THE MAXIMUM NUMBER OF CLUBS","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q29791211 . ?ent wdt:P4999 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["WHICH  COUNTRY HAS THE HIGHEST NUMBER OF SPORTS CLUBS"],"info":{}}
{"id":"train_5517","question":"What city in Bilbao has a twinned administrative body?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q8692 . ?sbj wdt:P31 wd:Q515 }","paraphrases":[],"info":{}}
{"id":"train_5518","question":"What physically interacts with glycine and has a subcellular localization in the integral component of a membrane?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q620730 wdt:P129 ?answer . ?answer wdt:P681 wd:Q14327652 }","paraphrases":["What physically interatomic with glycine and encompasses a subcellular localization within the indispensably component of a membrane?"],"info":{}}
{"id":"train_5519","question":"Which macOS operating systems use PowerPC to function?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q14116 p:P400 ?s . ?s ps:P400 wd:Q209860 . ?s pq:P306 ?value }","paraphrases":["PowerPC functions what macOS operating system?"],"info":{}}
{"id":"train_5520","question":"What is the indirect cause of the predecessor of street sweepers, janitors, and professionals who take care of buildings such as hospitals and schools?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17309512 wdt:P1479 ?X . ?X wdt:P155 ?answer }","paraphrases":["What is the circuitous cause of the forerunner of road sweepers, janitors, and experts who watch out of buildings such as clinics and schools?"],"info":{}}
{"id":"train_5522","question":"The Dijkstra's algorithm is named after which mathematician?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8548 wdt:P138 ?answer . ?answer wdt:P106 wd:Q170790 }","paraphrases":["The algorithm of the Dijkstra is named after which mathematician?"],"info":{}}
{"id":"train_5523","question":"Does the dolabriferol C have a specific rotation equal to -36.16?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q57394391 wdt:P6272 ?obj filter ( ?obj = -36.16 ) }","paraphrases":["Does the dolabriferol C have a particular turn break even with to -36.16?"],"info":{}}
{"id":"train_5524","question":"When did Coventry have a population of 316900?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6225 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '316900.0' ) ) . ?s pq:P585 ?value }","paraphrases":["What year did Coventry have a population of 316900?"],"info":{}}
{"id":"train_5525","question":"Tell me the name of solstice which starts with \"s\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q123524 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the solstice name that begins with \"s\""],"info":{}}
{"id":"train_5526","question":"Tell me water deity whose name has the word yinglong in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1916821 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yinglong' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know water divinity whose title has the word yinglong in it."],"info":{}}
{"id":"train_5528","question":"Name the comicbook publisher formerly known as All-American Publications that contains the word \"comics\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1114515 . ?sbj wdt:P1365 wd:Q3611907 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'comics' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the comicbook publisher formerly acknowledged as All-American Publications that includes the word \"comics\" in its name"],"info":{}}
{"id":"train_5530","question":"Why did October Revolution got devastated and who was responsible behind it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P770 wd:Q42976 . ?sbj wdt:P31 wd:Q48349 }","paraphrases":["Why did October Transformation got crushed and who was dependable behind it?"],"info":{}}
{"id":"train_5531","question":"What is the location of Feng Youlan's death that has a twin city named Minsk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q557220 wdt:P20 ?answer . ?answer wdt:P190 wd:Q2280 }","paraphrases":["What is the vicinity of Feng Youlan's death that has a twin city named Minsk?"],"info":{}}
{"id":"train_5534","question":"What  did Johannes Chrysostomus Wolfgangus Theophilus Mozart write for the clarinet concerto in A major, K. 622?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1056501 wdt:P86 ?answer . ?answer wdt:P1477 ?x FILTER ( contains ( ?x , 'Johannes Chrysostomus Wolfgangus Theophilus Mozart' ) ) }","paraphrases":["What did Johannes Chrysostomus Wolfgangus Theophilus Mozart type in for the clarinet concerto in A major, K. 622?"],"info":{}}
{"id":"train_5536","question":"What kind of characters are in Ghost Trick: Phantom Detective?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2629796 wdt:P674 ?X . ?X wdt:P4743 ?answer }","paraphrases":["What is the nature of the characters found in Ghost Trick: Phantom Detective?"],"info":{}}
{"id":"train_5538","question":"What city is the county seat of Norfolk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1376 wd:Q23109 . ?sbj wdt:P31 wd:Q515 }","paraphrases":["The country seat of Norfolk is in which city?"],"info":{}}
{"id":"train_5542","question":"Name a chemical element located in the UK that contains the word \"strontium\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11344 . ?sbj wdt:P189 wd:Q145 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'strontium' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a chemical component found within the UK that contains the word \"strontium\" in its name"],"info":{}}
{"id":"train_5543","question":"What is the Kinopoisk film ID for Dragon Ball Z?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q477916 wdt:P2603 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5545","question":"The Great Wall of China falls under what topic in history and meets what World Hertiage criteria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q12501 wdt:P2614 ?ans_1 . wd:Q12501 wdt:P2184 ?ans_2 }","paraphrases":["The Great Wall of China falls under what theme in records and meets what World Hertiage criteria?"],"info":{}}
{"id":"train_5546","question":"What is the rank of the taxon parent in the Allosaurus family?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14400 wdt:P171 ?answer . ?answer wdt:P105 wd:Q35409 }","paraphrases":["What is the rank of the taxon parent within the Allosaurus family?"],"info":{}}
{"id":"train_5547","question":"What Class IIIB combustible liquid has the highest vapor pressure?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009059 . ?ent wdt:P2119 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the combustible liquid has the highest vapor pressure in Class IIIB?"],"info":{}}
{"id":"train_5548","question":"what is just fontaine of fff male player id","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q192749 wdt:P4883 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5550","question":"When did Keith Holyoake become the Prime Minister of New Zealand?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q637012 p:P39 ?s . ?s ps:P39 wd:Q1071117 . ?s pq:P580 ?value }","paraphrases":["What year did Keith Holyoake become the Prime Minister of New Zealand?"],"info":{}}
{"id":"train_5551","question":"How many people visit the Counter-Reformation every year?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q128168 wdt:P276 ?X . ?X wdt:P1174 ?answer }","paraphrases":["How numerous individuals visit the Counter-Reformation each year?"],"info":{}}
{"id":"train_5553","question":"Who gave the  {food plant} of {landscape of} of {Laguiole knife} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23727 wdt:P180 ?X . ?X wdt:P1034 ?answer }","paraphrases":["Who named Laguiole knife?"],"info":{}}
{"id":"train_5554","question":"What award was The Shawshank Redemption nominated for","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q172241 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 ?value1 . }","paraphrases":["What award did Charlie Parker win and when did he acquire it"],"info":{}}
{"id":"train_5556","question":"Which is the standard enthalpy of formation of ethane?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q52858 wdt:P3078 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5557","question":"Kristi Yamaguchi won what sport in the Olympics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q237651 wdt:P2522 ?obj . ?obj wdt:P31 wd:Q18536594 }","paraphrases":["Kristi Yamaguchi won what don within the Olympics?"],"info":{}}
{"id":"train_5559","question":"At what end time did Adolphe Thiers give up his position held as the head of government in France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5738 p:P39 ?s . ?s ps:P39 wd:Q15135541 . ?s pq:P582 ?value }","paraphrases":["When did Adolphe Thiers resign his position as the head of government in France?"],"info":{}}
{"id":"train_5561","question":"How many were officially opened by Prince Philip, Duke of Edinburgh?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P542 wd:Q80976 }","paraphrases":["Give me the number of castles opened by Prince Philip."],"info":{}}
{"id":"train_5562","question":"What tributary is on lake Saint Martin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q25596 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["Name the tributary situated on lake Saint Martin."],"info":{}}
{"id":"train_5563","question":"What is the deity of Mahishasura} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q663318 wdt:P157 ?X . ?X wdt:P1049 ?answer }","paraphrases":["What is the divinity of Mahishasura} ?"],"info":{}}
{"id":"train_5564","question":"What wind turbine power station has the least annual energy output?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q159719 . ?ent wdt:P4131 ?obj . ?ent wdt:P2670 wd:Q49833 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What would be the wind turbine power station with the annual least energy output?"],"info":{}}
{"id":"train_5565","question":"what is the spacecraft with the lowest orbits completed whose instance of is spacecraft?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q40218 . ?ent wdt:P1418 ?obj . ?ent wdt:P31 wd:Q40218 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which spacecraft has the lowest number of orbits completed in a single occurrence?"],"info":{}}
{"id":"train_5568","question":"What does CBS do?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1056 wd:Q43380 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["What is CBS doing?"],"info":{}}
{"id":"train_5569","question":"Where did Vint Cerf have an academic major of mathematics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q92743 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q395 }","paraphrases":["At what University did Vint Cerf achieve his Mathematics degree?"],"info":{}}
{"id":"train_5571","question":"Name an fictionnal planet similar to the sun that contains the word \"vulcan \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5961279 . ?sbj wdt:P397 wd:Q525 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vulcan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a sun - like fictional planet with the word \"vulcan\" in its name"],"info":{}}
{"id":"train_5572","question":"When was Pericles born, given that the Gregorian  date of his birth is earlier than 1584","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q80398 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["If the Gregorian date of birth of Pericles was 1584 then what is his date of birth?"],"info":{}}
{"id":"train_5573","question":"Which {number of points/goals/set scored} and {number of matches played} of {{Matt Busby} has {member of sports team} as {Liverpool F.C.}}","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206237 p:P54 ?s . ?s ps:P54 wd:Q1130849 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["What {number of points/goals/set scored} and {number of matches played} of {{Matt Busby} has {member of sports team} as {Liverpool F.C.}}"],"info":{}}
{"id":"train_5575","question":"What signed language of Peter Singer has a case of genitive case?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q211539 wdt:P1412 ?answer . ?answer wdt:P2989 wd:Q146233 }","paraphrases":["What is made from Puncak Jaya which has rot point of 1517.0?"],"info":{}}
{"id":"train_5576","question":"The Tokugawa Shogunate was located in what country?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P27 wd:Q205662 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["The Tokugawa Shogunate was found in what country?"],"info":{}}
{"id":"train_5577","question":"Tell me the hypothetical planet that has Sun as a parent astronomical body and starts with the letter v?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5961279 . ?sbj wdt:P397 wd:Q525 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the theoretical planet that has Sun as a parent cosmic body and begins with the letter v?"],"info":{}}
{"id":"train_5579","question":"Which is the voice type of death growl?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P412 wd:Q335499 }","paraphrases":[],"info":{}}
{"id":"train_5580","question":"Who is the renter of the neighborhood, Venus de MIlo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q151952 wdt:P276 ?X . ?X wdt:P466 ?answer }","paraphrases":["Who is the leaseholder of the neighborhood, Venus de MIlo?"],"info":{}}
{"id":"train_5581","question":"What are the book which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q571 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the book which begin with the letter t"],"info":{}}
{"id":"train_5582","question":"What are the Catholic cathedral which start with the letter saint","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56242215 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'saint' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Catholic cathedral which begin with the letter saint"],"info":{}}
{"id":"train_5584","question":"Which is {founded by} the {subsidiary} of {Southwest_Airlines} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q503308 wdt:P112 ?ans_1 . wd:Q503308 wdt:P355 ?ans_2 }","paraphrases":["What subsidiary is founded by Southwest Airlines?"],"info":{}}
{"id":"train_5587","question":"What language did Nancy and Viscountess Astor speak in the \"welcome banner.jpg\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q195013 wdt:P1412 ?answer . ?answer wdt:P948 ?x FILTER ( contains ( ?x , 'Welcome banner.jpg' ) ) }","paraphrases":["What dialect did Nancy and Viscountess Astor talk within the \"welcome banner.jpg\"?"],"info":{}}
{"id":"train_5588","question":"Are Tintin and Snowy characters from 'The Adventures of Tintin'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q744536 wdt:P674 wd:Q52986 . wd:Q744536 wdt:P674 wd:Q1640056 }","paraphrases":["In 'The Adventures of Tintin', are Tintin and Snowy both characters?"],"info":{}}
{"id":"train_5589","question":"When did Sebastian Cole hold the position of the President of the Olympic Organizing Committee?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q188502 p:P39 ?s . ?s ps:P39 wd:Q7241353 . ?s pq:P580 ?value }","paraphrases":["What years was Sebastian Cole President of the Olympic Organizing Committee?"],"info":{}}
{"id":"train_5590","question":"Tell me intensive quantity whose name has the word volume in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3387041 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'volume' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me intensive extent whose title has the phrase extent in it."],"info":{}}
{"id":"train_5592","question":"What is the constitution of the Soviet Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q15180 wdt:P457 ?obj . ?obj wdt:P31 wd:Q7755 }","paraphrases":[],"info":{}}
{"id":"train_5593","question":"Which is the diagnostic test that is a health specialty of anatomical pathology and contains the word pap in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1762591 . ?sbj wdt:P1995 wd:Q683455 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pap' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the symptomatic test that's a wellbeing strength of anatomical pathology and contains the word pap in it's name?"],"info":{}}
{"id":"train_5594","question":"What is the daily newspaper published by Alan Rusbridger that contains the word \" guardian\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1110794 . ?sbj wdt:P98 wd:Q921140 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'guardian' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the day by day paper distributed by Alan Rusbridger that contains the word \" watchman\" in its name"],"info":{}}
{"id":"train_5595","question":"Name the anion for conjugate acid of ammonia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4147 wd:Q4087 . ?sbj wdt:P31 wd:Q107968 }","paraphrases":["Title the anion for conjugate corrosive of ammonia?"],"info":{}}
{"id":"train_5596","question":"who was the wife of julius caesar at the end of -68-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1048 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( ?x , '-68-0-0' ) ) }","paraphrases":["Give me the name of Julius Caesar's wife at the end of -68-0-0."],"info":{}}
{"id":"train_5601","question":"What did Katherine Dunham study at the University of Chicago and what was her academic degree in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q272637 p:P69 ?s . ?s ps:P69 wd:Q131252 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What did Katherine Dunham get her degree in at the University of Chicago?"],"info":{}}
{"id":"train_5602","question":"What are the film studio which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q976981 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the film studio which begin with the letter s"],"info":{}}
{"id":"train_5603","question":"When is the end time of the Republic of Tartarstan whom Rostam Minnexanov was head of government?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5481 p:P6 ?s . ?s ps:P6 wd:Q983503 . ?s pq:P582 ?value }","paraphrases":["When did the Republic of Tartarstan end when Rostam Minnexanov was head of government?"],"info":{}}
{"id":"train_5604","question":"What are the  type of software which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28530532 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the type of software which begin with the letter s"],"info":{}}
{"id":"train_5605","question":"Chronic Obstructive Pulmonary Disease falls into which health speciality and which drug is used for its treatment?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q199804 wdt:P1995 ?ans_1 . wd:Q199804 wdt:P2176 ?ans_2 }","paraphrases":["Chronic obstructive pulmonary disease falls into which specialty of health and which drug is used to treat it?"],"info":{}}
{"id":"train_5606","question":"What is the difference between casual dining and fine dining?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11707 wdt:P460 ?answer . ?answer wdt:P1889 wd:Q19316447 }","paraphrases":["What is the distinction between casual eating and great dining?"],"info":{}}
{"id":"train_5608","question":"Does the bore of the DRG Class 03 equal 570?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q201801 wdt:P2556 ?obj filter ( ?obj = 570 ) }","paraphrases":["Does the bore of the DRG Course 03 rise to 570?"],"info":{}}
{"id":"train_5609","question":"For Saint Kitts and Nevis when was the inflation rate as 6.5?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q763 p:P1279 ?s . ?s ps:P1279 ?x filter ( contains ( ?x , '6.5' ) ) . ?s pq:P585 ?value }","paraphrases":["When was the inflation rate of 6.5, for both Saint Kitts and Nevis, implemented?"],"info":{}}
{"id":"train_5611","question":"When was the first to record the death of David Koresh?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q431015 wdt:P1196 ?X . ?X wdt:P1249 ?answer }","paraphrases":["What is the first record of David Koresh's death?"],"info":{}}
{"id":"train_5612","question":"What is the title of the sequel to Lila: An Inquiry into Morals and who authored it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q694346 wdt:P155 ?X . ?X wdt:P50 ?answer }","paraphrases":["What is the title of the continuation to Lila: An Request into Ethics and who created it?"],"info":{}}
{"id":"train_5613","question":"How is a cubic meter measured?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1880 wd:Q25517 }","paraphrases":[],"info":{}}
{"id":"train_5614","question":"When Gamal Abdel Nasser} started his position as Prime Minister of Egypt?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q39524 p:P39 ?s . ?s ps:P39 wd:Q1571396 . ?s pq:P580 ?value }","paraphrases":["On what date did Gamal Abdel Nasser start his position as Prime Minister of Egypt?"],"info":{}}
{"id":"train_5615","question":"Who is the voice actor of the character Loretta Brown from the Family Guy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5930 p:P725 ?s . ?s ps:P725 ?obj . ?s pq:P453 wd:Q589480 }","paraphrases":["Give me the name of the actor who's voice was used for  Loretta Brown from the Family Guy?"],"info":{}}
{"id":"train_5616","question":"In the history of Peru, What is the total fertility rate of women?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q316648 wdt:P1269 ?X . ?X wdt:P4841 ?answer }","paraphrases":["Within the history of Peru, What is the entire ripeness rate of women?"],"info":{}}
