{"id":"train_15400","question":"What notable work was produced by Giotto di Bondone in 1300?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7814 p:P800 ?s . ?s ps:P800 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1300' ) ) }","paraphrases":["Giotto di Bondone created what notable work in 1300?"],"info":{}}
{"id":"train_15404","question":"When did the marriage between Maya Plisetskaya and Māris Liepa end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q460756 p:P26 ?s . ?s ps:P26 wd:Q2637804 . ?s pq:P582 ?value }","paraphrases":["When was the end of the marriage between Maya Plisetskaya and Māris Liepa?"],"info":{}}
{"id":"train_15405","question":"What award did Dolores Huerta receive in 2012?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q468843 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2012' ) ) }","paraphrases":["What award did Dolores Huerta win in 2012?"],"info":{}}
{"id":"train_15409","question":"What is the occupation of Harry Hinsley?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q834014 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["What is the occupation of Harry Hinsley?"],"info":{}}
{"id":"train_15413","question":"when did headquarters location of that is located at street address is one cnn center","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q48340 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P969 ?x filter ( contains ( ?x , 'One CNN Center' ) ) }","paraphrases":["When did the headquarters moved to 1 CNN Center?"],"info":{}}
{"id":"train_15416","question":"What public holiday in Norway starts with the letter \"p\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2398229 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What open occasion in Norway begins with the letter \"p\"?"],"info":{}}
{"id":"train_15417","question":"What are the legal profession which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15987302 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a profession in law that begins with an S."],"info":{}}
{"id":"train_15419","question":"Who was the Forrest Gump actor who was nominated for Best Actor at the Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q134773 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P2453 ?value }","paraphrases":["What was the name of the Forrest Gump actor who was considered for Best Actor at the Academy Awards?"],"info":{}}
{"id":"train_15420","question":"Name a policy known as a manifestation of racism that starts with letter A","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1156854 . ?sbj wdt:P1557 wd:Q8461 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a policy known as a manifestation of racism that begins with letter A"],"info":{}}
{"id":"train_15421","question":"Truman Capote wrote what famous writing??","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q134180 wdt:P800 ?obj . ?obj wdt:P31 wd:Q47461344 }","paraphrases":["Truman Capote composed what popular composing??"],"info":{}}
{"id":"train_15422","question":"For what film did Michael Douglas win an Academy Award for Best Picture?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q119798 p:P166 ?s . ?s ps:P166 wd:Q102427 . ?s pq:P805 ?value }","paraphrases":["Give the name of the film for which Michael Douglas won \"Best Picture\" at the Academy Awards."],"info":{}}
{"id":"train_15424","question":"Tell me iba official cocktail whose name has the word vesper in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2536409 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vesper' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know iba official cocktail whose title has the word vesper in it."],"info":{}}
{"id":"train_15425","question":"who happens in of school attended of amy bloom ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4749108 wdt:P69 ?X . ?X wdt:P131 ?answer }","paraphrases":["While Amy Bloom is a student what happens?"],"info":{}}
{"id":"train_15426","question":"What Territory of Dasoguz began in 1932?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q487672 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1932' ) ) }","paraphrases":["Which Territory of Dasoguz started in 1932?"],"info":{}}
{"id":"train_15427","question":"Tell me about the Wikimedia duplicate article about Barack Obama.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q76 wdt:P2959 ?obj . ?obj wdt:P31 wd:Q21286738 }","paraphrases":["Let me know around the Wikimedia copy article almost Barack Obama."],"info":{}}
{"id":"train_15429","question":"What was the annual profit of Alphabet Inc. in the year 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q20800404 p:P2295 ?s . ?s ps:P2295 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["How much yearly profit did Alphabet Inc. make in 2016?"],"info":{}}
{"id":"train_15431","question":"Where is the death place of Tex Rickard whose height is 2.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q713459 wdt:P20 ?answer . ?answer wdt:P2044 ?x FILTER ( contains ( ?x , '2.0' ) ) }","paraphrases":["Where is the dying vicinity of Tex Rickard whose peak is 2.0?"],"info":{}}
{"id":"train_15434","question":"who landscape of work of william gell?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q506472 wdt:P800 ?X . ?X wdt:P180 ?answer }","paraphrases":["who has landscaped the work of williams gell?"],"info":{}}
{"id":"train_15436","question":"What is the polymer of ethylene?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4600 wd:Q151313 . ?sbj wdt:P31 wd:Q81163 }","paraphrases":["Ethylene is polymerized into which polymer?"],"info":{}}
{"id":"train_15439","question":"What city, birthplace of Jonah Peretti, has divided into the Commonwealth of the Philippines?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6271916 wdt:P19 ?answer . ?answer wdt:P150 wd:Q146328 }","paraphrases":["What city, Jonah Peretti's birthplace, has split into the Philippines Commonwealth?"],"info":{}}
{"id":"train_15440","question":"Which is the mausoleum which contains the word zuihōden in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q162875 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zuihōden' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the tomb which contains the word zuihōden in it's name?"],"info":{}}
{"id":"train_15444","question":"What is named after January starting in 2002?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q108 p:P138 ?s . ?s ps:P138 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["Starting in 2002, what is named after January?"],"info":{}}
{"id":"train_15445","question":"When did data set  for  significant event of Nicolas Sarkozy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q329 wdt:P793 ?obj . ?obj wdt:P31 wd:Q1172284 }","paraphrases":[],"info":{}}
{"id":"train_15447","question":"WhO is holding of owns of Tesco?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q487494 wdt:P1830 ?X . ?X wdt:P749 ?answer }","paraphrases":["Which person owns Tesco?"],"info":{}}
{"id":"train_15449","question":"What are the location and coordinates of the town called Tallow?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q863266 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '24.7858' ) ) }","paraphrases":["What are the area and arranges of the town called Tallow?"],"info":{}}
{"id":"train_15450","question":"What twinned twinned administrative body of Stavanger started on the 1st of January 1948?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q25416 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1948' ) ) }","paraphrases":["Give me the name of the administrative body of Stavanger that started January 1st, 1948."],"info":{}}
{"id":"train_15451","question":"What was the population of East Flanders in 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1114 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["What was East Flanders ' population in 2016?"],"info":{}}
{"id":"train_15453","question":"Which statistician is the Nyquist-Shannon sampling theorem named after?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q679800 wdt:P138 ?answer . ?answer wdt:P106 wd:Q2732142 }","paraphrases":["Which statistician is the Nyquist-Shannon sampling theorem named after?"],"info":{}}
{"id":"train_15454","question":"Is Sridevi a language of Marathi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q270691 wdt:P1412 wd:Q1571 }","paraphrases":["was sridevi at a language of marathi?"],"info":{}}
{"id":"train_15455","question":"What is The Population of Coruna in  january first of 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8757 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2005' ) ) }","paraphrases":["On January 1, 2015, the population of Coruna was what number?"],"info":{}}
{"id":"train_15457","question":"Which is the feast day for Saints Cyril and Methodius?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P841 wd:Q239925 }","paraphrases":[],"info":{}}
{"id":"train_15459","question":"In what place with a human population of 8787892 is Frederick John Robinson, 1st Viscount Goderich, active?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q312591 wdt:P937 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '8787892' ) ) }","paraphrases":["In what put with a human populace of 8787892 is Frederick John Robinson, 1st Viscount Goderich, active?"],"info":{}}
{"id":"train_15460","question":"Did Ivanka Trump host a tv show?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q239411 wdt:P106 wd:Q947873 }","paraphrases":["Was Ivonka Trump ever a tv host?"],"info":{}}
{"id":"train_15461","question":"What is approved by the Iraq War?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q545449 wdt:P790 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15463","question":"Tell me me a media player whose name consist of the word \"woman\" and whose readable file format iTunes Music Library, binary variant itunes","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q210337 . ?sbj wdt:P1072 wd:Q27967349 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'itunes' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me me a media player whose name consist of the word \"woman\" and whose readable file format iTunes Music Library, binary variant itunes"],"info":{}}
{"id":"train_15464","question":"IS THE KINEMATIC VISCOSITY OF THE WATER GREATER THAN 0.012144","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q283 wdt:P2118 ?obj filter ( ?obj > 0.012144 ) }","paraphrases":["What is the Kinematic Viscosity of the water?"],"info":{}}
{"id":"train_15466","question":"How many patron saints are in Poland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q36 wdt:P417 ?obj }","paraphrases":["In Portland, how many patron saints are there?"],"info":{}}
{"id":"train_15467","question":"Are the number of parts in the work of art the Madama Butterfly 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q19005 wdt:P2635 ?obj filter ( ?obj = 2 ) }","paraphrases":["How many number of parts are the work of Madama Butterly 2?"],"info":{}}
{"id":"train_15469","question":"Tell me National Historic Trail  whose name has the word trail in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6973377 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trail' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me National Noteworthy Path whose title has the word path in it."],"info":{}}
{"id":"train_15471","question":"Is 0 the opposite of 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q204 wdt:P461 wd:Q204 }","paraphrases":["Is it accurate to say that 0 is the opposite of 0?"],"info":{}}
{"id":"train_15473","question":"Give me a name of hypostasis, which starts with an alphabet 'h'.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q651118 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me a hypostasis name that begins with an ' h ' alphabet."],"info":{}}
{"id":"train_15476","question":"Who gave the{deepest point} of {endemism} of {Guibemantis tornieri} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28056966 wdt:P183 ?X . ?X wdt:P1589 ?answer }","paraphrases":["Who named the deepest point of endemism of Guibemantis tornieri?"],"info":{}}
{"id":"train_15477","question":"When did Mika Brzezinski start working for MSNBC?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q449013 p:P108 ?s . ?s ps:P108 wd:Q13973 . ?s pq:P580 ?value }","paraphrases":["When did Mika Brzezinski start working for MSNBC?"],"info":{}}
{"id":"train_15478","question":"What award did Matti Nykanen receive as a Ski Jumper in the 1984 Winter Olympics at Normal Hill?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16849 p:P1344 ?s . ?s ps:P1344 wd:Q376245 . ?s pq:P166 ?value }","paraphrases":["Did Matti Nykanen win a gold, silver, or bronze medal as a ski jumper in the 1984 Winter Olymics at Normal Hill?"],"info":{}}
{"id":"train_15479","question":"Which award was received by Frei Otta in the year 1997.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q64412 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1997' ) ) }","paraphrases":["What award did Frei Otta receive in 1997?"],"info":{}}
{"id":"train_15481","question":"When did Robert M. Follette end his position as Governor of Wisconsin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q878682 p:P39 ?s . ?s ps:P39 wd:Q3112727 . ?s pq:P582 ?value }","paraphrases":["In what year did Mr. Follette end his position as Governor of WI?"],"info":{}}
{"id":"train_15482","question":"What record is held by Renaud Lavillenie and where?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q1742 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P276 ?value1 . }","paraphrases":["What record is held by Renaud Lavillenie and where?"],"info":{}}
{"id":"train_15483","question":"Which film was Sergei Eisenstein a director of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P57 wd:Q8003 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Which film was Sergei Eisenstein a executive of?"],"info":{}}
{"id":"train_15484","question":"Was Reese Witherspoon influenced by Julia Roberts?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44063 wdt:P737 wd:Q40523 }","paraphrases":["Was Julia Roberts an influence on Reese Witherspoon?"],"info":{}}
{"id":"train_15485","question":"when did the Italo-Turkish war end?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q203824 wdt:P582 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15486","question":"What position does the the Church of England hold","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2389 wd:Q82708 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["The Church of England hold's what position?"],"info":{}}
{"id":"train_15489","question":"What is epigraphy's business division?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P199 wd:Q181260 }","paraphrases":[],"info":{}}
{"id":"train_15491","question":"What are the single which start with the letter way","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134556 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'way' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT IS SINGLE WHICH START WITH THE LETTER WAY"],"info":{}}
{"id":"train_15493","question":"Who is the child of the sister of Louis, Dauphin of France, Duke of Guyenne?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1347131 wdt:P3373 ?X . ?X wdt:P22 ?answer }","paraphrases":["Tell me who Louis, Dauphin of France, Duke of Guyenne's sister's child is."],"info":{}}
{"id":"train_15494","question":"What is the {satellite} of the {star} {Triton}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3359 wdt:P397 ?X . ?X wdt:P398 ?answer }","paraphrases":["What satellites the star Triton?"],"info":{}}
{"id":"train_15495","question":"When was the population of Davao City 849947.0 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1473 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '849947.0' ) ) . ?s pq:P585 ?value }","paraphrases":["In what time period did Davao City have a population of 849947.0 ?"],"info":{}}
{"id":"train_15499","question":"Where is {location} and {height} of {{pole vault}  {record held} by {Jennifer Suhr}} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q6310 . ?s pq:P276 ?value1 . ?s pq:P2048 ?value2 }","paraphrases":["What height is and where was the pole vault record set by Jennifer Suhr?"],"info":{}}
{"id":"train_15500","question":"Give me an university that starts with 'V' and has Carnegie Classification of Institutions of Higher Education, that is also an Doctoral University with highest research activity.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3918 . ?sbj wdt:P2643 wd:Q23334765 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me a college that begins with 'V' and has Carnegie Classification of Institutions of Higher Education, that is likewise a Doctoral University with most noteworthy research action."],"info":{}}
{"id":"train_15501","question":"What country has the word \"States\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43702 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'states' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What nation has the word \"States\" in its name?"],"info":{}}
{"id":"train_15502","question":"Where did William Jones from the British Raj die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q273969 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q129286 }","paraphrases":["During British Rule of India, in what city did William Jones perish?"],"info":{}}
{"id":"train_15503","question":"Was Alan Alda nominated for a Tony Award for Best Actor in a Play and a Drama Desk Award for Outstanding Featured Actor in a Play?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q310394 wdt:P1411 wd:Q1445521 . wd:Q310394 wdt:P1411 wd:Q5305712 }","paraphrases":["Is it true that Alan Alda was nominated for both a Tony Award for Best Actor in a Play and a Drama Desk Award for Outstanding Featured Actor in a Play?"],"info":{}}
{"id":"train_15504","question":"Which archipelagic state has the highest age of majority?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q13107770 . ?ent wdt:P2997 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What archipelagic state contains the age of majority that is the highest?"],"info":{}}
{"id":"train_15506","question":"Tell me fictional detective whose name has the word sam in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q523 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vega' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know anecdotal analyst whose title has the word sam in it."],"info":{}}
{"id":"train_15508","question":"Is the metallicity of the Messier 62 less than -0.944?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13980 wdt:P2227 ?obj filter ( ?obj < -0.944 ) }","paraphrases":["What is the metallicity of the Messier 62?"],"info":{}}
{"id":"train_15509","question":"Which is the density of malathion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q423005 wdt:P2054 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15511","question":"What is the {award received} of {William O. Douglas} that is {point in time} in {1962-1-1} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1391996 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1962' ) ) }","paraphrases":["What award did William O. Douglas receive on January 1st, 1962?"],"info":{}}
{"id":"train_15513","question":"When did Tel Aviv become the twin city of Łódź ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q33935 p:P190 ?s . ?s ps:P190 wd:Q580 . ?s pq:P580 ?value }","paraphrases":["Give me the date when Tel Aviv became partner city of Łódź."],"info":{}}
{"id":"train_15514","question":"Who is the {data controller (GDPR)} for {secretary general} of {Mariano Rajoy}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3975 wd:Q10819 . ?sbj wdt:P31 wd:Q59859818 }","paraphrases":["Who is the {information controller (GDPR)} for {secretary common} of {Mariano Rajoy}"],"info":{}}
{"id":"train_15515","question":"What is the {Christian name} of {Vasco Núñez de Balboa}, that has {language of website} is {Portuguese} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19080 wdt:P735 ?answer . ?answer wdt:P407 wd:Q5146 }","paraphrases":["What is the {Christian title} of {Vasco Núñez de Balboa}, that has {dialect of site} is {Portuguese} ?\""],"info":{}}
{"id":"train_15519","question":"What role did Lance Reddick play in \"The Wire\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q478360 p:P161 ?s . ?s ps:P161 wd:Q322056 . ?s pq:P453 ?value }","paraphrases":["Who did Lance Reddick play in \"The Wire\"?"],"info":{}}
{"id":"train_15520","question":"Which means{has part}  from {Indian Ocean} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1239 wdt:P527 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15521","question":"Where was Elizabeth Ann Seton buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q459032 wdt:P119 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Where was Elizabeth Ann Seton buried?"],"info":{}}
{"id":"train_15522","question":"What airport does Delta Air Lines fly out of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P121 wd:Q188920 . ?sbj wdt:P31 wd:Q1248784 }","paraphrases":["What airplane terminal does Delta Discuss Lines fly out of?"],"info":{}}
