{"id":"train_10133","question":"WHat is the fossil taxon of type OH 7 that contains the word habilis\"\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23038290 . ?sbj wdt:P427 wd:Q7072569 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'habilis' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat is the fossil taxon of kind OH 7 that contains the word habilis\"\" in its name"],"info":{}}
{"id":"train_10135","question":"When was Stanley Baldwin elected to the 34th Parliament of the United Kingdom, and when did his term end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q166635 p:P39 ?s . ?s ps:P39 wd:Q41582587 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["When was Stanley Baldwin elected to the United Kingdom's 34th Parliament, and when ended his term?"],"info":{}}
{"id":"train_10138","question":"When was Wayne Gretzky inducted intot the Hockey Hall of Fame?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q209518 p:P166 ?s . ?s ps:P166 wd:Q1136687 . ?s pq:P585 ?value }","paraphrases":["When did Wayne Gretzy get put into the Hockey hall of fame?"],"info":{}}
{"id":"train_10139","question":"What was Anthony Quinn nominated for, in the beginning of January 1957?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q83484 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1957' ) ) }","paraphrases":["for which was Anthony Quinn nominated for, in the beginning of January 1957?"],"info":{}}
{"id":"train_10140","question":"Which is the enterprise of the headquarters location in Cleveland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q37320 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":[],"info":{}}
{"id":"train_10143","question":"What award did Ed Begley receive in the year 1956?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q318312 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1956' ) ) }","paraphrases":["In 1956, Ed Begley received what award?"],"info":{}}
{"id":"train_10145","question":"Was Jerry Lee Lewis' record label from Philips and Smash Records?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q202729 wdt:P264 wd:Q1536003 . wd:Q202729 wdt:P264 wd:Q7544232 }","paraphrases":["Was Jerry Lee Lewis' record label acquired through Philips and Smash Records?"],"info":{}}
{"id":"train_10146","question":"What is  award received  from Henrik Pontoppidan that is  together with is  Karl Adolph Gjellerup ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q225554 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q131487 }","paraphrases":["Henrik Pontoppidan received which award together with Karl Adolph Gjellerup?"],"info":{}}
{"id":"train_10147","question":"Tell me Class II combustible liquid whose name has the word toluene in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21009057 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'toluene' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know comedic sort whose title has the word sitcom in it title"],"info":{}}
{"id":"train_10148","question":"Does Alloy 718's Poisson's ratio equal to .32?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q55843475 wdt:P5593 ?obj filter ( ?obj = 0.32 ) }","paraphrases":["Is .32 equal to the Alloy 718's Poisson's ratio"],"info":{}}
{"id":"train_10150","question":"What is the landscape of Water Lilies having vernacular name of","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1189907 wdt:P180 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'اپسرا' ) ) }","paraphrases":["What is the scene of Water Lilies having vernacular title of"],"info":{}}
{"id":"train_10151","question":"With 300029 inhabitants, where is the village of Xingtai?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q58576 wdt:P150 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '300029' ) ) }","paraphrases":["With 300029 tenants, where is the town of Xingtai?"],"info":{}}
{"id":"train_10152","question":"Which is the place of work of August Sander that has executive power headed by Ernst Schwering?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q61530 wdt:P937 ?answer . ?answer wdt:P6 wd:Q1360182 }","paraphrases":["Which is August Sander's workplace that is headed by Ernst Schwering with executive power?"],"info":{}}
{"id":"train_10153","question":"Tell me revolution which contains the word o revolution in their own name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10931 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'revolution' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a revolution in their own name that contains the word o revolution"],"info":{}}
{"id":"train_10154","question":"What is the FAA airport code for Los Angeles International Airport?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q8731 wdt:P240 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10155","question":"What is the chemical compound of erythromycin when interacting with a significant drug?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P769 wd:Q213511 . ?sbj wdt:P31 wd:Q11173 }","paraphrases":["When interacting with a significant drug, what is the chemical compound of erythromycin?"],"info":{}}
{"id":"train_10157","question":"Name an hill in Asia that contains the word \"ridges\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q54050 . ?sbj wdt:P30 wd:Q48 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ridges' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an hill in Asia that contains the phrase \"ridges\" in its name"],"info":{}}
{"id":"train_10159","question":"Who wrote the novel known for politics and the English language, \"1984\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q208460 wdt:P50 ?answer . ?answer wdt:P800 wd:Q2273966 }","paraphrases":["Who wrote the novel acknowledged for politics and the English language, \"1984\"?"],"info":{}}
{"id":"train_10160","question":"What is the diplomatic relation of the land of Ujjain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q200119 wdt:P17 ?X . ?X wdt:P530 ?answer }","paraphrases":["How is the land of Ujjain diplomatically related?"],"info":{}}
{"id":"train_10163","question":"What award was presented to Walter Payton in 1993?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q963117 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1993' ) ) }","paraphrases":["What award did Walter Payton win in 1993?"],"info":{}}
{"id":"train_10164","question":"Are Berliner Volksbank's net profits equal to 19,700,000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q821855 wdt:P2295 ?obj filter ( ?obj = 19700000 ) }","paraphrases":["Are Berliner Volksbank's net benefits break even with to 19,700,000?"],"info":{}}
{"id":"train_10165","question":"Which is the Commonwealth realm for the anthem of God Save the Queen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P85 wd:Q40807 . ?sbj wdt:P31 wd:Q202686 }","paraphrases":["Which is the Commonwealth domain for the song of devotion of God Spare the Queen?"],"info":{}}
{"id":"train_10166","question":"what is the biggest village that belongs to muchinigi puttu","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q532 . ?ent wdt:P2046 ?obj . ?ent wdt:P131 wd:Q11107378 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the largest village in Muchinigi Puttu?"],"info":{}}
{"id":"train_10167","question":"what is branch of biology that starts with z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28598684 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the biological branch that begins with z?"],"info":{}}
{"id":"train_10168","question":"Who is the chairperson of the U.S. Department of State?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q789915 wdt:P488 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10169","question":"Which is the gene for the genetic association of schizophrenia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41112 wdt:P2293 ?obj . ?obj wdt:P31 wd:Q7187 }","paraphrases":["What is the gene for schizophrenia's genetic association?"],"info":{}}
{"id":"train_10171","question":"what is the end time for ma long has ranking as 1.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q459114 p:P1352 ?s . ?s ps:P1352 ?x filter ( contains ( ?x , '1.0' ) ) . ?s pq:P582 ?value }","paraphrases":["Ma Long has ranking as 1.0 at what end time?"],"info":{}}
{"id":"train_10172","question":"Tell me vocal group whose name has the word willows in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q120544 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'willows' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know vocal bunch whose title has the word willows in it."],"info":{}}
{"id":"train_10174","question":"What university did Sylvia Plath attend and what was her academic major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q133054 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["What was the university that Sylvia Plath attended and what was her major?"],"info":{}}
{"id":"train_10175","question":"Which is the hereditary title office holder of Salman of Saudi Arabia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1308 wd:Q367825 . ?sbj wdt:P31 wd:Q5737899 }","paraphrases":["Which is the genetic title office holder of Salman of Saudi Arabia?"],"info":{}}
{"id":"train_10177","question":"Where does the holder of the position of Lech Kaczynski live?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2757 wdt:P39 ?X . ?X wdt:P263 ?answer }","paraphrases":["Where does the holder of the position of Lech Kaczynski live?"],"info":{}}
{"id":"train_10181","question":"w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q332885 wdt:P21 ?answer . ?answer wdt:P1889 wd:Q8441 }","paraphrases":["w"],"info":{}}
{"id":"train_10182","question":"Is it true that the points awarded of 3-2 sets are greater than 2.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q27210429 wdt:P3260 ?obj filter ( ?obj > 2.4 ) }","paraphrases":["Is 2.4 less than the amount of points awarded of 3-2 sets?"],"info":{}}
{"id":"train_10183","question":"What film series does Plane Daffy star in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7201002 wdt:P179 ?X . ?X wdt:P161 ?answer }","paraphrases":["What film arrangement does Plane Daffy star in?"],"info":{}}
{"id":"train_10184","question":"Who is the author and publisher of Grand Theft Auto V?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q17452 wdt:P50 ?ans_1 . wd:Q17452 wdt:P123 ?ans_2 }","paraphrases":["Name the author and publisher of Grand Theft Auto V?"],"info":{}}
{"id":"train_10187","question":"WHO APPEARS TO BE THE MOVIE DIRECTOR OF THEODOROS ANGELOPOULOS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55168 wdt:P1441 ?X . ?X wdt:P57 ?answer }","paraphrases":["WHO Shows up TO BE THE Motion picture Chief OF THEODOROS ANGELOPOULOS?"],"info":{}}
{"id":"train_10193","question":"Who is the lead of Mafia Action?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18550 wdt:P452 ?X . ?X wdt:P1542 ?answer }","paraphrases":["Who is the lead of Mafia Action?"],"info":{}}
{"id":"train_10194","question":"Who replaced Humayun as the emperor of the Munghal empire ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q486188 p:P39 ?s . ?s ps:P39 wd:Q15390704 . ?s pq:P1365 ?value }","paraphrases":["Which emperor took over for Humayun of the Munghal empire?"],"info":{}}
{"id":"train_10196","question":"What is the leading government figure for Moldova?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q217 wdt:P6 ?obj }","paraphrases":["Moldova's leading government figure is whom?"],"info":{}}
{"id":"train_10197","question":"What is the source of taxon for opium","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1672 wd:Q46452 . ?sbj wdt:P31 wd:Q16521 }","paraphrases":["What is the source of opium taxon?"],"info":{}}
{"id":"train_10201","question":"Who is the person that was a student of Ivan Pavlov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1066 wd:Q42985 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the individual that was a understudy of Ivan Pavlov?"],"info":{}}
{"id":"train_10206","question":"What is the sourcing circumstances when Irene of Athens was born in 752?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q206737 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( ?x , '752-1-1' ) ) . ?s pq:P1480 ?value }","paraphrases":["What is the sourcing conditions when Irene of Athens was conceived in 752?"],"info":{}}
{"id":"train_10207","question":"Which chemical compound has the highest standard enthalpy of formation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P3078 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which chemical compound has the highest enthalpy formation?"],"info":{}}
{"id":"train_10209","question":"What are signs of mercury poisoning as a result of using butabarbital for treatment?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q408089 wdt:P780 ?answer . ?answer wdt:P2176 wd:Q410608 }","paraphrases":["What are signs of mercury harming as a result of utilizing butabarbital for treatment?"],"info":{}}
{"id":"train_10211","question":"Which deity of Kami has the influence of Koshintō.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q524158 wdt:P1049 ?answer . ?answer wdt:P737 wd:Q3096508 }","paraphrases":["Which divinity of Kami has the impact of Koshintō."],"info":{}}
{"id":"train_10214","question":"What is name of the higher taxon of Medicago sativa whose vernacular name is אספסת?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q156106 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'אספסת' ) ) }","paraphrases":["What is the name of Medicago sativa's higher taxon whose vernacular name is omnipresent?"],"info":{}}
{"id":"train_10215","question":"Who is the owner and where is the home venue of the Los Angeles Lakers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q121783 wdt:P1830 ?ans_1 . wd:Q121783 wdt:P115 ?ans_2 }","paraphrases":["Who owns the Los Angeles Lakers and where is their venue located?"],"info":{}}
{"id":"train_10216","question":"Who leads the government of Lahore?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11739 wdt:P1313 ?obj . ?obj wdt:P31 wd:Q294414 }","paraphrases":["Give me the name of the leader of the government of Lahore?"],"info":{}}
{"id":"train_10217","question":"Who does Charlemagne, the king of Lombards, follow? And who is he followed by?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P97 ?s . ?s ps:P97 wd:Q22997793 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Who does Charlemagne, the king of Lombards, follow? And who is he followed by"],"info":{}}
{"id":"train_10218","question":"Does 1 E2 has a lower limit equal to 100?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13012283 wdt:P5447 ?obj filter ( ?obj = 100 ) }","paraphrases":["Is the lower limit of 1 E2 100?"],"info":{}}
{"id":"train_10219","question":"Is labetalol and piretanide used as a drug to treat hypertension?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41861 wdt:P2176 wd:Q958087 . wd:Q41861 wdt:P2176 wd:Q3905617 }","paraphrases":["Is it true that labetalol and piretanide are used as a drug to treat hypertension?"],"info":{}}
{"id":"train_10220","question":"Which is the Cinema Treasures ID for Canadian Museum of History>=?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1032269 wdt:P4129 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10222","question":"What is the location of Raging Bull, that has been divided into Washtenaw County?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q220780 wdt:P840 ?answer . ?answer wdt:P150 wd:Q137916 }","paraphrases":["What is the area of Seething Bull, that has been separated into Washtenaw County?"],"info":{}}
{"id":"train_10223","question":"Did William the Conqueror build the Tower of London and Windsor Castle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q37594 wdt:P1830 wd:Q62378 . wd:Q37594 wdt:P1830 wd:Q464955 }","paraphrases":["Was it William the Conqueror who built the Tower of London and Windsor Castle?"],"info":{}}
{"id":"train_10224","question":"What version of bitcoin software was published 11-1-2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131723 p:P348 ?s . ?s ps:P348 ?obj . ?s pq:P577 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["what is the version of bitcoin software edited on 11/01/2016?"],"info":{}}
{"id":"train_10226","question":"tell  me literary genre union of list values as qualifiers  starts with f","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q223393 . ?sbj wdt:P2737 wd:Q23766486 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know scholarly sort union of list values as qualifiers begins with f"],"info":{}}
{"id":"train_10227","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q220 wdt:P2596 ?obj . ?obj wdt:P31 wd:Q3024240 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_10228","question":"Who is creator Criss Angel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P170 wd:Q131685 }","paraphrases":[],"info":{}}
{"id":"train_10229","question":"Where in Massachusetts did Samuel P. Huntington die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q19074 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P131 wd:Q771 }","paraphrases":["Which area of Massachusetts did Samuel P. Huntington die?"],"info":{}}
{"id":"train_10230","question":"Which is the British Museum thesaurus ID for mineral?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7946 wdt:P3632 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10231","question":"Which is the Encyclopædia Universalis ID of John Singer Sargent?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q155626 wdt:P3219 ?answer }","paraphrases":[],"info":{}}
{"id":"train_10232","question":"What are the Hindu scriptures and texts which start with the letter b that is translated by Franklin Edgerton","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1194040 . ?sbj wdt:P655 wd:Q16002981 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Hindu scriptures and texts which begin with the letter b that is translated by using Franklin Edgerton"],"info":{}}
{"id":"train_10234","question":"who inflation rate of consumer price inde of aspect  of history of Chad?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q754192 wdt:P1269 ?X . ?X wdt:P1279 ?answer }","paraphrases":["who expansion rate of customer cost inde of viewpoint of history of Chad?"],"info":{}}
{"id":"train_10236","question":"When did Charles Aznavour receive the award for Officer of the National Order of Quebec?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1785 p:P166 ?s . ?s ps:P166 wd:Q15464524 . ?s pq:P585 ?value }","paraphrases":["Give the date when the award for Officer of the National Order of Quebec was given to Charles Aznavour?"],"info":{}}
{"id":"train_10239","question":"What is canonization status of the saint  ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P411 wd:Q43115 }","paraphrases":[],"info":{}}
{"id":"train_10240","question":"What is the battery of the plane that has causes of eating?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q204260 wdt:P618 ?answer . ?answer wdt:P828 wd:Q213449 }","paraphrases":["What is the battery of the plane that has causes of eating?"],"info":{}}
{"id":"train_10242","question":"Name a part of a plant that contain the word \"veil \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20011319 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'veil' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a part of a plant containing in its name the word \"veil\""],"info":{}}
{"id":"train_10243","question":"WHAT ARE THE WORK OF INCUMBENT OF CHIEF OFFICIAL WHITE HOUSE PHOTOGRAPHER?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28955826 wdt:P1308 ?X . ?X wdt:P108 ?answer }","paraphrases":["WHAT ARE THE PHOTOGRAPHER HOUSE OF INCUMBENT OF CHIEF OFFICIAL?"],"info":{}}
{"id":"train_10244","question":"What are the stratus which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q40526 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the stratus which begin with the letter s"],"info":{}}
{"id":"train_10245","question":"How many appointments are needed for cirrhosis of the liver?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q147778 wdt:P923 ?obj }","paraphrases":["People with early-stage cirrhosis of the liver usually don't have symptoms. Often, cirrhosis is first detected through a routine blood test or checkup. To help confirm a diagnosis, a combination of laboratory and imaging tests is usually done."],"info":{}}
{"id":"train_10246","question":"Was Coldplay's genre rock music?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q45188 wdt:P136 wd:Q11399 }","paraphrases":["Was Coldplay playing rock?"],"info":{}}
{"id":"train_10249","question":"Is it true that the sublimation temperature of starch is equal to 410?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41534 wdt:P2113 ?obj filter ( ?obj = 410 ) }","paraphrases":["Is the sublimation temperature of starch equal to 410?"],"info":{}}
{"id":"train_10251","question":"What is the number of out of school children of the continent of Kagera River ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2750140 wdt:P30 ?X . ?X wdt:P2573 ?answer }","paraphrases":["How many children in the continent of the Kagera River are out of school?"],"info":{}}
{"id":"train_10252","question":"What is in the administrative unit of Imo State, specifically the one who's capital city is Lagos?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q842939 wdt:P131 ?answer . ?answer wdt:P36 wd:Q8673 }","paraphrases":["What is within the authoritative unit of Imo State, particularly the one who's capital city is Lagos?"],"info":{}}
{"id":"train_10255","question":"What awards has Gene Wolfe received?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q361149 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What grants has Quality Wolfe received?"],"info":{}}
{"id":"train_10256","question":"How many license plates have \"plus one\" or \"+one\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q564954 wdt:P275 ?obj }","paraphrases":["How many license plate numbers contain +1?"],"info":{}}
