{"id":"train_11977","question":"What is the CEO's office of the religious affiliation of Bartholomew the Apostle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43982 wdt:P140 ?X . ?X wdt:P2388 ?answer }","paraphrases":["What is the religious affiliation of Bartholomew the Apostle's CEO office?"],"info":{}}
{"id":"train_11978","question":"tell me state of India that located in the administrative territorial entity India which  starts with u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13390680 . ?sbj wdt:P131 wd:Q668 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["inform me kingdom of India that located in the administrative territorial entity India which starts with u"],"info":{}}
{"id":"train_11979","question":"Which is the association football club for the member of sports team Ryan Giggs?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10524 wdt:P54 ?obj . ?obj wdt:P31 wd:Q476028 }","paraphrases":[],"info":{}}
{"id":"train_11980","question":"Who's voice is dubbed in Freemium Isn't Free","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18573108 wdt:P179 ?X . ?X wdt:P725 ?answer }","paraphrases":["Who's voice is named in Freemium Isn't Free"],"info":{}}
{"id":"train_11983","question":"Does the floors below ground of the U.S. Bank Tower equal to 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q57900 wdt:P1139 ?obj filter ( ?obj = 2 ) }","paraphrases":["How many underground floors are in the US Bank Tower?"],"info":{}}
{"id":"train_11984","question":"Is it true that the periapsis of 1951 Lick equals to 1.3048936?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q146318 wdt:P2244 ?obj filter ( ?obj = 1.3048936 ) }","paraphrases":["Is the pariapsis of 1951 Lick 1.3048936?"],"info":{}}
{"id":"train_11985","question":"Which is the properties for this type of ambassador?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q121998 wdt:P1963 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11986","question":"Does Tamala park has 0 male population?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7680582 wdt:P1540 ?obj filter ( ?obj = 0.0 ) }","paraphrases":["True or False, Tamala park has a 0 male population?"],"info":{}}
{"id":"train_11988","question":"What are the mass media which start with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11033 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What mass media starts with \"y\"?"],"info":{}}
{"id":"train_11990","question":"Who discovered and what is Uranium name after?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1098 wdt:P61 ?ans_1 . wd:Q1098 wdt:P138 ?ans_2 }","paraphrases":["Who found and what is Uranium title after?"],"info":{}}
{"id":"train_11991","question":"Tell me which is the legal doctrine which contains the word person in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1192543 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'person' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know which is the legitimate tenet which contains the word person in it's name?"],"info":{}}
{"id":"train_11992","question":"Is the galatic latitude of Orion Nebula less than -15.5071472","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13903 wdt:P6261 ?obj filter ( ?obj < -15.5071472 ) }","paraphrases":["Tell me if the galactic latitude of Orion Nebula is less than -15.5071472."],"info":{}}
{"id":"train_11993","question":"Which restaurateur coined the term hot dog?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q181055 wdt:P61 ?answer . ?answer wdt:P106 wd:Q3427922 }","paraphrases":["Which restaurant coined the term hot dog?"],"info":{}}
{"id":"train_11994","question":"How many awards received were for Lincoln Kirstein?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q351339 wdt:P166 ?obj }","paraphrases":["What is the number of awards received by Lincoln Kirstein?"],"info":{}}
{"id":"train_11995","question":"What political part did Muammar al-Daddafi found","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P112 wd:Q19878 . ?sbj wdt:P31 wd:Q7278 }","paraphrases":["What political portion did Muammar al-Daddafi found"],"info":{}}
{"id":"train_11996","question":"What is Pete Maravich's competition class, position and specialty on his team?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q316183 wdt:P2094 ?ans_1 . wd:Q316183 wdt:P413 ?ans_2 }","paraphrases":["What was Pete Maravich's place on his basketball team"],"info":{}}
{"id":"train_11997","question":"What is the distance of Jupiter from the Sun?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q319 p:P2243 ?s . ?s ps:P2243 ?obj . ?s pq:P2210 wd:Q525 }","paraphrases":["How far away Jupiter is from the sun?"],"info":{}}
{"id":"train_12000","question":"fdhgdfh","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2992341 wdt:P1412 ?answer . ?answer wdt:P5109 wd:Q1775461 }","paraphrases":["Explain fdhgdfh."],"info":{}}
{"id":"train_12001","question":"Who gave the{head office location} of {works for} of {Lars Stigzelius} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q639832 wdt:P108 ?X . ?X wdt:P159 ?answer }","paraphrases":["Give me the name of the person who gave the head office location and works for Las Stigzelius."],"info":{}}
{"id":"train_12007","question":"Where is the death place of Ivan Kozlovsky which has 215,000 inhabitants?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1397423 wdt:P20 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '215000.0' ) ) }","paraphrases":["Where is the demise location of Ivan Kozlovsky which has 215,000 inhabitants?"],"info":{}}
{"id":"train_12008","question":"WHICH IS THE PROFESSIONAL DEGREE THAT CONTAINS THE WORD MASTER IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3273292 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'master' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT PROFESSIONAL DEGREE  CONTAINS THE WORD MASTER IN THE NAME"],"info":{}}
{"id":"train_12012","question":"Name a trans-Neptunian object discovered by Jan Oort that starts with letter C","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6592 . ?sbj wdt:P61 wd:Q309861 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a trans-Neptunian object observed via Jan Oort that starts with letter C"],"info":{}}
{"id":"train_12015","question":"Was Akon record label Stax and UpFront Records?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q32849 wdt:P264 wd:Q1546001 . wd:Q32849 wdt:P264 wd:Q7897910 }","paraphrases":["What record labels was Akon signed with?"],"info":{}}
{"id":"train_12017","question":"Why is the higher taxon of platyrrhini often confused with the monkey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q237157 wdt:P171 ?answer . ?answer wdt:P1889 wd:Q1367 }","paraphrases":["Why is the higher taxon of platyrrhini frequently confounded with the monkey?"],"info":{}}
{"id":"train_12018","question":"\"Which career of Colley Cibber, has a field of this career in the performing arts?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q918326 wdt:P106 ?answer . ?answer wdt:P425 wd:Q184485 }","paraphrases":["\"Which career of Colley Cibber, has a field of this career in the performing arts?\""],"info":{}}
{"id":"train_12020","question":"Was David_Duchovny occupation singer-songwriter and screenwriter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q484365 wdt:P106 wd:Q488205 . wd:Q484365 wdt:P106 wd:Q28389 }","paraphrases":["Is it true that the occupation of David Duchovny's occupation was singer, songwriter and screenwriter?"],"info":{}}
{"id":"train_12022","question":"WHO EDITED QUAN TANGHSI WITH THE COURTESY NAME OF","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q846569 wdt:P98 ?answer . ?answer wdt:P1782 ?x FILTER ( contains ( ?x , '子清' ) ) }","paraphrases":["WHO Altered QUAN TANGHSI WITH THE Cordiality Title OF"],"info":{}}
{"id":"train_12025","question":"who telephone code of location born of jack kevorkian ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q46636 wdt:P19 ?X . ?X wdt:P473 ?answer }","paraphrases":["who phone\n code of area born of jack kevorkian ?"],"info":{}}
{"id":"train_12026","question":"Who is the participant of Ludmilla Tourischeva awarded Olympic silver medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q231516 p:P1344 ?s . ?s ps:P1344 ?obj . ?s pq:P166 wd:Q15889641 }","paraphrases":["Who is the participant of Ludmilla Tourischeva awarded Olympic silver medal?"],"info":{}}
{"id":"train_12027","question":"Having the opposite of goddess, what is the disambiguation from God?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190 wdt:P1889 ?answer . ?answer wdt:P461 wd:Q205985 }","paraphrases":["Having the inverse of goddess, what is the disambiguation from God?"],"info":{}}
{"id":"train_12029","question":"When did Transmashholding have an operating income of 2,193,110,000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1519572 p:P3362 ?s . ?s ps:P3362 ?x filter ( contains ( ?x , '2.19311e+09' ) ) . ?s pq:P585 ?value }","paraphrases":["When was the operating income of  Transmashholding  2,193,110,000?"],"info":{}}
{"id":"train_12030","question":"WHAT IS THE I TUNES APP ID OF MINERCRAFT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q49740 wdt:P3861 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12032","question":"What is number of out of school children of continent history of the america?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q690256 wdt:P30 ?X . ?X wdt:P2573 ?answer }","paraphrases":["Which is the number of out of school children of continent history of the America?"],"info":{}}
{"id":"train_12034","question":"Where did Paolo Gentiloni graduate as Laurea magistrale (Italy) and what was his major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q1071031 p:P512 ?s . ?s ps:P512 wd:Q4000966 . ?s pq:P812 ?value1 . ?s pq:P69 ?value2 }","paraphrases":["What was the major of Paolo Gentiloni and when did he graduate as Laurea magistrate (Italy)?"],"info":{}}
{"id":"train_12036","question":"Name the Sparkasse with highest tier 1 capital ratio?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q13601825 . ?ent wdt:P2663 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What Sparkasse has the highest capital ratio?"],"info":{}}
{"id":"train_12038","question":"Where is the head office location of International Air Transport Association that contains Lachine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19755 wdt:P159 ?answer . ?answer wdt:P150 wd:Q1474128 }","paraphrases":["Where is the head office vicinity of International Air Transport Association that includes Lachine?"],"info":{}}
{"id":"train_12041","question":"When and for what did Jean-Luc Godard receive an Honorary César?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q53001 p:P166 ?s . ?s ps:P166 wd:Q727282 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["Jean-Luc Godard was the recipient of the Hononary Cesar; what year and for what work did he recieve this award?"],"info":{}}
{"id":"train_12042","question":"What is academic degree} of {Dan Carter} that is {number of points/goals/set scored} is {1457.0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q726199 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?x filter ( contains ( ?x , '1457.0' ) ) }","paraphrases":["What is academic degree} of {Dan Carter} where {number of points/goals/set scored} is {1457.0} ?"],"info":{}}
{"id":"train_12043","question":"What is Ivan Pyryev's middle name, which is the same as Juan's?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q552450 wdt:P735 ?answer . ?answer wdt:P460 wd:Q475210 }","paraphrases":["What is Ivan Pyryev's middle name, which is the identical as Juan's?"],"info":{}}
{"id":"train_12044","question":"What is the total revenue of the {Tencent} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q860580 wdt:P2139 ?obj }","paraphrases":["Which is the number of the total revenue of Tencent?"],"info":{}}
{"id":"train_12045","question":"Name the spot of neon that has diplomatic relation in Denmark.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q654 wdt:P189 ?answer . ?answer wdt:P530 wd:Q35 }","paraphrases":["What's the name of the spot of neon which has diplomatic relation in Denmark?"],"info":{}}
{"id":"train_12047","question":"What is elected in Edmund Barton, the Member of the Australian House of Representatives?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23342 p:P39 ?s . ?s ps:P39 wd:Q18912794 . ?s pq:P2715 ?value }","paraphrases":["Who is elected in Edmund Barton, the Member of the Australian House of Representatives?"],"info":{}}
{"id":"train_12050","question":"What are the village which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q532 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the village which begin with the letter w"],"info":{}}
{"id":"train_12053","question":"What is the Playmates Playmate ID for Pamela Anderson","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q83325 wdt:P5346 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12054","question":"What is the boiling point of the ozone when the pressure is 760.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q36933 p:P2102 ?s . ?s ps:P2102 ?obj . ?s pq:P2077 ?x filter ( contains ( ?x , '760.0' ) ) }","paraphrases":["Under 760 units of pressure, what is ozone's boiling point?"],"info":{}}
{"id":"train_12055","question":"What country was Hong Kong originally part of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8646 wdt:P155 ?obj . ?obj wdt:P31 wd:Q3373417 }","paraphrases":["Hong Kong was originally part of what country?"],"info":{}}
{"id":"train_12056","question":"When did Valencia have a population of 785,732?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8818 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '785732.0' ) ) . ?s pq:P585 ?value }","paraphrases":["Valencia had once a population of 785,732. What year was it?"],"info":{}}
{"id":"train_12057","question":"Eros is the father of how many?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q121973 wdt:P22 ?obj }","paraphrases":["Eros is how many people's father?"],"info":{}}
{"id":"train_12058","question":"Which is {administrative headquarters} {succeeds} of {Visigothic Kingdom} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q126936 wdt:P1365 ?X . ?X wdt:P36 ?answer }","paraphrases":["Which is {authoritative central station} {succeeds} of {Visigothic Kingdom} ?"],"info":{}}
{"id":"train_12059","question":"What is the players maximum number of plays in World Chess Championship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190042 wdt:P641 ?X . ?X wdt:P1873 ?answer }","paraphrases":["What is the players most extreme number of plays in World Chess Championship?"],"info":{}}
{"id":"train_12060","question":"What is a crisis that starts with the letter u.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q381072 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a emergency that begins with the letter u."],"info":{}}
{"id":"train_12063","question":"Who was the mother of Pedro I's child Princess Francisca of Brazil and when was Princess Francisca born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q242159 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["Who was the mother of Pedro I's child Princess Francisca of Brazil and when was Princess Francisca born?"],"info":{}}
{"id":"train_12066","question":"Which is the Mathematics Subject Classification ID for supersymmetry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q193442 wdt:P3285 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12068","question":"What are thedemographic profile which start with the letter teenager","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5932254 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'teenager' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are thedemographic profile which begin with the letter youngster"],"info":{}}
{"id":"train_12070","question":"What is {René Coty}'s {Elysee.fr president ID}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q158768 wdt:P5440 ?answer }","paraphrases":[],"info":{}}
{"id":"train_12071","question":"Which currency starts with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8142 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which cash begins with the letter y"],"info":{}}
{"id":"train_12072","question":"What took place at the Fortress Besieged, with Myanmar diplomatic relations?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3209149 wdt:P840 ?answer . ?answer wdt:P530 wd:Q836 }","paraphrases":["What took put at the Post Assaulted, with Myanmar discretionary relations?"],"info":{}}
{"id":"train_12073","question":"WHat was the economic crisis that caused the Wall Street Crash of 1929 and that contains the word \"depression \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q290178 . ?sbj wdt:P828 wd:Q201684 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'depression' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat was the monetary emergency that caused the Wall Street Crash of 1929 and that contains \"discouragement \" in its name"],"info":{}}
{"id":"train_12074","question":"When was Comoros a member of the International Development Association?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q970 p:P463 ?s . ?s ps:P463 wd:Q827525 . ?s pq:P580 ?value }","paraphrases":["In what moment was Comoros a component of the International Development Association?"],"info":{}}
{"id":"train_12075","question":"Did Pope John Paul II know French and Russian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q989 wdt:P1412 wd:Q150 . wd:Q989 wdt:P1412 wd:Q7737 }","paraphrases":["Were French and Russian languages that were spoken by Pope John Paul II?"],"info":{}}
{"id":"train_12077","question":"What is in the district of Tripura that shares a border with Bhutan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1363 wdt:P131 ?answer . ?answer wdt:P47 wd:Q917 }","paraphrases":["What is within the locale of Tripura that offers a border with Bhutan?"],"info":{}}
{"id":"train_12078","question":"What is the location directed by Fireworks Wednesday?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1419056 wdt:P57 ?X . ?X wdt:P19 ?answer }","paraphrases":["Which site was used during the direction Fireworks Wednesday?"],"info":{}}
{"id":"train_12079","question":"which gold rush starts with the letter g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q273182 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which gold surge begins with the letter g"],"info":{}}
{"id":"train_12081","question":"Which business got substituted by 20th Century Fox","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1366 wd:Q434841 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Which commerce got substituted by 20th Century Fox"],"info":{}}
{"id":"train_12082","question":"On which album is the track OK computer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q202996 wdt:P658 ?obj . ?obj wdt:P31 wd:Q134556 }","paraphrases":["Which album is the OK computer on the track?"],"info":{}}
{"id":"train_12085","question":"How many families are registered in Taipei?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1867 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q485228 }","paraphrases":["What is the total of families registered in Taipei?"],"info":{}}
{"id":"train_12089","question":"Name a University that contain the word \"virginia \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3918 . ?sbj wdt:P2643 wd:Q23334765 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'virginia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a University that contain the word \"virginia \" in its name"],"info":{}}
{"id":"train_12090","question":"Who discovered Esperanto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q143 wdt:P61 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Name the person that came up with Esperanto."],"info":{}}
{"id":"train_12091","question":"which 24 hours of le mans entry has the highest laps completed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q55096520 . ?ent wdt:P5349 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["How many laps of le mans were completed in 24 hours?"],"info":{}}
{"id":"train_12092","question":"How many instrument are for harps","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P870 wd:Q47369 }","paraphrases":["What are the kinds of Harps someone can play?"],"info":{}}
{"id":"train_12094","question":"What is the tributary of the extreme point deepest of Papua New Guinea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q691 wdt:P1589 ?X . ?X wdt:P974 ?answer }","paraphrases":["What is the tributary of the extraordinary point most profound of Papua Unused Guinea?"],"info":{}}
{"id":"train_12098","question":"Is the media legend for The Guardian the logo image named The Guardian 2018.svg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11148 p:P154 ?s . ?s ps:P154 ?x filter ( contains ( ?x , 'The Guardian 2018.svg' ) ) . ?s pq:P2096 ?value }","paraphrases":["Is the logo imagine for the media legend for The Guardian called The Guardian 2018.svg?"],"info":{}}
{"id":"train_12099","question":"What was the population of Rwanda in 1989?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1037 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1989' ) ) }","paraphrases":["which  Rwanda  population  in  the year 1989?"],"info":{}}
{"id":"train_12100","question":"Tell me dwarf planet whose name has the word pluto in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2199 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pluto' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose to me predominate planet whose name has the word pluto in it."],"info":{}}
{"id":"train_12103","question":"Name a business subsidiary of Nissan","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q20165 wdt:P355 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":["Title a trade backup of Nissan"],"info":{}}
