{"id":"train_7049","question":"What is divided into the Chiba Prefecture, which has a gps coordinate of 140.367?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q80011 wdt:P150 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '140.367' ) ) }","paraphrases":["What is partitioned into the Chiba Prefecture, which contains a gps facilitate of 140.367?"],"info":{}}
{"id":"train_7050","question":"what is in the focal length of Very large telescope?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q265628 wdt:P2151 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7051","question":"WHICH IS THE DEITY THAT WEARS HIMATION THAT CONTAINS THE WORD CHRIST IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q178885 . ?sbj wdt:P3828 wd:Q781731 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'christ' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE DEITY THAT WEARS HIMATION THAT CONTAINS THE WORD CHRIST IN THEIR NAME"],"info":{}}
{"id":"train_7052","question":"What award did Dave Brubeck receive in 1996?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q108597 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1996' ) ) }","paraphrases":["In 1996, Dave Brubeck received which award?"],"info":{}}
{"id":"train_7055","question":"When and what award did Daniel McFadden receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q312560 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["When and what grant did Daniel McFadden receive?"],"info":{}}
{"id":"train_7058","question":"What is the measure of the scale of temperature?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11466 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q2394680 }","paraphrases":["What is temperature measured in?"],"info":{}}
{"id":"train_7061","question":"What is the ortholog of RHO?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q14859555 wdt:P684 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7062","question":"How many defendants were there in the Nuremberg trials?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q80130 wdt:P1591 ?obj }","paraphrases":["How many people were accused in the Nuremberg trials?"],"info":{}}
{"id":"train_7063","question":"How many matches did Hidetoshi Nakata play as a member of the Japan National under-17 football team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q128725 p:P54 ?s . ?s ps:P54 wd:Q3044339 . ?s pq:P1350 ?value }","paraphrases":["When Hidetoshi Nakata was a player on the Japan National under-17 football team, how many matches did he play in?"],"info":{}}
{"id":"train_7064","question":"Is the metallicity of the Messier 30, -2.27?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13653 wdt:P2227 ?obj filter ( ?obj = -2.27 ) }","paraphrases":["The Messier 30 has the metallicity of what?"],"info":{}}
{"id":"train_7066","question":"Who is the {national association football team} for {home venue} of {Wembley Stadium}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P115 wd:Q128468 . ?sbj wdt:P31 wd:Q6979593 }","paraphrases":["What is the national football team whose home venue is Wembley Stadium?"],"info":{}}
{"id":"train_7067","question":"What is Adam Weishaupt's first name?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q159481 p:P735 ?s . ?s ps:P735 wd:Q347181 . ?s pq:P1545 ?value }","paraphrases":["which is Adam Weishaupt's first name?"],"info":{}}
{"id":"train_7069","question":"What does tobramycin treat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1758380 wdt:P2175 ?X . ?X wdt:P2176 ?answer }","paraphrases":["Tobramycin treats what?"],"info":{}}
{"id":"train_7071","question":"What part of Missouri was Mark Twain born in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7245 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1581 }","paraphrases":["Name the part of Missouri in which Mark Twain was born."],"info":{}}
{"id":"train_7073","question":"who enzyme for found in taxon of homo sapiens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P703 wd:Q15978631 . ?sbj wdt:P31 wd:Q8047 }","paraphrases":["who protein for found in taxon of homo sapiens?"],"info":{}}
{"id":"train_7078","question":"Which is the academic degree for undergraduate degree?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P512 wd:Q6008527 }","paraphrases":[],"info":{}}
{"id":"train_7079","question":"Name a movie from Hayao Miyazaki","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P162 wd:Q55400 . ?sbj wdt:P31 wd:Q1107 }","paraphrases":["Title a motion picture from Hayao Miyazaki"],"info":{}}
{"id":"train_7081","question":"Who is the","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q81422 wdt:P800 ?ans_1 . wd:Q81422 wdt:P1441 ?ans_2 }","paraphrases":["Who is the?"],"info":{}}
{"id":"train_7082","question":"Who is replacing John Howard's position in the Australian House of Representatives?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q51330 p:P39 ?s . ?s ps:P39 wd:Q18912794 . ?s pq:P1365 ?value }","paraphrases":["Which person is replacing John Howard in the Australian House of Representatives ?"],"info":{}}
{"id":"train_7083","question":"How was our planet formed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q200325 wdt:P1269 ?obj . ?obj wdt:P31 wd:Q3504248 }","paraphrases":["Our planet was formed how?"],"info":{}}
{"id":"train_7085","question":"who chronology of topic of continent of Canine Hills ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5032401 wdt:P30 ?X . ?X wdt:P2184 ?answer }","paraphrases":["Who is the chronology of the Canine Hills continent?"],"info":{}}
{"id":"train_7086","question":"How many partners does Poseidon have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P451 wd:Q41127 }","paraphrases":["Poseidon has how many partners?"],"info":{}}
{"id":"train_7088","question":"What is the christian church whose leader is known as the pope that contains the word \"catholic \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q34651 . ?sbj wdt:P2388 wd:Q19546 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'catholic' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the christian church whose chief is recognised as the pope that contains the phrase \"catholic \" in its name"],"info":{}}
{"id":"train_7090","question":"Mukesh Ambani is the boss of which company ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P169 wd:Q298547 . ?sbj wdt:P31 wd:Q4830453 }","paraphrases":["Mukesh Ambani is the boss of which company ?"],"info":{}}
{"id":"train_7091","question":"What is the word for work or name in English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P407 wd:Q1860 . ?sbj wdt:P31 wd:Q8171 }","paraphrases":["WHICH IS THE WORD OF WORK OR NAME IN ENGLISH"],"info":{}}
{"id":"train_7092","question":"What edition of Abhigyanashakuntalam is in English?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q320594 p:P747 ?s . ?s ps:P747 ?obj . ?s pq:P407 wd:Q1860 }","paraphrases":["Which edition of Abhigyanashakuntalam is in English?"],"info":{}}
{"id":"train_7093","question":"Who is the spouse of Aaliyah and when did they divorce?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q11617 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who is the life partner of Aaliyah and when did they separate?"],"info":{}}
{"id":"train_7095","question":"What natural feature on the Leeward Islands is also on a tributary of the Riviere Roxelane?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q29971 wdt:P706 ?answer . ?answer wdt:P974 wd:Q5649034 }","paraphrases":["What herbal function on the Leeward Islands is also on a tributary of the Riviere Roxelane?"],"info":{}}
{"id":"train_7097","question":"Whats characters are in The Emperor's New Groove","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q223163 wdt:P674 ?X . ?X wdt:P172 ?answer }","paraphrases":["Which characters are in The Emperor's New Groove?"],"info":{}}
{"id":"train_7100","question":"What is the third given name of Kollegah?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q58785 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '3' ) ) }","paraphrases":["Kollegah given third name is?"],"info":{}}
{"id":"train_7101","question":"What is the verse that names Jesus Christ as the Son of Man?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q302 p:P2561 ?s . ?s ps:P2561 ?x filter ( contains ( ?x , 'Son of man' ) ) . ?s pq:P805 ?value }","paraphrases":["Which Bible verse refers to Jesus Christ as the Son of Man?"],"info":{}}
{"id":"train_7102","question":"How many members of the sports team are from the Saitama Seibu Lions?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P54 wd:Q325819 }","paraphrases":["How many members are on the Saitama Seibu Lions?"],"info":{}}
{"id":"train_7103","question":"Is Fogle a family name of Jared Fogle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6159960 wdt:P734 wd:Q56244996 }","paraphrases":["Image result for Is Fogle a family name of Jared Fogle?\nFogle was born in Indianapolis, Indiana, to Norman and Adrienne Fogle. He has a younger brother and sister. He was raised in a Jewish home. ... In 1995, Fogle graduated from North Central High School in Indianapolis."],"info":{}}
{"id":"train_7104","question":"Who owns the copyright for,\"The Little Prince\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q25338 wdt:P3931 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is credited as the author of \"The Little Prince\"?"],"info":{}}
{"id":"train_7105","question":"Does the explosive velocity of the octanitrocubane equals 8080.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q413940 wdt:P2231 ?obj filter ( ?obj = 8080.0 ) }","paraphrases":["What is the explosive velocity of the octanitrocubane?"],"info":{}}
{"id":"train_7108","question":"What role did James Spader play in \"The Office\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23831 p:P161 ?s . ?s ps:P161 wd:Q296928 . ?s pq:P453 ?value }","paraphrases":["Jame Spader played what character in \"The Office\"?"],"info":{}}
{"id":"train_7109","question":"What is the name of the organization represented by Pablo Picasso?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5593 wdt:P1875 ?obj . ?obj wdt:P31 wd:Q43229 }","paraphrases":["What organization did Pablo Picasso represent?"],"info":{}}
{"id":"train_7110","question":"Does the yield strength of the Alloy 718 equal 996?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q55843475 wdt:P5529 ?obj filter ( ?obj = 996.0 ) }","paraphrases":["What is the yield strength of Alloy 718?"],"info":{}}
{"id":"train_7111","question":"Which is the building for the headquarters location of Cathay Pacific?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q32141 wdt:P159 ?obj . ?obj wdt:P31 wd:Q41176 }","paraphrases":["Which is the building for the base camp area of Cathay Pacific?"],"info":{}}
{"id":"train_7112","question":"What's the country that has the lowest amount of school children who have family that work for the International Bank for Reconstruction and Development?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q6256 . ?ent wdt:P2573 ?obj . ?ent wdt:P463 wd:Q191384 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Give me the country with the least number of International Bank for Reconstruction and Development workers' families with children."],"info":{}}
{"id":"train_7113","question":"What is the subsidiary company of University of Paris whose geocoordinates is 48.956214 2.341933?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q209842 wdt:P355 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '48.956214 2.341933' ) ) }","paraphrases":["What is the subsidiary enterprise of University of Paris whose geocoordinates is 48.956214 2.341933?"],"info":{}}
{"id":"train_7114","question":"When was Santa Fe twinned with Junta de Villalba?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q44244 p:P190 ?s . ?s ps:P190 wd:Q1643574 . ?s pq:P580 ?value }","paraphrases":["When was Santa Fe twinned with Junta de Villalba?"],"info":{}}
{"id":"train_7116","question":"What is the language of Baha u llah?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q101054 wdt:P119 ?X . ?X wdt:P1705 ?answer }","paraphrases":["What is the language of Baha u llah?"],"info":{}}
{"id":"train_7117","question":"Is it true that the points awarded of the 2018 AFL Women's season equals to 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q48523108 wdt:P3260 ?obj filter ( ?obj = 2 ) }","paraphrases":["Do the 2018 AFL Women's season points equal 2?"],"info":{}}
{"id":"train_7118","question":"What was the population of Gelsenkirchen on 12-31-2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2765 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["What was Gelsenkirchen's population in 2016?"],"info":{}}
{"id":"train_7119","question":"Who did Gary Gygax divorce on January 1st in 1980?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q25550430 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["On January 1st, 1980, Gary Gygax divorced who?"],"info":{}}
{"id":"train_7120","question":"Which academic field for the history of the United States divides into the state of Michigan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131110 wdt:P2578 ?answer . ?answer wdt:P150 wd:Q1166 }","paraphrases":["Which academic field divides into the state of Michigan for U.S. history?"],"info":{}}
{"id":"train_7121","question":"Which job uses a brick?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q40089 wdt:P1535 ?obj . ?obj wdt:P31 wd:Q28640 }","paraphrases":["Which work employments a brick?"],"info":{}}
{"id":"train_7122","question":"What amount of money did Guglielmo Marconi receive for the Nobel Prize is Physics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q36488 p:P166 ?s . ?s ps:P166 wd:Q38104 . ?s pq:P1706 ?value1 . ?s pq:P2121 ?value2 }","paraphrases":["What amount of money has Guglielmo Marconi received for the Physics Nobel Prize?"],"info":{}}
{"id":"train_7124","question":"What podcast does John Oliver work on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P371 wd:Q1701254 . ?sbj wdt:P31 wd:Q24634210 }","paraphrases":["What podcast does John Oliver work on?"],"info":{}}
{"id":"train_7126","question":"What is the population of Richmond at 2011-7-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43421 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["As of July of 2011, how many people lived in Richmond?"],"info":{}}
{"id":"train_7127","question":"What is the name of the Bohr model that has been awarded the Nobel Prize in Physics?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q172948 wdt:P138 ?answer . ?answer wdt:P166 wd:Q38104 }","paraphrases":["What is the title of the Bohr demonstrate that has been granted the Nobel Prize in Physics?"],"info":{}}
{"id":"train_7128","question":"Where is the death place of Masaccio whose countries are municipio XII?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5811 wdt:P20 ?answer . ?answer wdt:P150 wd:Q16481992 }","paraphrases":["Where is the passing put of Masaccio whose nations are municipio XII?"],"info":{}}
{"id":"train_7130","question":"Josip Broz Tito is the head of government for what historical country?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q9161 . ?sbj wdt:P31 wd:Q3024240 }","paraphrases":["What historical country was led by Josip Broz Tito?"],"info":{}}
{"id":"train_7131","question":"When did \"The Bold and the Beautiful\" receive an award for International TV Audience for Best Telenovela/Soap Opera?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q82729 p:P166 ?s . ?s ps:P166 wd:Q23011213 . ?s pq:P585 ?value }","paraphrases":["The International TV Audience for Best Telenovela/Soap Opera award was won by \"The Bold and the Beautiful\" which year?"],"info":{}}
{"id":"train_7132","question":"What is the great power with maximum exports?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q185145 . ?ent wdt:P2135 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which country has the greatest exports?"],"info":{}}
{"id":"train_7133","question":"What is the name of the archaeological site where Qin Shi Huang was buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7192 wdt:P119 ?obj . ?obj wdt:P31 wd:Q839954 }","paraphrases":["What is the title of the archeological location where Qin Shi Huang was buried?"],"info":{}}
{"id":"train_7134","question":"What is the history of Montevideo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1335 wdt:P2184 ?obj . ?obj wdt:P31 wd:Q28747937 }","paraphrases":["Give me the history of Montevideo."],"info":{}}
{"id":"train_7135","question":"Where did Niccolò Machiavelli die in Sant'Andrea in Percussina?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1399 p:P20 ?s . ?s ps:P20 wd:Q2509922 . ?s pq:P17 ?value }","paraphrases":["Where in Sant'Andrea Percussina did Niccolo Machiavelli die in?"],"info":{}}
{"id":"train_7136","question":"Who {member of sports team} and the {position played on team / speciality} of {Stephen_Curry} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q352159 wdt:P54 ?ans_1 . wd:Q352159 wdt:P413 ?ans_2 }","paraphrases":["What sports team and position does Stephen Curry play?"],"info":{}}
{"id":"train_7138","question":"What are the econothem  which start with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2669627 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the econothem which begin with the letter p"],"info":{}}
{"id":"train_7139","question":"what is the {temperature} for {2,4,6-trinitrotoluene} which has {density} as {1.65} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q170167 p:P2054 ?s . ?s ps:P2054 ?x filter ( contains ( ?x , '1.65' ) ) . ?s pq:P2076 ?value }","paraphrases":["what is the {temperature} for {2,4,6-trinitrotoluene} which has {thickness} as {1.65} ?"],"info":{}}
{"id":"train_7141","question":"How many natural products of taxon are done by Cucumis sativus ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1582 wd:Q23425 }","paraphrases":["In regards to Cucumis sativus, how many natural products of taxons are done?"],"info":{}}
{"id":"train_7142","question":"What is the galaxy with the lowest redshift whose constellation is Boötes?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q318 . ?ent wdt:P1090 ?obj . ?ent wdt:P59 wd:Q8667 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the lowest redshift galaxy with Boötes constellation?"],"info":{}}
{"id":"train_7144","question":"Is the beam of the Etchells equal to 2.1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q930962 wdt:P2261 ?obj filter ( ?obj = 2.1 ) }","paraphrases":["Is 2.1 the beam of the Etchells?"],"info":{}}
{"id":"train_7146","question":"film studio","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26529 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'voyager' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Studio of films"],"info":{}}
{"id":"train_7149","question":"In what capacity does the Empire of Japan govern?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q188712 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["In what capacity is the Japanese Empire governing?"],"info":{}}
{"id":"train_7150","question":"Belgrade is the capital of what country?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q3711 . ?sbj wdt:P31 wd:Q3024240 }","paraphrases":["Belgrade is the capital of what country?"],"info":{}}
{"id":"train_7151","question":"Does the Mariana Trench have an elevation above sea level that is less than -13192.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q510 wdt:P2044 ?obj filter ( ?obj < -13192.8 ) }","paraphrases":["Is the the elevation lower than -13192.8 for the Mariana Trench?"],"info":{}}
{"id":"train_7152","question":"Where is Pat Sajak's birthplace in the province of Cook County?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q705419 wdt:P19 ?answer . ?answer wdt:P131 wd:Q108418 }","paraphrases":["Where is Pat Sajak's birthplace in the province of Cook County?"],"info":{}}
{"id":"train_7155","question":"What are  the archipelago  which start with the letter I","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33837 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'î' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the archipelago which begin with the letter I"],"info":{}}
{"id":"train_7157","question":"What award did Sidney Lumet win in 2009?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q51559 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["In 2009 what award did Sidney Lumet receive?"],"info":{}}
{"id":"train_7160","question":"who is the family and father of 14th_Dalai_Lama?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q17293 wdt:P53 ?ans_1 . wd:Q17293 wdt:P22 ?ans_2 }","paraphrases":["Who is the 14th Dalai Lama's family and father?"],"info":{}}
{"id":"train_7161","question":"Which is the regulatory authority responsible for Esperanto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q143 wdt:P1018 ?obj . ?obj wdt:P31 wd:Q1211427 }","paraphrases":["Who regulates the Esperanto language?"],"info":{}}
{"id":"train_7162","question":"Who are the characters in the second season of the series Black Sails?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21185947 wdt:P179 ?X . ?X wdt:P674 ?answer }","paraphrases":["Who are the characters within the moment season of the arrangement Dark Sails?"],"info":{}}
{"id":"train_7163","question":"What spacecraft has the longest orbital period?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q40218 . ?ent wdt:P2146 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What spacecraft stayed in orbit the longest?"],"info":{}}
{"id":"train_7164","question":"What engine family has the highest compression ratio?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15057020 . ?ent wdt:P1247 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which family of engines has the biggest compression ratio?"],"info":{}}
{"id":"train_7165","question":"Who manufactures Xbox and what is the lowest price it can be sold for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132020 wdt:P176 ?X . ?X wdt:P2295 ?answer }","paraphrases":["Who makes Xbox and what is the least cost it can be sold for?"],"info":{}}
