{"id":"train_18976","question":"What kind of oil was used in the portrait of Vista geral do Centro S. Paulo 103?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51099374 wdt:P180 ?X . ?X wdt:P618 ?answer }","paraphrases":["What kind of oil was utilized within the representation of Vista geral do Centro S. Paulo 103?"],"info":{}}
{"id":"train_18977","question":"Is it true that the total fertility rate of Egypt equals to 2.6704?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q79 wdt:P4841 ?obj filter ( ?obj = 2.6704 ) }","paraphrases":["Is Egypt's fertility rate 2.6704?"],"info":{}}
{"id":"train_18978","question":"When was Ezra Pound nominated for a Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q163366 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["In what year was Ezra Pound shortlisted for the Nobel Prize in Literature?"],"info":{}}
{"id":"train_18979","question":"What are the city in Ukraine which start with the letter vylkove","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12131624 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vylkove' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the city in Ukraine which begin with the letter vylkove"],"info":{}}
{"id":"train_18980","question":"Which is the musical form which contains the word variation in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q862597 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'variation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the melodic shape which contains the word variety in it's title?"],"info":{}}
{"id":"train_18981","question":"What television station does Oprah Winfrey work for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q55800 wdt:P108 ?obj . ?obj wdt:P31 wd:Q1616075 }","paraphrases":["What tv station does Oprah Winfrey work for?"],"info":{}}
{"id":"train_18982","question":"Where in England did Alexander McQueen die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q207939 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P131 wd:Q21 }","paraphrases":["Alexander McQueen died somewhere in England where was it?"],"info":{}}
{"id":"train_18984","question":"Where was Melinda Gates being educated on January 1st, 1982?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q463877 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1982' ) ) }","paraphrases":["January 1st, 1982, where was Melinda Gates educated?"],"info":{}}
{"id":"train_18985","question":"how many people are women?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P4675 wd:Q467 }","paraphrases":["What is the population of women?"],"info":{}}
{"id":"train_18986","question":"What team did Paulino Alcantara play for in 1915?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q277365 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1915' ) ) }","paraphrases":["What is the name of the team that Paulino Alcantara played for in 1915?"],"info":{}}
{"id":"train_18988","question":"What is the undercarriage of Cessna's 172 Skyhawk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q244479 wdt:P1637 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18989","question":"What are the names of Neil Gaiman's father and spouse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q210059 wdt:P22 ?ans_1 . wd:Q210059 wdt:P26 ?ans_2 }","paraphrases":["Who were Neil Gaiman's dad and wife?"],"info":{}}
{"id":"train_18990","question":"What is the capital of Melbourne?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q3141 . ?sbj wdt:P31 wd:Q7448101 }","paraphrases":["What is the capital of Melbourne?"],"info":{}}
{"id":"train_18992","question":"What is the { sport number } for { Lewis Hamilton } { sport team member } as { Mercedes GP }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q9673 p:P54 ?s . ?s ps:P54 wd:Q172721 . ?s pq:P1618 ?value }","paraphrases":["What is Lewis Hamilton's Mercedes GP sport number?"],"info":{}}
{"id":"train_18995","question":"When were Pink Floyd granted the Grammy Award for Album of the Year?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2306 p:P1411 ?s . ?s ps:P1411 wd:Q904528 . ?s pq:P585 ?value }","paraphrases":["When were Pink Floyd allowed the Grammy Grant for Collection of the Year?"],"info":{}}
{"id":"train_18996","question":"Which is a pawnbroker for the material used of wool?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P186 wd:Q42329 . ?sbj wdt:P31 wd:Q176637 }","paraphrases":[],"info":{}}
{"id":"train_18997","question":"Who is the spouse of Charles Laughton and when did the marriage end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q55264 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who is the companion of Charles Laughton and when did the marriage conclusion?"],"info":{}}
{"id":"train_18998","question":"Which is the {location of formation} and the {headquarters location} of {Microsoft} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q2283 wdt:P740 ?ans_1 . wd:Q2283 wdt:P159 ?ans_2 }","paraphrases":["Which is the {location of formation} and the {headquarters location} of {Microsoft} ?"],"info":{}}
{"id":"train_18999","question":"How did Herodotus die in 425 B.C.?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q26825 p:P570 ?s . ?s ps:P570 ?x filter ( contains ( ?x , '-425-1-1' ) ) . ?s pq:P31 ?value }","paraphrases":["What caused the death of Herodotus in 425 B.C.?"],"info":{}}
{"id":"train_19000","question":"What are the administrative divisions of the headquarters of Sinovac Biotech?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3485048 wdt:P159 ?X . ?X wdt:P150 ?answer }","paraphrases":["What are the administrative divisions of the headquarters of Sinovac Biotech?"],"info":{}}
{"id":"train_19001","question":"What is the name of Nicholas II of Russia who was born in Pushkin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q40787 p:P19 ?s . ?s ps:P19 wd:Q7947 . ?s pq:P1448 ?value }","paraphrases":["Nicholas II of Russia was born in Pushkin under what name?"],"info":{}}
{"id":"train_19003","question":"Is the number of  blank votes of the Volta Redonda mayoral election of 2016 less than 5163.2","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q60675965 wdt:P5045 ?obj filter ( ?obj < 5163.2 ) }","paraphrases":["Were there fewer than 5163.2 blank votes in the Volta Redonda 2016 mayoral election?"],"info":{}}
{"id":"train_19004","question":"What was the cause of death of Robert West?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1648686 wdt:P509 ?X . ?X wdt:P689 ?answer }","paraphrases":["How did Robert West die?"],"info":{}}
{"id":"train_19006","question":"Tell me the branch of philosophy that contains the word {philosophy} in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22811234 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'philosophy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the branch of philosophy containing in their name the word"],"info":{}}
{"id":"train_19007","question":"When did position held of Sebastian Coe and elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q188502 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["When did position held of Sebastian Coe and chosen in?"],"info":{}}
{"id":"train_19010","question":"What is the place made Airbus A300 whose Indian reservation is canton of Toulouse-2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6437 wdt:P1071 ?answer . ?answer wdt:P131 wd:Q1727635 }","paraphrases":["What is the region made Airbus A300 whose Indian reservation is canton of Toulouse-2?"],"info":{}}
{"id":"train_19012","question":"What is the author citatin (zoology) for Johan Christian Fabricius?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q156205 wdt:P835 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19014","question":"What is the statistical system for Hebrew","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q9288 . ?sbj wdt:P31 wd:Q55456485 }","paraphrases":["What is the measurable framework for Hebrew"],"info":{}}
{"id":"train_19015","question":"What is member  of party of Normandy landings ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16470 wdt:P710 ?X . ?X wdt:P463 ?answer }","paraphrases":["What members are part of the party of Normandy landings?"],"info":{}}
{"id":"train_19017","question":"When did Antony Tudor receive an award at Kennedy Center Honors?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q608183 p:P166 ?s . ?s ps:P166 wd:Q1738793 . ?s pq:P585 ?value }","paraphrases":["What year was Antony Tudor given an award at Kennedy Center Honors?"],"info":{}}
{"id":"train_19018","question":"who  jurisdiction of legally established by of water pollution ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q183129 wdt:P92 ?X . ?X wdt:P1001 ?answer }","paraphrases":["who ward of lawfully set up by of water contamination ?"],"info":{}}
{"id":"train_19019","question":"Which is founded by the American Civil Liberties Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q21637 wdt:P112 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19022","question":"Who directed the Seven Samurai ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q189540 wdt:P57 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who coordinated the Seven Samurai ?"],"info":{}}
{"id":"train_19023","question":"Give me the fertility rate of Spring Offensive","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q750567 wdt:P276 ?X . ?X wdt:P4841 ?answer }","paraphrases":["Spring Offensive has what fertility rate?"],"info":{}}
{"id":"train_19024","question":"What was the population of people born in the time of Peter the Great?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8479 wdt:P19 ?X . ?X wdt:P1082 ?answer }","paraphrases":["What was the populace of individuals born within the time of Dwindle the Great?"],"info":{}}
{"id":"train_19026","question":"What country is Siege of Constantinople from? Are they from Asia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q399482 wdt:P276 ?answer . ?answer wdt:P30 wd:Q48 }","paraphrases":["What nation is Attack of Constantinople from? Are they from Asia"],"info":{}}
{"id":"train_19028","question":"In what year did Edward V become monarch of England?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q170470 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P580 ?value }","paraphrases":["Give the year Edward V became monarch of England."],"info":{}}
{"id":"train_19033","question":"Who replaced Michal Korybut Wisniowiecki as the King of Poland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q54041 p:P39 ?s . ?s ps:P39 wd:Q3273712 . ?s pq:P1365 ?value }","paraphrases":["Who supplanted Michal Korybut Wisniowiecki as the Ruler of Poland?"],"info":{}}
{"id":"train_19034","question":"What is architect of Giorgetto Giugiaro ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P84 wd:Q316565 }","paraphrases":[],"info":{}}
{"id":"train_19035","question":"Who is the author that wrote the Discworld series in their secondary language of English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3257270 wdt:P50 ?answer . ?answer wdt:P1412 wd:Q1860 }","paraphrases":["Who is the creator that composed the Discworld arrangement in their auxiliary dialect of English?"],"info":{}}
{"id":"train_19037","question":"Which is {twin town} and {death place} of {Ann Radcliffe} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q231944 wdt:P20 ?X . ?X wdt:P190 ?answer }","paraphrases":["Which is Ann Radcliffe's { twin town } and { death place }?"],"info":{}}
{"id":"train_19038","question":"How many facet polytopes are in an equilateral triangle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1312 wd:Q157002 }","paraphrases":["How many facet polytopes does an equilateral triangle contain?"],"info":{}}
{"id":"train_19039","question":"What is the noble title for a duke?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P97 wd:Q166886 }","paraphrases":[],"info":{}}
{"id":"train_19044","question":"What was the inflation rate on Poland in 2001?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q36 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["In 2001 in Poland, what was the inflation rate?"],"info":{}}
{"id":"train_19045","question":"Has Robbie Williams ever been signed to record labels EMI and Interscope Records?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47875 wdt:P264 wd:Q183412 . wd:Q47875 wdt:P264 wd:Q231694 }","paraphrases":["Was Robbie Williams ever signed to record labels of th EMI and Interscope Records?"],"info":{}}
{"id":"train_19048","question":"What award did Richard Thaler receive in the year 2014?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q371212 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["Which award did Richard Thaler earn in 2014?"],"info":{}}
{"id":"train_19049","question":"Which movie is about Stephen Hawking?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P674 wd:Q17714 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Which motion picture is around Stephen Hawking?"],"info":{}}
{"id":"train_19050","question":"Tell me nutrition those contains the word elible in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2138622 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'edible' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know nourishment those contains the word elible in their title"],"info":{}}
{"id":"train_19053","question":"How many natural products contained in wheat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q15645384 wdt:P1582 ?obj }","paraphrases":["Wheat contains how many natural products?"],"info":{}}
{"id":"train_19054","question":"Tell me the basic emotion which contains the word trust in their name!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16748867 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trust' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the primary emotion which contains the phrase have faith in their name!"],"info":{}}
{"id":"train_19057","question":"What is the cause of working with Jinul?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q704894 wdt:P106 ?X . ?X wdt:P1542 ?answer }","paraphrases":["What is the cause of working with Jinul?"],"info":{}}
{"id":"train_19058","question":"With an inflow of Kultuchnaya, what are the waterfalls on the Angara River called?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q162737 wdt:P469 ?answer . ?answer wdt:P200 wd:Q4246441 }","paraphrases":["With an influx of Kultuchnaya, what are the waterfalls on the Angara River called?"],"info":{}}
{"id":"train_19059","question":"Tell me language family whose name has the word quechua in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25295 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'quechua' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know dialect family whose title has the word quechua in it."],"info":{}}
{"id":"train_19061","question":"tell me duo starts with r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10648343 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me taxation whose name has the word sam in it."],"info":{}}
{"id":"train_19062","question":"What is the Q48460 of the place of incorporation of Guns N’ Roses ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11895 wdt:P740 ?X . ?X wdt:P1036 ?answer }","paraphrases":["What is the Q48460 of the area of incorporation of Guns N’ Roses ?"],"info":{}}
{"id":"train_19063","question":"Which is Gene Atlas Image of RHO?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q14859555 wdt:P692 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19064","question":"Which is the comics publishing company in the comic book industry that starts with the letter c?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1114515 . ?sbj wdt:P452 wd:Q1760610 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the comics publishing business enterprise in the comic e book enterprise that starts with the letter c?"],"info":{}}
{"id":"train_19067","question":"What award did Edsger W. Dijkstra receive in 2002?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8556 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["Give me the name of the award received by Edsger W. Dijkstra in 2002."],"info":{}}
{"id":"train_19068","question":"WHICH IS THE STATE OF AUSTRALIA THAT STARTS WIH V","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5852411 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which Australian State starts with a V?"],"info":{}}
{"id":"train_19069","question":"When is the  book was published by Zork that was established by David Crane?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q226736 wdt:P123 ?answer . ?answer wdt:P112 wd:Q1174091 }","paraphrases":["When is the book was distributed by Zork that was set up by David Crane?"],"info":{}}
{"id":"train_19070","question":"What ancient Greek temple starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q267596 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What old Greek sanctuary begins with the letter \"t\"?"],"info":{}}
{"id":"train_19071","question":"What is the body of water with GPS coordinates of 0.0 located in Tarawa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2486 wdt:P206 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '0.0' ) ) }","paraphrases":["What is the body of water with GPS arranges of 0.0 found in Tarawa?"],"info":{}}
{"id":"train_19075","question":"Is the maximum wavelength of sensitivity of the Large Synoptic Survey Telescope equal to 1060?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q672021 wdt:P3737 ?obj filter ( ?obj = 1060 ) }","paraphrases":["Is the greatest wavelength of affectability of the Expansive Concise Study Telescope rise to to 1060?"],"info":{}}
{"id":"train_19076","question":"What carbine starts with the letter \"z\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q183302 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What carbine does the letter \"z\" start with?"],"info":{}}
{"id":"train_19078","question":"When was Grozny's population 287410?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5196 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '287410.0' ) ) . ?s pq:P585 ?value }","paraphrases":["During which period Grozny's population 287410"],"info":{}}
{"id":"train_19079","question":"Is knowledge different from information and data?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9081 wdt:P1889 wd:Q11028 . wd:Q9081 wdt:P1889 wd:Q42848 }","paraphrases":["Is information diverse from data and information?"],"info":{}}
{"id":"train_19080","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P175 wd:Q483118 . ?sbj wdt:P31 wd:Q14831768 }","paraphrases":["n/a"],"info":{}}
{"id":"train_19081","question":"What is the human with the lowest age of consent whose given name is Ram?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P2999 ?obj . ?ent wdt:P735 wd:Q19823792 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the lowest consent age human whose name is Ram?"],"info":{}}
{"id":"train_19082","question":"Who is informed by Dizzy Gillespie whose profession is conductor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49575 wdt:P737 ?answer . ?answer wdt:P106 wd:Q158852 }","paraphrases":["Who is educated by Woozy Gillespie whose calling is conductor?"],"info":{}}
{"id":"train_19085","question":"When did the military designate the C-130 Hercules as CC-130?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q182027 p:P798 ?s . ?s ps:P798 ?x filter ( contains ( ?x , 'CC-130' ) ) . ?s pq:P580 ?value }","paraphrases":["On what date did the military designate the C-130 Hercules as CC-130?"],"info":{}}
{"id":"train_19087","question":"When was Pune becom the the administrative territorial entity of Bombay Presidency?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1538 p:P131 ?s . ?s ps:P131 wd:Q891827 . ?s pq:P580 ?value }","paraphrases":["When did Pune start serving as Bombay's President?"],"info":{}}
{"id":"train_19088","question":"What is Wales the capital of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q25 wdt:P36 ?obj . ?obj wdt:P31 wd:Q5119 }","paraphrases":["What is Wales the capital of?"],"info":{}}
{"id":"train_19090","question":"Name a task that contains the word \"quantum \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q759676 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'quantum' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a task containing in its name the word \"quantum\""],"info":{}}
{"id":"train_19091","question":"Which eating disorder is treated by a psychologist when an individual's molar mass is less than 305.074?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q373822 wdt:P2176 ?answer . ?answer wdt:P2067 ?x FILTER ( contains ( ?x , '305.074' ) ) }","paraphrases":["Which eating clutter is treated by a analyst when an individual's molar mass is less than 305.074?"],"info":{}}
{"id":"train_19092","question":"In 1996, which administrative territorial entity was Glasgow located in ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4093 p:P131 ?s . ?s ps:P131 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1996' ) ) }","paraphrases":["Give me the name of the administrative territorial entity that contained Glasgow in 1996?"],"info":{}}
