{"id":"train_9033","question":"Name the substantial in period for Leipzig which has situated in time zone as UTC+02: 00.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2079 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value }","paraphrases":["Name the generous in period for Leipzig which has located in time zone as UTC+02: 00."],"info":{}}
{"id":"train_9034","question":"Who is the service operator of the item Avianca?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q308911 wdt:P121 ?X . ?X wdt:P137 ?answer }","paraphrases":["Who is the benefit administrator of the thing Avianca?"],"info":{}}
{"id":"train_9035","question":"Give me a mobile operating system, that starts with an alphabet 'w'.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q920890 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Donate me a versatile working framework, that begins with an letter set 'w'."],"info":{}}
{"id":"train_9036","question":"What is the Pinakothek ID for Lucas Cranach the Elder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q191748 wdt:P4025 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9037","question":"Which city is the twinned administrative body of Cardiff?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10690 wdt:P190 ?obj . ?obj wdt:P31 wd:Q515 }","paraphrases":["Which city is the twinned regulatory body of Cardiff?"],"info":{}}
{"id":"train_9040","question":"Which sovereign states of the Panic of 1907 are boroughs.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q844449 wdt:P17 ?X . ?X wdt:P150 ?answer }","paraphrases":["Which 1907 Panic sovereign states are boroughs."],"info":{}}
{"id":"train_9041","question":"Who are the members of the Koch family?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P53 wd:Q2896603 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What are the names of the members of the Koch family?"],"info":{}}
{"id":"train_9042","question":"How many electrical plug types are for Laos?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q819 wdt:P2853 ?obj }","paraphrases":["Laos has how many types of electrical plugs?"],"info":{}}
{"id":"train_9043","question":"When did Belgrade start and end being a country as a Principality of Serbia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3711 p:P17 ?s . ?s ps:P17 wd:Q684030 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["What date did Belgrade begin and cease being a country as a Principality of Serbia?"],"info":{}}
{"id":"train_9045","question":"Tell me natural language whose name has the word thai in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33742 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'thai' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me herbal language whose identify has the phrase thai in it."],"info":{}}
{"id":"train_9048","question":"What airline does Air India belong to","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q69906 wdt:P199 ?obj . ?obj wdt:P31 wd:Q46970 }","paraphrases":["What carrier does Discuss India have a place to"],"info":{}}
{"id":"train_9049","question":"When did Reinhold Messner stop being Sabine Stehle`s partner?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q189307 p:P451 ?s . ?s ps:P451 wd:Q28053617 . ?s pq:P582 ?value }","paraphrases":["When did Sabine Stehle and Reinhold Messner split?"],"info":{}}
{"id":"train_9050","question":"What is the birth location of Barbara Liskov, the partner town is Tehran?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16080922 wdt:P19 ?answer . ?answer wdt:P190 wd:Q3616 }","paraphrases":["What is the start area of Barbara Liskov, the partner city is Tehran?"],"info":{}}
{"id":"train_9054","question":"What was Ali ibn al-Husayn Zayn al-Ábidin's date of birth in the year 658?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q314978 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1319 ?x filter ( contains ( ?x , '658-0-0' ) ) }","paraphrases":["In the year 658, what was the date of birth for Ali al-Husayn Zayn al-Ábidin's ?"],"info":{}}
{"id":"train_9055","question":"Is 40.5 Australia's central government debt as a percent of GDP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q408 wdt:P1689 ?obj filter ( ?obj = 40.5 ) }","paraphrases":["Is 40.5 Australia's central government obligation as a percent of GDP?"],"info":{}}
{"id":"train_9056","question":"What is the start time for Liverpool, who also has Cologne as its twinned administrative body?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q24826 p:P190 ?s . ?s ps:P190 wd:Q365 . ?s pq:P580 ?value }","paraphrases":["What time does the Cologne administrative body begin?"],"info":{}}
{"id":"train_9057","question":"What toponym is the pan flute named after, from the time and legend of Dryope?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q218802 wdt:P138 ?answer . ?answer wdt:P25 wd:Q29788463 }","paraphrases":["What toponym is the pan flute named after, from the time and legend of Dryope?"],"info":{}}
{"id":"train_9058","question":"Which is the position in the time period of Reconquista?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2348 wd:Q79791 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["What is the position in the Reconquista period?"],"info":{}}
{"id":"train_9059","question":"What was the Ashgabat capital until 10-27-1924?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23438 p:P1376 ?s . ?s ps:P1376 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1924' ) ) }","paraphrases":["What was the capital of Ashgabat until October 27th, 1924?"],"info":{}}
{"id":"train_9062","question":"Which is the AlloCiné film ID for Bicycle Thieves?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q172837 wdt:P1265 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9063","question":"Who is the son of Maria Lorenza Berreneche?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6004142 wdt:P40 ?X . ?X wdt:P22 ?answer }","paraphrases":["Who is the child of Maria Lorenza Berreneche?"],"info":{}}
{"id":"train_9065","question":"Is the floors above ground of the Italian Hall equal to 2","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q424748 wdt:P1101 ?obj filter ( ?obj = 2 ) }","paraphrases":["Is the floors over ground of the Italian Lobby break even with to 2"],"info":{}}
{"id":"train_9067","question":"Give me the date of birth of Alcibiades before the Gregorian calendar date of 1584?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q187982 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["What was Alcibiades date of birth before the Gregorian calendar date of 1584?"],"info":{}}
{"id":"train_9068","question":"For what Victor Goldschmidt was in nomination in the year 1932?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q213668 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1932' ) ) }","paraphrases":["What was Victor Goldschmidt nominated for in 1932?"],"info":{}}
{"id":"train_9069","question":"What Academy of Science is Gottfried Wilhelm Leibniz the director of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1037 wd:Q9047 . ?sbj wdt:P31 wd:Q414147 }","paraphrases":["Gottfried Wilhelm Leibniz is the director of what Academy of Science?"],"info":{}}
{"id":"train_9070","question":"Which is the death place in Hattie Jacques having a sister city of Buenos Aires?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q449020 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1486 }","paraphrases":["Which is the passing put in Hattie Jacques having a sister city of Buenos Aires?on?"],"info":{}}
{"id":"train_9071","question":"Which is the professorship of theology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P803 wd:Q34178 }","paraphrases":[],"info":{}}
{"id":"train_9072","question":"What is Loop ID for Simon Baron-Cohen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q918343 wdt:P2798 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9075","question":"What is the name of the mythical human-animal hybrid that was worshiped in Greek mythology that has the word \"Minotaur\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20902363 . ?sbj wdt:P1049 wd:Q34726 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'minotaur' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the name of the mythical human-animal hybrid that used to be worshiped in Greek mythology that has the phrase \"Minotaur\" in its name?"],"info":{}}
{"id":"train_9076","question":"\"Which is {language of work} of {bey}, whose {typology} is {subject–object–verb language} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q181217 wdt:P407 ?answer . ?answer wdt:P4132 wd:Q539808 }","paraphrases":["\"Which is {language of work} of {bey}, whose {typology} is {subject–object–verb language} ?\""],"info":{}}
{"id":"train_9078","question":"What is the name of an embankment dam that starts with the letter h.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1244922 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of an dike dam that begins with the letter h."],"info":{}}
{"id":"train_9079","question":"Where was Alice Walker awarded a Bachelor of Arts degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q215868 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 wd:Q1765120 }","paraphrases":["Where did Alice Walk receive her Bachelor of Arts degree?"],"info":{}}
{"id":"train_9080","question":"What is the antonym of hypotension, which can be treated with esmolol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q275419 wdt:P461 ?answer . ?answer wdt:P2176 wd:Q418139 }","paraphrases":["What is the hypotension antonym that can be treated with esmolol?"],"info":{}}
{"id":"train_9083","question":"who member of land} of lashkar gah ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q476800 wdt:P17 ?X . ?X wdt:P463 ?answer }","paraphrases":["Who is a member of the Lashkar gah's land?"],"info":{}}
{"id":"train_9084","question":"What chemical compounds cause air pollution?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q131123 wdt:P828 ?obj . ?obj wdt:P31 wd:Q11173 }","paraphrases":["What chemical compounds cause discuss pollution?"],"info":{}}
{"id":"train_9085","question":"Tell me first-class city whose name has the word milwaukee in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15221304 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'milwaukee' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What first-class city has the word 'milwaukee' in it?"],"info":{}}
{"id":"train_9087","question":"Name an instruction set architecture that contain the word \" x87\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q272683 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'x87' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an architecture set of instructions containing the word \"x87\" in its name"],"info":{}}
{"id":"train_9088","question":"Who wrote the notable work Doctor Who?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P800 wd:Q34316 }","paraphrases":["Who is the author of the notable work Doctor Who?"],"info":{}}
{"id":"train_9090","question":"What's the stock exchange for Toshiba?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q49125 wdt:P414 ?obj }","paraphrases":["What is Toshiba's stock exchange?"],"info":{}}
{"id":"train_9091","question":"Who is the {specialized agency of the United Nations} for {subsidiary} of {World Bank}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7164 wdt:P355 ?obj . ?obj wdt:P31 wd:Q15925165 }","paraphrases":["Who is the {specialized office of the Joined together Countries} for {backup} of {World Bank}"],"info":{}}
{"id":"train_9092","question":"Which is the vegetable for this taxon is source of eggplant?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7540 wdt:P1672 ?obj . ?obj wdt:P31 wd:Q1470762 }","paraphrases":[],"info":{}}
{"id":"train_9093","question":"Which ballet was composed by Pyotr Ilyich Tchaikovsky?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P86 wd:Q7315 . ?sbj wdt:P31 wd:Q15079786 }","paraphrases":["Which expressive dance was composed by Pyotr Ilyich Tchaikovsky?"],"info":{}}
{"id":"train_9099","question":"What is the TV Show hosted by Jerry Springer that contains the word \" jerry\" in its name ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5398426 . ?sbj wdt:P371 wd:Q27214 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'jerry' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the TV Appear facilitated by Jerry Springer that contains the word \" jerry\" in its title ?"],"info":{}}
{"id":"train_9104","question":"WHICH IS THE ENERGY SOURCE OF REPLACED HAVRINGE UPPER LIGHT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40101409 wdt:P1365 ?X . ?X wdt:P618 ?answer }","paraphrases":["What energy source replaced havringe upper light."],"info":{}}
{"id":"train_9106","question":"Tell me about country of origin of pasta and publication date?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q178 p:P495 ?s . ?s ps:P495 ?obj . ?s pq:P577 ?value1 . }","paraphrases":["Tell me about the pasta country of origin and the date of publication?"],"info":{}}
{"id":"train_9107","question":"Who is the {Vidhan Sabha} for {executive body} of {Himachal Pradesh}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1177 wdt:P208 ?obj . ?obj wdt:P31 wd:Q3091020 }","paraphrases":["Who is the { Vidhan Sabha } for { Himachal Pradesh's executive body }"],"info":{}}
{"id":"train_9109","question":"Tell me cell whose name has the word synoviocyte in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7868 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'synoviocyte' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know cell whose title has the word synoviocyte in it."],"info":{}}
{"id":"train_9112","question":"What are the social skills which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11303 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the social abilities which begin with the letter w"],"info":{}}
{"id":"train_9113","question":"\"What is the topic of law containing large numbers, that has scholarly field for it's data?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207952 wdt:P1269 ?answer . ?answer wdt:P2578 wd:Q42848 }","paraphrases":["\"What is the topic of regulation containing massive numbers, that has scholarly discipline for it's data?\""],"info":{}}
{"id":"train_9115","question":"What is the name for the head of office in Barcelona?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1492 wdt:P1313 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["What is the title for the head of office in Barcelona?"],"info":{}}
{"id":"train_9116","question":"What is the organizational structure of the Russian Orthodox Church?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2389 wd:Q60995 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["What is the organizational structure of the Russian Conventional Church?"],"info":{}}
{"id":"train_9119","question":"Which is the medical specialty of the field of work of Sigmund Freud?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q9215 wdt:P101 ?obj . ?obj wdt:P31 wd:Q930752 }","paraphrases":["Which is the restorative claim to fame of the field of work of Sigmund Freud?"],"info":{}}
{"id":"train_9120","question":"Name a color model that contain the word \"hsv \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2294018 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hsv' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a color model in its name containing the word \"hsv\""],"info":{}}
{"id":"train_9121","question":":What city on the continent of North America is considered the twin town of Kraków?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q31487 wdt:P190 ?answer . ?answer wdt:P30 wd:Q49 }","paraphrases":[":What metropolis on the continent of North America is regarded the twin city of Kraków?\""],"info":{}}
{"id":"train_9123","question":"What is the fruit that belongs to the taxon Cuminum cyminum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q132624 wdt:P1672 ?obj . ?obj wdt:P31 wd:Q1364 }","paraphrases":["What fruit belongs in the taxon Cuminum cyminum?"],"info":{}}
{"id":"train_9124","question":"Johann Schelle is the professor of what literary genre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q449311 wdt:P1066 ?X . ?X wdt:P136 ?answer }","paraphrases":["Johann Schelle is the teacher of what scholarly class?"],"info":{}}
{"id":"train_9125","question":"Who is the team manager of Manan Sharma plays?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19898331 wdt:P54 ?X . ?X wdt:P286 ?answer }","paraphrases":["WHO IS THE TEAM MANAGER OF MANAN SHARMA PLAYS"],"info":{}}
{"id":"train_9127","question":"Give the end time for lower Saxony has head of government as Christian Wulff?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1197 p:P6 ?s . ?s ps:P6 wd:Q2540 . ?s pq:P582 ?value }","paraphrases":["Give the conclusion time for lower Saxony has head of government as Christian Wulff?"],"info":{}}
{"id":"train_9128","question":"Tell me fundamental state of matter whose name has the word solid in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15831576 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'solid' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the basic state of matter whose name contains the word solid."],"info":{}}
{"id":"train_9129","question":"What is distribution for My Little Pony ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1071312 wdt:P437 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9130","question":"which is the {location} for {Joseph Raymond McCarthy} where {educated at} as {primary school} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q189197 p:P69 ?s . ?s ps:P69 wd:Q9842 . ?s pq:P276 ?value }","paraphrases":["Which is the {area} for {Joseph Raymond McCarthy} where {taught at} as {essential school} ?"],"info":{}}
{"id":"train_9134","question":"Which German Citizen has the best personal score?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P2415 ?obj . ?ent wdt:P27 wd:Q183 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which German has the best personal score?"],"info":{}}
{"id":"train_9135","question":"Which is the Artsy gene for Cubism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q42934 wdt:P2411 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9136","question":"What is the national anthem of Nazi Germany?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7318 wdt:P85 ?obj . ?obj wdt:P31 wd:Q23691 }","paraphrases":["What is the national song of devotion of Nazi Germany?"],"info":{}}
{"id":"train_9137","question":"Which bay of Valentia Island has the tributary Courantyne River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1146838 wdt:P206 ?answer . ?answer wdt:P974 wd:Q508582 }","paraphrases":["Which bay of Valentia Island has the tributary Courantyne River?"],"info":{}}
{"id":"train_9139","question":"What was Jonathan Larson nominated for in 2002?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q449002 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["For which award was Jonathan Larson nominated in the year 2002?"],"info":{}}
{"id":"train_9140","question":"tell me social philosophy that starts with e","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q180592 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me social philosophy that starts with e"],"info":{}}
{"id":"train_9141","question":"Which is the vehicle normally used for Railjet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q327051 wdt:P3438 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9143","question":"What is Open Food Facts food category ID for Citrus ×paradisi ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41350 wdt:P1821 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9145","question":"What are the Jewish denomination that starts with the letter j","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3001185 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'j' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the Jewish name that begins with the letter j"],"info":{}}
{"id":"train_9146","question":"What was Verona's population in 1981?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2028 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1981' ) ) }","paraphrases":["In 1981, how many people lived in Verona?"],"info":{}}
{"id":"train_9147","question":"What is the twin city of Leeds?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q39121 . ?sbj wdt:P31 wd:Q1549591 }","paraphrases":["What is the succession war that begins with the letter w"],"info":{}}
{"id":"train_9148","question":"How many numbers of the official symbol for the Quebec} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q176 wdt:P2238 ?obj }","paraphrases":["Which is the number for the official symbol of Quebec?"],"info":{}}
{"id":"train_9151","question":"When did Keio University enroll 2492 students?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q815432 p:P2196 ?s . ?s ps:P2196 ?x filter ( contains ( ?x , '2492.0' ) ) . ?s pq:P585 ?value }","paraphrases":["In what year did Keio University's enrollment reach 2492 students?"],"info":{}}
{"id":"train_9153","question":"where is the industry and location of AVN_Award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q824540 wdt:P452 ?ans_1 . wd:Q824540 wdt:P276 ?ans_2 }","paraphrases":["Which industry and location is associated with the AVN_Award?"],"info":{}}
{"id":"train_9154","question":"What award is Luigi Pirandello received that is 1934-1-1 on point in time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1403 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1934' ) ) }","paraphrases":["What award was presented to Luigi Pirandello on January 1st, 1934?"],"info":{}}
