{"id":"train_16364","question":"Which is the statutory city of Austria for the twinned administrative body of Bern?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q70 . ?sbj wdt:P31 wd:Q262882 }","paraphrases":[],"info":{}}
{"id":"train_16365","question":"who  writing system for facet  of Japanese?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1269 wd:Q5287 . ?sbj wdt:P31 wd:Q190502 }","paraphrases":["who composing framework for aspect of Japanese?"],"info":{}}
{"id":"train_16366","question":"When did Edward II of England become King of England?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5236 p:P39 ?s . ?s ps:P39 wd:Q18810062 . ?s pq:P580 ?value }","paraphrases":["On what date was the throne of England given to Edward II."],"info":{}}
{"id":"train_16367","question":"What is the antonym of the type of film of Freud, Biologist of the Mind?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15070049 wdt:P136 ?X . ?X wdt:P461 ?answer }","paraphrases":["What is the antonym of the sort of film of Freud, Scientist of the Mind?"],"info":{}}
{"id":"train_16368","question":"How many costumes has Pierre Balmain designed?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2515 wd:Q551674 }","paraphrases":["What is the number of costumes that Pierre Balmain has designed?"],"info":{}}
{"id":"train_16369","question":"Is Ulysses S. Grant the owner of Cincinnati?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q34836 wdt:P1830 wd:Q5120208 }","paraphrases":["Is it true that Ulysses S. Grant is the owner of Cincinnati?"],"info":{}}
{"id":"train_16370","question":"Name a city that contains the word \"milwaukee \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15221304 . ?sbj wdt:P237 wd:Q7440568 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'milwaukee' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a city that contains \"milwaukee \" in its name"],"info":{}}
{"id":"train_16371","question":"What are the earnings before interest and taxes accrued by the Secure Digital card?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q466977 wdt:P178 ?X . ?X wdt:P3362 ?answer }","paraphrases":["What are the profit some time recently intrigued and charges collected by the Secure Computerized card?"],"info":{}}
{"id":"train_16374","question":"In 1984-0-0 what was Mickey Rooney nominated for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q104081 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["Mickey Rooney was nomimted for what in 1984?"],"info":{}}
{"id":"train_16375","question":"When did José Luis Rodríguez Zapatero marry Sonsoles Espinosa?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41395 p:P26 ?s . ?s ps:P26 wd:Q41261 . ?s pq:P580 ?value }","paraphrases":["Name the date on which José Luis Rodríguez Zapatero and Sonsoles Espinosa were wed."],"info":{}}
{"id":"train_16376","question":"Is the annual energy output of Itaipu Binacional equal to 103.098?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q244169 wdt:P4131 ?obj filter ( ?obj = 103.098 ) }","paraphrases":["Is the yearly output of energy of Itaipu Binacional  103.098?"],"info":{}}
{"id":"train_16377","question":"What are the results of the product Whopper?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1135327 wdt:P176 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What are the comes about of the item Whopper?"],"info":{}}
{"id":"train_16379","question":"Is Down syndrome same as Mongolian idiocy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47715 wdt:P460 wd:Q21469259 }","paraphrases":["Mongolian idiocy is the same as Down Syndrome correct?"],"info":{}}
{"id":"train_16381","question":"Is the study of humans called ethnography?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5 wdt:P2579 wd:Q132151 }","paraphrases":["Is it true that the study of humans is called ethnography?"],"info":{}}
{"id":"train_16382","question":"Tell me the matter phase and pressure where water has a phase point as triple.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q106410 . ?s pq:P515 ?value1 . ?s pq:P2077 ?value2 }","paraphrases":["Tell me the phase of the matter and the pressure in which water has a triple phase point."],"info":{}}
{"id":"train_16383","question":"Is it true Bobby_Fischer given name James and Arthur?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41314 wdt:P735 wd:Q677191 . wd:Q41314 wdt:P735 wd:Q1778168 }","paraphrases":["Was Bobby Fischer's given name James and Arthur?"],"info":{}}
{"id":"train_16384","question":"Who sculpted the Statue of Zeus at Olympia ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q46239 wdt:P170 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who etched the Statue of Zeus at Olympia ?"],"info":{}}
{"id":"train_16385","question":"What is the time zone for Cannes in daylight saving time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q39984 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q36669 }","paraphrases":["Find the time zone for daylight saving time in Cannes."],"info":{}}
{"id":"train_16386","question":"Which partner town of Chiang Mai has MASL of 150.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q52028 wdt:P190 ?answer . ?answer wdt:P2044 ?x FILTER ( contains ( ?x , '150.0' ) ) }","paraphrases":["Which accomplice town of Chiang Mai has MASL of 150.0?"],"info":{}}
{"id":"train_16387","question":"What is The Count of Monte Cristo divided  Of Monte Cristo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q191838 wdt:P840 ?X . ?X wdt:P150 ?answer }","paraphrases":["What is The Check of Monte Cristo isolated Of Monte Cristo?"],"info":{}}
{"id":"train_16389","question":"Muḥammad ibn Mūsā al-Khwārizmī is culture ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9038 wdt:P2596 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16391","question":"\"What is {located in} of {Western Front}, which is {member of} is {CERN}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q152989 wdt:P276 ?answer . ?answer wdt:P463 wd:Q42944 }","paraphrases":["\"What is { in } of the { Western Front } { member of } is { CERN }"],"info":{}}
{"id":"train_16393","question":"WHat is the Matterhorn's parent peak?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3137 wd:Q1374 }","paraphrases":[],"info":{}}
{"id":"train_16395","question":"\"Which is {watercourse ends in} of {Gulf of Maine}, whose {tributary} is {Rio Miriri} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q876470 wdt:P403 ?answer . ?answer wdt:P974 wd:Q3432544 }","paraphrases":["\"Which is {conduit closes in} of {Inlet of Maine}, whose {tributary} is {Rio Miriri} ?\""],"info":{}}
{"id":"train_16397","question":"When was George Saunders nominated for the National Book Award for Fiction?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1251926 p:P1411 ?s . ?s ps:P1411 wd:Q3873144 . ?s pq:P585 ?value }","paraphrases":["On what date did George Saunders get nominate for the National Book Award for Fiction?"],"info":{}}
{"id":"train_16399","question":"Where in Italy was Carla Bruni born??","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q143945 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q38 }","paraphrases":["Carla Bruni was born in what Italian city?"],"info":{}}
{"id":"train_16404","question":"What are the event sequence which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15900616 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the occasion arrangement which begin with the letter w"],"info":{}}
{"id":"train_16406","question":"Which is the Canadian Baseball Hall of Fame inductee ID for All-American Girls Professional Baseball League?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1052634 wdt:P4462 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16407","question":"Where is the place of death and what was the cause of death of Grover Cleveland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q35171 wdt:P20 ?ans_1 . wd:Q35171 wdt:P509 ?ans_2 }","paraphrases":["What was Grover Cleveland's place and time of death?"],"info":{}}
{"id":"train_16408","question":"Which is the edition or translation of The Pilgrim's Progress?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P629 wd:Q268211 }","paraphrases":[],"info":{}}
{"id":"train_16409","question":"When was the Sleeping Hermaphrodite?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q4945054 p:P793 ?s . ?s ps:P793 wd:Q217102 . ?s pq:P585 ?value }","paraphrases":["The Sleeping Hermaphrodite was during which period?"],"info":{}}
{"id":"train_16411","question":"Which journal published Zoopolis","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q29392560 wdt:P2860 ?X . ?X wdt:P1433 ?answer }","paraphrases":["Zoopolis was published by what journal?"],"info":{}}
{"id":"train_16413","question":"What movie was Stanley Kramer nominated for Best Picture by the Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q73136 p:P1411 ?s . ?s ps:P1411 wd:Q102427 . ?s pq:P805 ?value }","paraphrases":["Give me the title of the movie for which Stanley Kramer received a nomination for Pest Picture."],"info":{}}
{"id":"train_16418","question":"Tell me extinct human group whose name has the word wusun in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55208590 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wusun' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know terminated human bunch whose title has the word wusun in it."],"info":{}}
{"id":"train_16420","question":"Which Atlantic hurricane had maximum damage cost?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2547976 . ?ent wdt:P2630 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which hurricane in the Atlantic had the highest damage cost?"],"info":{}}
{"id":"train_16421","question":"Who are the executive and legislative bodies of Dublin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1761 wdt:P208 ?ans_1 . wd:Q1761 wdt:P194 ?ans_2 }","paraphrases":["The executive and legislative bodies of Dublin are run by who?"],"info":{}}
{"id":"train_16422","question":"who interior ministry for military branch of lavrentiy beria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q141829 wdt:P241 ?obj . ?obj wdt:P31 wd:Q6589202 }","paraphrases":["who insides service for military department of lavrentiy beria?"],"info":{}}
{"id":"train_16423","question":"What is the temperature of Aldrin that has a density of 1.6?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q409054 p:P2054 ?s . ?s ps:P2054 ?x filter ( contains ( ?x , '1.6' ) ) . ?s pq:P2076 ?value }","paraphrases":["Give me the temperature of Aldrin, which has a density of 1.6."],"info":{}}
{"id":"train_16426","question":"Which is the redshift for NGC 1275?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q497687 wdt:P1090 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16427","question":"Is the thermal conductivity of the tungsten equal to 173?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q743 wdt:P2068 ?obj filter ( ?obj = 173 ) }","paraphrases":["Is 173 tungsten's thermal conductivity?"],"info":{}}
{"id":"train_16428","question":"Are there 5,329 graves in the Ardennes American Cemetery and Memorial","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q638977 wdt:P2351 ?obj filter ( ?obj = 5329 ) }","paraphrases":["Does Ardennes American Cemetery and Memorial have 5,329 graves?"],"info":{}}
{"id":"train_16430","question":"What happened to Vladimir Mayakovsky on January 17, 1933?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q132964 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1933' ) ) }","paraphrases":["What occured to Vladimir Mayakovsky on January 17, 1933?"],"info":{}}
{"id":"train_16435","question":"When did Francisco Morales Bermúdez become President of the Council of Ministers of Peru?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q116630 p:P39 ?s . ?s ps:P39 wd:Q1758412 . ?s pq:P580 ?value }","paraphrases":["Francisco Morales Bermudez became President of the Council of Ministers of Peru on what date?"],"info":{}}
{"id":"train_16436","question":"Which is the facility operator in action of CIM-10 Bomarc?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q781894 wdt:P137 ?X . ?X wdt:P607 ?answer }","paraphrases":["Which is the office administrator in activity of CIM-10 Bomarc?"],"info":{}}
{"id":"train_16437","question":"Who is the  {human} for {after a work by} of {Fiddler on the Roof}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q487330 wdt:P1877 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who wrote Fiddler on the Roof?"],"info":{}}
{"id":"train_16438","question":"What are the platforms in Half-Life that are set in the foundation date of 1991-9-17?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q752241 wdt:P400 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '1991' ) ) }","paraphrases":["What are the Half - Life platforms set in the 1991 - 9 - 17 foundation date?"],"info":{}}
{"id":"train_16439","question":"Reading has which TO idenfication?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q161491 wdt:P3120 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16440","question":"What award did Lasse Viren receive during the 1972 Summer Olympics as a participant in the Men's 5000 metres?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q52611 p:P1344 ?s . ?s ps:P1344 wd:Q2094442 . ?s pq:P166 ?value }","paraphrases":["Which was the award that Lasse Viren received during the 1972 Summer Olympics as a participant in the Men's 5000 metres?"],"info":{}}
{"id":"train_16441","question":"which cell starts with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7868 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which cell begins with the letter s"],"info":{}}
{"id":"train_16442","question":"When and where does Florence Griffith-Joyner hold the record as 100 meters?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q31082 p:P1000 ?s . ?s ps:P1000 wd:Q164761 . ?s pq:P276 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["When and where does Florence Griffith-Joyner maintain the file as a hundred meters?"],"info":{}}
{"id":"train_16444","question":"What ID does the TV Guide show for \"The Searchers\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q276769 wdt:P3804 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16446","question":"What the capital of Nanjing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q16666 . ?sbj wdt:P31 wd:Q7188 }","paraphrases":["What the capital of Nanjing?"],"info":{}}
{"id":"train_16448","question":"\"Which actor in the Schindler's List, has an intersex that is a female?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q483941 wdt:P161 ?answer . ?answer wdt:P21 wd:Q6581072 }","paraphrases":["Who in the Schindler's List has an intersex that is a female?"],"info":{}}
{"id":"train_16450","question":"What is the monoanion for the conjugate base of phenol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q130336 wdt:P4149 ?obj . ?obj wdt:P31 wd:Q55523986 }","paraphrases":["What is the monoanion for the conjugate base of phenol?"],"info":{}}
{"id":"train_16451","question":"Is Craig Patrick's career plus-minus rating greater than -106.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q202779 wdt:P6547 ?obj filter ( ?obj > -106.4 ) }","paraphrases":["What is Craig Patrick's plus-minus rating?"],"info":{}}
{"id":"train_16452","question":"What agency maintains Metro Manila?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q13580 wdt:P126 ?obj . ?obj wdt:P31 wd:Q327333 }","paraphrases":["What office keeps up Metro Manila?"],"info":{}}
{"id":"train_16454","question":"Is the male population of the Nanga Brook equal to 0.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6963442 wdt:P1540 ?obj filter ( ?obj = 0.0 ) }","paraphrases":["Is the male populace of the Nanga Tolerate break even with to 0.0?"],"info":{}}
{"id":"train_16455","question":"how much number of matches played for Giuseppe Meazza has a member of sports team as Atalanta B.C. ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q192131 p:P54 ?s . ?s ps:P54 wd:Q1886 . ?s pq:P1350 ?value }","paraphrases":["how much number of matches played for Giuseppe Meazza contains a part of sports group as Atalanta B.C. ?"],"info":{}}
{"id":"train_16456","question":"What are the medication which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12140 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the medicine which begin with the letter v"],"info":{}}
{"id":"train_16458","question":"How many of William the Silent`s children live to adulthood?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q78454 p:P1971 ?s . ?s ps:P1971 ?obj . ?s pq:P518 wd:Q20483979 }","paraphrases":["Count the number of William who made it to the adulthood as the Silent's children life."],"info":{}}
{"id":"train_16465","question":"When was Ernest Borgnine and his spouse Ethel Merman's birth date and death?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q102551 p:P26 ?s . ?s ps:P26 wd:Q129087 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When was the date of birth and death for Ernest Borgnine and his spouse Ethel Merman?"],"info":{}}
{"id":"train_16466","question":"What is the name of the sister city of Oslo, where Ernest Sachs was born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24284687 wdt:P19 ?answer . ?answer wdt:P190 wd:Q585 }","paraphrases":["What is the title of the sister city of Oslo, where Ernest Sachs was born?"],"info":{}}
{"id":"train_16468","question":"How many followers follows the film Dirty Harry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P155 wd:Q110206 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["What are the number of followers for the film Dirty Harry?"],"info":{}}
{"id":"train_16469","question":"Who is married to the titleholder of the Philip K. Dick Award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1341487 wdt:P1346 ?X . ?X wdt:P26 ?answer }","paraphrases":["Who is hitched to the titleholder of the Philip K. Dick Award?"],"info":{}}
{"id":"train_16470","question":"Thiruvananthapuram is the capital of which state in India?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q167715 . ?sbj wdt:P31 wd:Q13390680 }","paraphrases":[],"info":{}}
{"id":"train_16471","question":"Where is the zip code 91040-91043, where the show Dexter is set?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23577 wdt:P840 ?answer . ?answer wdt:P281 ?x FILTER ( contains ( ?x , '91040–91043' ) ) }","paraphrases":["Where is the zip code 91040-91043, where the show Dexter is set?"],"info":{}}
{"id":"train_16473","question":"68 to 77 degrees","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P2069 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["68 to 77 degrees"],"info":{}}
{"id":"train_16474","question":"Which company is Facebook owned by?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1056 wd:Q355 . ?sbj wdt:P31 wd:Q783794 }","paraphrases":[],"info":{}}
{"id":"train_16476","question":"When did Chris Hadfield receive an award and what for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q1076962 p:P166 ?s . ?s ps:P166 wd:Q11415564 . ?s pq:P585 ?value1 . ?s pq:P101 ?value2 }","paraphrases":["Chris Hadfield recieved an award for what and when did he receive it?"],"info":{}}
{"id":"train_16477","question":"In which year Henry Ford was awarded Order of the German Eagle?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8768 p:P166 ?s . ?s ps:P166 wd:Q94117 . ?s pq:P585 ?value }","paraphrases":["Henry Ford was awarded Order of the German Eagle in what year?"],"info":{}}
{"id":"train_16479","question":"where is  island located on system of mountains ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6921123 wdt:P4552 ?X . ?X wdt:P5130 ?answer }","paraphrases":["Tell me where the island is located on the system of mountains."],"info":{}}
{"id":"train_16480","question":"Who was the Hattusa excavation director until 2005?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q181007 p:P4345 ?s . ?s ps:P4345 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2005' ) ) }","paraphrases":["Who served until 2005 as the Hattusa excavation director?"],"info":{}}
{"id":"train_16481","question":"What is the conflict in the branch of Enrique Camarena?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2786877 wdt:P241 ?X . ?X wdt:P607 ?answer }","paraphrases":["which is the conflict in the branch of enrique camarena?"],"info":{}}
{"id":"train_16482","question":"What is the name of a shipwrecking that starts with the letter å.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q906512 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'å' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a shipwrecking that begins with the letter å."],"info":{}}
{"id":"train_16483","question":"What are the chemical reaction which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q36534 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an open content from the LAMP platform that contains the word \" wikipedia\" in its name"],"info":{}}
{"id":"train_16484","question":"What is the {child} and the {spouse} of {Ralph_Lauren} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q296647 wdt:P40 ?ans_1 . wd:Q296647 wdt:P26 ?ans_2 }","paraphrases":["Who is Ralph Lauren married to and what did they name their kid?"],"info":{}}
{"id":"train_16485","question":"What is the family name for writing the Hebrew alphabet","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P282 wd:Q33513 . ?sbj wdt:P31 wd:Q101352 }","paraphrases":["In the Hebrew alphabet what is the written family name?"],"info":{}}
{"id":"train_16486","question":"When did Emma Jung become married to Carl Gustav Jung, and when did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q41532 p:P26 ?s . ?s ps:P26 wd:Q124210 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["Emma Jung and Carl Gustav Jung were married during what window of time?"],"info":{}}
