{"id":"train_7908","question":"What empire starts with the letter m?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q48349 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What realm begins with the letter m?"],"info":{}}
{"id":"train_7909","question":"What republic was the Indian Independence movement a significant event for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P793 wd:Q12444025 . ?sbj wdt:P31 wd:Q7270 }","paraphrases":["Which republic was a significant event for the Indian Independence movement?"],"info":{}}
{"id":"train_7910","question":"Which is the longest span of Humber Bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1141014 wdt:P2787 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7915","question":"How many persons are state head in  {Georgia} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q230 wdt:P35 ?obj }","paraphrases":["In the country of Georgia, what number of persons are state's heads."],"info":{}}
{"id":"train_7916","question":"Which is located in protected area for Loch Lomond?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q208926 wdt:P3018 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7918","question":"Name the country with the most total exports, where Viktor Zubkov was Prime Minister?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3624078 . ?ent wdt:P2135 ?obj . ?ent wdt:P6 wd:Q147425 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Viktor Zubkov was Prime Minister of what country that had the most total exports?"],"info":{}}
{"id":"train_7919","question":"Are valganciclovir and docosanol medicines used to treat Herpes simplex?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6473911 wdt:P2176 wd:Q423384 . wd:Q6473911 wdt:P2176 wd:Q3033497 }","paraphrases":["Can valganciclovir and docosanol medicines be used to treat Herpes simplex?"],"info":{}}
{"id":"train_7921","question":"What country was Mercedes McCambridge of Joliet born in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q140017 p:P19 ?s . ?s ps:P19 wd:Q40345 . ?s pq:P17 ?value }","paraphrases":["Where was Mercedes McCambridge of Joliet born?"],"info":{}}
{"id":"train_7924","question":"Name a country where people speak english and that starts with letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6256 . ?sbj wdt:P37 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a united states of america where humans speak english and that starts with letter z"],"info":{}}
{"id":"train_7925","question":"What award did Holly Hunter receive in 1993?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q105660 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1993' ) ) }","paraphrases":["In 1993, which award was granted to Holly Hunter?"],"info":{}}
{"id":"train_7928","question":"Which {kind of music} do {sculptor} {Tikitotmoniki Totems} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18749240 wdt:P170 ?X . ?X wdt:P136 ?answer }","paraphrases":["What genre does the sculptor of Tikitotmoniki Totems represent?"],"info":{}}
{"id":"train_7929","question":"What was the capital of the Muisca Confederation starting in 1450 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5782830 p:P36 ?s . ?s ps:P36 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1450' ) ) }","paraphrases":["Tell me the name of the Muisca Confederation capital."],"info":{}}
{"id":"train_7931","question":"What fleet is USAir Flight 5050 a part of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7865889 wdt:P137 ?X . ?X wdt:P121 ?answer }","paraphrases":["What armada is USAir Flight 5050 a piece of?"],"info":{}}
{"id":"train_7932","question":"What plays were composed by The Crush Collision March?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28158040 wdt:P86 ?X . ?X wdt:P1303 ?answer }","paraphrases":["What plays did The Crush Collision March compose?"],"info":{}}
{"id":"train_7934","question":"What are the airliner which start with the letter eiríksson","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q210932 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'eiríksson' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the carrier which begin with the letter eiríksson"],"info":{}}
{"id":"train_7935","question":"What is The Numbers movie ID of Easy Rider ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q503638 wdt:P3808 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7937","question":"Give the highest attendance of the sports season?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q27020041 . ?ent wdt:P1110 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Allow the most noteworthy participation of the sports season?"],"info":{}}
{"id":"train_7938","question":"In what neighborhood did Nikos Kazantzakis die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q214622 wdt:P20 ?X . ?X wdt:P150 ?answer }","paraphrases":["In what neighborhood did Nikos Kazantzakis die?"],"info":{}}
{"id":"train_7941","question":"What are the type of spor which start with the letter waterskiing","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q31629 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'waterskiing' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the type of spor which begin with the letter waterskiing"],"info":{}}
{"id":"train_7945","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5950 wdt:P1889 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["n/a"],"info":{}}
{"id":"train_7947","question":"who is the court of bowers v.hardwick?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2907274 wdt:P4884 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7948","question":"Which sister city of Vladivostok has a Wikivoyage banner \"Manila Banner.jpg\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q959 wdt:P190 ?answer . ?answer wdt:P948 ?x FILTER ( contains ( ?x , 'Manila Banner.jpg' ) ) }","paraphrases":["Which sister metropolis of Vladivostok has a Wikivoyage banner \"Manila Banner.jpg\"?"],"info":{}}
{"id":"train_7949","question":"tel me war deity worshipped by religion of ancient Egypt  starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41863069 . ?sbj wdt:P1049 wd:Q447131 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tel me struggle deity worshipped with the aid of religion of historic Egypt starts with w"],"info":{}}
{"id":"train_7950","question":"Which television series is Burt Reynolds in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P161 wd:Q202148 . ?sbj wdt:P31 wd:Q5398426 }","paraphrases":["Which TV series does Burt Reynolds have in?"],"info":{}}
{"id":"train_7952","question":"What is the Member of the Hellenic Parliament ID of Mikis Thedorakis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q151976 wdt:P2278 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7953","question":"Who is publisher of  Thickness-dependent leakage current of (polyvinylidene fluoride/lead titanate) pyroelectric detectors based track-list.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51829315 wdt:P1433 ?X . ?X wdt:P123 ?answer }","paraphrases":["Who is distributer of Thickness-dependent spillage current of (polyvinylidene fluoride/lead titanate) pyroelectric locators based track-list."],"info":{}}
{"id":"train_7954","question":"What is the location in or next to body of water and time zone of Nice?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q33959 wdt:P206 ?ans_1 . wd:Q33959 wdt:P421 ?ans_2 }","paraphrases":["Where is in or next to body of water and time zone of Nice?"],"info":{}}
{"id":"train_7955","question":"Which is the Indian census area code of Himachal Pradesh?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1177 wdt:P3213 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7957","question":"When was Frederick William I of Prussia's child Louisa Ulrika of Prussia's date of birth and death?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q105013 p:P40 ?s . ?s ps:P40 wd:Q234251 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When was Frederick William I of Prussia's infant Louisa Ulrika of Prussia's date of delivery and death?"],"info":{}}
{"id":"train_7958","question":"Was Isis married to Osiris and Min?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q79876 wdt:P26 wd:Q46491 . wd:Q79876 wdt:P26 wd:Q192322 }","paraphrases":["Were Osiris and Min married to Isis?"],"info":{}}
{"id":"train_7961","question":"What is Île en île writer ID for J. M. G. Le Clézio?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q42037 wdt:P5409 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7962","question":"What is the sexually homologous and venous drainage of Clitoris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q873072 wdt:P4545 ?ans_1 . wd:Q873072 wdt:P2289 ?ans_2 }","paraphrases":["What is the sexually homologous and venous drainage of Clitoris?"],"info":{}}
{"id":"train_7963","question":"What is the { academic degree } of { Bernhard Riemann } that is conferred by { Göttingen University }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q42299 p:P512 ?s . ?s ps:P512 ?obj . ?s pq:P1027 wd:Q152838 }","paraphrases":["What degree did Bernhard Riemann earn at Gottingen University?"],"info":{}}
{"id":"train_7964","question":"the author id of yann martel","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q13914 wdt:P5532 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7965","question":"What role did Aberdeen play when it was a part of the regional government Grampian?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q36405 p:P131 ?s . ?s ps:P131 wd:Q1542364 . ?s pq:P3831 ?value }","paraphrases":["As part of the regional government of Grampian, how did Aberdeen contribute?"],"info":{}}
{"id":"train_7967","question":"What religion does the country of the Golden Horde follow","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P17 wd:Q79965 . ?sbj wdt:P31 wd:Q11197007 }","paraphrases":["In the country of the Golden Horde, what religion is followed?"],"info":{}}
{"id":"train_7969","question":"What award did Umberto Eco receive in 2001?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12807 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["Which award was presented to Umberto Eco in 2001?"],"info":{}}
{"id":"train_7971","question":"How many countries are around Chile?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P17 wd:Q298 }","paraphrases":["Name the countries that have boundaries with Chile."],"info":{}}
{"id":"train_7972","question":"Show me provincial or territorial capital city in Canada that starts with y.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21507383 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Show me Canada's provincial or territorial capital that begins with y."],"info":{}}
{"id":"train_7974","question":"What is the border of Georgia that has the UTC-06:00 timezone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1428 wdt:P47 ?answer . ?answer wdt:P421 wd:Q5385 }","paraphrases":["What is the border of Georgia that has the UTC-06:00 timezone?"],"info":{}}
{"id":"train_7975","question":"Which religious affiliation of Qara Khitai is under the domain of Buddhist studies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q862304 wdt:P140 ?answer . ?answer wdt:P2579 wd:Q1000976 }","paraphrases":["Which non secular affiliation of Qara Khitai is below the area of Buddhist studies?"],"info":{}}
{"id":"train_7976","question":"How much is an electronvolt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q83327 wdt:P111 ?obj . ?obj wdt:P31 wd:Q181175 }","paraphrases":["How much is an electronvolt?"],"info":{}}
{"id":"train_7977","question":"What is an historical period that starts with the letter v.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11514315 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is an authentic period that begins with the letter v."],"info":{}}
{"id":"train_7978","question":"What is DRTL?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q133279 wdt:P654 ?X . ?X wdt:P461 ?answer }","paraphrases":["What does the acronym DRTL stand for?"],"info":{}}
{"id":"train_7979","question":"What is the category for employees of the organization and the member of of Yale_University ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q49112 wdt:P4195 ?ans_1 . wd:Q49112 wdt:P463 ?ans_2 }","paraphrases":["What is the organization's employee category and Yale University's member?"],"info":{}}
{"id":"train_7981","question":"Name a alternative version of Gospel of Matthew","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q392302 wdt:P747 ?obj . ?obj wdt:P31 wd:Q3331189 }","paraphrases":["Title a elective form of Gospel of Matthew"],"info":{}}
{"id":"train_7982","question":"What is the opposite of Atheism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7066 wdt:P461 ?obj . ?obj wdt:P31 wd:Q49447 }","paraphrases":["What is the inverse of Skepticism?"],"info":{}}
{"id":"train_7984","question":"What specie physically interacts with acetylcholine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q180623 wdt:P129 ?X . ?X wdt:P703 ?answer }","paraphrases":["What specie physically interatomic with acetylcholine?"],"info":{}}
{"id":"train_7985","question":"How many Roman families claimed lineage from the Julio-Claudian dynasty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P53 wd:Q192841 }","paraphrases":["Which is the number of Roman families that claimed lineage from the Julio-Claudian dynasty?"],"info":{}}
{"id":"train_7986","question":"On January 1st, 2010, what award did Tim Bernes-Lee receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q80 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2010' ) ) }","paraphrases":["Which award did Tim Bernes-Lee win on January 1st, 2010?"],"info":{}}
{"id":"train_7987","question":"Which naval artillery has the most effective firing range?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q511450 . ?ent wdt:P4176 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What naval gun has the best firing range?"],"info":{}}
{"id":"train_7988","question":"When did Gianni Rodari receive a Hans Christian Andersen Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q193018 p:P166 ?s . ?s ps:P166 wd:Q327154 . ?s pq:P585 ?value }","paraphrases":["Gianni Rodari received a Hans Christian Andersen Award on what date?"],"info":{}}
{"id":"train_7989","question":"Where were the birthplaces of Nawab Bai's children?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6982746 wdt:P40 ?X . ?X wdt:P19 ?answer }","paraphrases":["Where did Nawab Bai's grow up?"],"info":{}}
{"id":"train_7990","question":"What is field of exercise of publishing house has  Rock 'N' Roll Comics ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20874879 wdt:P123 ?X . ?X wdt:P452 ?answer }","paraphrases":["What is the field exercise of the publishing house of Rock 'N' Roll Comics?"],"info":{}}
{"id":"train_7991","question":"What position did Benedetto Croce hold starting in 1946?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q192348 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1946' ) ) }","paraphrases":["Bendetto Croce held what position starting in 1946?"],"info":{}}
{"id":"train_7992","question":"Which is the agglutinative language for the official language of Achaemenid Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q389688 wdt:P37 ?obj . ?obj wdt:P31 wd:Q171263 }","paraphrases":["What is the agglutinative language for the Achaemenid Empire's official language?"],"info":{}}
{"id":"train_7996","question":"What is the Mona Lisa's sovereign state?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12418 wdt:P127 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What is the Mona Lisa's imperial state?"],"info":{}}
{"id":"train_7997","question":"Who is the son of the sibling of Freydís Eiríksdóttir","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q451114 wdt:P3373 ?X . ?X wdt:P22 ?answer }","paraphrases":["Who is the child of the kin of Freydís Eiríksdóttir"],"info":{}}
{"id":"train_7998","question":"Name the think tank that spent the most money in the field of social policy.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q155271 . ?ent wdt:P2402 ?obj . ?ent wdt:P101 wd:Q828395 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which think tank spent the most money is social policy?"],"info":{}}
{"id":"train_7999","question":"What is the estimate of the magnitude of the planet on the far side of the Moon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q816838 wdt:P376 ?X . ?X wdt:P1215 ?answer }","paraphrases":["What is the estimate of the magnitude of the planet on the far aspect of the Moon?"],"info":{}}
{"id":"train_8000","question":"What is the TV host of the copy of Berpacu Dalam Melodi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12475983 wdt:P144 ?X . ?X wdt:P371 ?answer }","paraphrases":["What is the TV have of the duplicate of Berpacu Dalam Melodi?"],"info":{}}
{"id":"train_8001","question":"In which barley wine contains the maximum of alcohol by volume?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q808329 . ?ent wdt:P2665 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which barley wine has the maximum alcohol content?"],"info":{}}
{"id":"train_8002","question":"Who is the event producer of the baseball World Series?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q265538 wdt:P664 ?X . ?X wdt:P641 ?answer }","paraphrases":["Give the name of the event producer of the baseball World Series"],"info":{}}
{"id":"train_8005","question":"When was Kate Sheppard finished being a member of the National Council of Women of New Zealand?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q455072 p:P463 ?s . ?s ps:P463 wd:Q6971948 . ?s pq:P582 ?value }","paraphrases":["What year did Kate Sheppard's membership of the National Council of Women of New Zealand end?"],"info":{}}
{"id":"train_8006","question":"What is the name of the sequel to Are You Experienced?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q640397 wdt:P156 ?X . ?X wdt:P264 ?answer }","paraphrases":["What is the title of the continuation to Are You Experienced?"],"info":{}}
{"id":"train_8007","question":"Was the screenwriter of SpongeBob Squarepants named Kazimieras G. Prapuolenis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q83279 wdt:P58 wd:Q1291296 }","paraphrases":["Was Kazimieras G. Prapuolenis the screenwriter of SpongeBob Squarepants?"],"info":{}}
{"id":"train_8009","question":"Where is the Cleveland Stock Exchange located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q37320 . ?sbj wdt:P31 wd:Q11691 }","paraphrases":["Where is the Cleveland Stock Trade located?"],"info":{}}
{"id":"train_8010","question":"What are the survival skill which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891382 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["List a survival skill that starts with the letter s."],"info":{}}
{"id":"train_8011","question":"What sports team does Clarence Seedorf play for and how many matches did he play?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q484909 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["What sports team does Clarence Seedorf play for and how many suits did he play?"],"info":{}}
{"id":"train_8012","question":"Is Alexander Hamilton a lawyer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q178903 wdt:P106 wd:Q40348 }","paraphrases":["Did Alexander Hamilton practice law?"],"info":{}}
{"id":"train_8013","question":"How many individuals do law schools educate?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P69 wd:Q1321960 }","paraphrases":["Give me the number of individuals law schools educate."],"info":{}}
{"id":"train_8016","question":"What is signs of effect of acetic acid ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q47512 wdt:P1542 ?X . ?X wdt:P780 ?answer }","paraphrases":["What are the signs of effects from acetic acid?"],"info":{}}
{"id":"train_8019","question":"What town in Spain borders Bilbao?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q8692 . ?sbj wdt:P31 wd:Q2074737 }","paraphrases":["What town in Spain borders Bilbao?"],"info":{}}
{"id":"train_8020","question":"Who was Rosa Luxemburg's spouse until 1903?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7231 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1903' ) ) }","paraphrases":["Who was married to Rosa Luxembourg until 1903?"],"info":{}}
{"id":"train_8022","question":"Which edition of Othello is this?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q26833 wdt:P747 ?obj . ?obj wdt:P31 wd:Q3331189 }","paraphrases":["Which Othello edition is this?"],"info":{}}
{"id":"train_8025","question":"Tell me literary character whose name has the word wu in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3658341 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wu' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know scholarly character whose title has the word wu in it."],"info":{}}
{"id":"train_8027","question":"Why did Ramsay Macdonald get elected to the MEmber of the 32d parliament of the UK and why did he stop?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q166646 p:P39 ?s . ?s ps:P39 wd:Q41582584 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["Why did Ramsay Macdonald get chosen to the Part of the 32d parliament of the UK and why did he stop?"],"info":{}}
{"id":"train_8029","question":"What is a Christian holiday that starts with the letter s.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60075825 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a Christian holiday that begnis with the letter s."],"info":{}}
{"id":"train_8031","question":"Who are the alumni of the developer of Gregorian telescope?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q742318 wdt:P61 ?X . ?X wdt:P69 ?answer }","paraphrases":["Who are the graduated class of the designer of Gregorian telescope?"],"info":{}}
