{"id":"train_23259","question":"Tell me armed forces whose name has the word wehrmacht in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q772547 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wehrmacht' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me armed forces whose name has the word wehrmacht in it."],"info":{}}
{"id":"train_23265","question":"What what is play  location of first performance Palace of Whitehall and also which starts with letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25379 . ?sbj wdt:P4647 wd:Q391620 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is play location of first performance Palace of Whitehall and also which starts offevolved with letter t"],"info":{}}
{"id":"train_23267","question":"What what is  public holiday day in year for periodic occurrence by 18 Tishrei which starts with letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1197685 . ?sbj wdt:P837 wd:Q2912433 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is public excursion day in yr for periodic incidence by way of 18 Tishrei which begins with letter s"],"info":{}}
{"id":"train_23270","question":"What is the architecture firm of based in Athletics at the 2008 Summer Olympics – Men's long jump ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q917323 wdt:P276 ?X . ?X wdt:P84 ?answer }","paraphrases":["What is the architecture firm of based in Athletics at the 2008 Summer Olympics – Men's lengthy bounce ?"],"info":{}}
{"id":"train_23279","question":"How much people are there in the county of Al Bayda","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35784 wdt:P131 ?X . ?X wdt:P1082 ?answer }","paraphrases":["How many people are there in Al Bayda County?"],"info":{}}
{"id":"train_23280","question":"tell me legal case whose name has the word wei in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2334719 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wei' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which legal case as the word wei in it?"],"info":{}}
{"id":"train_23285","question":"WHICH IS THE VERSION EDITION OR TRANSLATION THAT CONTAINS THE WORD KPY30 IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3331189 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'крузо' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE VERSION EDITION OR TRANSLATION THAT CONTAINS THE WORD KPY30 IN THEIR NAME"],"info":{}}
{"id":"train_23286","question":"What is namination did Luis Buñuel receive his work in That Obscure Object of Desire?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q51545 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q1138798 }","paraphrases":["which nomination did Luis Buñuel receive for his work in That Obscure Object of Desire?"],"info":{}}
{"id":"train_23287","question":"Did Tim Curry and Henry Woolf star in \"The Rocky Horror Picture Show\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q751921 wdt:P161 wd:Q52392 . wd:Q751921 wdt:P161 wd:Q5730498 }","paraphrases":["Were Henry Woolf and Time Curry both in \"The Rocky Horror Picture Show\"?"],"info":{}}
{"id":"train_23305","question":"WHICH IS THE MINOR BASILICA THAT ARCHITECTURAL STYLE RENAISSANCE ARCHITECTURE AND WHICH CONTAINS THE WORD SANTI IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q120560 . ?sbj wdt:P149 wd:Q236122 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'santi' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE MINOR BASILICA THAT ARCHITECTURAL STYLE RENAISSANCE ARCHITECTURE AND WHICH CONTAINS THE WORD SANTI IN THEIR NAME"],"info":{}}
{"id":"train_23309","question":"Tell me association football league whose name has the word  serie   in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15991303 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'serie' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know affiliation football alliance whose title has the word serie in it."],"info":{}}
{"id":"train_23318","question":"Tell me recurring event whose name has the word worldcon in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15275719 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'worldcon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me recurring event, the name of which contains the word worldcon."],"info":{}}
{"id":"train_23320","question":"liscence number of sawao kato","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q312684 wdt:P2696 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23321","question":"Tell me district of Austria whose name has the word wels in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q871419 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wels' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know locale of Austria whose title has the word wels in it."],"info":{}}
{"id":"train_23331","question":"What agricultural revolution starts with the letter \"r\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6499967 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What rural insurgency begins with the letter \"r\"?"],"info":{}}
{"id":"train_23341","question":"What are the proxy war which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q864113 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the intermediary war which begin with the letter w"],"info":{}}
{"id":"train_23346","question":"Tell me where Robert Fisk went to school and what his major was.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q310900 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["Let me know where Robert Fisk went to school and what his major was."],"info":{}}
{"id":"train_23347","question":"na","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q153463 wdt:P54 ?X . ?X wdt:P1352 ?answer }","paraphrases":["na"],"info":{}}
{"id":"train_23353","question":"What film does Meryl Streep start in","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q873 wdt:P1283 ?obj . ?obj wdt:P31 wd:Q1371849 }","paraphrases":["What film does Meryl Streep begin in"],"info":{}}
{"id":"train_23354","question":"What is Guy of Lisignan, the King of Jerusalem's, noble title","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q294192 p:P97 ?s . ?s ps:P97 wd:Q693614 . ?s pq:P1706 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["What is Fellow of Lisignan, the Ruler of Jerusalem's, respectable title"],"info":{}}
{"id":"train_23356","question":"Which aircraft component contains the word tailhoook in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28816538 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tailhook' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which aircraft component consists of the word tailhoook in their title"],"info":{}}
{"id":"train_23358","question":"What part of Gruppe14, Gruppe Erweiterung C, Nummer PRÄS burial plot is Kurt Waldheim located?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1260 p:P119 ?s . ?s ps:P119 ?obj . ?s pq:P965 ?x filter ( contains ( ?x , 'Gruppe14, Gruppe Erweiterung C, Nummer PRÄS' ) ) }","paraphrases":["Kurt Waldheim is located in what part of Gruppe14, Gruppe Erweiterung C, Nummer PRAS burial plot?"],"info":{}}
{"id":"train_23360","question":"What is Nominis saint ID for Teresa of Ávila ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q174880 wdt:P4286 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23363","question":"What are the die marriage which start with the letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60644899 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the die marriage that starts with a C."],"info":{}}
{"id":"train_23369","question":"Name a relative of Tim Minchin","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1038 wd:Q23527 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Title a relative of Tim Minchin"],"info":{}}
{"id":"train_23375","question":"Tell me the observable universe that starts with the letter o.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28530079 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me the observable universe that starts with the letter o."],"info":{}}
{"id":"train_23376","question":"Name the compiler of the Annals of Mathematics, which has an Erdos number of 2.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q564426 wdt:P98 ?answer . ?answer wdt:P2021 ?x FILTER ( contains ( ?x , '2.0' ) ) }","paraphrases":["Name the compiler of the Annals of Mathematics, which has an Erdos range of 2."],"info":{}}
{"id":"train_23382","question":"When did Jean-Jacques Rousseau marry Thérèse Levasseur?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6527 p:P26 ?s . ?s ps:P26 wd:Q440771 . ?s pq:P580 ?value }","paraphrases":["Jean-Jacques Rousseau married Therese Levasseur on what date?"],"info":{}}
{"id":"train_23383","question":"What does the statue of Dante Alighieri depict","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P180 wd:Q1067 . ?sbj wdt:P31 wd:Q179700 }","paraphrases":["What does the statue of Dante Alighieri depict"],"info":{}}
{"id":"train_23387","question":"What is the bibliography of English speaker Maurice Sendak.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q314771 wdt:P800 ?answer . ?answer wdt:P407 wd:Q1860 }","paraphrases":["What is the reference index of English speaker Maurice Sendak."],"info":{}}
{"id":"train_23390","question":"What is the symbol of the physical quantity \"kilometre\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q828224 wdt:P111 ?X . ?X wdt:P416 ?answer }","paraphrases":["What is the image of the physical amount \"kilometer\"?"],"info":{}}
{"id":"train_23399","question":"what is former builiding in ancient greece culture and also which starts with letter a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19860854 . ?sbj wdt:P2596 wd:Q11772 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is previous builiding in antiquated greece culture conjointly which begins with letter a"],"info":{}}
{"id":"train_23402","question":"What are the  contract which start with the letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q93288 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the contract which start with the letter r"],"info":{}}
{"id":"train_23412","question":"When and where did Jeff Bezos have an accident","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q312556 p:P793 ?s . ?s ps:P793 wd:Q171558 . ?s pq:P585 ?value1 . ?s pq:P276 ?value2 }","paraphrases":["When and where an accident happened to Jeff Bezos"],"info":{}}
{"id":"train_23413","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P179 wd:Q129240 . ?sbj wdt:P31 wd:Q571 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_23418","question":"Who was divorced from Hank Azaria on 1st January, 2000","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q202056 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["Hank Azaria divorced from whom on 1st January 2000"],"info":{}}
{"id":"train_23420","question":"WHICH IS THE EXCIPIENT THAT STARTS WITH X","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902638 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH EXCIPIENT STARTS WITH X?"],"info":{}}
{"id":"train_23424","question":"Who is the actor Lana Turner","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P175 wd:Q201034 . ?sbj wdt:P31 wd:Q1371849 }","paraphrases":["Who is the performing artist Lana Turner"],"info":{}}
{"id":"train_23431","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P706 wd:Q538 . ?sbj wdt:P31 wd:Q82794 }","paraphrases":["Not applicable"],"info":{}}
{"id":"train_23437","question":"Who is the {television series} for {director} of {Jim Henson}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P57 wd:Q191037 . ?sbj wdt:P31 wd:Q5398426 }","paraphrases":["Who is the {tv arrangement} for {executive} of {Jim Henson}"],"info":{}}
{"id":"train_23444","question":"What are the economic policy which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q582577 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the financial arrangement which begin with the letter t"],"info":{}}
{"id":"train_23445","question":"what is ring system that contains the word rings in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28951811 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'rings' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is ring device that consists of the phrase rings in their name"],"info":{}}
{"id":"train_23450","question":"Tell me the ship type whose name has the word whaleback in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2235308 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'whaleback' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the type of ship whose name is whaleback"],"info":{}}
{"id":"train_23458","question":"what are the vegetation zone which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2083910 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the vegetation zone which begin with the letter t"],"info":{}}
{"id":"train_23465","question":"What are the neighborhood  which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q123705 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the neighborhood which begin with the letter z"],"info":{}}
{"id":"train_23468","question":"Name the lady and the year in which she gave birth to Princess Januária of Brazil.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q261802 . ?s pq:P25 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["Name the lady and the yr in which she gave beginning to Princess Januária of Brazil."],"info":{}}
{"id":"train_23474","question":"Tell me transcript whose name has the word messenger in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26944990 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'messenger' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know transcript whose title has the word flag-bearer in it."],"info":{}}
{"id":"train_23485","question":"Name the unit of measurement that uses the percent sign and starts with letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47574 . ?sbj wdt:P913 wd:Q7559698 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the unit of measurement that uses the percent sign and begins with letter P"],"info":{}}
{"id":"train_23490","question":"What National Historic Trail starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6973377 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["ON WHICH NATIONAL HISTORIC TRAIL STARTS WITH THE LETTER T"],"info":{}}
{"id":"train_23503","question":"What urban city starts with \"v\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29946056 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What urban city begins with \"v\"?"],"info":{}}
{"id":"train_23506","question":"I need to know the mountain range in the Ethiopian Highlands.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4552 wd:Q319288 }","paraphrases":[],"info":{}}
{"id":"train_23507","question":"How long was Ub Iwerks a teacher at Northeast High School","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q336424 p:P69 ?s . ?s ps:P69 wd:Q7057903 . ?s pq:P582 ?value }","paraphrases":["what was the tenure of Ub Iwerks as a teacher at Northeast High School?"],"info":{}}
{"id":"train_23522","question":"Name the employer of John Lasseter since 2006","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q269214 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2006' ) ) }","paraphrases":["Who has been John Lasseter's employer since 2006?"],"info":{}}
{"id":"train_23527","question":"What are the activity which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1914636 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the action which begin with the letter v"],"info":{}}
{"id":"train_23531","question":"Tell me land-grant university whose name has the word virginia in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q615150 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'virginia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal me land-grant university whose name has the word virginia in it."],"info":{}}
{"id":"train_23540","question":"Tell me me a music festival whose name consist of the word \"contest\" and whose production company European Broadcasting  union","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q868557 . ?sbj wdt:P272 wd:Q166400 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'contest' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me me a track pageant whose title consist of the phrase \"contest\" and whose production enterprise European Broadcasting union"],"info":{}}
{"id":"train_23554","question":"Who is the {human} for {partner} of {Julia Roberts}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q40523 wdt:P451 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Julia Roberts has called her husband Danny Moder her “favourite human” and “the best decision” she ever made.\n\nThe Hollywood star opened up about her marriage during a discussion with actress Gwyneth Paltrow on the latter’s Goop podcast, sharing a rare insight into her personal life.\n\nRoberts, 51, said the first “real seismic shift” in her life was meeting cameraman and cinematographer Moder nearly 20 years ago, and that marrying him made her realise “my life will never be the same again in the most indescribable way”.\n\n“It’s some kind of alchemy,” she said of her relationship with Moder, with whom she has three children."],"info":{}}
{"id":"train_23558","question":"What are the musical which start with the letter world","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2743 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the melodic which begin with the letter world"],"info":{}}
{"id":"train_23560","question":"tell  me epic poem that starts with t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q37484 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me that epic poem begins with t"],"info":{}}
{"id":"train_23572","question":"which play game starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25379 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which play game begins with w"],"info":{}}
{"id":"train_23573","question":"TELL ME HISTORICAL REGION THAT STARTS WITH THE LETTER V","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1620908 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know Chronicled Locale THAT Begins WITH THE LETTER V"],"info":{}}
{"id":"train_23584","question":"What is Ryan Reynold's person ID on Kino-teatr.ua","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q192682 wdt:P5312 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23603","question":"Who was the person behind the sponsorship of Vincent van Gogh","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5582 wdt:P859 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who was the person behind Vincent van Gogh's sponsorship?"],"info":{}}
{"id":"train_23606","question":"What was Maya Angelou nominated for at the 27th Tony Awards","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q19526 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q4632657 }","paraphrases":["Tell me what Maya Angelou was nominated for at the 27th Tony Awards."],"info":{}}
{"id":"train_23609","question":"What are theredistribution market which start with the letter usell","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41795373 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'usell' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are theredistribution showcase which begin with the letter usell"],"info":{}}
