{"id":"train_8286","question":"Does the Scoville grade of the Carolina Reaper equal 1255440.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q15427475 wdt:P2658 ?obj filter ( ?obj = 1255440.0 ) }","paraphrases":["Is 1255440.0 the Scoville grade of Carolina Reaper?"],"info":{}}
{"id":"train_8287","question":"What is the parent organisation of the label Wayfaring Sons?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7975896 wdt:P264 ?X . ?X wdt:P749 ?answer }","paraphrases":["What is the parent association of the name Wayfaring Children?"],"info":{}}
{"id":"train_8288","question":"What was the incident that involved record producer, Marma Veeran?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6772032 wdt:P162 ?X . ?X wdt:P793 ?answer }","paraphrases":["What was the occurrence that included record maker, Marma Veeran?"],"info":{}}
{"id":"train_8289","question":"How is spinacia oleracea identified?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q81464 wdt:P1070 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8290","question":"Who is the record producer of It Hurts Me Too?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q50397044 wdt:P179 ?X . ?X wdt:P162 ?answer }","paraphrases":["Who is the record producer of It Hurts Me Too?"],"info":{}}
{"id":"train_8291","question":"What is libretto by Das Rheingold, which has a famous book called the Lohengrin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q327717 wdt:P87 ?answer . ?answer wdt:P800 wd:Q23085 }","paraphrases":["What is libretto by Das Rheingold, which has a famous book called the Lohengrin?"],"info":{}}
{"id":"train_8292","question":"What was the capital city of Nazi Germany?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q7318 . ?sbj wdt:P31 wd:Q107390 }","paraphrases":["What was the capital city of Nazi Germany?"],"info":{}}
{"id":"train_8293","question":"In which location with 572059 inhabitants was Fischer Black born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q963275 wdt:P19 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '572059.0' ) ) }","paraphrases":["In which area with 572059 tenants was Fischer Dark born?"],"info":{}}
{"id":"train_8294","question":"Is the muzzle velocity of the AK47 less than 572","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q37116 wdt:P4137 ?obj filter ( ?obj < 572.0 ) }","paraphrases":["Is the gag speed of the AK47 less than 572"],"info":{}}
{"id":"train_8297","question":"Name a character created by Marvel Comics that contains the word \"wolverine \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15773347 . ?sbj wdt:P123 wd:Q173496 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wolverine' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a persona created via Marvel Comics that consists of the word \"wolverine \" in its name"],"info":{}}
{"id":"train_8301","question":"who is executive producer of Bicycle Thieves ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q172837 wdt:P1431 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8302","question":"What is the geotope with the lowest topographic isolation whose country is Germany ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q372363 . ?ent wdt:P2659 ?obj . ?ent wdt:P17 wd:Q183 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What it the German geotope with the lowest topographic isolation?"],"info":{}}
{"id":"train_8305","question":"What was the amount of population in New South Wales in 2014-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3224 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2014' ) ) }","paraphrases":["What was the population in New South Wales in 2014?"],"info":{}}
{"id":"train_8308","question":"What is the son of the sister of Asim ibn Umar ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4806987 wdt:P3373 ?X . ?X wdt:P22 ?answer }","paraphrases":["What is the child of the sister of Asim ibn Umar ?"],"info":{}}
{"id":"train_8309","question":"Who is the person in the head of the government of Rotterdam?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q34370 wdt:P6 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the person in Rotterdam's head of government?"],"info":{}}
{"id":"train_8310","question":"How many filming locations are located in Oxfordshire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P915 wd:Q23169 }","paraphrases":["What number of filming locations will be located in Oxfordshire?"],"info":{}}
{"id":"train_8311","question":"It is true that Harley Quinn's partner was Hal Jordan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q849477 wdt:P451 wd:Q2345627 }","paraphrases":["Was Hal Jordan partner of Harley Quinn?"],"info":{}}
{"id":"train_8314","question":"Who is the{dynasty} for {family} of {Rollo}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q273773 wdt:P53 ?obj . ?obj wdt:P31 wd:Q164950 }","paraphrases":["Who is the { dynasty } of the { Rollo } family?"],"info":{}}
{"id":"train_8316","question":"whats the involvement of dutch east India company","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1416 wd:Q159766 }","paraphrases":[],"info":{}}
{"id":"train_8317","question":"What books are the Harry Potter movies based on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P179 wd:Q8337 . ?sbj wdt:P31 wd:Q7725634 }","paraphrases":["What books are the Harry Potter motion pictures based on?"],"info":{}}
{"id":"train_8318","question":"What is the sister city of the Badminton World Federation in garrison?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q126638 wdt:P159 ?X . ?X wdt:P190 ?answer }","paraphrases":["What is the sister city of the Badminton World Alliance in army?"],"info":{}}
{"id":"train_8320","question":"Name a city in France that contains the word \"éguilly \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q484170 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'éguilly' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a city in France that contains the word \"éguilly \" in its name"],"info":{}}
{"id":"train_8321","question":"Which is the Prabook ID for Czesław Miłosz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q45970 wdt:P3368 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8323","question":"Is it true that Warner Bros. Records was George Harrison's record label?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2643 wdt:P264 wd:Q843402 }","paraphrases":["Did George Harrison have Warner Bros as his record label?"],"info":{}}
{"id":"train_8324","question":"What is the location of the headquarters of \"Deutsches Institut für Normung\" which has coordinates at  52.505515 13.344447","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q152746 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P625 ?x filter ( contains ( ?x , '52.505515 13.344447' ) ) }","paraphrases":["What is the location for the cooridnates 52.505515 13.344447, where the headquarters of Deutches Institut fur Normung is located?"],"info":{}}
{"id":"train_8326","question":"what is television in france  of regulated","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q3546742 wdt:P3719 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8327","question":"Who is the publisher for Julius Streicher?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P123 wd:Q76984 }","paraphrases":[],"info":{}}
{"id":"train_8328","question":"what is british empire's history of India?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2184 wd:Q133136 . ?sbj wdt:P31 wd:Q223832 }","paraphrases":["what is british empire's history of India?"],"info":{}}
{"id":"train_8329","question":"Who employed Gavin McInnes as a contributor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5528217 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P39 wd:Q20204892 }","paraphrases":["Who was Gavin McInne's employer as a contributor?"],"info":{}}
{"id":"train_8331","question":"What is the diplomatic relation of Ireland, that has people of Chinese Canadian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q27 wdt:P530 ?answer . ?answer wdt:P172 wd:Q1207351 }","paraphrases":["What is the discretionary connection of Ireland, that has individuals of Chinese Canadian?"],"info":{}}
{"id":"train_8332","question":"Which is the sexual preference of the studies of psychotherapy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q183257 wdt:P2578 ?obj . ?obj wdt:P31 wd:Q2275640 }","paraphrases":["Which is the sexual inclination of the considers of psychotherapy?"],"info":{}}
{"id":"train_8333","question":"What series ordinal was given to Antonio Aguilar, given name José Pascual?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1958523 p:P735 ?s . ?s ps:P735 wd:Q53871939 . ?s pq:P1545 ?value }","paraphrases":["Antonio Aguilar (Jose Pascual) was given what series ordinal?"],"info":{}}
{"id":"train_8334","question":"Tell me logarithmic unit whose name has the word trit in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17342348 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trit' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me logarithmic unit whose name has the word trit in it."],"info":{}}
{"id":"train_8337","question":"I need to know the Argonauts' position.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P39 wd:Q165510 }","paraphrases":[],"info":{}}
{"id":"train_8338","question":"What method was used to determine the population of the Moravian-Silesian Region as 1209879?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q190550 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '1209879' ) ) . ?s pq:P1013 ?value }","paraphrases":["Which method was used to determine the population of the Moravian-Silesian Region as 1209879?"],"info":{}}
{"id":"train_8340","question":"Where is the Costco Headquarters located in Issaquah, WA?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q715583 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P625 ?x filter ( contains ( ?x , '47.5501 -122.051' ) ) }","paraphrases":["Costco HQ is located where in Issaquah, WA?"],"info":{}}
{"id":"train_8341","question":"Which is the Fibonacci number in the translated edition of Lexicon Forestale that contains the number 1 in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47577 . ?sbj wdt:P629 wd:Q62469935 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , '1' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the Fibonacci range in the translated version of Lexicon Forestale that carries the variety 1 in it is name?"],"info":{}}
{"id":"train_8344","question":"Was David Cassidy an actor and a singer-songwriter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q457306 wdt:P106 wd:Q33999 . wd:Q457306 wdt:P106 wd:Q488205 }","paraphrases":["Was David Cassidy a singer-songwriter and also an actor?"],"info":{}}
{"id":"train_8347","question":"What is the geography of topic for human geography?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2633 wd:Q12831143 }","paraphrases":[],"info":{}}
{"id":"train_8348","question":"What is the award that Daniel McFadden got with James Heckman?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q312560 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q312561 }","paraphrases":["What award did Daniel McFadden and James Heckman receive?"],"info":{}}
{"id":"train_8349","question":"Who is the leader of the Indian National Congress","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10225 wdt:P488 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the pioneer of the Indian National Congress"],"info":{}}
{"id":"train_8352","question":"What body part does the medicine dicloxacillin treat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2313471 wdt:P2175 ?X . ?X wdt:P927 ?answer }","paraphrases":["What part of the body does the dicloxacillin medicine treat?"],"info":{}}
{"id":"train_8353","question":"Tell me whether Sodium chloride is instance of Chloride ion?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2314 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P642 wd:Q108200 }","paraphrases":["Is Sodium Chloride a Chloride Ion?"],"info":{}}
{"id":"train_8355","question":"Which sports league is the Romain Inex team a part of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3440678 wdt:P54 ?X . ?X wdt:P118 ?answer }","paraphrases":["Who affected Roald Dahl's career?"],"info":{}}
{"id":"train_8356","question":"What is the town sister of Minsk where country seat is Urban okrug Bryansk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2280 wdt:P190 ?answer . ?answer wdt:P1376 wd:Q27532884 }","paraphrases":["What is the town sister of Minsk the place u . s . seat is Urban okrug Bryansk?"],"info":{}}
{"id":"train_8358","question":"Which country was Eldar Ryazanov born in as he was born in Samara?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q381944 p:P19 ?s . ?s ps:P19 wd:Q894 . ?s pq:P17 ?value }","paraphrases":["What is the name of the country that Eldar Ryazanov was born in as he was born in Samara?"],"info":{}}
{"id":"train_8359","question":"what is geometric concept contains the word space in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21550639 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'space' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is geometric concept contains the word space in their name"],"info":{}}
{"id":"train_8362","question":"Which award did Aaron T. Beck receive in the year 1999?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q302849 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1999' ) ) }","paraphrases":["Aaron T. Beck won which award in the year 1999?"],"info":{}}
{"id":"train_8363","question":"How many sports are related to inline speed skating?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P641 wd:Q618786 }","paraphrases":["Inline speed skating relates to what number of sports?"],"info":{}}
{"id":"train_8364","question":"Who is the {human} with the {MIN(Erdős number)} whose {occupation} is {mathematician} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P2021 ?obj . ?ent wdt:P106 wd:Q170790 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Who is the mathematician with the minimum Erdős number?"],"info":{}}
{"id":"train_8365","question":"where is the animation studio for the owner of Walt disney parks and resorts ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1830 wd:Q1431781 . ?sbj wdt:P31 wd:Q1107679 }","paraphrases":["Where is the Walt Disney Parks and Resorts Animation Studio?"],"info":{}}
{"id":"train_8366","question":"Which is the biological database for the location of Yale University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P276 wd:Q49112 . ?sbj wdt:P31 wd:Q4117139 }","paraphrases":["Which is the organic database for the area of Yale University?"],"info":{}}
{"id":"train_8367","question":"Who translated the King James Version of the bible?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q623398 wdt:P629 ?obj . ?obj wdt:P31 wd:Q47461344 }","paraphrases":["Who was the King James bible translated by?"],"info":{}}
{"id":"train_8369","question":"How many writing systems are by hiragana?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P282 wd:Q48332 }","paraphrases":["For Hiragana, how many writing systems are there?"],"info":{}}
{"id":"train_8370","question":"When did Charlize Theron's relationship with Stuart Townsend end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q80046 p:P451 ?s . ?s ps:P451 wd:Q363525 . ?s pq:P582 ?value }","paraphrases":["When did Stuart Townsend and Charlize Theron split?"],"info":{}}
{"id":"train_8371","question":"What what is city/town permanent duplicated item Königsberg and also which starts with letter k","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7930989 . ?sbj wdt:P2959 wd:Q4120832 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'k' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is city/town changeless copied thing Königsberg and furthermore which begins with letter k"],"info":{}}
{"id":"train_8372","question":"Name the standard mainland China character in the Table of Jōyō kanji with the highest stroke count ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15904197 . ?ent wdt:P5205 ?obj . ?ent wdt:P972 wd:Q55502741 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which common Chinese character in the Table of Joyo kanji requires the most strokes?"],"info":{}}
{"id":"train_8373","question":"What is {position held} of {Frank Bainimarama} where {start time} is {2006-12-5} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q57830 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2006' ) ) }","paraphrases":["As of 2006-12-5 what was Frank Bainimarama's position?"],"info":{}}
{"id":"train_8376","question":"What is the MASL of the place of the death of Ibn Taymiyyah?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q491558 wdt:P20 ?X . ?X wdt:P2044 ?answer }","paraphrases":["What is the MASL of the put of the passing of Ibn Taymiyyah?"],"info":{}}
{"id":"train_8377","question":"Who maintains the termini of Aomori Prefectural Road Route 241?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11662450 wdt:P559 ?X . ?X wdt:P126 ?answer }","paraphrases":["The termini of Aomori Prefectural Road Route 241 is taken care by who?"],"info":{}}
{"id":"train_8379","question":"Heinrich Schütz holds the seat for which county?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q153643 wdt:P937 ?X . ?X wdt:P1376 ?answer }","paraphrases":["What county does Heinrich Schutz hold the seat for?"],"info":{}}
{"id":"train_8380","question":"What is the office of Martin S James's work?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6776511 wdt:P108 ?X . ?X wdt:P159 ?answer }","paraphrases":["What's the work of Martin S James ' office?"],"info":{}}
{"id":"train_8381","question":"WHAT ARE THE USES OF SEISMIC WAVE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2283 wd:Q186167 }","paraphrases":[],"info":{}}
{"id":"train_8383","question":"which sports season has the highest points awarded whose participating teams is adelaide football club?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q27020041 . ?ent wdt:P3260 ?obj . ?ent wdt:P1923 wd:Q948900 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which adelaide football club season was awarded the highest points?"],"info":{}}
{"id":"train_8386","question":"How many matches did Cafu play for Real Zaragoza?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q178683 p:P54 ?s . ?s ps:P54 wd:Q10308 . ?s pq:P1350 ?value }","paraphrases":["How Much Matches Did Cafu Play For \nReal zaragoza?"],"info":{}}
{"id":"train_8387","question":"Name a relativistic wave equation that contains the word \" equation\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7310838 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'equation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a relativistic wave condition that contains the word \" condition\" in its name"],"info":{}}
{"id":"train_8388","question":"Is the suicide rate Akita Prefecture less than 25.488?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q81863 wdt:P3864 ?obj filter ( ?obj < 25.488 ) }","paraphrases":["Is 25.488 low for the suicide rate for Akita Prefecture?"],"info":{}}
{"id":"train_8390","question":"What is the capital of Helsinki that is located in the administrative territorial entity of the Russian Empire?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1757 p:P1376 ?s . ?s ps:P1376 ?obj . ?s pq:P131 wd:Q34266 }","paraphrases":["What is the capital of Helsinki in the territory of the Russian Empire?"],"info":{}}
{"id":"train_8391","question":"Give the name of galaxy with less apparent magnitude and was discovered by William Herschel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q318 . ?ent wdt:P1215 ?obj . ?ent wdt:P61 wd:Q14277 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What galaxy, discovered by William Herschel, has the less apparent magnitude?"],"info":{}}
{"id":"train_8392","question":"Is the torque of the NEMA 17 Stepper motor Model LDO-42STH47-1684A equal to 40.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q25859948 wdt:P2230 ?obj filter ( ?obj = 40.0 ) }","paraphrases":["Is 40.0 the same as the touque of the NEMA 17 Stepper motor Model LDO-42STH47-1684A?"],"info":{}}
{"id":"train_8393","question":"Was Diane_Keaton nominated for Screen Actors Guild Award for Outstanding Performance by a Male Actor in a Leading Role  and  Broadcast Film Critics Association Award for Best Actress?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q102642 wdt:P1411 wd:Q654620 . wd:Q102642 wdt:P1411 wd:Q922226 }","paraphrases":["What was Diane Keaton nominated for and by who?"],"info":{}}
{"id":"train_8396","question":"What person who's a citizen of Romania has the highest EGF rating?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5 . ?ent wdt:P4105 ?obj . ?ent wdt:P27 wd:Q218 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What Romanian has the top rating via EGF?"],"info":{}}
{"id":"train_8397","question":"What is the total quantity produced by Fuji?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q504893 wdt:P1092 ?obj }","paraphrases":["How much does Fuji produce?"],"info":{}}
{"id":"train_8401","question":"Who's rule over Tocanis government ended on 3-22-20187?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43695 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2018' ) ) }","paraphrases":["Give me the name of the ruler whose reign over the Tocanis government ended on 3/22/20187."],"info":{}}
{"id":"train_8404","question":"How was John XXIII consecrated?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1598 wd:Q23873 }","paraphrases":["By what means was John XXIII made or declared sacred?"],"info":{}}
{"id":"train_8406","question":"Who is the {theatre award} for {nominated for} of {Vanessa Redgrave}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q347879 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q15229229 }","paraphrases":["Who is the {theater grant} for {assigned for} of {Vanessa Redgrave}"],"info":{}}
{"id":"train_8407","question":"What is tarragon's PalDat plant ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q155814 wdt:P4122 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8408","question":"A marsh is what type of habitat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2974 wd:Q30198 }","paraphrases":[],"info":{}}
{"id":"train_8409","question":"Mention the chemical compound composition for treatment of major depressive disorder","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2175 wd:Q42844 . ?sbj wdt:P31 wd:Q11173 }","paraphrases":["What is the chemical compound composition for treatment of major depressive disorder"],"info":{}}
