{"id":"train_6215","question":"Tell me the sports team which contains the word world in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12973014 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'world' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the sports group which contains the word world in it's name?"],"info":{}}
{"id":"train_6216","question":"What did Katherine Dunham study at the University of Chicago and what was her academic degree in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q272637 p:P69 ?s . ?s ps:P69 wd:Q131252 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What did Katherine Dunham study and what was her academic degree in at Chicago University?"],"info":{}}
{"id":"train_6217","question":"What linked jurisdiction is adjacent to the Council of the North?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5176544 wdt:P1001 ?X . ?X wdt:P47 ?answer }","paraphrases":["What connected purview is adjoining to the Committee of the North?"],"info":{}}
{"id":"train_6218","question":"How many officeholders are there with {Jiang Zemin} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1308 wd:Q16597 }","paraphrases":["Jiang Zemin has what number of officeholders?"],"info":{}}
{"id":"train_6219","question":"What academic degree did James Mattis receive at Richland High School?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q267902 p:P69 ?s . ?s ps:P69 wd:Q7330633 . ?s pq:P512 ?value }","paraphrases":["Which degree did Richland High School give to James Mattis for his academic studies?"],"info":{}}
{"id":"train_6226","question":"Where can you not hunt a domesticated animal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q36963 p:P276 ?s . ?s ps:P276 ?obj . ?s pq:P1011 wd:Q622852 }","paraphrases":["Where are domestic animals illegal to hunt?"],"info":{}}
{"id":"train_6227","question":"what is first-order metaclass contains the word type in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24017414 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'type' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is first-request metaclass contains the command type in their name"],"info":{}}
{"id":"train_6228","question":"Tell me the award Stephen Jay Gould received on the first of January 2001?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q180619 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["Which award was Stephen J. Gould given on January 1st in the year 2001?"],"info":{}}
{"id":"train_6229","question":"Was Rajneesh a leader, artist, and guru?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q148285 wdt:P106 wd:Q483501 . wd:Q148285 wdt:P106 wd:Q484260 }","paraphrases":["An artist, guru and a leader; was that Rajneesh?"],"info":{}}
{"id":"train_6230","question":"What is the standard time zone for Zaporizhzhya Oblast?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q171334 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q1777301 }","paraphrases":["Which is the standard time zone for Zaporizhzhya Oblast?"],"info":{}}
{"id":"train_6231","question":"Which is the location of first performance of La traviata?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q186162 wdt:P4647 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6232","question":"which binary relation starts with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q130901 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which twofold connection begins with the letter s"],"info":{}}
{"id":"train_6235","question":"Does the vilkhivchik area equal to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4334348 wdt:P2046 ?obj filter ( ?obj = 0 ) }","paraphrases":["Is the area of vilkhivchik equal to 0?"],"info":{}}
{"id":"train_6237","question":"When Otto von Bismarck ended as Bundeskanzler (Norddeutscher Bund) ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8442 p:P39 ?s . ?s ps:P39 wd:Q885840 . ?s pq:P582 ?value }","paraphrases":["On what date did Otto von Bismarck quit as Federal Chancellor?"],"info":{}}
{"id":"train_6238","question":"Investigation of explosion characteristics of coal dust was undertaken as a part of regular research program at CSIR-CBRI,\nRoorkee, India, for designing explosion safety measures for coal dust handling installations. Potential explosion hazard of\ncoal dust cloud is characterized by maximum explosion pressure, maximum rate of pressure rise and explosibility index.\nStudy aimed at review and analysis of existing data on explosion parameters of coals and creating new sufficient quantitative\nexplosibility data for safe design and operation of plants handling some specific selected coals. Various aspects covered are:","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q416796 . ?ent wdt:P2204 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which aspects of the explosion characteristics of coal dust were investigated by the quantitative explosibility studies at CSIR-CBRI in Roorkee, India, in the process of designing safety measures for coal dust handling?"],"info":{}}
{"id":"train_6239","question":"What is the current time in Turin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q495 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value }","paraphrases":["Give me the present time in Turin."],"info":{}}
{"id":"train_6240","question":"What science studies genetic diseases?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12136 wdt:P2579 ?answer . ?answer wdt:P1542 wd:Q200779 }","paraphrases":["Genetic diseases is studied by which science?"],"info":{}}
{"id":"train_6241","question":"What is seat of Mitsubishi UFJ Financial group, that has local government areas is Yonbancho?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1542175 wdt:P159 ?answer . ?answer wdt:P150 wd:Q3347147 }","paraphrases":["What is seat of Mitsubishi UFJ Financial group, that has neighborhood government areas is Yonbancho?"],"info":{}}
{"id":"train_6243","question":"Who was Peter Paul Rubens' employer in September 1609?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5599 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1609' ) ) }","paraphrases":["Give me the name of Peter Paul Rubens' employer in September 1609."],"info":{}}
{"id":"train_6245","question":"Which Netherlands municipality has the highest employment by economic sector?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2039348 . ?ent wdt:P2297 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which Netherlands capital has the highest employment by economic sector?"],"info":{}}
{"id":"train_6246","question":"Was Lewis Hamilton a member of the sports team Minardi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9673 wdt:P54 wd:Q142381 }","paraphrases":["The first attempt to rank drivers using a model was in 2009 by Eichenberger and Stadelmann (paper here and pdf here). Without giving too much away, my model agrees with theirs on several of the top ranked drivers. However, many of the previous model’s results don’t pass a sanity check. Ukyo Katayama is ranked ahead of Nigel Mansell, Erik Comas is ranked ahead of Ayrton Senna, Arturo Merzario is ranked ahead of Jack Brabham, Mark Blundell is ranked ahead of Niki Lauda, and Mike Hawthorn is ranked 5th best of all time. Understandably, the model didn’t get a warm reception in online forums."],"info":{}}
{"id":"train_6248","question":"Who is the admin HQ of the movie studio for Dinner for Schmucks?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1226599 wdt:P272 ?X . ?X wdt:P159 ?answer }","paraphrases":["Who is the admin HQ of the film studio for Dinner for Schmucks?"],"info":{}}
{"id":"train_6252","question":"WHICH IS THE ORGANIZATION OFANTHEM THAT IS ANTHEM OF EUROPE AND WHICH STARTS WITH C","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q43229 . ?sbj wdt:P85 wd:Q11993 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE ORGANIZATION OFANTHEM THAT IS ANTHEM OF EUROPE AND WHICH STARTS WITH C"],"info":{}}
{"id":"train_6255","question":"How many matches did Roberto Baggio play for Bologna F.C. 1909, and how many goals did he score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q67964 p:P54 ?s . ?s ps:P54 wd:Q1893 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["State the number of matches Roberto Baggio played for Bologna F.C. 1909 and the number of goals he scored."],"info":{}}
{"id":"train_6256","question":"What country is Belfast located in, and when was the city founded?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q10686 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["What united states is Belfast located in, and when was once the town founded?"],"info":{}}
{"id":"train_6258","question":"DOES THE FLASH POINT OF THE METHANOL EQUALS 52","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q14982 wdt:P2128 ?obj filter ( ?obj = 52 ) }","paraphrases":["THE METHANOL EQUALS 52 THE FLASH POINT"],"info":{}}
{"id":"train_6260","question":"What is the pronunciation audio of the administrative centre of Joseon ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28179 wdt:P36 ?X . ?X wdt:P443 ?answer }","paraphrases":["In the administrative centre of Joseon, what is the pronunciation audio?"],"info":{}}
{"id":"train_6261","question":"What are the currency  which start with the letter yen","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8142 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yen' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the money which begin with the letter yen"],"info":{}}
{"id":"train_6262","question":"Is Frank Zappa the father of both Moon and Ahmet Zappa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q127330 wdt:P40 wd:Q291024 . wd:Q127330 wdt:P40 wd:Q401963 }","paraphrases":["Are Moon and Ahmet Zappa both Frank Zappa's kids?"],"info":{}}
{"id":"train_6264","question":"Who is the writer of A Brief History of Time by the professor of Dennis W.Sciama?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q471726 wdt:P50 ?answer . ?answer wdt:P1066 wd:Q284336 }","paraphrases":["Who wrote  A Brief History of Time by the professor of Dennis W.Sciama?"],"info":{}}
{"id":"train_6266","question":"Where does the crocodile rank in the taxon of Crocodylinae?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2535664 wdt:P171 ?X . ?X wdt:P105 ?answer }","paraphrases":["Where does the crocodile rank within the taxon of Crocodylinae?"],"info":{}}
{"id":"train_6267","question":"What is the poet ID given by Les Voix de la poésie to Alphonse Daudet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q228546 wdt:P5477 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6269","question":"What is ICCF ID for Magnus Carlsen ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q106807 wdt:P3316 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6270","question":"When did Yul Brynner receive the Special Tony Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q102813 p:P166 ?s . ?s ps:P166 wd:Q2308234 . ?s pq:P585 ?value }","paraphrases":["On what date did Yul Brynner receive the Special Tony Award?"],"info":{}}
{"id":"train_6273","question":"When did series of In the Mood for Love and follows?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q1056853 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["When did arrangement of Within the Disposition for Adore and follows?"],"info":{}}
{"id":"train_6274","question":"Which school did William Walker finish at 1838?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q196401 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1838' ) ) }","paraphrases":["From what school did William Walker graduate in 1838?"],"info":{}}
{"id":"train_6276","question":"who is favorite player of doctoral supervisor of Darius Lakdawalla ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5222945 wdt:P184 ?X . ?X wdt:P737 ?answer }","paraphrases":["who is favorite player of doctoral boss of Darius Lakdawalla ?"],"info":{}}
{"id":"train_6277","question":"What is the material with the lowest operating temperature whose use is construction?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q214609 . ?ent wdt:P5066 ?obj . ?ent wdt:P366 wd:Q385378 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the construction material with the lowest operating temperature?"],"info":{}}
{"id":"train_6279","question":"Which is the antonym of the participation event for a girl?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3031 wdt:P461 ?X . ?X wdt:P1344 ?answer }","paraphrases":["What is the opposite of the participation event for a girl?"],"info":{}}
{"id":"train_6280","question":"Is mental confusion a sign or result of kerosene?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q76904 wdt:P1542 ?answer . ?answer wdt:P780 wd:Q557945 }","paraphrases":["Is mental perplexity a sign or result of lamp fuel?"],"info":{}}
{"id":"train_6285","question":"Tell me the characters in the version of Božanska komedija (Debevec).","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21191070 wdt:P629 ?X . ?X wdt:P674 ?answer }","paraphrases":["Get me the list of characters in the version of Božanska komedija (Debevec)."],"info":{}}
{"id":"train_6287","question":"Is it true that the standard molar entropy of germanium equals to 37.32?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q867 wdt:P3071 ?obj filter ( ?obj = 37.32 ) }","paraphrases":["Is it genuine that the standard molar entropy of germanium breaks even with to 37.32?"],"info":{}}
{"id":"train_6288","question":"whats the route of administration for lead poisoning?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q110315 wdt:P636 ?obj }","paraphrases":["How do you get lead poisoning?"],"info":{}}
{"id":"train_6289","question":"Tell me the sports team Giuseppe Meazza plays for and when he began with them.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q192131 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["Tell me the sports crew Giuseppe Meazza plays for and when he began with them."],"info":{}}
{"id":"train_6291","question":"Does the speed limit of the Brocken Railway equal 40?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q514245 wdt:P3086 ?obj filter ( ?obj = 40 ) }","paraphrases":["Does the speed constrain of the Brocken Railroad break even with 40?"],"info":{}}
{"id":"train_6294","question":"who is cousin for motif of Portrait of Adele Bloch-Bauer I ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q354396 wdt:P180 ?X . ?X wdt:P1038 ?answer }","paraphrases":["Who is the cousin of Adele Bloch - Bauer's portrait?"],"info":{}}
{"id":"train_6295","question":"What administrative territorial entity of Kenya starts with the letter \"n\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3976641 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What administrative territorial entity of Kenya begins with the letter \"n\"?"],"info":{}}
{"id":"train_6297","question":"Populism is the political alignment of how many?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1387 wd:Q180490 }","paraphrases":["How many have the political alignment of populism?"],"info":{}}
{"id":"train_6298","question":"What are the group or class of chemical substances which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17339814 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the bunch or lesson of chemical substances which begin with the letter v"],"info":{}}
{"id":"train_6303","question":"What are the historic county of England which start with the letter yorkshire","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1138494 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yorkshire' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the historic county of England which begin with the letter yorkshire"],"info":{}}
{"id":"train_6305","question":"Which business is Ford Motor Company in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44294 wdt:P199 ?obj . ?obj wdt:P31 wd:Q4830453 }","paraphrases":[],"info":{}}
{"id":"train_6307","question":"Does the Milky Way include Messier 47 and NGC 4833?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q321 wdt:P398 wd:Q13942 . wd:Q321 wdt:P398 wd:Q840301 }","paraphrases":["Is it true that Milky Way includes Messier 47 and NGC 4833?"],"info":{}}
{"id":"train_6308","question":"Is the personal best of Walter Steiner equal to 179?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q372873 wdt:P2415 ?obj filter ( ?obj = 179 ) }","paraphrases":["Is Walter Steiner's personal best 179?"],"info":{}}
{"id":"train_6309","question":"How many employers does Johnson & Johnson provide?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P108 wd:Q333718 }","paraphrases":["Johnson & Johnson has how many employees?"],"info":{}}
{"id":"train_6310","question":"What is the operator and manufacturer of Boeing B-52 Stratofortress?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q174534 wdt:P137 ?ans_1 . wd:Q174534 wdt:P176 ?ans_2 }","paraphrases":["Who operates and manufactures the Boeing B-52 Stratofortress?"],"info":{}}
{"id":"train_6311","question":"Is the age of majority in Ireland equal to 21.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q27 wdt:P2997 ?obj filter ( ?obj = 21.6 ) }","paraphrases":["Is the age of lion's share in Ireland break even with to 21.6?"],"info":{}}
{"id":"train_6312","question":"What sport does the chairwoman of the Athletic Club play?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8687 wdt:P488 ?X . ?X wdt:P641 ?answer }","paraphrases":["The chairwoman of the Athletic Club plays what sport?"],"info":{}}
{"id":"train_6314","question":"What award did Gherman Titov receive on August 9, 1961?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q152298 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1961' ) ) }","paraphrases":["Which award did Gherman Titov receive on August 9, 1961?"],"info":{}}
{"id":"train_6315","question":"What is the exact date of John Cabot's death in 1498?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q85642 p:P570 ?s . ?s ps:P570 ?x filter ( contains ( YEAR ( ?x ) , '1498' ) ) . ?s pq:P31 ?value }","paraphrases":["tell me the death date of John Cabot's in 1498?"],"info":{}}
{"id":"train_6316","question":"How many conditions list “cough” as a symptom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P780 wd:Q35805 }","paraphrases":["\"Cough\" is a symptom for how many conditions?"],"info":{}}
{"id":"train_6318","question":"Which {chemical element} has {MIN(time-weighted average exposure limit)} whose {subclass of} is {group 13} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11344 . ?ent wdt:P2404 ?obj . ?ent wdt:P279 wd:Q189294 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which {chemical component} has {MIN(time-weighted normal introduction restrain)} whose {subclass of} is {gather 13} ?"],"info":{}}
{"id":"train_6319","question":"What is published in journal of bibliographic citation of Using accelerometers to measure physical activity in large-scale epidemiological studies: issues and challenges. ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37625907 wdt:P2860 ?X . ?X wdt:P1433 ?answer }","paraphrases":["Give me what has been published in journal of bibliographic citation of Using accelerometers to measure physical activity in large-scale epidemiological studies: issues and challenges."],"info":{}}
{"id":"train_6320","question":"Name a painting by Vincent van Gogh","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P710 wd:Q5582 . ?sbj wdt:P31 wd:Q72823 }","paraphrases":["Title a portray by Vincent van Gogh"],"info":{}}
{"id":"train_6321","question":"Is limestone's decomposition point 1517.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23757 p:P2107 ?s . ?s ps:P2107 ?x filter ( contains ( ?x , '1517.0' ) ) . ?s pq:P1013 ?value }","paraphrases":["What is the decomposition point of limestone?"],"info":{}}
{"id":"train_6322","question":"Which division is the subsidiary of MTV?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P355 wd:Q43359 . ?sbj wdt:P31 wd:Q334453 }","paraphrases":["Which division is the backup of MTV?"],"info":{}}
{"id":"train_6324","question":"Where did Karl Marx begin his education in the year 1830?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9061 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1830' ) ) }","paraphrases":["Where did Karl Marx star his education in 1830?"],"info":{}}
{"id":"train_6325","question":"When did the Cossack Hetmanate cease being a vassal of the Ottoman Empire?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q212439 p:P31 ?s . ?s ps:P31 wd:Q2560551 . ?s pq:P582 ?value }","paraphrases":["On what date was the Cossack Hetmanate frei from the  subordination to the Ottoman Empire?"],"info":{}}
{"id":"train_6326","question":"Was cryptocurrency based on blockchain and/or online music store?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13479982 wdt:P144 wd:Q20514253 . wd:Q13479982 wdt:P144 wd:Q43060 }","paraphrases":["Did the basis of cryptocurrency include blockchain and/or online music store?"],"info":{}}
{"id":"train_6328","question":"What is the hereditary position of the Head of State Office  of Japan Empire","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q188712 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q42045197 }","paraphrases":[],"info":{}}
{"id":"train_6329","question":"what is the operation for the anatomical location problem of the ear ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P927 wd:Q7362 . ?sbj wdt:P31 wd:Q600236 }","paraphrases":["What is the anatomical location problem surgery for the ear?"],"info":{}}
{"id":"train_6331","question":"Who did Ingmar Bergman marry and when did the marriage end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q7546 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who did Ingmar Bergman marry and when did the marriage end?"],"info":{}}
{"id":"train_6332","question":"How many narrative locations are for the Os Lusíadas} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q781898 wdt:P840 ?obj }","paraphrases":["For the Os Lusiadas, how many narrative locations are there?"],"info":{}}
