{"id":"train_1353","question":"Who is the parent company of the label of Carabao?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1035286 wdt:P264 ?X . ?X wdt:P355 ?answer }","paraphrases":["Which parent company owns the label of Carabao?"],"info":{}}
{"id":"train_1357","question":"What is Mikhail Botvinnik's Israel Chess Federation player ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q178865 wdt:P3867 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1358","question":"For what team did Tom Finney play 433 matches for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q352338 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?x filter ( contains ( ?x , '433.0' ) ) }","paraphrases":["What team did Tom Finney play 433 matches for?"],"info":{}}
{"id":"train_1359","question":"In which conflict was Vasily Blyukher involved ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q48129 wdt:P607 ?X . ?X wdt:P828 ?answer }","paraphrases":["Which conflict was Vasily Blyukher part of?"],"info":{}}
{"id":"train_1361","question":"What what is animated nonprofit organization distributed by MGM and English","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q345367 . ?sbj wdt:P3259 wd:Q21011287 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'day' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is enlivened nonprofit organization dispersed by MGM and English"],"info":{}}
{"id":"train_1364","question":"tell me aspect of history name has the word propaganda it it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17524420 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'propaganda' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know angle of history title has the word purposeful publicity it it"],"info":{}}
{"id":"train_1365","question":"How many architects worked on the St. Peter's Basilica?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q12512 wdt:P84 ?obj }","paraphrases":["What is the total number of architects that worked on St Peter's Basilica?"],"info":{}}
{"id":"train_1366","question":"Did Miles Davis record and label the RCA and Capitol Records?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q93341 wdt:P264 wd:Q202585 . wd:Q93341 wdt:P264 wd:Q193023 }","paraphrases":["WHO recorded and tagged the RCA and Capitol Records?"],"info":{}}
{"id":"train_1367","question":"Which is the union for administrative territorial entity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2737 wd:Q56061 }","paraphrases":[],"info":{}}
{"id":"train_1369","question":"State the confederation of Jefferson Davis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q162269 . ?sbj wdt:P31 wd:Q170156 }","paraphrases":["What nation is Jeferson Davis a part of?"],"info":{}}
{"id":"train_1370","question":"Who did Diane von Furstenberg marry in 1969MacGraw","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q272438 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1969' ) ) }","paraphrases":["Name the person whom Diane von Furstenberg married during the year 1969."],"info":{}}
{"id":"train_1371","question":"\"chupenme la pija giles ndeahhre\"' is written in what language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q36747 wdt:P103 ?obj . ?obj wdt:P31 wd:Q25295 }","paraphrases":["\"chupenme la pija giles ndeahhre\"' is composed in what language?"],"info":{}}
{"id":"train_1372","question":"What was the HH-60 Jayhawk developed from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1892024 wdt:P176 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What was the HH-60 Jayhawk created from?"],"info":{}}
{"id":"train_1374","question":"Who is the sibling of Subutai?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3373 wd:Q162217 }","paraphrases":[],"info":{}}
{"id":"train_1378","question":"Tell me the name of the parabolic differential equation which starts with the letter e.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1575416 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the title of the illustrative differential condition which begins with the letter e."],"info":{}}
{"id":"train_1379","question":"What are the municipality of Spain that contains the word zumaia in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2074737 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zumaia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the municipality of Spain which contains in its name the word zumaia"],"info":{}}
{"id":"train_1381","question":"Did Louis VI of France die at the Chateau de la Douye?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q165883 p:P20 ?s . ?s ps:P20 wd:Q48622322 . ?s pq:P276 ?value }","paraphrases":["Is Chateau de la Douye where Louis VI of France passed?"],"info":{}}
{"id":"train_1382","question":"How many processor cores does Xbox one have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q13361286 wdt:P1141 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1383","question":"What songs are on the tracklist of Led Zeppelin IV?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q201940 wdt:P658 ?obj . ?obj wdt:P31 wd:Q7366 }","paraphrases":["What melodies are on the tracklist of Led Zeppelin IV?"],"info":{}}
{"id":"train_1385","question":"What is the parent company of New York State University (that has co-ords of -33.1911)?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1140241 wdt:P355 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '43.0062 -76.1973' ) ) }","paraphrases":["What is the parent company of Unused York State College (that has co-ords of -33.1911)?"],"info":{}}
{"id":"train_1386","question":"WHICH IS THE ICE HOCKEY TOURNAMENT THAT CONTAINS THE WORD TROPHY IN THEIR NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18325242 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trophy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE ICE HOCKEY Competition THAT CONTAINS THE WORD TROPHY IN THEIR NAME"],"info":{}}
{"id":"train_1387","question":"What career uses a fishing reel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14373 wdt:P106 ?answer . ?answer wdt:P2283 wd:Q1572168 }","paraphrases":["What career employments a angling reel?"],"info":{}}
{"id":"train_1388","question":"Is the inflation rate of Japan equal to -0.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q17 wdt:P1279 ?obj filter ( ?obj = -0.6 ) }","paraphrases":["Is -0.6 equal to the inflation rate of Japan?"],"info":{}}
{"id":"train_1391","question":"Which is the written work for the first translated edition?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q199 wdt:P629 ?obj . ?obj wdt:P31 wd:Q47461344 }","paraphrases":["Which is the composed work for the primary interpreted edition?"],"info":{}}
{"id":"train_1394","question":"Name a vegetation zone in Europe that starts with letter T","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2083910 . ?sbj wdt:P30 wd:Q46 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a vegetation zone in Europe that begins with letter T"],"info":{}}
{"id":"train_1395","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P800 wd:Q191838 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["n/a"],"info":{}}
{"id":"train_1396","question":"In what language is soup pronounced as Ru-cyn.ogg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41415 p:P443 ?s . ?s ps:P443 ?x filter ( contains ( ?x , 'Ru-суп.ogg' ) ) . ?s pq:P407 ?value }","paraphrases":["In what language is soup articulated as Ru-cyn.ogg?"],"info":{}}
{"id":"train_1397","question":"In what country was Adelaide founded on 12-28-1836?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5112 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1836' ) ) }","paraphrases":["On 12-28-1836, in what county was Adelaide founded?"],"info":{}}
{"id":"train_1398","question":"What is L-Tyrosine encoded by","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q188017 wdt:P702 ?obj . ?obj wdt:P31 wd:Q165052 }","paraphrases":["Through what method is L-Tyrosine encoded?"],"info":{}}
{"id":"train_1399","question":"What is the name of the music festival that is based on Sanremo Music Festival and that starts with the letter \"c\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q868557 . ?sbj wdt:P144 wd:Q206959 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the name of the tune pageant that is based on Sanremo Music Festival and that starts offevolved with the letter \"c\"?"],"info":{}}
{"id":"train_1400","question":"What is the personal name of David Eddings is it said to be different From Taavet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q354888 wdt:P735 ?answer . ?answer wdt:P460 wd:Q22222753 }","paraphrases":["What is the non-public name of David Eddings is it stated to be different From Taavet?"],"info":{}}
{"id":"train_1401","question":"Who is the brother or sister of George II of Great Britain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q131981 wdt:P3373 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the brother or sister of George II of Incredible Britain?"],"info":{}}
{"id":"train_1402","question":"What twinned administrative body of Queensland started on October 10th, 1984?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q36074 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["What paired administrative body of Queensland started on October 10th, 1984?"],"info":{}}
{"id":"train_1403","question":"was the 2013 german federal election canadidacy age 21.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q555931 wdt:P2998 ?obj filter ( ?obj < 21.6 ) }","paraphrases":["Confirm that the 2013 german federal election canadidacy age is 21.6."],"info":{}}
{"id":"train_1407","question":"Was Website software engine Microsoft?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q35127 wdt:P408 wd:Q2283 }","paraphrases":["Is it true that Microsoft was a Website software engine?"],"info":{}}
{"id":"train_1408","question":"What are the integer which start with the letter i","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12503 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , '1' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the integer which begin with the letter i"],"info":{}}
{"id":"train_1409","question":"The country of Catania has which cities?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1903 wdt:P1376 ?X . ?X wdt:P150 ?answer }","paraphrases":["The nation of Catania has which cities?"],"info":{}}
{"id":"train_1411","question":"who opposite of manifestation  of figure of the earth ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q437882 wdt:P1557 ?X . ?X wdt:P461 ?answer }","paraphrases":["Which is the opposite of manifestation of figure of the earth?"],"info":{}}
{"id":"train_1412","question":"How many people own a Nissan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q20165 wdt:P1830 ?obj }","paraphrases":["Nissans are owned by how many people?"],"info":{}}
{"id":"train_1413","question":"What {county seat in}{Hamilton} has a {population} of {51,000.0}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q30985 wdt:P1376 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '51000.0' ) ) }","paraphrases":["What {province situate in}{Hamilton} encompasses a {populace} of {51,000.0}?"],"info":{}}
{"id":"train_1414","question":"What is the location and height of the pole vault recorded by Eliza McCartney?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q18011042 . ?s pq:P276 ?value1 . ?s pq:P2048 ?value2 }","paraphrases":["What is the location and height of Eliza Mccartney's pole vault?"],"info":{}}
{"id":"train_1415","question":"When was BP the headquarters location of London?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q152057 p:P159 ?s . ?s ps:P159 wd:Q84 . ?s pq:P969 ?value }","paraphrases":["During what time was the BP headquarters located in London?"],"info":{}}
{"id":"train_1417","question":"Which is measured by  quantity of erg ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q185153 wdt:P111 ?X . ?X wdt:P1880 ?answer }","paraphrases":["What is measured by the amount of erg?"],"info":{}}
{"id":"train_1421","question":"What game platform of Pac-Man has the latest release version of 4.2.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q173626 wdt:P400 ?answer . ?answer wdt:P348 ?x FILTER ( contains ( ?x , '4.2.6' ) ) }","paraphrases":["Which Pac - Man game platform has the latest 4.2.6 release?"],"info":{}}
{"id":"train_1423","question":"What is the official name for Taos Pueblo which is designated as a World Heritage Site?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q252814 p:P1435 ?s . ?s ps:P1435 wd:Q9259 . ?s pq:P1448 ?value }","paraphrases":["The designated World Heritage Site, Taos Pueblo, has what official name?"],"info":{}}
{"id":"train_1424","question":"What part of the Jordan River has the coordinates 35.5583?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q40059 p:P625 ?s . ?s ps:P625 ?x filter ( contains ( ?x , '35.5583' ) ) . ?s pq:P518 ?value }","paraphrases":["Coordinate 35.5583 is the coordinate for what part of the Jordan River?"],"info":{}}
{"id":"train_1426","question":"Which color appears in Rocketeer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13476036 wdt:P1441 ?X . ?X wdt:P462 ?answer }","paraphrases":["What is the color of Rocketeer?"],"info":{}}
{"id":"train_1428","question":"How many leagues are in the National Hockey League?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P118 wd:Q1215892 }","paraphrases":["how many leagues are in natinal hockey league?"],"info":{}}
{"id":"train_1430","question":"What political border does the Congress of Vienna have cause to be interested in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P828 wd:Q46362 . ?sbj wdt:P31 wd:Q1292279 }","paraphrases":["Which is the political border Congress of Vienna have cause?"],"info":{}}
{"id":"train_1431","question":"Foil is used in what type of sports competition?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2416 wd:Q471447 }","paraphrases":["What type of sports competition uses foil?"],"info":{}}
{"id":"train_1432","question":"What is capital of Ōtsu ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q202907 wdt:P1376 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1433","question":"What is the namesake of the Riemann zeta function, which has the Cauchy–Euler equation in its significant works?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q187235 wdt:P138 ?answer . ?answer wdt:P800 wd:Q1196465 }","paraphrases":["What is the namesake of the Riemann zeta work, which has the Cauchy–Euler condition in its noteworthy works?"],"info":{}}
{"id":"train_1434","question":"What is the INEGI municipality ID of Tlalnepantla de Baz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q845307 wdt:P3801 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1437","question":"Is Dublin located next to the Liffey and the Royal Canal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1761 wdt:P206 wd:Q208009 . wd:Q1761 wdt:P206 wd:Q1542268 }","paraphrases":["Is it true that Dublin is located next to the Liffey and the Royal Canal?"],"info":{}}
{"id":"train_1438","question":"Tell me the United States federal executive department that contains the word department in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q910252 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'department' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the Joined together States government official office that contains the word division in their name"],"info":{}}
{"id":"train_1442","question":"Where will be Namada after she leaves river source?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q234004 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }","paraphrases":["When Namada leaves the river, where will she be?"],"info":{}}
{"id":"train_1443","question":"Which is the Hederich encyclopedia article ID of Hades?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41410 wdt:P2272 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1444","question":"what is the {represents} for {North Atlantic Treaty} that has {signatory} as {Dean Acheson} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q877399 p:P1891 ?s . ?s ps:P1891 wd:Q214758 . ?s pq:P1268 ?value }","paraphrases":["what signature represents Dean Acheson regarding the North Atlantic Treaty?"],"info":{}}
{"id":"train_1445","question":"IS THE BITE FORCE QUOTIENT OF THE DHOLE EQUALS 132","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q132585 wdt:P3485 ?obj filter ( ?obj = 132 ) }","paraphrases":["IS THE Nibble Drive Remainder OF THE DHOLE Rises to 132"],"info":{}}
{"id":"train_1448","question":"How many children are out of school at Wish You a Merry Christmas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q252123 wdt:P495 ?X . ?X wdt:P2573 ?answer }","paraphrases":["What number of youngsters are out of school at Wish You a Merry Christmas?"],"info":{}}
{"id":"train_1450","question":"Who influenced Anna Akhmatova who was born on May 26th, 1799.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q80440 wdt:P737 ?answer . ?answer wdt:P569 ?x FILTER ( contains ( YEAR ( ?x ) , '1799' ) ) }","paraphrases":["Who impacted Anna Akhmatova who was born on May 26th, 1799."],"info":{}}
{"id":"train_1452","question":"Tell me the scientific model that starts with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q193946 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the logical demonstrate that begins with the letter w"],"info":{}}
{"id":"train_1453","question":"Who won the Battle of Austerlitz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P607 wd:Q134114 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who declared victory during the Battle of Austerlitz?"],"info":{}}
{"id":"train_1454","question":"Of the 2015 Baga massacre, does the number of those missing equal 2000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q18732673 wdt:P1446 ?obj filter ( ?obj = 2000 ) }","paraphrases":["Are there 2000 people missing as a result of the 2015 Baga massacre?"],"info":{}}
{"id":"train_1455","question":"Is there a Thanksgiving in Panama?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13959 wdt:P276 wd:Q804 }","paraphrases":["Does Panama have a Thanksgiving?"],"info":{}}
{"id":"train_1457","question":"What is warning of Shahada, that has Women in Red banner is Arabic WV banner.jpg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41831 wdt:P407 ?answer . ?answer wdt:P948 ?x FILTER ( contains ( ?x , 'Arabic WV banner.jpg' ) ) }","paraphrases":["What is warning of Shahada, that has Women in Red banner is Arabic WV banner.jpg?"],"info":{}}
{"id":"train_1459","question":"When did Wes Craven divorce Bonnie Broecker?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q223992 p:P26 ?s . ?s ps:P26 wd:Q20894422 . ?s pq:P582 ?value }","paraphrases":["When did Wes Craven and  Bonnie Broecker get separated?"],"info":{}}
{"id":"train_1461","question":"What field of work does Porfirio Díaz do?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q150688 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["Profirio Diaz works in what?"],"info":{}}
{"id":"train_1462","question":"WHO COMES BEFORE OR AFTER ESTONIAN SOVIET SOCIALIST REPBULIC?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q130280 wdt:P155 ?X . ?X wdt:P156 ?answer }","paraphrases":["WHO COMES BEFORE OR AFTER ESTONIAN SOVIET SOCIALIST REPBULIC?"],"info":{}}
{"id":"train_1463","question":"In what instances has Fernando Pessoa been compared to Jean Seul de Méluret?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q173481 p:P460 ?s . ?s ps:P460 wd:Q21028930 . ?s pq:P31 ?value }","paraphrases":["In what occurrences has Fernando Pessoa been compared to Jean Seul de Méluret?"],"info":{}}
{"id":"train_1464","question":"What awarded Peter Sellers was nominated for at 37th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q177984 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917138 }","paraphrases":["Which award was Peter Sellers nominated for at the 37th Academy Awards?"],"info":{}}
{"id":"train_1465","question":"Tell me phantom island  whose name has the word tuanaki in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q129264 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tuanaki' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which phantom island contains the word tunaki in it"],"info":{}}
{"id":"train_1468","question":"What is the union for Airbus A320s?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q6475 wdt:P2738 ?obj . ?obj wdt:P31 wd:Q15056995 }","paraphrases":["What is the union for Airbus A320s?"],"info":{}}
{"id":"train_1469","question":"What writing system does Arabic use?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2283 wd:Q8196 . ?sbj wdt:P31 wd:Q11077643 }","paraphrases":["What composing framework does Arabic use?"],"info":{}}
{"id":"train_1470","question":"Is it true that the publication interval of the Cuore is less than 1.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2756124 wdt:P2896 ?obj filter ( ?obj < 1.2 ) }","paraphrases":["Is it genuine that the distribution interim of the Cuore is less than 1.2?"],"info":{}}
{"id":"train_1471","question":"What was the significant event that happened to Jean Gabin in 1976?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23842 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1976' ) ) }","paraphrases":["In 1976, what significant event did Jean Gabin experience?"],"info":{}}
{"id":"train_1472","question":"What was the inflation rate of Portugal during 1993-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q45 p:P1279 ?s . ?s ps:P1279 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1993' ) ) }","paraphrases":["What was the rate of inflation on Portugal during 1993-1-1?"],"info":{}}
