{"id":"train_14149","question":"Which is the programming language of Bitcoin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q131723 wdt:P277 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14151","question":"operator}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q660668 . ?ent wdt:P1099 ?obj . ?ent wdt:P137 wd:Q7440716 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["-"],"info":{}}
{"id":"train_14152","question":"Where was Anthony Mundine educated.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q614952 wdt:P69 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14155","question":"Is the enthalpy of vaporization of the DL-methyl lactate less than 35.76?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q11370589 wdt:P2116 ?obj filter ( ?obj < 35.76 ) }","paraphrases":["Does the DL-methyl lactate have an enthalpy of vaporization that's less than 35.76?"],"info":{}}
{"id":"train_14156","question":"australian","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q27020041 . ?ent wdt:P3260 ?obj . ?ent wdt:P641 wd:Q50776 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Australian territory"],"info":{}}
{"id":"train_14157","question":"Which is the Lega Serie A team ID for Juventus F.C.?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1422 wdt:P5424 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14161","question":"When did Geeta Dutt get married and divorced?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q470416 p:P26 ?s . ?s ps:P26 wd:Q149136 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["Geeta Dutt get married"],"info":{}}
{"id":"train_14162","question":"Name the private educational institution in Berlin with the most students ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23002042 . ?ent wdt:P2196 ?obj . ?ent wdt:P159 wd:Q64 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What private school in Berlin has the most students?"],"info":{}}
{"id":"train_14164","question":"What is the male version of the name Abu Bakr","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q334923 wdt:P735 ?obj . ?obj wdt:P31 wd:Q12308941 }","paraphrases":["What is the male adaptation of the title Abu Bakr"],"info":{}}
{"id":"train_14165","question":"What is Maurice Merleau-Ponty's Itunes artist ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q212639 wdt:P2850 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14166","question":"What is the address of the École Polytechnique, with a street number of 22?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q273626 p:P669 ?s . ?s ps:P669 ?obj . ?s pq:P670 ?x filter ( contains ( ?x , '22' ) ) }","paraphrases":["Does Ecole Polytechnique street address number have 22"],"info":{}}
{"id":"train_14167","question":"\"Which equation is often confused with thereof Pi, which comes before the letter P?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q167 wdt:P1889 ?answer . ?answer wdt:P156 wd:Q14412 }","paraphrases":["\"Which equation is frequently careworn with thereof Pi, which comes before the letter P?\""],"info":{}}
{"id":"train_14169","question":"In what sport did Agnes Miegel receive a 1st place medal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q67013 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["In what don did Agnes Miegel get a 1st put medal?"],"info":{}}
{"id":"train_14171","question":"Which is the puppet state of the capital of Vilnius?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q216 . ?sbj wdt:P31 wd:Q208164 }","paraphrases":["Which is the manikin state of the capital of Vilnius?"],"info":{}}
{"id":"train_14172","question":"What is the production date for The Barber of Seville?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q208659 wdt:P2754 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14174","question":"What is the name of a sibling duo that starts with the letter v.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q14073567 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a kin twosome that begins with the letter v."],"info":{}}
{"id":"train_14175","question":"Which is the presidential system for Joko Widodo in the head of government?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q3318231 . ?sbj wdt:P31 wd:Q49892 }","paraphrases":["What is the presidential system in the head of government for Joko Widodo?"],"info":{}}
{"id":"train_14178","question":"Name the least flammable nitrogen-containing class IIIB combustible liquid","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009059 . ?ent wdt:P2202 ?obj . ?ent wdt:P527 wd:Q627 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What class IIIB combustible liquid that contains nitrogen is the least flammable?"],"info":{}}
{"id":"train_14179","question":"What was Melinda Gates' academic major and degree when she studied at Duke University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q463877 p:P69 ?s . ?s ps:P69 wd:Q168751 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What was once Melinda Gates' educational predominant and degree when she studied at Duke University?"],"info":{}}
{"id":"train_14180","question":"\"What academic supervisor of Al-Shafi'i, encompasses a similar religious affiliation as Sunni Islam?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q294281 wdt:P1066 ?answer . ?answer wdt:P140 wd:Q483654 }","paraphrases":["\"What scholastic boss of Al-Shafi'i, envelops a comparative devout alliance as Sunni Islam?\""],"info":{}}
{"id":"train_14181","question":"What legislative body of West Virginia has a part in the West Virginia House of Delegates?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1371 p:P194 ?s . ?s ps:P194 ?obj . ?s pq:P527 wd:Q320278 }","paraphrases":["In West Virginia, what body of the legislature has a role in the House of Delegates?"],"info":{}}
{"id":"train_14182","question":"Is the Keret House 2 floors above ground?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q38985 wdt:P1101 ?obj filter ( ?obj = 2 ) }","paraphrases":["How many floors above ground is the Keret House?"],"info":{}}
{"id":"train_14183","question":"What is the United Arab Emirates diplomatic relation to Serbia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q878 p:P530 ?s . ?s ps:P530 wd:Q403 . ?s pq:P805 ?value }","paraphrases":["What is the diplomatic relationship of the United Arab Emirates and Serbia?"],"info":{}}
{"id":"train_14184","question":"When did Axel Oxenstierna serve as Lord High Chancellor of Sweeden, and when did his service end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q155127 p:P39 ?s . ?s ps:P39 wd:Q3259383 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["When did Axel Oxenstierna serve as Lord High Chancellor of Sweeden, and when did his service end?"],"info":{}}
{"id":"train_14187","question":"What is the time zone in the Kochi continent?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1800 wdt:P30 ?X . ?X wdt:P421 ?answer }","paraphrases":["What is the Kochi Continent's time zone?"],"info":{}}
{"id":"train_14188","question":"What film character was inspired by George II of Great Britain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P941 wd:Q131981 . ?sbj wdt:P31 wd:Q15773347 }","paraphrases":["What film character was motivated by George II of Awesome Britain?"],"info":{}}
{"id":"train_14192","question":"Tell me me a war deity whose name consist of the word \"wadjet\" and whoseworshipped by religion of ancient Egypt","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41863069 . ?sbj wdt:P1049 wd:Q447131 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wadjet' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a war deity whose name is \"wadjet\" and adorned by the ancient Egyptian religion"],"info":{}}
{"id":"train_14194","question":"Tell me about a legal case applying to jurisdiction of the Supreme Court of the United states and contains the word Maryland in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2334719 . ?sbj wdt:P1001 wd:Q11201 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'maryland' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know almost a legitimate case applying to locale of the Incomparable Court of the Joined together states and contains the word Maryland in their title"],"info":{}}
{"id":"train_14195","question":"What medication is used to treat cocaine addiction","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41576 wdt:P769 ?obj . ?obj wdt:P31 wd:Q12140 }","paraphrases":["What medication is used for cocaine addiction treatment?"],"info":{}}
{"id":"train_14196","question":"WHAT IS THE CATALAN OBJECT OF CULTURAL INTEREST ID OF SAGRADA FAMILIA","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q48435 wdt:P1586 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14197","question":"Which talent agency represented Henry Fonda?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q19155 wdt:P1875 ?obj . ?obj wdt:P31 wd:Q5354754 }","paraphrases":["Henry Fonda is represented by which talent agency?"],"info":{}}
{"id":"train_14199","question":"What is the death location, bordered by Gussago, of Carlo Maria Giulini?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q430829 wdt:P20 ?answer . ?answer wdt:P47 wd:Q104653 }","paraphrases":["What is the passing area, bordered by Gussago, of Carlo Maria Giulini?"],"info":{}}
{"id":"train_14200","question":"What is the emblem of Notre Dame in Paris","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2981 wdt:P708 ?obj . ?obj wdt:P31 wd:Q2072238 }","paraphrases":["What is the symbol of Notre Lady in Paris"],"info":{}}
{"id":"train_14202","question":"Who received an Academy Award for Best Supporting Actor for Spartacus?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q108297 p:P166 ?s . ?s ps:P166 wd:Q106291 . ?s pq:P1346 ?value }","paraphrases":["Who won the Academy Award for Best Supporting Actor for Spartacus?"],"info":{}}
{"id":"train_14203","question":"Who was nominated for the Academy Award for Best Director for The Third Man?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q271830 p:P1411 ?s . ?s ps:P1411 wd:Q103360 . ?s pq:P2453 ?value }","paraphrases":["What's the name of the director who earned their Oscar nomination for the movie The Third Man?"],"info":{}}
{"id":"train_14204","question":"Did Richard Branson own eDreams?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q194419 wdt:P1830 wd:Q696009 }","paraphrases":["Did Richard Branson claim eDreams?"],"info":{}}
{"id":"train_14205","question":"Which award did Elie Wiesel receive in 1968?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q18391 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1968' ) ) }","paraphrases":["Which award was given to Elie Wiesel in 1968?"],"info":{}}
{"id":"train_14207","question":"When was Leslie Caron's Academy Award nomination for Best Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q230023 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P585 ?value }","paraphrases":["Leslie Caron was nominated for an Academy Award for Best Actress on what date?"],"info":{}}
{"id":"train_14210","question":"What is the main building \"Harry Potter\" is set in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q8337 . ?sbj wdt:P31 wd:Q15720793 }","paraphrases":[],"info":{}}
{"id":"train_14213","question":"What was the academic discipline of Giovanni Bellini that influenced his paintings?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17169 wdt:P101 ?answer . ?answer wdt:P1056 wd:Q3305213 }","paraphrases":["What was the scholastic teach of Giovanni Bellini that impacted his depictions?"],"info":{}}
{"id":"train_14215","question":"What is often confused with the badge, that is part of the series that is Law & Order: Criminal Intent?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q799000 wdt:P1889 ?answer . ?answer wdt:P179 wd:Q1055728 }","paraphrases":["What is frequently stressed with the badge, that is phase of the series that is Law & Order: Criminal Intent?"],"info":{}}
{"id":"train_14218","question":"What's the human difference to Magic Johnson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q134183 wdt:P1889 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What's the human contrast to Enchantment Johnson?"],"info":{}}
{"id":"train_14219","question":"When was Menachem Begins Minister without portfolio?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q130873 p:P39 ?s . ?s ps:P39 wd:Q15733044 . ?s pq:P642 ?value }","paraphrases":["On what date was Menachem Begins Minister without portfolio?"],"info":{}}
{"id":"train_14220","question":"Who gave the {AWLD status} of {second language} of {Jean Dujardin} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q189422 wdt:P1412 ?X . ?X wdt:P1999 ?answer }","paraphrases":["Who gave the {AWLD status} of {second language} of {Jean Dujardin} ?"],"info":{}}
{"id":"train_14221","question":"George Weah is in which public office?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1308 wd:Q173139 . ?sbj wdt:P31 wd:Q294414 }","paraphrases":["George Weah is in which open office?"],"info":{}}
{"id":"train_14222","question":"Who is the record producer, who also has work as a structural engineer, of Scooby Doo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q205683 wdt:P162 ?answer . ?answer wdt:P106 wd:Q1779650 }","paraphrases":["Who is the file producer, who additionally has work as a structural engineer, of Scooby Doo?"],"info":{}}
{"id":"train_14223","question":"What was the population of Kerala in 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1186 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["Which was the population number of Kerala in 2011?"],"info":{}}
{"id":"train_14227","question":"Where is the place of Thomas Gray located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q315516 wdt:P119 ?X . ?X wdt:P47 ?answer }","paraphrases":["Where is the put of Thomas Gray located?"],"info":{}}
{"id":"train_14229","question":"In what manner did Albrecht von Wallenstein die that was distinguishable from a justifiable homicide?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q153545 wdt:P1196 ?answer . ?answer wdt:P1889 wd:Q6317275 }","paraphrases":["In what manner did Albrecht von Wallenstein die that was distinguishable from a justifiable homicide?"],"info":{}}
{"id":"train_14231","question":"What award did George F. Kennan receive in 1957?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q156058 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1957' ) ) }","paraphrases":["which award was George F. Kennan short listed in 1957"],"info":{}}
{"id":"train_14232","question":"Who is the {international airport} for {item operated} of {Delta Air Lines}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P121 wd:Q188920 . ?sbj wdt:P31 wd:Q644371 }","paraphrases":["Who is the {universal air terminal} for {thing worked} of {Delta Discuss Lines}"],"info":{}}
{"id":"train_14233","question":"Give me the solar optical telescope with the largest angular resolution.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1238291 . ?ent wdt:P3439 ?obj . ?ent wdt:P31 wd:Q35273 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Give me the photo voltaic optical telescope with the greatest angular resolution."],"info":{}}
{"id":"train_14234","question":"When did Romain Rolland with the Prix Femina?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47162 p:P166 ?s . ?s ps:P166 wd:Q18945 . ?s pq:P585 ?value }","paraphrases":["What year did Romain Rolland win the Prix Femina?"],"info":{}}
{"id":"train_14236","question":"What are the comedic genre which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5151404 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the comedic class which begin with the letter s"],"info":{}}
{"id":"train_14239","question":"Which is the Indianapolis Museum of Art artwork ID for Whistler's Mother?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q687182 wdt:P4674 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14240","question":"Where were the borders of the Adams-Onis Treaty?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q351722 wdt:P1891 ?X . ?X wdt:P47 ?answer }","paraphrases":["Where were the borders of the Adams-Onis Treaty?"],"info":{}}
{"id":"train_14241","question":"Which language pronounces cherry as Fr-cerise.ogg?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q196 p:P443 ?s . ?s ps:P443 ?x filter ( contains ( ?x , 'Fr-cerise.ogg' ) ) . ?s pq:P407 ?value }","paraphrases":["In which language cherry is converse as Fr-cerise.ogg ?"],"info":{}}
{"id":"train_14243","question":"Is the Scoville grade of the Cayenne pepper equal to 30000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6598 wdt:P2658 ?obj filter ( ?obj = 30000 ) }","paraphrases":["Does the Scoville grade of the Cayenne pepper equal 30000?"],"info":{}}
{"id":"train_14245","question":"What people and geography are associated with Cornwall?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q23148 wdt:P1792 ?ans_1 . wd:Q23148 wdt:P2633 ?ans_2 }","paraphrases":["Conwall is generally associated with what geographical region, in terms of population?"],"info":{}}
{"id":"train_14248","question":"Who is the incumbent of the political office held by Arthur Drewry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q312664 wdt:P39 ?X . ?X wdt:P1308 ?answer }","paraphrases":["Who is Arthur Drewry's incumbent political office?"],"info":{}}
{"id":"train_14249","question":"Was Mark Twain a journalist and humorist?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7245 wdt:P106 wd:Q1930187 . wd:Q7245 wdt:P106 wd:Q12406482 }","paraphrases":["Is Mark Twain known as a humorist and journalist?"],"info":{}}
{"id":"train_14250","question":"which positioning number for Al Smith (also using the name Alfred)?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q430714 p:P735 ?s . ?s ps:P735 wd:Q3480335 . ?s pq:P1545 ?value }","paraphrases":["Al (Alfred) Smith's positioning number."],"info":{}}
{"id":"train_14251","question":"What was the number of out of school children at East Asia at 2004-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q27231 p:P2573 ?s . ?s ps:P2573 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["On January 1, 2004, how many school children were out of school?"],"info":{}}
{"id":"train_14254","question":"Which musical is based off of Candide?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P144 wd:Q215894 . ?sbj wdt:P31 wd:Q2743 }","paraphrases":["Which melodic is dependent on Candide?"],"info":{}}
{"id":"train_14256","question":"Mudanjiang is located in which time zone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q217646 wdt:P421 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14257","question":"What award did Elizabeth Loftus receive for psychology?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q262154 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q9418 }","paraphrases":["What award did Elizabeth Loftus receive?"],"info":{}}
{"id":"train_14258","question":"L-Arginine is encoded by how many?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q173670 wdt:P702 ?obj }","paraphrases":["How many encode L-Arginine?"],"info":{}}
{"id":"train_14261","question":"Which are the means of locomotion for Palaeognathae?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q19166 wdt:P3512 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14265","question":"Which rural cities have movable object location from Crimean War?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q254106 wdt:P276 ?X . ?X wdt:P150 ?answer }","paraphrases":["Which provincial cities have mobile protest area from Crimean War?"],"info":{}}
{"id":"train_14267","question":"Rabah Madjer belongs to which sports team and in how many matches did he represent them?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q431343 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["What team does Rabah Madjer play for and how many matches did he play for them?"],"info":{}}
{"id":"train_14268","question":"When did the Republic of Congo have a particular population?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q971 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '1.1579e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["A particular population was present in the Republic of Congo when?"],"info":{}}
{"id":"train_14270","question":"What is the capital of Japan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q188712 wdt:P36 ?obj . ?obj wdt:P31 wd:Q5119 }","paraphrases":["What's Japan's capital?"],"info":{}}
{"id":"train_14271","question":"WHAT IS ISLAND OF LOCATION OF MONTREAL","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P5130 wd:Q292354 }","paraphrases":[],"info":{}}
{"id":"train_14272","question":"Who is mother of Cloris Leachman","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P25 wd:Q230131 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Title a parent taxon of Spinacia oleracea"],"info":{}}
{"id":"train_14274","question":"Was Michael Phelps a participant of the 2010 Winter Olympic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q39562 wdt:P1344 wd:Q9674 }","paraphrases":["In 2010, was Michael Phelps an athlete in the Olympics?"],"info":{}}
{"id":"train_14275","question":"How many contributions to published work by ABC?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3919 wd:Q287076 }","paraphrases":["ABC has how many contributions to published work?"],"info":{}}
{"id":"train_14276","question":"Where was Lucius Cornelius Sulla, of Roman Republic, born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q483783 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q17167 }","paraphrases":["Lucius Cornelius sulla of Roman Republic was born where?"],"info":{}}
{"id":"train_14277","question":"Which is the mythical human-animal hybrid that is worshiped by Greek mythology and starts with the letter m?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20902363 . ?sbj wdt:P1049 wd:Q34726 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the legendary human-animal hybrid that is worshiped by Greek mythology and begins with the letter m?"],"info":{}}
