{"id":"train_6941","question":"Name a traditional fairy tale that starts with letter S","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q42402646 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a conventional pixie story that begins with letter S"],"info":{}}
{"id":"train_6944","question":"Does the surface tension of the undecane equal 17.45?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q150731 wdt:P3013 ?obj filter ( ?obj = 17.45 ) }","paraphrases":["Is the undercane surface tension 17.45?"],"info":{}}
{"id":"train_6945","question":"What gene is associated with breast cancer by a Genome-wide association study?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q128581 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q1098876 }","paraphrases":["In a Genome-wide association study, what gene is associated with breast cancer?"],"info":{}}
{"id":"train_6946","question":"Lawrence Summers was educated at which university and gained which degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q317953 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P512 ?value1 . }","paraphrases":["Lawrence Summers was educated at which university and which degree was obtained?"],"info":{}}
{"id":"train_6947","question":"What facilities does the Hartsfield-Jackson Atlanta International Airport have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q214861 wdt:P912 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6949","question":"which poem contains the word prymskvioa in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5185279 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'þrymskviða' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which poem contains in its name the word prymskvioa"],"info":{}}
{"id":"train_6950","question":"Competitive snowboarding has how many sports discipline's?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2416 wd:Q178131 }","paraphrases":["Which is the number of sports discipline that competitive snowboarding has?"],"info":{}}
{"id":"train_6951","question":"Which is the newspaper owned by the Australian Football League?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P127 wd:Q50783 . ?sbj wdt:P31 wd:Q11032 }","paraphrases":[],"info":{}}
{"id":"train_6952","question":"At what time did Ulaanbaatar have a population of 1.372e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23430 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '1.372e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["When did Ulaanbaatar have a population of 1.372e+06?"],"info":{}}
{"id":"train_6953","question":"Name a W3C Recommendation that starts with letter X","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2661442 . ?sbj wdt:P1462 wd:Q37033 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a W3C Suggestion that begins with letter X"],"info":{}}
{"id":"train_6954","question":"When did Zakopane become part of the Kingdom of Galicia and Lodomeria?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q144786 p:P131 ?s . ?s ps:P131 wd:Q2396442 . ?s pq:P580 ?value }","paraphrases":["When did Zakopane join the Kingdom of Galicia and Lodomeria?"],"info":{}}
{"id":"train_6955","question":"In which country is Syracuse that is the birth place of Megyn Kelly?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q293260 p:P19 ?s . ?s ps:P19 wd:Q128069 . ?s pq:P17 ?value }","paraphrases":["Megan Kelly's birthplace, Syracuse, is located in which country?"],"info":{}}
{"id":"train_6956","question":"Which year is the beginning of Russian Empire?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q34266 p:P122 ?s . ?s ps:P122 wd:Q184558 . ?s pq:P580 ?value }","paraphrases":["Which year marked the beginning of the Russian Empire?"],"info":{}}
{"id":"train_6958","question":"What Denmark hotel has the least angle from vertical?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q27686 . ?ent wdt:P4183 ?obj . ?ent wdt:P17 wd:Q35 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Name the hotel that has the least angle from vertical located in Denmark."],"info":{}}
{"id":"train_6961","question":"When was Sun Wen a member of the sports team Atlanta Beat?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q253223 p:P54 ?s . ?s ps:P54 wd:Q4816008 . ?s pq:P580 ?value }","paraphrases":["How many years did Sun Wen remain as a member of the sports team Atlanta Beat?"],"info":{}}
{"id":"train_6963","question":"Which architect, who also designed the Jewish Museum in Berlin, was honored with the Buber-Rosenzweig-Medal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q157003 wdt:P84 ?answer . ?answer wdt:P166 wd:Q278778 }","paraphrases":["Which architect, who additionally designed the Jewish Museum in Berlin, was once honored with the Buber-Rosenzweig-Medal?"],"info":{}}
{"id":"train_6964","question":"Which spouse did Henry III of France have in 1589-8-2.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q53448 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1589' ) ) }","paraphrases":["Who was the wife of Henry III of France in 1589?"],"info":{}}
{"id":"train_6967","question":"What is the reason for Kosovo sharing a border with Albania?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1246 p:P47 ?s . ?s ps:P47 wd:Q222 . ?s pq:P805 ?value }","paraphrases":["Kosobo shared a border with Albania, why?"],"info":{}}
{"id":"train_6969","question":"What's the phase point of the critical point?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P873 wd:Q111059 }","paraphrases":["What is the critical point's phase point?"],"info":{}}
{"id":"train_6971","question":"Name the capital city Aung San Suu Kyi lives in.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q36740 wdt:P551 ?obj . ?obj wdt:P31 wd:Q5119 }","paraphrases":[],"info":{}}
{"id":"train_6972","question":"Has Jeremy Corbyn lived in Finsbury Park?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q291169 wdt:P551 wd:Q122566 }","paraphrases":["Did Jeremy Corbyn live in Finsbury Park?"],"info":{}}
{"id":"train_6973","question":"What is the zipcode William Stukeley died in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1381018 wdt:P20 ?X . ?X wdt:P281 ?answer }","paraphrases":["What is the zipcode William Stukeley passed on in?"],"info":{}}
{"id":"train_6977","question":"What is FIS cross-country skier ID for Marit Bjørgen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q216256 wdt:P2773 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6978","question":"What sport rewards the FIFA World Cup?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q19317 wdt:P641 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6979","question":"What is the Neurolex ID for the parietal lobe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q815334 wdt:P696 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6980","question":"gsdfhgdfh","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1149738 wdt:P676 ?answer . ?answer wdt:P1477 ?x FILTER ( contains ( ?x , 'Antonio Romero Márquez' ) ) }","paraphrases":["gsdfhgdfh"],"info":{}}
{"id":"train_6981","question":"When was Peter Zumthor awarded the Arts and Culture Prize of German Catholics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q123179 p:P166 ?s . ?s ps:P166 wd:Q1514013 . ?s pq:P585 ?value }","paraphrases":["What year did Peter Zumthor get awarded the Arts and Culture Prize?"],"info":{}}
{"id":"train_6982","question":"When did the Grateful Dead receive the Grammy for Lifetime Achievement Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q212533 p:P166 ?s . ?s ps:P166 wd:Q935843 . ?s pq:P585 ?value }","paraphrases":["When did the Grateful Dead get the Grammy for Lifetime Achievement Award?"],"info":{}}
{"id":"train_6983","question":"Tell me pavo whose name has the word peacock in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3917160 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'peacock' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know pavo whose title has the word peacock in it."],"info":{}}
{"id":"train_6986","question":"What is Ronaldo's Mackolik.com Player ID","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q529207 wdt:P2458 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6987","question":"What is the pharmaceutical product for which cocaine is active ingredient?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3781 wd:Q41576 . ?sbj wdt:P31 wd:Q28885102 }","paraphrases":["What is the pharmaceutical item for which cocaine is dynamic ingredient?"],"info":{}}
{"id":"train_6988","question":"What is in the category of György Lukács?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q151523 wdt:P4619 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6989","question":"Is the production rate of Somontano the same as 144093.6","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1938017 wdt:P2197 ?obj filter ( ?obj = 144093.6 ) }","paraphrases":["Is Somontano's production rate 144093.6?"],"info":{}}
{"id":"train_6990","question":"When did John Frederick William Herschel receive the Copley Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q14278 p:P166 ?s . ?s ps:P166 wd:Q28003 . ?s pq:P585 ?value }","paraphrases":["Give me the date that John Frederick William Herschel received the Copley Medal."],"info":{}}
{"id":"train_6991","question":"Which inventor or discoverer with the profession of astronomer discovered 90377 Sedna?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15610 wdt:P61 ?answer . ?answer wdt:P106 wd:Q11063 }","paraphrases":["Which inventor or discoverer with the profession of astronomer determined 90377 Sedna?"],"info":{}}
{"id":"train_6992","question":"Who are the women who voiced part of Naked to the Limit, One More Time?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51164989 wdt:P179 ?X . ?X wdt:P725 ?answer }","paraphrases":["Who are the ladies who voiced portion of Bare to the Constrain, One More Time?"],"info":{}}
{"id":"train_6993","question":"Which mosque is named after Suleiman the Magnificent?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P138 wd:Q8474 . ?sbj wdt:P31 wd:Q32815 }","paraphrases":["Which mosque is named after Suleiman the Radiant?"],"info":{}}
{"id":"train_6994","question":"What is first described in tide with praenomen Gaius?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23384 wdt:P61 ?answer . ?answer wdt:P2358 wd:Q5517401 }","paraphrases":["What is first described in tide with praenomen Gaius?"],"info":{}}
{"id":"train_6995","question":"What association football league that starts with the letter \"s\" is organized by the Italian Football Federation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15991303 . ?sbj wdt:P664 wd:Q201897 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What affiliation football alliance that begins with the letter \"s\" is organized by the Italian Football League?"],"info":{}}
{"id":"train_6997","question":"\"Where is the birthplace of Hugh Owen Thomas, which has the global point 53.293975° N, -4.376728° W?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1634494 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '53.293975 -4.376728' ) ) }","paraphrases":["\"Where is the birthplace of Hugh Owen Thomas, which has the global factor 53.293975° N, -4.376728° W?\""],"info":{}}
{"id":"train_6998","question":"What is material used of water ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P186 wd:Q283 }","paraphrases":[],"info":{}}
{"id":"train_6999","question":"In what town is Taekyeung College?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q491524 wdt:P17 ?X . ?X wdt:P150 ?answer }","paraphrases":["In what town is Taekyeung College?"],"info":{}}
{"id":"train_7000","question":"Tell me the number of goals scored and matched played by Zico from the Kashima Antlers.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q47526 p:P54 ?s . ?s ps:P54 wd:Q16932 . ?s pq:P1351 ?value1 . ?s pq:P1350 ?value2 }","paraphrases":["Tell me how many goals Zico played from the Kashima Antlers scored and matched."],"info":{}}
{"id":"train_7001","question":"Does the argument of periapsis of 8680 Rone equal 1.080852?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q644778 wdt:P2248 ?obj filter ( ?obj = 1.080852 ) }","paraphrases":["Does the contention of periapsis of 8680 Rone rise to 1.080852?"],"info":{}}
{"id":"train_7002","question":"Tell me the component that has the shape of hyperboloid and starts with the letter c?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1310239 . ?sbj wdt:P1419 wd:Q505628 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the aspect that has the shape of hyperboloid and starts with the letter c?"],"info":{}}
{"id":"train_7004","question":"Which is the significant event for A-League?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P793 wd:Q219586 }","paraphrases":[],"info":{}}
{"id":"train_7005","question":"What {source material} is the {buff coat} {made from}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3373195 wdt:P186 ?X . ?X wdt:P1582 ?answer }","paraphrases":["What {source material} is the {buff coat} {made from}?"],"info":{}}
{"id":"train_7006","question":"Who are the children of Jens Breivik's husband?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19376205 wdt:P26 ?X . ?X wdt:P40 ?answer }","paraphrases":["Tell me who Jens Breivik's spouse's children are?"],"info":{}}
{"id":"train_7007","question":"How many out of school children did Central Asia count in 2007?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q27275 p:P2573 ?s . ?s ps:P2573 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2007' ) ) }","paraphrases":["In 2007, how many out of school children were in Central Asia?"],"info":{}}
{"id":"train_7008","question":"Who is the head general of this branch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5531647 wdt:P241 ?X . ?X wdt:P607 ?answer }","paraphrases":["Who is the head common of this department?"],"info":{}}
{"id":"train_7009","question":"Are there more than 0.8 seasons of Supertrain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q367772 wdt:P2437 ?obj filter ( ?obj > 0.8 ) }","paraphrases":["Did Supertrain have more than 0.8 seasons?"],"info":{}}
{"id":"train_7011","question":"Which republic with the a minimal nominal GDP is a member of the International Finance Corporation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7270 . ?ent wdt:P2131 ?obj . ?ent wdt:P463 wd:Q656801 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which republic possessing a nominal GDP of minimal is a member of the International Finance Corporation?"],"info":{}}
{"id":"train_7012","question":"Did Amitabh Bachchan speak the Hindi-Urdu language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9570 wdt:P1412 wd:Q11051 }","paraphrases":["Was the Hindi-Urdu language spoken by Amitabh Bachchan?"],"info":{}}
{"id":"train_7013","question":"In what year was Bette Davis nominated for the Academy Award for Best Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q71206 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value }","paraphrases":["When was Bette Davis nominated for the Academy Award for Best Actress?"],"info":{}}
{"id":"train_7014","question":"What government is headed by the land of Arkhangelsk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1851 wdt:P17 ?X . ?X wdt:P6 ?answer }","paraphrases":["What government is headed by the arrive of Arkhangelsk?"],"info":{}}
{"id":"train_7015","question":"Is William Wilde the father of Oscar Wilde?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q30875 wdt:P22 wd:Q2540254 }","paraphrases":["Is Oscar Wilde William Wilde's son?"],"info":{}}
{"id":"train_7016","question":"What political party did Svetlana Savitskaya's become a member of in 1975?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q152318 p:P102 ?s . ?s ps:P102 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1975' ) ) }","paraphrases":["Svetlana Savitskaya joined which political party in 1975?"],"info":{}}
{"id":"train_7017","question":"What pharmaceutical product has zinc as it's active ingredient?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3781 wd:Q758 . ?sbj wdt:P31 wd:Q28885102 }","paraphrases":["What pharmaceutical item has zinc as it's dynamic fixing?"],"info":{}}
{"id":"train_7018","question":"What is the blood type of Jay Chou?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q238819 wdt:P1853 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7019","question":"who are the film editor, director of Spirited_Away?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q155653 wdt:P1040 ?ans_1 . wd:Q155653 wdt:P57 ?ans_2 }","paraphrases":["who are the film editor, chief of Spirited_Away?"],"info":{}}
{"id":"train_7020","question":"What was the population of the Aland Islands in 1979?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5689 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1979' ) ) }","paraphrases":["What was the Aland Islands' population in 1979?"],"info":{}}
{"id":"train_7021","question":"Which is the capital of Tulunids?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q726798 wdt:P36 ?answer }","paraphrases":[],"info":{}}
{"id":"train_7022","question":"What is the film genre of the musician from Hold me in your arms.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26689546 wdt:P175 ?X . ?X wdt:P136 ?answer }","paraphrases":["What is the film class of the artist from Hold me in your arms."],"info":{}}
{"id":"train_7023","question":"What team did Sourav Ganguly play for starting in 2005?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q561487 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2005' ) ) }","paraphrases":["Which was the first team in 2005 where Sourav Ganguly started?"],"info":{}}
{"id":"train_7024","question":"Mention the award handed over to the daughter of Alexander II of Russia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83171 wdt:P22 ?X . ?X wdt:P166 ?answer }","paraphrases":["The daughter of Alexander II of Russia was handed what award?"],"info":{}}
{"id":"train_7025","question":"What is the cause and place of death of Lewis Carroll?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q38082 wdt:P20 ?ans_1 . wd:Q38082 wdt:P509 ?ans_2 }","paraphrases":["How and where did Lewis Carrol die?"],"info":{}}
{"id":"train_7026","question":"WHEN IS THE ANTONYM EVENT OF MARCELO ARIEL GELMAN SCHBEROFF","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q55222552 wdt:P793 ?X . ?X wdt:P461 ?answer }","paraphrases":["WHEN IS THE ANTONYM Occasion OF MARCELO ARIEL GELMAN SCHBEROFF"],"info":{}}
{"id":"train_7027","question":"Which is the type of music from the work of Guitar Player?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42384429 wdt:P1441 ?X . ?X wdt:P136 ?answer }","paraphrases":["Which is the sort of music from the work of Guitar Player?"],"info":{}}
{"id":"train_7034","question":"What are the moon of Saturn which start with the letter titan","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1972 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'titan' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is Saturn's moon that starts with the titan letter?"],"info":{}}
{"id":"train_7035","question":"Which Android One has the largest maximum size or capacity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q18063397 . ?ent wdt:P3559 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What kind of Android One is the biggest and has the most storage space?"],"info":{}}
{"id":"train_7036","question":"Name an actor of 60 minutes","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q247869 wdt:P161 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Title an on-screen character of 60 minutes"],"info":{}}
{"id":"train_7038","question":"designed","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P287 wd:Q127050 . ?sbj wdt:P31 wd:Q2656967 }","paraphrases":["designed"],"info":{}}
{"id":"train_7039","question":"What is Gery Cori's family name before marriage?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q204733 p:P734 ?s . ?s ps:P734 ?obj . ?s pq:P828 wd:Q8445 }","paraphrases":["What is Gery Cori's family title some time recently marriage?"],"info":{}}
{"id":"train_7040","question":"During the 34th Academy Awards, what awards was the film La Dolce Vita nominated for?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q18407 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q917163 }","paraphrases":["La Dolce Vita was nominated for what categories at the 34th Academy Awards?"],"info":{}}
{"id":"train_7041","question":"What are the borders of Kaifeng that contain the rural city of Fendquan District","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q208471 wdt:P47 ?answer . ?answer wdt:P150 wd:Q1198617 }","paraphrases":["What are the borders of Kaifeng that comprise the rural city of Fendquan District"],"info":{}}
{"id":"train_7042","question":"What is Craig T. Nelson's spoken language whose name is abbreviated английский?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q329807 wdt:P1412 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'английский' ) ) }","paraphrases":["What language did Craig T. Nelson speek?"],"info":{}}
{"id":"train_7044","question":"What part of the constellation orbits the Milky Way?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q321 wdt:P398 ?X . ?X wdt:P59 ?answer }","paraphrases":["Which constellation contains the Milky Way?"],"info":{}}
{"id":"train_7046","question":"Who gave the{user} of {theme} of {Gingerbread Man} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15233326 wdt:P144 ?X . ?X wdt:P1535 ?answer }","paraphrases":["Who gave the{user} of {subject} of {Gingerbread Man} ?"],"info":{}}
{"id":"train_7048","question":"tell me fossil taxon name has the word velociraptor in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23038290 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'velociraptor' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the name of a fossil taxon has the word \"velociraptor\""],"info":{}}
