{"id":"train_18770","question":"what is the instant messaging client that contains the world 'whatsapp' in its name and that has the Tizen Operating System","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2462003 . ?sbj wdt:P306 wd:Q609306 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'whatsapp' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is the immediately messaging client that consists of the world 'whatsapp' in its title and that has the Tizen Operating System"],"info":{}}
{"id":"train_18771","question":"What is the natural features in Rhodes that has a tributary near the Koprucay River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43048 wdt:P706 ?answer . ?answer wdt:P974 wd:Q385473 }","paraphrases":["What is the natural points in Rhodes that has a tributary close to the Koprucay River?"],"info":{}}
{"id":"train_18772","question":"What is a dyad that begins with the letter y?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29431432 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a dyad that starts with the letter y?"],"info":{}}
{"id":"train_18773","question":"WHICH IS THE CELL COMPONENT OF LYSOSOME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P681 wd:Q83330 }","paraphrases":[],"info":{}}
{"id":"train_18774","question":"Who are the language speakers of the language signed by Albert Renger-Patzsch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q62002 wdt:P1412 ?X . ?X wdt:P1098 ?answer }","paraphrases":["WHO IS THE LAGUAGE SPEAKERS OF LANGUAGE SIGNED BY ALBERT RANGER PATZSCH"],"info":{}}
{"id":"train_18775","question":"Is Kelly Clarkson's family name Clarkson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q483507 wdt:P734 wd:Q16359986 }","paraphrases":["Is Clarkson Kelly Clarkson's family name?"],"info":{}}
{"id":"train_18777","question":"When Jimmy Wales was awarded as Quadriga?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q181 p:P166 ?s . ?s ps:P166 wd:Q700899 . ?s pq:P585 ?value }","paraphrases":["When Jimmy Grains was granted as Quadriga?"],"info":{}}
{"id":"train_18778","question":"Which locality has the largest male population?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3257686 . ?ent wdt:P1540 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Locality with the largest male population"],"info":{}}
{"id":"train_18779","question":"What year was Barry Fitzgeralld nominated for Best Actor at the Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q290666 p:P1411 ?s . ?s ps:P1411 wd:Q103916 . ?s pq:P585 ?value }","paraphrases":["Barry Fitzgerald was nominated for Best Actor at the Academy Awards in what year?"],"info":{}}
{"id":"train_18781","question":"Which field  work of Edward Howard-Vyse ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5343516 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["Which field work of Edward Howard-Vyse ?"],"info":{}}
{"id":"train_18782","question":"\"Who was {discoverer of} of {atoll}, that was a {member of} the {American Philosophical Society} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42523 wdt:P61 ?answer . ?answer wdt:P463 wd:Q466089 }","paraphrases":["\"Who was {pioneer of} of {atoll}, that was a {part of} the {American Philosophical Society} ?\""],"info":{}}
{"id":"train_18783","question":"WHat is the association whose motto is Citius, Altius, Fortius that starst with letter C","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q48204 . ?sbj wdt:P1546 wd:Q1093409 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHat is the affiliation whose witticism is Citius, Altius, Fortius that starst with letter C"],"info":{}}
{"id":"train_18784","question":"Which territory of Indianapolis is Unigov located in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q6346 p:P150 ?s . ?s ps:P150 ?obj . ?s pq:P828 wd:Q7885171 }","paraphrases":["When locating the territories of Indianapolis, where can you find Unigov?"],"info":{}}
{"id":"train_18785","question":"What is speed of sound of glycerol that is temperature is 25.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q132501 p:P2075 ?s . ?s ps:P2075 ?obj . ?s pq:P2076 ?x filter ( contains ( ?x , '25.0' ) ) }","paraphrases":["How fast does sound travel through glycerol at room temperature?"],"info":{}}
{"id":"train_18786","question":"What are significant ingredients to Christo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14633979 wdt:P800 ?X . ?X wdt:P186 ?answer }","paraphrases":["what are the main ingrediants of Christo?"],"info":{}}
{"id":"train_18787","question":"What is made from asafoetida but is commonly called asafetida?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16530385 wdt:P1582 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'asafetida' ) ) }","paraphrases":["What is made of asafoetida but is commonly referred to asafetida?"],"info":{}}
{"id":"train_18788","question":"Who was Paul Krugman's main influence ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q131112 wdt:P737 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the main influence of Paul Kruman?"],"info":{}}
{"id":"train_18789","question":"Does the bite force quotient of Ursus arctos equal 78?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q36341 wdt:P3485 ?obj filter ( ?obj = 78 ) }","paraphrases":["Does the nibble drive remainder of Ursus arctos rise to 78?"],"info":{}}
{"id":"train_18790","question":"What are the participants of the cause of weather ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11663 wdt:P1542 ?X . ?X wdt:P1132 ?answer }","paraphrases":["What are the members of the cause of climate ?"],"info":{}}
{"id":"train_18791","question":"What is STW Thesaurus for Economics ID for Oman","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q842 wdt:P3911 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18792","question":"When did Edward Witten receive the Dirac Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q201513 p:P166 ?s . ?s ps:P166 wd:Q1227369 . ?s pq:P585 ?value }","paraphrases":["When did Edward Witten get the Dirac Decoration?"],"info":{}}
{"id":"train_18793","question":"What positions are held in NATO?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7184 wdt:P2388 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["What are the roles in NATO?"],"info":{}}
{"id":"train_18794","question":"Who are Burt Lancaster's children?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q160528 wdt:P40 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who are Burt Lancaster's children?"],"info":{}}
{"id":"train_18795","question":"In what electoral district did Oswald Mosley was a Member of the 35th Parliament of the UK?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q332400 p:P39 ?s . ?s ps:P39 wd:Q41582588 . ?s pq:P768 ?value }","paraphrases":["Give the electoral district that Oswald Mosley belonged to in the 35th Parliament of the UK."],"info":{}}
{"id":"train_18797","question":"Which is the active patron saint of Adrian IV?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132845 wdt:P937 ?X . ?X wdt:P417 ?answer }","paraphrases":["Give me the name of the active patron saint of Adrian IV."],"info":{}}
{"id":"train_18798","question":"What is place of {tungsten}, that has {adulthood\n} is {16.0}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q743 wdt:P189 ?answer . ?answer wdt:P2999 ?x FILTER ( contains ( ?x , '16.0' ) ) }","paraphrases":["What is place of {tungsten}, that has {adulthood } is {16.0}"],"info":{}}
{"id":"train_18799","question":"Which is the AUSNUT 2011-13 Food Group ID for beef?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q192628 wdt:P4618 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18800","question":"Tell me about partner of Ian McKellen and end time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q170510 p:P451 ?s . ?s ps:P451 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Let me know around accomplice of Ian McKellen and conclusion time?"],"info":{}}
{"id":"train_18802","question":"Who gave the{alumnus of} of {developer of} of {Web 2.0} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131164 wdt:P61 ?X . ?X wdt:P69 ?answer }","paraphrases":["Who gave the{alumnus of} of {engineer of} of {Web 2.0} ?"],"info":{}}
{"id":"train_18803","question":"who is the player of Battles of Lexington and Concord?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q778010 wdt:P710 ?answer . ?answer wdt:P421 wd:Q2204 }","paraphrases":["Give me the name of player of Battles of Lexington and Concord?"],"info":{}}
{"id":"train_18804","question":"When was Hendrik Lorentz nominated for Nobel Prize in Physics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41688 p:P1411 ?s . ?s ps:P1411 wd:Q38104 . ?s pq:P585 ?value }","paraphrases":["What year did Hendrik Lorentz become a Physics Nobel Prize nominee?"],"info":{}}
{"id":"train_18805","question":"Which is the grammatical gender for Norwegian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9043 wdt:P5109 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18806","question":"Tell me me a city-state whose name consist of the word \"hamburg\" and whose highest point hasselbrack.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q133442 . ?sbj wdt:P610 wd:Q877482 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'hamburg' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me me a city-state whose name consist of the word \"hamburg\" and whose highest point hasselbrack."],"info":{}}
{"id":"train_18807","question":"Who is the character of Book of Genesis whose daughter is Hezron?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9184 wdt:P674 ?answer . ?answer wdt:P40 wd:Q4177234 }","paraphrases":["Who is the personality of Book of Genesis whose daughter is Hezron?"],"info":{}}
{"id":"train_18808","question":"What is the league of major league lacrosse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P118 wd:Q1634225 }","paraphrases":[],"info":{}}
{"id":"train_18809","question":"What are some of the signs of HN-1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5635296 wdt:P1542 ?X . ?X wdt:P780 ?answer }","paraphrases":["What are a few of the signs of HN-1?"],"info":{}}
{"id":"train_18811","question":"Who was the first James Irwin named James?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q297801 p:P735 ?s . ?s ps:P735 wd:Q677191 . ?s pq:P1545 ?value }","paraphrases":["Who was the first James Irwin?"],"info":{}}
{"id":"train_18813","question":"Did Absinthe originate in the country of Switzerland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q170210 wdt:P495 wd:Q39 }","paraphrases":["Does Absinthe originally come from Switzerland?"],"info":{}}
{"id":"train_18814","question":"What is RHE professor's ID of Numa Denis Fustel de Coulanges?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q462597 wdt:P5462 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18817","question":"Which is the Base biographique AUTOR ID for Eugène Atget?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q322030 wdt:P3960 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18818","question":"Who is the manager or director at the Technical University of Berlin that started in the year 2010?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q51985 p:P1037 ?s . ?s ps:P1037 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2010' ) ) }","paraphrases":["Name the manager or director who took over the Technical University of Berlin in 2010."],"info":{}}
{"id":"train_18819","question":"What are the IBM official Cocktail which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2536409 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the IBM official cocktail that begins with a V."],"info":{}}
{"id":"train_18821","question":"what is the administrative unit of sardinia which has Q48460 as \"2--45\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1462 wdt:P131 ?answer . ?answer wdt:P1036 ?x FILTER ( contains ( ?x , '2--45' ) ) }","paraphrases":["what is the authoritative unit of sardinia which has Q48460 as \"2--45\"?"],"info":{}}
{"id":"train_18822","question":"Who preceded and who followed Benedict XVI as a cardinal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q2494 p:P39 ?s . ?s ps:P39 wd:Q45722 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Who preceded and who, as a cardinal, followed Benedict XVI?"],"info":{}}
{"id":"train_18823","question":"Who was Marilyn Monroe's spouse whose marriage to her ended on September 13, 1946?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4616 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1946' ) ) }","paraphrases":["Who ended a marriage to Marilyn Monroe on 9/13/1946?"],"info":{}}
{"id":"train_18825","question":"Is the longest span of the Millenium Bridge equal to 144?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44057 wdt:P2787 ?obj filter ( ?obj = 144 ) }","paraphrases":["is 144 the longest span of the millenium bridge?"],"info":{}}
{"id":"train_18829","question":"How many children does Elton John and his spouse David Furnish have?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2808 p:P26 ?s . ?s ps:P26 wd:Q1174489 . ?s pq:P1971 ?value }","paraphrases":["David Furnish and Elton John have how many children?"],"info":{}}
{"id":"train_18831","question":"What is the source of this taxon of Pyrus which is made from Pyrus communis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q434 wdt:P1672 ?answer . ?answer wdt:P1582 wd:Q146281 }","paraphrases":["What is the source of this taxon of Pyrus which is made from Pyrus communis?"],"info":{}}
{"id":"train_18832","question":"Tell me the city in Ukraine that replaces Khadjibey and whose name contains the word odessa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12131624 . ?sbj wdt:P1365 wd:Q2511180 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'odessa' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me the city in Ukraine that replaces Khadjibey and whose name contains the word odessa?"],"info":{}}
{"id":"train_18833","question":"Where is the deathplace of Joseph Dunninger, that has a location of -73.9876?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q687505 wdt:P20 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-73.9876' ) ) }","paraphrases":["Where is the deathplace of Joseph Dunninger, that has a vicinity of -73.9876?"],"info":{}}
{"id":"train_18834","question":"What was Takeda Shingen's cause of death, with 240 total number of cases?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q276404 wdt:P509 ?answer . ?answer wdt:P1603 ?x FILTER ( contains ( ?x , '240.0' ) ) }","paraphrases":["What was the cause of death for Takeda Shingen, with a total of 240 cases?"],"info":{}}
{"id":"train_18835","question":"Which is the B-side for We Are the Champions?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q238564 wdt:P1432 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18836","question":"What prize was awarded to Steve Francis the prizewinner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q354186 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What prize was granted to Steve Francis the prizewinner?"],"info":{}}
{"id":"train_18838","question":"Name a parent taxon of Spinacia oleracea","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q81464 wdt:P171 ?obj . ?obj wdt:P31 wd:Q16521 }","paraphrases":["Title a parent taxon of Spinacia oleracea"],"info":{}}
{"id":"train_18840","question":"Can you name the J.K. Rowling book that has sold the least copies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7725634 . ?ent wdt:P2664 ?obj . ?ent wdt:P50 wd:Q34660 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which of J.K. Rowling's books has been purchased the least?"],"info":{}}
{"id":"train_18842","question":"what is political ideology starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q14934048 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is political belief system begins with w"],"info":{}}
{"id":"train_18843","question":"Which is the academic discipline that studies the history of the world?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2578 wd:Q200325 . ?sbj wdt:P31 wd:Q11862829 }","paraphrases":["Which is the scholarly order that reviews the historical backdrop of the world?"],"info":{}}
{"id":"train_18844","question":"Who was received the Nobel peace prize together with Yitzhak Rabin?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q34060 p:P166 ?s . ?s ps:P166 wd:Q35637 . ?s pq:P1706 ?value }","paraphrases":["With whom was Yitzhak Rabin awared the Nobel peace prize?"],"info":{}}
{"id":"train_18845","question":"What is the safety classification and labeling of water which has the original title \"Europa-Parlamentets og Rådets forordning (EF) nr. 1272/2008 af 16. december 2008 om klassificering, mærkning og emballering af stoffer og blandinger og om ændring og ophævelse af direktiv 67/548/EØF og 1999/45/EF og om ændring af forordning (EF) nr. 1907/2006\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q283 wdt:P4952 ?answer . ?answer wdt:P1476 ?x FILTER ( contains ( ?x , 'Europa-Parlamentets og Rådets forordning (EF) nr. 1272/2008 af 16. december 2008 om klassificering, mærkning og emballering af stoffer og blandinger og om ændring og ophævelse af direktiv 67/548/EØF og 1999/45/EF og om ændring af forordning (EF) nr. 1907/2006' ) ) }","paraphrases":["What is the security classification and labeling of water which has the initial title \"Europa-Parlamentets og Rådets forordning (EF) nr. 1272/2008 af 16. december 2008 om klassificering, mærkning og emballering af stoffer og blandinger og om ændring og ophævelse af direktiv 67/548/EØF og 1999/45/EF og om ændring af forordning (EF) nr. 1907/2006\"?"],"info":{}}
{"id":"train_18846","question":"Who is Carl Sagan's doctoral student?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q410 wdt:P185 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Carl Sagan's doctoral student?"],"info":{}}
{"id":"train_18847","question":"What is replaces  of  Kingdom of Great Britain that applies to part is Wales?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q161885 p:P1365 ?s . ?s ps:P1365 ?obj . ?s pq:P518 wd:Q25 }","paraphrases":["Where is Wales in relation to Great Britain?"],"info":{}}
{"id":"train_18848","question":"Did Nelson Mandela name his son Makgatho Mandela?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q8023 wdt:P40 wd:Q2104774 }","paraphrases":["Is Makgatho Mandela the name of Nelson Mandela's son?"],"info":{}}
{"id":"train_18849","question":"Are Batumi and Matsue located in New Orleans?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q34404 wdt:P190 wd:Q25475 . wd:Q34404 wdt:P190 wd:Q207321 }","paraphrases":["Is it true that Batumi and Matsue are located in New Orleans?"],"info":{}}
{"id":"train_18854","question":"Where is the studio that filmed the narrative of Val?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q54340140 wdt:P1441 ?X . ?X wdt:P915 ?answer }","paraphrases":["Where is the studio filming Val's narrative?"],"info":{}}
{"id":"train_18856","question":"When did Baguio have a population of 97449?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1822 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '97449.0' ) ) . ?s pq:P459 ?value }","paraphrases":["Baguio had a population of 97,449 in what year?"],"info":{}}
{"id":"train_18857","question":"What is the type locality or geology of density?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2695 wd:Q29539 }","paraphrases":[],"info":{}}
{"id":"train_18859","question":"Tell me Wikimedia disambiguation page whose name has the word zhou in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4167410 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zhou' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the disambiguation page of Wikimedia whose name contains the word zhou."],"info":{}}
{"id":"train_18860","question":"When did the Kalmar Union have a population of 4000000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q62623 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '4000000' ) ) . ?s pq:P585 ?value }","paraphrases":["On what date did the Kalmar Union have a population of 40000000?"],"info":{}}
{"id":"train_18861","question":"What birthplace of Eero Järnefelt is in the County of Viborg and Nyslott rural city?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1390614 wdt:P19 ?answer . ?answer wdt:P131 wd:Q920468 }","paraphrases":["What birthplace of Eero Järnefelt is in the County of Viborg and Nyslott rural city?"],"info":{}}
{"id":"train_18863","question":"What  Ostrogothic Kingdom capital city has a central European time zone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q583038 wdt:P36 ?answer . ?answer wdt:P421 wd:Q25989 }","paraphrases":["What Ostrogothic Kingdom capital city has a central European time zone?"],"info":{}}
{"id":"train_18864","question":"What position did Nicolae Ceaușescu hold starting on the 9th of December, 1967?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q80504 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1967' ) ) }","paraphrases":["What position did Nicolae Ceausescu hold on December, 1967?"],"info":{}}
{"id":"train_18865","question":"What is the employment of Marlene Dietrich, whose field of this employment is in estrada?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4612 wdt:P106 ?answer . ?answer wdt:P425 wd:Q2472420 }","paraphrases":["What is the business of Marlene Dietrich, whose field of this business is in estrada?"],"info":{}}
{"id":"train_18866","question":"what is in the Rock Hall of Fame ID of Charlie Christian ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q356490 wdt:P3162 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18868","question":"What is the craft of Carneades whose patron saint is Catherine of Alexandria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q284994 wdt:P106 ?answer . ?answer wdt:P417 wd:Q179718 }","paraphrases":["What is the craft of Carneades whose buyer saint is Catherine of Alexandria?"],"info":{}}
{"id":"train_18869","question":"Who is the TV production company that employs Oprah WInfrey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q55800 wdt:P108 ?obj . ?obj wdt:P31 wd:Q10689397 }","paraphrases":[],"info":{}}
