{"id":"train_17842","question":"What is Nice's twinned administrative body and where is the administrative territorial entity located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q33959 wdt:P190 ?ans_1 . wd:Q33959 wdt:P131 ?ans_2 }","paraphrases":["What is the twinned administrative body of Nice, and where is the administrative territory entity located?"],"info":{}}
{"id":"train_17843","question":"What is { position held } of { Henry Morton Stanley } { start time } is { 1895 - 7 - 15 }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q171421 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1895' ) ) }","paraphrases":["Henry Morton Stanley started what job on 7/15/1895?"],"info":{}}
{"id":"train_17845","question":"Who co-founded the building of the Fender Cyclone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q599105 wdt:P176 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who co-founded the design of Fender Cyclone?"],"info":{}}
{"id":"train_17847","question":"What is the Indian reservation of Kaliningrad Oblast, that has local government areas including Udmurt Republic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1749 wdt:P131 ?answer . ?answer wdt:P150 wd:Q5422 }","paraphrases":["What is the Indian reservation of Kaliningrad Oblast, that has nearby government areas consisting of Udmurt Republic?"],"info":{}}
{"id":"train_17851","question":"What award do Jessye Norman and champion Judith Jamison both have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q240937 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q6303488 }","paraphrases":["What grant do Jessye Norman and winner Judith Jamison both have?"],"info":{}}
{"id":"train_17852","question":"Which is the BNA authority ID for Eugène Sue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q315220 wdt:P3788 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17853","question":"Which is the OlimpBase Chess Olympiad player ID for Bobby Fischer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41314 wdt:P3940 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17854","question":"What honours is solved by prime number theorem?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q386292 wdt:P1136 ?X . ?X wdt:P166 ?answer }","paraphrases":["What respects is illuminated by prime number theorem?"],"info":{}}
{"id":"train_17855","question":"Which earthquake had the highest magnitude on the Mercalli intensity scale with a scale of 11?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7944 . ?ent wdt:P2527 ?obj . ?ent wdt:P2784 wd:Q23925708 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["On the Mercalli intensity scale, what earthquake had the highest magnitude reaching 11?"],"info":{}}
{"id":"train_17857","question":"Which is the BirdLife International ID for Dodo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q43502 wdt:P5257 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17858","question":"Tell me  area of mathematics  whose name has the word  trigonometry in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1936384 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trigonometry' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know zone of arithmetic whose title has the word trigonometry in it."],"info":{}}
{"id":"train_17859","question":"Name an amulet associated with Ancient Egypt.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P17 wd:Q11768 . ?sbj wdt:P31 wd:Q131557 }","paraphrases":[],"info":{}}
{"id":"train_17861","question":"What is the event location of the Battle of the Atlantic, which has a tributary of River Pol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q157627 wdt:P276 ?answer . ?answer wdt:P974 wd:Q21995585 }","paraphrases":["What is the tournament place of the Battle of the Atlantic, which has a tributary of River Pol?"],"info":{}}
{"id":"train_17862","question":"tell me virtue that starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q157811 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the virtue with which w begins"],"info":{}}
{"id":"train_17864","question":"When did Helen Caldicott receive the award for Victorian Honour Roll of Women?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q431092 p:P166 ?s . ?s ps:P166 wd:Q7927224 . ?s pq:P585 ?value }","paraphrases":["On what date did Helen Caldicott receive the Victorian Honour Roll of Women award?"],"info":{}}
{"id":"train_17865","question":"What is the name of the mineral that has an hexagonal crystal system and that has the word \"lonsdaleite\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q429795 . ?sbj wdt:P556 wd:Q663314 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'lonsdaleite' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of the mineral that has an hexagonal crystal machine and that has the word \"lonsdaleite\" in its name?"],"info":{}}
{"id":"train_17866","question":"What namesake of germanium has a CPI inflation rate of 4.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q867 wdt:P138 ?answer . ?answer wdt:P1279 ?x FILTER ( contains ( ?x , '4.2' ) ) }","paraphrases":["What namesake of germanium includes a CPI swelling rate of 4.2?"],"info":{}}
{"id":"train_17867","question":"What legislature subject is different from tripartite classification of authority?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11204 wdt:P1269 ?answer . ?answer wdt:P1889 wd:Q3565078 }","paraphrases":["What council subject is diverse from tripartite classification of specialist?"],"info":{}}
{"id":"train_17868","question":"What is the absolute viscosity of hydrogen cyanide?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q26075 wdt:P3070 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17869","question":"\"Who is {born in} of {George Santayana} where the {partner city} is in {San Juan}?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q237833 wdt:P19 ?answer . ?answer wdt:P190 wd:Q41211 }","paraphrases":["\"Who is born in { George Santayana } in { San Juan } where the { partner city } is?\""],"info":{}}
{"id":"train_17871","question":"Name a film crew member from Beauty and the Beast.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q179673 wdt:P3092 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17872","question":"What is the name of the company that produces Windows 7?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11215 wdt:P176 ?X . ?X wdt:P355 ?answer }","paraphrases":["Which is the name of the company that produces Windows 7?"],"info":{}}
{"id":"train_17873","question":"Tell me the bridge that is located in the administrative territorial entity of London borough of Southwark and starts with the letter b?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12280 . ?sbj wdt:P131 wd:Q730706 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me the bridge that is located in the administrative territorial entity of London borough of Southwark and starts with the letter b?"],"info":{}}
{"id":"train_17874","question":"WHICH IS THE LAW OF THERMODYNMICS STARTS WITH I","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q849392 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE LAW OF THERMODYNMICS Begins WITH I"],"info":{}}
{"id":"train_17875","question":"Did {Thomas Hobbes} is {employer} of {Anthony Ashley Cooper, 1st Earl of Shaftesbury} and {Caleb Banks} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q37621 wdt:P108 wd:Q336002 . wd:Q37621 wdt:P108 wd:Q5019214 }","paraphrases":["Does Thomas Hobbes work for Anthony Ashley Cooper and Caleb Banks?"],"info":{}}
{"id":"train_17876","question":"TELL ME BASEBALL TEAM WHOSE NAME HAS THE WORD AGUILAS IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13027888 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'águilas' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know BASEBALL Group WHOSE Title HAS THE WORD AGUILAS IN IT."],"info":{}}
{"id":"train_17877","question":"What is the platform for Amstrad CPC?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P400 wd:Q478829 }","paraphrases":[],"info":{}}
{"id":"train_17879","question":"How was the murder method of Wilfrid Laurier treated?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q128664 wdt:P509 ?X . ?X wdt:P2176 ?answer }","paraphrases":["Wilfrid Laurier's murder method was treated in a certain way, what was it?"],"info":{}}
{"id":"train_17882","question":"In what city did former Soviet Union leader Boris Yeltsin pass away.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34453 wdt:P20 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '305600.0' ) ) }","paraphrases":["In what metropolis did former Soviet Union chief Boris Yeltsin skip away."],"info":{}}
{"id":"train_17883","question":"What year did Renaud Lavillenie hold the record for pole vault?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1742 p:P1000 ?s . ?s ps:P1000 wd:Q185027 . ?s pq:P580 ?value }","paraphrases":["Renaud Lavillenie held the record for the pole vault in what year?"],"info":{}}
{"id":"train_17885","question":"What is the name of the economy that starts with the letter 'r'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q159810 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["NAME THE ECONOMY WHICH STARTS WITH THE LETTER R"],"info":{}}
{"id":"train_17886","question":"Who preceded and who succeeded to Lothair I as king of Franks?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q150735 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["What kings directly preceded and followed Lothair I as the king of the Franks?"],"info":{}}
{"id":"train_17888","question":"which action  starts with o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4026292 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ô' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What action begins with \"o\"?"],"info":{}}
{"id":"train_17892","question":"What is the taxon parent of B95a's species?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q54752923 wdt:P703 ?X . ?X wdt:P171 ?answer }","paraphrases":["What is the taxon parent of B95a's species?"],"info":{}}
{"id":"train_17893","question":"Which award did Augustin-Jean Fresnel receive in the year 1824?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q187241 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1824' ) ) }","paraphrases":["What award did Augustin-Jean Fresnel receive in the year 1824?"],"info":{}}
{"id":"train_17894","question":"Tell me me a dog  whose name consist of the word \"balto\" and whose exhibition history Cleveland Museum of Natural History","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q144 . ?sbj wdt:P608 wd:Q902706 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'balto' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know me a pooch whose title comprise of the word \"balto\" and whose presentation history Cleveland Historical center of Characteristic History"],"info":{}}
{"id":"train_17895","question":"What was the method used to determine the population of Ferrara was 132009?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q13362 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '132009' ) ) . ?s pq:P459 ?value }","paraphrases":["How was Ferrara's population determined to be 132009?"],"info":{}}
{"id":"train_17897","question":"What monuments were made in the Return of the Prodigal Son?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q512755 wdt:P1071 ?X . ?X wdt:P1456 ?answer }","paraphrases":["What landmarks were made in the Return of the Prodigal Son?"],"info":{}}
{"id":"train_17898","question":"Which is the manifestation that runs on Feh?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28451996 wdt:P1547 ?X . ?X wdt:P1557 ?answer }","paraphrases":["Which is the appearance that runs on Feh?"],"info":{}}
{"id":"train_17899","question":"What tunic does Heracles wear?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q122248 wdt:P3828 ?obj . ?obj wdt:P31 wd:Q201714 }","paraphrases":["What kind of tunic is Heracles wearing?"],"info":{}}
{"id":"train_17901","question":"What was owned by L'Origne du monde as at 1868-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q334138 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1868' ) ) }","paraphrases":["L'Origne Du Monde as owned what on 1/1/1868"],"info":{}}
{"id":"train_17903","question":"Which is the BMRB ID of ethanol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q153 wdt:P5219 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17904","question":"What is the play of UEFA Champions League whose governing body is FIFA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18756 wdt:P641 ?answer . ?answer wdt:P797 wd:Q253414 }","paraphrases":["What is the play of UEFA Champions League whose governing physique is FIFA?"],"info":{}}
{"id":"train_17906","question":"Is the nominal GDP of Ghana equal to 47330016342.5734?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q117 wdt:P2131 ?obj filter ( ?obj = 47330016342.5734 ) }","paraphrases":["Is Ghana's GDP about 4.7 trillion?"],"info":{}}
{"id":"train_17908","question":"What is the instance of fluorine that is followed by neon?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q650 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P156 wd:Q654 }","paraphrases":["Which is an example of fluorine that comes after neon?"],"info":{}}
{"id":"train_17910","question":"Which book is Die Hard based on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q105598 wdt:P144 ?obj . ?obj wdt:P31 wd:Q47461344 }","paraphrases":["Which book is Kick the bucket Difficult based on?"],"info":{}}
{"id":"train_17911","question":"Which is the medication that is found in taxon of Homo Sapiens and contains the word tyrosine in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12140 . ?sbj wdt:P703 wd:Q15978631 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tyrosine' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the medicine that's found in taxon of Homo Sapiens and contains the word tyrosine in it's name?"],"info":{}}
{"id":"train_17913","question":"What facility is operated by the subsidiary of Qantas Freight?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q869352 wdt:P749 ?X . ?X wdt:P121 ?answer }","paraphrases":["Which facility is operated by the subsidiary of Qantas Freight?"],"info":{}}
{"id":"train_17914","question":"which countries of the country seat of Caracas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1533 wdt:P1376 ?X . ?X wdt:P150 ?answer }","paraphrases":["which nations of the nation situate of Caracas?"],"info":{}}
{"id":"train_17915","question":"The capital of Melbourne is in what district?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q3141 . ?sbj wdt:P31 wd:Q149621 }","paraphrases":["What is the district of the capital of Melbourne"],"info":{}}
{"id":"train_17917","question":"That language follows the Middle English?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P155 wd:Q36395 . ?sbj wdt:P31 wd:Q34770 }","paraphrases":["That dialect takes after the Center English?"],"info":{}}
{"id":"train_17918","question":"When was the population of Western Australia 2.5656 million?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3206 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '2.5656e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["What year was the population of Western Australia 2.5656 million?"],"info":{}}
{"id":"train_17921","question":"What what is sports league season starts April and also which starts with letter i","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q623109 . ?sbj wdt:P4794 wd:Q118 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE SPORTS LEAGUE SEASON THAT STARTS IN APRIL AND STARTS WITH THE LETER I"],"info":{}}
{"id":"train_17922","question":"What is in the category of job?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1478 wd:Q192581 }","paraphrases":[],"info":{}}
{"id":"train_17923","question":"Knowing about his signs of memory loss that disrupts daily life, what is the disability of Paddy Roy Bates?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q555531 wdt:P1050 ?answer . ?answer wdt:P780 wd:Q30141616 }","paraphrases":["Knowing around his signs of memory misfortune that disturbs lifestyle , what is the incapacity of Paddy Roy Bates?"],"info":{}}
{"id":"train_17925","question":"What is {located in time zone} of {Mönchengladbach} which is {valid in period} is {standard time} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2758 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q1777301 }","paraphrases":["what is the time zone in Mönchengladbach?"],"info":{}}
{"id":"train_17926","question":"What do humans in the field of work leprosy do for a living?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P101 wd:Q36956 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["People who work in the field of leprosy do what for a living?"],"info":{}}
{"id":"train_17927","question":"Which means{streak color} at the color {gray} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P534 wd:Q42519 }","paraphrases":[],"info":{}}
{"id":"train_17928","question":"What are the lawn game which start with the letter ladder","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6503676 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ladder' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the garden diversion which begin with the letter ladder"],"info":{}}
{"id":"train_17929","question":"what is fairy tale contains the word witch in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q699 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'witch' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is pixie story contains the word witch in their name"],"info":{}}
{"id":"train_17934","question":"Which state of Italy that has Women in Red banner is SDC10394(2).jpg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q38 wdt:P150 ?answer . ?answer wdt:P948 ?x FILTER ( contains ( ?x , 'SDC10394 (2).jpg' ) ) }","paraphrases":["Which state of Italy that has Ladies in Ruddy standard is SDC10394(2).jpg?"],"info":{}}
{"id":"train_17935","question":"How many of the winners are Ruth Prawer Jhabvala?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1346 wd:Q235759 }","paraphrases":["Among the winners, how many of them are Ruth Prawer Jhabvala?"],"info":{}}
{"id":"train_17936","question":"\"Which is {on shore of} of {Conakry}, that has {tributary} is {Ribeira da Janela} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3733 wdt:P206 ?answer . ?answer wdt:P974 wd:Q12049348 }","paraphrases":["\"Which is {on shore of} of {Conakry}, that has {tributary} is {Ribeira da Janela} ?\""],"info":{}}
{"id":"train_17938","question":"Tell me cuisine whose name has the word zosui in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1778821 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zosui' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know cooking whose title has the word zosui in it."],"info":{}}
{"id":"train_17939","question":"What is the eponym of O'Hare International Airport that has a sister city, Vilnius?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q213717 wdt:P138 ?answer . ?answer wdt:P190 wd:Q216 }","paraphrases":["What is the eponym of O'Hare International Airport that has a sister city, Vilnius?"],"info":{}}
{"id":"train_17940","question":"In what year was Guam's population 89463?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16635 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '89463.0' ) ) . ?s pq:P585 ?value }","paraphrases":["At what time was Guam's population 89,463?"],"info":{}}
{"id":"train_17941","question":"What is recently deceased R. H. Tawney's PIN Code?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2589871 wdt:P20 ?X . ?X wdt:P281 ?answer }","paraphrases":["What is as of late expired R. H. Tawney's Stick Code?"],"info":{}}
{"id":"train_17942","question":"IS THE STSTED AGE AT EVENT OF RYDER EQUALS 8.0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q59318498 wdt:P3629 ?obj filter ( ?obj = 8.0 ) }","paraphrases":["IS THE STSTED AGE AT Occasion OF RYDER Rises to 8.0"],"info":{}}
{"id":"train_17943","question":"What what is  private university owner of by  Notre Dame School of Architecture which starts with letter d","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q902104 . ?sbj wdt:P1830 wd:Q7063475 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is private college proprietor of via Notre Dame School of Architecture which starts with letter d"],"info":{}}
{"id":"train_17944","question":"When was the Academy award received by Emil Jannings for Best Actor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q77181 p:P166 ?s . ?s ps:P166 wd:Q103916 . ?s pq:P585 ?value }","paraphrases":["In which year Emil Jannings received Academy award for best actor?"],"info":{}}
{"id":"train_17947","question":"What are the life style which start with the letter warrior","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q32090 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'warrior' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the life style which begin with the letter warrior"],"info":{}}
{"id":"train_17948","question":"What is the coordinate location of Ghent University which has its headquarters located in Ghent?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1137665 p:P159 ?s . ?s ps:P159 wd:Q1296 . ?s pq:P625 ?value }","paraphrases":["What are the coordinates for Ghent University?"],"info":{}}
{"id":"train_17950","question":"Which is the number of missing for 2011 Tōhoku earthquake and tsunami?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q36204 wdt:P1446 ?answer }","paraphrases":[],"info":{}}
