{"id":"train_1955","question":"What what is Radionavigation-satellite service manifestation of by satellite navigation system nd which that starts with {'g'}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20181002 . ?sbj wdt:P1557 wd:Q179435 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is Radionavigation-satellite carrier manifestation of by using satellite navigation gadget nd which that starts with {'g'}"],"info":{}}
{"id":"train_1957","question":"Who is the active mayor of Johann Gottlieb Fichte?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q102585 wdt:P937 ?X . ?X wdt:P6 ?answer }","paraphrases":["Who is the dynamic leader of Johann Gottlieb Fichte?"],"info":{}}
{"id":"train_1958","question":"which terriain feature group is located on city of london?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q23311 wdt:P706 ?obj . ?obj wdt:P31 wd:Q16887380 }","paraphrases":["which terriain include bunch is found on city of london?"],"info":{}}
{"id":"train_1959","question":"what is the birth place of Erik Erikson,is he the head of the national Government Kurt Balum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q58074 wdt:P19 ?answer . ?answer wdt:P6 wd:Q1764115 }","paraphrases":["what is the birth put of Erik Erikson,is he the head of the national Government Kurt Balum?"],"info":{}}
{"id":"train_1960","question":"When was Pablo Neruda awarded the National Prize for Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q34189 p:P166 ?s . ?s ps:P166 wd:Q860699 . ?s pq:P585 ?value }","paraphrases":["At which point in time did Pablo Neruda get awarded the National Prize for Literature?"],"info":{}}
{"id":"train_1962","question":"What amount of those stated are for Zaporizhzhia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q157835 wdt:P248 ?obj }","paraphrases":["Which amount of those stated are for Zaporizhzhia?"],"info":{}}
{"id":"train_1963","question":"Tell me about the codon that is encoded by glycine.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q620730 wdt:P702 ?obj . ?obj wdt:P31 wd:Q165052 }","paraphrases":["Tell me about the glycine - encoded codon."],"info":{}}
{"id":"train_1964","question":"What award did Arthur Rubinstein win on 1/1/1961?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q183182 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1961' ) ) }","paraphrases":["On January 1st, 1961, which award was granted to Arthur Rubinstein?"],"info":{}}
{"id":"train_1966","question":"What did George Lucas major in at University of Southern California and what was his degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q38222 p:P69 ?s . ?s ps:P69 wd:Q4614 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["At University of Southern California, what was George Lucas' major and degree?"],"info":{}}
{"id":"train_1968","question":"What is the name of a branch of service that starts with the letter v.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q690109 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a department of benefit that begins with the letter v."],"info":{}}
{"id":"train_1969","question":"What is the master name of Michel de Montaigne, who has the native name Marc Antoine Muret?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41568 wdt:P1066 ?answer . ?answer wdt:P1559 ?x FILTER ( contains ( ?x , 'Marc Antoine Muret' ) ) }","paraphrases":["What is the ace title of Michel de Montaigne, who has the local title Marc Antoine Muret?"],"info":{}}
{"id":"train_1970","question":"how many are influenced by maimonides?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q127398 wdt:P737 ?obj }","paraphrases":["In regards to Maimonides, how many are influenced by it?"],"info":{}}
{"id":"train_1975","question":"What rotary cannon did General Electric design that starts with the letter \"m\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1966482 . ?sbj wdt:P287 wd:Q54173 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What rotary cannon did General Electric graph that starts with the letter \"m\"?"],"info":{}}
{"id":"train_1976","question":"For how long has Cardinal Mazarin been the Bishop of Metz","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q166056 p:P39 ?s . ?s ps:P39 wd:Q15729481 . ?s pq:P582 ?value }","paraphrases":["What was the duration Cardinal Mazarin served as Bishop of Metz?"],"info":{}}
{"id":"train_1977","question":"Who is the {empire} for {country of citizenship} of {Vladimir Lenin}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1394 wdt:P27 ?obj . ?obj wdt:P31 wd:Q48349 }","paraphrases":["Who is the { empire } of { Vladimir Lenin } for { Citizenship country }"],"info":{}}
{"id":"train_1978","question":"Who was the author that appeared in Professor Shattuck?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28658577 wdt:P1441 ?X . ?X wdt:P58 ?answer }","paraphrases":["Who was the creator that showed up in Professor Shattuck?"],"info":{}}
{"id":"train_1979","question":"What does Air China build?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51747 wdt:P121 ?X . ?X wdt:P186 ?answer }","paraphrases":["What is the construction of Air China?"],"info":{}}
{"id":"train_1980","question":"When did Alexander Shelepin stop being chairperson for the KGB?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q80919 p:P488 ?s . ?s ps:P488 wd:Q533890 . ?s pq:P582 ?value }","paraphrases":["From when Alexander Shelepin was termiated from Chairperson of KGB?"],"info":{}}
{"id":"train_1981","question":"Who graduated and played Burnin' the Roadhouse Down.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4999805 wdt:P175 ?X . ?X wdt:P69 ?answer }","paraphrases":["Give me the name of the person that graduated and played Burnin' the Roadhouse Down."],"info":{}}
{"id":"train_1983","question":"What is Francis's religious name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q450675 wdt:P1635 ?answer }","paraphrases":[],"info":{}}
{"id":"train_1984","question":"Who gave the  {initial cause} of {outcome} of {Mechanization} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1160362 wdt:P1542 ?X . ?X wdt:P828 ?answer }","paraphrases":["Who gave the initial cause of the Mechanization outcome?"],"info":{}}
{"id":"train_1986","question":"How much chemical structure are for oxytocin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q169960 wdt:P117 ?obj }","paraphrases":["What is the checmical structure ofr oxytocin?"],"info":{}}
{"id":"train_1988","question":"What is the type of government in the state of Norfolk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23109 wdt:P17 ?X . ?X wdt:P122 ?answer }","paraphrases":["The state of Norfolk has what type of government?"],"info":{}}
{"id":"train_1991","question":"Frank Gehry created what sculpture?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P170 wd:Q180374 . ?sbj wdt:P31 wd:Q860861 }","paraphrases":["Straight to the point Gehry made what sculpture?"],"info":{}}
{"id":"train_1992","question":"Tell me me a textile fibre whose name consist of the word \"woman\" and whose fabrication method sericulture silk","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3071311 . ?sbj wdt:P2079 wd:Q864650 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'silk' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me me a cloth fibre whose identify consist of the word \"woman\" and whose fabrication method sericulture silk"],"info":{}}
{"id":"train_2000","question":"When was Michail Sholokhov nominated for a Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42398 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["Michail Sholokhov was nominated for Literature's Nobel Prize in what year?"],"info":{}}
{"id":"train_2001","question":"Did World War II took place in Mediterranean Sea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q362 wdt:P276 wd:Q4918 }","paraphrases":["Is it true that World War II took place in Mediterranean Sea?"],"info":{}}
{"id":"train_2002","question":"Who founded the superior formation of Weyerhauser, Canada?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q29123048 wdt:P749 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who established the predominant arrangement of Weyerhauser, Canada?"],"info":{}}
{"id":"train_2005","question":"Is the magnification of the TZF 9b equal to 2.5?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q42292630 wdt:P4163 ?obj filter ( ?obj = 2.5 ) }","paraphrases":["Is the amplification of the TZF 9b rise to to 2.5"],"info":{}}
{"id":"train_2006","question":"Is there a monument dedicated to the Iroquois tribe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q68518 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q4989906 }","paraphrases":["Is there a landmark devoted to the Iroquois tribe?"],"info":{}}
{"id":"train_2008","question":"Tell me operating system component whose name has the word file in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q30059018 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'file' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the component of the operating system whose name contains the word file."],"info":{}}
{"id":"train_2010","question":"Who was the spouse of Honoré de Balzac in the year 1850?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9711 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1850' ) ) }","paraphrases":["Mention the spouse name of Honore de Balzac in the year 1850?."],"info":{}}
{"id":"train_2012","question":"What is the highest position in the Greater London administrative body ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q23306 wdt:P1313 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["What is the very best function in the Greater London administrative body ?"],"info":{}}
{"id":"train_2014","question":"What was the award received by Anne, Princess Royal that is point in time was 1969-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q151754 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1969' ) ) }","paraphrases":["Anne, Princess Royal, received which award on 1969-0-0?"],"info":{}}
{"id":"train_2016","question":"Who owns and founded the company JPMorgan Chase?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q192314 wdt:P127 ?ans_1 . wd:Q192314 wdt:P112 ?ans_2 }","paraphrases":["Who is the founder and owner of the JPMorgan Chase company?"],"info":{}}
{"id":"train_2018","question":"Who is the  {chemical compound} for {significant drug interaction} of {(RS)-methadone}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P769 wd:Q179996 . ?sbj wdt:P31 wd:Q11173 }","paraphrases":["Who is the {chemical compound} for {critical sedate interaction} of {(RS)-methadone}"],"info":{}}
{"id":"train_2020","question":"Is Colin Firth a sibling of Jonathan Firth and Kate Firth?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q162492 wdt:P3373 wd:Q713766 . wd:Q162492 wdt:P3373 wd:Q4532014 }","paraphrases":["Does Colin Firth have siblings named Jonathan Firth and Kate Firth?"],"info":{}}
{"id":"train_2021","question":"What is the number of out of school children in the planetary system of the Moon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q405 wdt:P397 ?X . ?X wdt:P2573 ?answer }","paraphrases":["What is the variety of out of school youngsters in the planetary gadget of the Moon?"],"info":{}}
{"id":"train_2022","question":"Which is the {international sport governing body} for {authority} of {baseball}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5369 wdt:P797 ?obj . ?obj wdt:P31 wd:Q11422536 }","paraphrases":["Which is the {worldwide don overseeing body} for {specialist} of {baseball}?"],"info":{}}
{"id":"train_2024","question":"What is the largest depth of a lunar crater?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1348589 . ?ent wdt:P4511 ?obj . ?ent wdt:P31 wd:Q1348589 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the biggest depth of a lunar basin?"],"info":{}}
{"id":"train_2025","question":"Tell me about the abdication of Juan Carlos I.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q19943 wdt:P793 ?obj . ?obj wdt:P31 wd:Q207549 }","paraphrases":["Let me know around the abandonment of Juan Carlos I."],"info":{}}
{"id":"train_2028","question":"Is the maximum age of compulsory education in Sweden equal to 16 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q34 wdt:P3271 ?obj filter ( ?obj = 16 ) }","paraphrases":["Is the greatest age of obligatory instruction in Sweden break even with to 16 ?"],"info":{}}
{"id":"train_2030","question":"What award John Berryman received at 1969-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q522192 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1969' ) ) }","paraphrases":["In the year 1969 which award did John Berryman received?"],"info":{}}
{"id":"train_2032","question":"Tell me about the television program WWE and its production company.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P272 wd:Q35339 . ?sbj wdt:P31 wd:Q15416 }","paraphrases":["Inform me regarding the TV program WWE and its generation organization."],"info":{}}
{"id":"train_2035","question":"Who gave the {subsidiary} of {previous is} of {Académie des Beaux-Arts} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q337531 wdt:P155 ?X . ?X wdt:P199 ?answer }","paraphrases":["Who previously gave the subsidiary of the Académie des Beaux-Arts?"],"info":{}}
{"id":"train_2036","question":"Who is the prime minister at admin HQ of the International Ice Hockey Federation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190173 wdt:P159 ?X . ?X wdt:P6 ?answer }","paraphrases":["Who is prime minister of IIHF HQ?"],"info":{}}
{"id":"train_2037","question":"Who in San Cristóbal de La Laguna was chosen as register office?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q54898 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q745221 }","paraphrases":["Who was selected as register office in San Cristóbal de La Laguna."],"info":{}}
{"id":"train_2042","question":"Which is the inscription for Le Déjeuner sur l'herbe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q152509 wdt:P1684 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2043","question":"What is the SI derived unit for the measured physical quantity of density?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P111 wd:Q29539 . ?sbj wdt:P31 wd:Q208469 }","paraphrases":["What is the SI inferred unit for the measured physical amount of density?"],"info":{}}
{"id":"train_2049","question":"What is the design of the satellite Jupiter Heliopolitanus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20669412 wdt:P180 ?X . ?X wdt:P398 ?answer }","paraphrases":["What is the plan of the disciple Jupiter Heliopolitanus?"],"info":{}}
{"id":"train_2052","question":"WHAT DOES PARSHVANATHA FOLLOW?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q1400271 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What is PARSHVANATHA FOLLOW going to do?"],"info":{}}
{"id":"train_2053","question":"Is the watershed area of Itzstedter Sea .28?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1675385 wdt:P2053 ?obj filter ( ?obj = 0.28 ) }","paraphrases":["Is 0.28 the watershed area of the Itzstedter Sea?"],"info":{}}
{"id":"train_2054","question":"What is the crafted from of the artist of The Thin Mercury Sound?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7768705 wdt:P175 ?X . ?X wdt:P186 ?answer }","paraphrases":["What is the crafted from of the artist of The Thin Mercury Sound?"],"info":{}}
{"id":"train_2056","question":"tell me steroid hormone that starts with t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q422137 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know steroid hormone that begins with t"],"info":{}}
{"id":"train_2059","question":"when is the {point in time} for {Jawaharlal Nehru} who {nominated for} as {Nobel Peace Prize} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1047 p:P1411 ?s . ?s ps:P1411 wd:Q35637 . ?s pq:P585 ?value }","paraphrases":["when is the {point in time} for {Jawaharlal Nehru} who {designated for} as {Nobel Peace Prize} ?"],"info":{}}
{"id":"train_2060","question":"How many home ports are by the Southhamptons?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P504 wd:Q79848 }","paraphrases":["The Port of Southampton is a passenger and cargo port in the central part of the south coast of .... The port handles 80,000 tons (tonnes) of such produce, much of it from the Canary Isles, each year. ... The Eastern Docks is home to a variety of transport companies and marine service providers, including Williams Shipping ...\n‎Cruise shipping · ‎Freight and cargo · ‎Port services · ‎Boats and small ships"],"info":{}}
{"id":"train_2061","question":"Who was the head of State of Georgia on January 25th, 2004?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q230 p:P35 ?s . ?s ps:P35 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["On January 25, 2004, who was the head of the State of Georgia?"],"info":{}}
{"id":"train_2062","question":"What year was Nicki Minaj  nominated a Grammy Award for the Album of the year?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q162202 p:P1411 ?s . ?s ps:P1411 wd:Q904528 . ?s pq:P585 ?value }","paraphrases":["Nicki Minaj was nominated for Album of the year in what Year?"],"info":{}}
{"id":"train_2065","question":"What kind of employment do the spouses of Jussi Björling do?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q56157 wdt:P26 ?X . ?X wdt:P106 ?answer }","paraphrases":["What is the job of Jussi Björling's  spouse?"],"info":{}}
{"id":"train_2067","question":"What are the political system which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28108 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the political framework which begin with the letter t"],"info":{}}
{"id":"train_2068","question":"What is the royal title of Louis the Pious and who followed his reign.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P156 ?value1 . }","paraphrases":["What is Louis the Pious's royal title and who followed his reign."],"info":{}}
{"id":"train_2069","question":"What award did Amnesty International receive in 1988?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q42970 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1988' ) ) }","paraphrases":["In 1988 Amnesty Intl was given what award?"],"info":{}}
{"id":"train_2070","question":"What was Ian McEwan nominated for in 2007?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q190379 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2007' ) ) }","paraphrases":["Ian McEwan was nominated for what in 2007?"],"info":{}}
{"id":"train_2072","question":"Did Wladimir Kilitschko win during Wladimir Klitschko vs. Sultan Ibragimov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q18797 wdt:P2522 wd:Q39059190 }","paraphrases":["What was the outcome of the Wladimir Klitschko vs. Sultan Ibragimove?"],"info":{}}
{"id":"train_2074","question":"Which is the Butterflies and Moths of North America ID for Geometridae?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q45559 wdt:P3398 ?answer }","paraphrases":[],"info":{}}
{"id":"train_2077","question":"When did Billie Jean King receive her award as a \"Library of Congress Living Legend\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q54527 p:P166 ?s . ?s ps:P166 wd:Q6542686 . ?s pq:P580 ?value }","paraphrases":["When did Billie Jean King win the Library of Congress Living Legend Award?"],"info":{}}
{"id":"train_2078","question":"Name the flavored tea named after Charles Grey that contains the word \"earl\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3526264 . ?sbj wdt:P138 wd:Q294662 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'earl' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the flavored tea named after Charles Grey that carries the word \"earl\" in its identify"],"info":{}}
{"id":"train_2079","question":"How many goals did Garrincha score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q180642 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }","paraphrases":["How numerous objectives did Garrincha score?"],"info":{}}
{"id":"train_2083","question":"What is the name of the secondary national association football team for the Zinedine Zidane Team members?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1835 wdt:P54 ?obj . ?obj wdt:P31 wd:Q45053817 }","paraphrases":["What is the name for the Zinedine Zidane Team members who are called secondary national association football team?"],"info":{}}
{"id":"train_2085","question":"What movable object located in Siege of Jerusalem has the legal name القدس?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q456993 wdt:P276 ?answer . ?answer wdt:P1448 ?x FILTER ( contains ( ?x , 'القدس' ) ) }","paraphrases":["What mobile protest found in Attack of Jerusalem has the lawful title القدس?"],"info":{}}
{"id":"train_2087","question":"What are the human which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the human which begin with the letter t"],"info":{}}
{"id":"train_2088","question":"Who was significant in the movement for Indian Independence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P793 wd:Q12444025 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was important in the Indian Independence movement?"],"info":{}}
{"id":"train_2089","question":"Which is the permanent duplicated item of famine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2959 wd:Q168247 }","paraphrases":[],"info":{}}
{"id":"train_2090","question":"Who gave the {prequel of} of {location of narrative} of {Candide} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q215894 wdt:P840 ?X . ?X wdt:P156 ?answer }","paraphrases":["Who gave the prequel of location of narrative of Candide ?"],"info":{}}
