{"id":"train_19934","question":"What is the end time and place of marriage of Ernest Borgnine who has Ethel Merman as his wife?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q102551 p:P26 ?s . ?s ps:P26 wd:Q129087 . ?s pq:P582 ?value1 . ?s pq:P2842 ?value2 }","paraphrases":["What is Ernest Borgnine's end time and place of marriage that has Ethel Merman as his wife?"],"info":{}}
{"id":"train_19936","question":"Is the position angle of the northwest equal to 315?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5491373 wdt:P2211 ?obj filter ( ?obj = 315 ) }","paraphrases":["Is northwest equal to the 315 position angle"],"info":{}}
{"id":"train_19938","question":"Amsterdam Metro has what type of electrification?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q260870 wdt:P930 ?obj }","paraphrases":["What kind of electrification is employed by the Amsterdam Metro?"],"info":{}}
{"id":"train_19940","question":"Who gave the {representative} of {painters} of {Relativity} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2635136 wdt:P170 ?X . ?X wdt:P1875 ?answer }","paraphrases":["Who gave the {agent} of {painters} of {Relativity} ?"],"info":{}}
{"id":"train_19941","question":"What award did Charlie Parker win and when did he receive it","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q103767 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What award did Charlie Parker win and when did he acquire it"],"info":{}}
{"id":"train_19942","question":"Which books are in Bill Gates collection?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P195 wd:Q5284 . ?sbj wdt:P31 wd:Q2217259 }","paraphrases":["What books does Bill Gates own?"],"info":{}}
{"id":"train_19943","question":"Who is the  {human} for {member of political party} of {Social Democratic Party of Germany}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P102 wd:Q49768 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the {human} for {part of political party} of {Social Law based Party of Germany}"],"info":{}}
{"id":"train_19945","question":"Is Amsterdam located in or next to a body of water?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q727 wdt:P206 wd:Q338137 }","paraphrases":["Is Amsterdam near a body of water?"],"info":{}}
{"id":"train_19946","question":"What caused Jimi Hendrix to die from asphyxia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5928 p:P509 ?s . ?s ps:P509 wd:Q193840 . ?s pq:P805 ?value }","paraphrases":["Why did Jimi Hendrix die of asphyxia?"],"info":{}}
{"id":"train_19947","question":"What determination method is the estimation process for population of Virginia Beach?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q49259 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q791801 }","paraphrases":["What estimation process is the determation method of Virginia Beach's population?"],"info":{}}
{"id":"train_19950","question":"Which is the parent taxon for Python reticulatus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P171 wd:Q216136 }","paraphrases":[],"info":{}}
{"id":"train_19951","question":"what is bnc id for university of salamanca?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q308963 wdt:P1890 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19953","question":"What is the population of Austria-Hungary in the year of 1914?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q28513 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1914' ) ) }","paraphrases":["Give me the population of Austria-Hungary in 1914."],"info":{}}
{"id":"train_19954","question":"Who wrote the bibliographic citation titled SIV-induced instability of the chimpanzee gut microbiome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34986975 wdt:P2860 ?X . ?X wdt:P50 ?answer }","paraphrases":["Who composed the bibliographic quotation titled SIV-induced precariousness of the chimpanzee intestine microbiome?"],"info":{}}
{"id":"train_19955","question":"How many newspaper formats are there for the newspaper?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3912 wd:Q11032 }","paraphrases":["How many different newspaper layouts are there?"],"info":{}}
{"id":"train_19956","question":"What is the tourist attraction with the word petronas in the name had the main building contractor of Hazama Corporation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q570116 . ?sbj wdt:P193 wd:Q4410214 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'petronas' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the vacation destination with the word petronas in the name had the principle building temporary worker of Hazama Corporation?"],"info":{}}
{"id":"train_19958","question":"What temperature is calcium carbonate that had a density of 2.7?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q23767 p:P2054 ?s . ?s ps:P2054 ?x filter ( contains ( ?x , '2.7' ) ) . ?s pq:P2076 ?value }","paraphrases":["At what temperature does calcium carbonate have a density of 2.7?"],"info":{}}
{"id":"train_19960","question":"What is the daily does of lidocaine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q216935 wdt:P4250 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19961","question":"Which is the EHAK ID for Tallinn?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1770 wdt:P1140 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19962","question":"Mention the position secured by Saint George","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q48438 wdt:P106 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["Specify the position secured by Holy person George"],"info":{}}
{"id":"train_19963","question":"In what year did Constans II die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41613 wdt:P20 ?X . ?X wdt:P47 ?answer }","paraphrases":["In what year did Constans II die?"],"info":{}}
{"id":"train_19964","question":"What is the career of the religious affiliation of First Epistle of John?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131101 wdt:P140 ?X . ?X wdt:P106 ?answer }","paraphrases":["What is the career of the devout connection of To begin with Epistle of John?"],"info":{}}
{"id":"train_19965","question":"What is the Hypertext Transfer Protocol document","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8777 wdt:P92 ?obj . ?obj wdt:P31 wd:Q560361 }","paraphrases":["Describe a Hypertext Transfer Protocol document"],"info":{}}
{"id":"train_19966","question":"Was Aaron_Burr position held Vice President of the United States and Attorney General of New York?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q179090 wdt:P39 wd:Q11699 . wd:Q179090 wdt:P39 wd:Q7013056 }","paraphrases":["Did Aaron Burr hold the position of Vice President of the US and Attorney General of New York?"],"info":{}}
{"id":"train_19967","question":"Learn the meaning of this sign in sign language at LSFVocabInformer.ogv.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9081 wdt:P828 ?answer . ?answer wdt:P2919 ?x FILTER ( contains ( ?x , 'LSF Vocab informer.ogv' ) ) }","paraphrases":["Learn the that means of this sign in signal language at LSFVocabInformer.ogv."],"info":{}}
{"id":"train_19968","question":"What is the French pronunciation of apple?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q89 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q150 }","paraphrases":["How do you pronounce the word apple in French?"],"info":{}}
{"id":"train_19969","question":"Benjamin Franklin is of what Mormon Literature and Creative Arts Database Artist ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q34969 wdt:P5469 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19971","question":"What are the three phases of water?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q106410 . ?s pq:P2077 ?value1 . ?s pq:P515 ?value2 }","paraphrases":["What are the water's three phases?"],"info":{}}
{"id":"train_19972","question":"Tell me religion  whose name has the word yarsanism in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9174 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yarsanism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me naval offensive whose name has the word attack in it."],"info":{}}
{"id":"train_19974","question":"Give the name of the taxon with the lowest chromosome quantity whose progenitor is Passifloraceae.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16521 . ?ent wdt:P5230 ?obj . ?ent wdt:P171 wd:Q157164 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Give the identify of the taxon with the lowest chromosome volume whose progenitor is Passifloraceae."],"info":{}}
{"id":"train_19975","question":"Who is the student of Ruhollah Khomeini?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q38823 wdt:P1066 ?ans_1 . wd:Q38823 wdt:P802 ?ans_2 }","paraphrases":["Who is Ruhollah Khomeini's student?"],"info":{}}
{"id":"train_19977","question":"What are the intelligence agency which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47913 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an intelligence agency that begins with an S."],"info":{}}
{"id":"train_19978","question":"Which is the ESPN X Games athlete ID of Nyjah Huston?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2185882 wdt:P4893 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19979","question":"Who was the consecrator for Paul VI?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1598 wd:Q16975 }","paraphrases":[],"info":{}}
{"id":"train_19980","question":"Who gave the {member of} of {author} of {Private Investigations} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2253494 wdt:P676 ?X . ?X wdt:P463 ?answer }","paraphrases":["Who was the author of Private Investigations?"],"info":{}}
{"id":"train_19981","question":"What is the county seat for the train station serves at the Qamishi Airport?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1432529 wdt:P931 ?X . ?X wdt:P1376 ?answer }","paraphrases":["Name the county seat for the train station that services the Qamishi Airport."],"info":{}}
{"id":"train_19982","question":"How many days left until Mother's Day?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q47502 wdt:P837 ?obj }","paraphrases":["What is the number of days left until Mother's Day?"],"info":{}}
{"id":"train_19984","question":"What is signs of cause  of tetraethyl pyrophosphate ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q933664 wdt:P1542 ?X . ?X wdt:P780 ?answer }","paraphrases":["What is signs and symptoms of motive of tetraethyl pyrophosphate ?"],"info":{}}
{"id":"train_19985","question":"What is the Population I star of Neptune","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q332 wdt:P397 ?obj . ?obj wdt:P31 wd:Q3592493 }","paraphrases":["Which star of Neptune is Population 1?"],"info":{}}
{"id":"train_19987","question":"Krater is the predecessor of what civilization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q476968 wdt:P2596 ?X . ?X wdt:P1365 ?answer }","paraphrases":["Krater is the forerunner of what civilization?"],"info":{}}
{"id":"train_19988","question":"What are the coordinates for the International Atomic Energy Agency headquartered in Vienna?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41984 p:P159 ?s . ?s ps:P159 wd:Q1741 . ?s pq:P625 ?value }","paraphrases":["The International Atomic Energy Agency is headquartered in Vienna at which coordinates?"],"info":{}}
{"id":"train_19989","question":"What are the coordinates to the source of the Murray River?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q183078 p:P625 ?s . ?s ps:P625 ?obj . ?s pq:P518 wd:Q7376362 }","paraphrases":["What are coordinates of Murray River beginning?"],"info":{}}
{"id":"train_19990","question":"How many types of orbits are with the {low Earth orbit} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P522 wd:Q663611 }","paraphrases":["The number of IOW types of Earth orbit are?"],"info":{}}
{"id":"train_19994","question":"Where was the creator of \"Nude Figure\" born?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20816408 wdt:P170 ?X . ?X wdt:P19 ?answer }","paraphrases":["Which is the birthplace of the creator of \"Nude Figure\" ?"],"info":{}}
{"id":"train_19998","question":"Which is World Waterfall Database ID for Iguaçu Falls?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q36332 wdt:P3326 ?answer }","paraphrases":[],"info":{}}
{"id":"train_19999","question":"What area has Ryan Reynolds lived in that has a border with West Athens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192682 wdt:P551 ?answer . ?answer wdt:P47 wd:Q1669280 }","paraphrases":["What area has Ryan Reynolds lived in that has a border with West Athens?"],"info":{}}
{"id":"train_20003","question":"Was Quantum_mechanics creator Max Planck and Eugene Wigner ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q944 wdt:P170 wd:Q9021 . wd:Q944 wdt:P170 wd:Q155790 }","paraphrases":["Did Max Planck and Eugene Wigner create Quantum_mechanics?"],"info":{}}
{"id":"train_20005","question":"Did Leonard Cohen work in the same field as Gil Scott-Heron?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1276 wdt:P136 wd:Q378858 }","paraphrases":["Did Gil Scott-Heron and Leonard Cohen work in similar fields?"],"info":{}}
{"id":"train_20006","question":"What is the { start time } for { Jakarta } as { Tokyo } has { twined administrative body }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3630 p:P190 ?s . ?s ps:P190 wd:Q1490 . ?s pq:P580 ?value }","paraphrases":["The {start time} for {Jakarta} as {Tokyo} has"],"info":{}}
{"id":"train_20007","question":"Where is the place of death of John Stuart Mill, that is also a sister city of Ioannina?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q50020 wdt:P20 ?answer . ?answer wdt:P190 wd:Q183199 }","paraphrases":["Where is the put of passing of John Stuart Process, that's moreover a sister city of Ioannina?"],"info":{}}
{"id":"train_20008","question":"How many members were part of the Catholic Church in 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9592 p:P2124 ?s . ?s ps:P2124 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["What was the number of members which were part of the Catholic Church in 2015?"],"info":{}}
{"id":"train_20010","question":"What is the language of work and narrative location of the book Of Mice and Men?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q457977 wdt:P407 ?ans_1 . wd:Q457977 wdt:P840 ?ans_2 }","paraphrases":["In what language is the book Of Mice and Men and where is it set?"],"info":{}}
{"id":"train_20012","question":"Name a book written by Joseph Heller that starts with letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47461344 . ?sbj wdt:P50 wd:Q208101 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a book written by means of Joseph Heller that begins with letter P"],"info":{}}
{"id":"train_20013","question":"Which school did Gerard Butler attend?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q169982 wdt:P69 ?answer . ?answer wdt:P3793 ?x FILTER ( contains ( ?x , '2001:630:40::/48' ) ) }","paraphrases":["Which school did Gerard Butler go to?"],"info":{}}
{"id":"train_20014","question":"Tell me what is the determination method for hepatitis B with a genetic association of HLA-DPB1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6853 p:P2293 ?s . ?s ps:P2293 wd:Q18026941 . ?s pq:P459 ?value }","paraphrases":["Which determination method is used for hepatitis B with a genetic association of HLA-DPB1?"],"info":{}}
{"id":"train_20018","question":"Where is Priyanka Chopra's citizenship and what is her religion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q158957 wdt:P140 ?ans_1 . wd:Q158957 wdt:P27 ?ans_2 }","paraphrases":["Where is Priyanka Chopra's citizenship and what is her religion?"],"info":{}}
{"id":"train_20019","question":"After London Bridge, what crossing comes upstream next?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q130206 wdt:P2673 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20020","question":"Was Jon Voight nominated for Broadcast Film Critics Association Award for Best Supporting Actor and Boston Society of Film Critics Award for Best Actor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q167520 wdt:P1411 wd:Q922348 . wd:Q167520 wdt:P1411 wd:Q894591 }","paraphrases":["Did the Broadcast Film Critics Association Award for Best Supporting Actor and Boston Society of Film Critics Award for Best Actor have Jon Voight as a nominee?"],"info":{}}
{"id":"train_20023","question":"does the program support the language of the assembly language","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3985 wd:Q165436 }","paraphrases":[],"info":{}}
{"id":"train_20024","question":"What tributary ends in the Jari River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2670262 wdt:P403 ?X . ?X wdt:P974 ?answer }","paraphrases":["What tributary closes within the Jari Stream?"],"info":{}}
{"id":"train_20027","question":"Where is Islamabad located ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1362 wdt:P2633 ?obj . ?obj wdt:P31 wd:Q46865913 }","paraphrases":["What is the location of Islamabad?"],"info":{}}
{"id":"train_20028","question":"Is it true Nicole_Kidman country of citizenship Australia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q37459 wdt:P27 wd:Q408 }","paraphrases":["Is Nicole Kidman an Australian citizen?"],"info":{}}
{"id":"train_20029","question":"what is owned by google that is end time is 2015-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q95 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["What ended for Google in 2015?"],"info":{}}
{"id":"train_20031","question":"who member  of played by of The Blue Ridge Rangers Rides Again ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7718827 wdt:P175 ?X . ?X wdt:P463 ?answer }","paraphrases":["who part of played by of The Blue Edge Officers Rides Once more ?"],"info":{}}
{"id":"train_20032","question":"Which is the École normale alumnus ID for Joseph Fourier?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q8772 wdt:P5373 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20034","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q747702 wdt:P138 ?answer . ?answer wdt:P166 wd:Q844872 }","paraphrases":["What is it?"],"info":{}}
{"id":"train_20036","question":"Who replaced Benjamin Disraeli as the Prime Minister of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q82006 p:P39 ?s . ?s ps:P39 wd:Q14211 . ?s pq:P1365 ?value }","paraphrases":["Who was Benjamin Disraeli's replacement as Prime Minister of the United Kingdom?"],"info":{}}
{"id":"train_20037","question":"what is solves os make use of  link state  routing protocol?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1755411 wdt:P2283 ?X . ?X wdt:P2159 ?answer }","paraphrases":["What does the link state routing protocol solve?"],"info":{}}
{"id":"train_20039","question":"What are the spiritual practice which start with the letter mana","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2270606 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'mana' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the spiritual practice that begins with the mana letter?"],"info":{}}
{"id":"train_20040","question":"What are the dialect that writing system Cantonese Braille and which that starts with the letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33384 . ?sbj wdt:P282 wd:Q13586477 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the dialect that writing system Cantonese Braille and which that begins with the letter c"],"info":{}}
{"id":"train_20042","question":"What is the flag for the Flag of China?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P163 wd:Q131147 }","paraphrases":[],"info":{}}
{"id":"train_20043","question":"When did Brett Favre become a member of the Green Bay Packers?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q267088 p:P54 ?s . ?s ps:P54 wd:Q213837 . ?s pq:P580 ?value }","paraphrases":["What was the date when Brett Favre started as a player on the Green Bay Packers?"],"info":{}}
{"id":"train_20045","question":"To which musical genre does the musician Disappeared belong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5281287 wdt:P175 ?X . ?X wdt:P136 ?answer }","paraphrases":["Disappeared can be defined as which genre?"],"info":{}}
{"id":"train_20046","question":"What was the role of W.E.B. Du Bois as a member of Alpha Phi Alpha?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q158060 p:P463 ?s . ?s ps:P463 wd:Q2839513 . ?s pq:P2868 ?value }","paraphrases":["What did WEB Du Bois do in the Alpha Phi Alpha?"],"info":{}}
{"id":"train_20049","question":"What episode in the series Marc Anthony is entitles Marco?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q26625 p:P735 ?s . ?s ps:P735 wd:Q17520955 . ?s pq:P1545 ?value }","paraphrases":["Which episode in the Marc Anthony series is rntitled Marco?"],"info":{}}
{"id":"train_20050","question":"Tell me city with millions of inhabitants whose name has the word voronezh in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1637706 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'voronezh' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the epic piece which start with the letter tambuka"],"info":{}}
{"id":"train_20051","question":"What is the population of Butuan","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1686 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '298378.0' ) ) . ?s pq:P585 ?value }","paraphrases":["Tell me the population of Butuan?"],"info":{}}
{"id":"train_20052","question":"business entity in Russia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q172957 wdt:P176 ?answer . ?answer wdt:P1454 wd:Q134161 }","paraphrases":["commerce substance in Russia"],"info":{}}
{"id":"train_20054","question":"What is the higher taxon of Gnathostomata, which was introduced at -525000000-0-0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26214 wdt:P171 ?answer . ?answer wdt:P580 ?x FILTER ( contains ( YEAR ( ?x ) , '0000' ) ) }","paraphrases":["What is the higher taxon of Gnathostomata, which was presented at -525000000-0-0?"],"info":{}}
