{"id":"train_8410","question":"Who is the {state university system} for {affiliation} of {Purdue University}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q217741 wdt:P1416 ?obj . ?obj wdt:P31 wd:Q1075106 }","paraphrases":["Who is the {state college framework} for {alliance} of {Purdue College}"],"info":{}}
{"id":"train_8411","question":"Who is the nominee for Nirvana whose victor is Moby?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11649 wdt:P1411 ?answer . ?answer wdt:P1346 wd:Q14045 }","paraphrases":["Who is Nirvana's nominee whose winner is Moby?"],"info":{}}
{"id":"train_8412","question":"what is the class IIIA combustible liquid with the highest vapor pressure whose has part is chlorine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q21009058 . ?ent wdt:P2119 ?obj . ?ent wdt:P527 wd:Q688 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What class IIIA combustible liquid that has chlorine has the highest vapor pressure?"],"info":{}}
{"id":"train_8413","question":"\"Which characters on Friends have an end time for work at 2004-0-0?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q79784 wdt:P674 ?answer . ?answer wdt:P2032 ?x FILTER ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["\"Which characters on Companions have an conclusion time for work at 2004-0-0?\""],"info":{}}
{"id":"train_8414","question":"Is it true that the disease burden of air pollution equals to 1001000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q131123 wdt:P2854 ?obj filter ( ?obj = 1001000 ) }","paraphrases":["Is it true that air pollution's disease burden is equal to 1001000?"],"info":{}}
{"id":"train_8415","question":"Which is the chemical composition of drug used for treatment of Asthma?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q35869 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q11173 }","paraphrases":["Which is the chemical composition of sedate utilized for treatment of Asthma?"],"info":{}}
{"id":"train_8416","question":"Who is the chairperson of the Communist Party of China and who are his followers?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q17427 p:P488 ?s . ?s ps:P488 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["Who is the chairperson of the Communist Party of China and who are his followers?"],"info":{}}
{"id":"train_8417","question":"\"Which is {manufactured from} of {lumber}, that has {user} is {wood carver} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1370714 wdt:P186 ?answer . ?answer wdt:P1535 wd:Q6138343 }","paraphrases":["\"Which is {fabricated from} of {stumble}, that has {client} is {wood carver} ?\""],"info":{}}
{"id":"train_8418","question":"Which is the infectious disease that has effect on bacteria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q10876 wdt:P1542 ?obj . ?obj wdt:P31 wd:Q18123741 }","paraphrases":["Which is the irresistible infection that has impact on bacteria?"],"info":{}}
{"id":"train_8422","question":"What is the partner city of Nice that has 315196 inhabitants?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q33959 wdt:P190 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '315196' ) ) }","paraphrases":["What is the associate city of Nice that has 315196 inhabitants?"],"info":{}}
{"id":"train_8423","question":"What award did The Beatles receive in 1996?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1299 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1996' ) ) }","paraphrases":["Which award did The Beatles receive in 1996?"],"info":{}}
{"id":"train_8425","question":"Which is the academic degree and the academic major of Maximilien Robespierre who was educated at the Lycée Louis-le-Grand?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q44197 p:P69 ?s . ?s ps:P69 wd:Q1059546 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["Which is the scholastic degree and the scholarly major of Maximilien Robespierre who was taught at the Lycée Louis-le-Grand?"],"info":{}}
{"id":"train_8426","question":"What is Mary Pickford's first name?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q104109 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '1' ) ) }","paraphrases":["What first name did Mary Pickford use in real life?"],"info":{}}
{"id":"train_8428","question":"Who appointed Robert F. Kennedy yo U.S. Attorney General?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q25310 p:P39 ?s . ?s ps:P39 wd:Q636207 . ?s pq:P748 ?value }","paraphrases":["Robert F. Kennedy was appointed by who?"],"info":{}}
{"id":"train_8429","question":"Who spoke in the historic period of Marcus Vipsanius Agrippa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q48174 wdt:P2348 ?X . ?X wdt:P989 ?answer }","paraphrases":["Who spoke in Marcus Vipsanius Agrippa's historical period?"],"info":{}}
{"id":"train_8431","question":"What are the institution of the European Union  which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q748720 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the institution of the European Union which begin with the letter s"],"info":{}}
{"id":"train_8434","question":"Give the largest block size of block cipher?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q543151 . ?ent wdt:P2599 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the largest block size of cipher?"],"info":{}}
{"id":"train_8435","question":"What was Roger Martin du Gard nominated for on January 1, 1935?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q129155 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1935' ) ) }","paraphrases":["On January 1, 1935 what was Roger Martin du Gard nominated for?"],"info":{}}
{"id":"train_8436","question":"what is the MASL of the twin town of lasi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q46852 wdt:P190 ?X . ?X wdt:P2044 ?answer }","paraphrases":["what is the MASL of the twin town of lasi?"],"info":{}}
{"id":"train_8437","question":"Which award did Corin Tellado receive in the year 1998?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1813126 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1998' ) ) }","paraphrases":["In 1998 Corin Tellado received what award?"],"info":{}}
{"id":"train_8441","question":"IS THE ALEXA RANK OF THE PLURK GREATER THAN 1307.2","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q32111 wdt:P1661 ?obj filter ( ?obj > 1307.2 ) }","paraphrases":["Is 1307.2 less than the Alexa rank of the Plurk?"],"info":{}}
{"id":"train_8442","question":"who  is makes use  of sports of European Poker Tour season 2 results ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3060792 wdt:P641 ?X . ?X wdt:P2283 ?answer }","paraphrases":["Who makes use of the European Poker Tour season 2 results?"],"info":{}}
{"id":"train_8443","question":"What is on the shore of the Atlantic coastal plain with the Barranco de Tahodio tributary?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q756832 wdt:P206 ?answer . ?answer wdt:P974 wd:Q5719981 }","paraphrases":["What is on the shore of the Atlantic coastal simple with the Barranco de Tahodio tributary?"],"info":{}}
{"id":"train_8446","question":"What writing system does Malayalam use?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q36236 wdt:P282 ?obj . ?obj wdt:P31 wd:Q29517555 }","paraphrases":["What composing framework does Malayalam utilize?"],"info":{}}
{"id":"train_8447","question":"What are the social skills which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1413287 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the social aptitudes which begin with the letter s"],"info":{}}
{"id":"train_8448","question":"Name the painting that features Mona Lisa and that starts wit letter L","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3305213 . ?sbj wdt:P608 wd:Q15087813 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the painting that aspects Mona Lisa and that starts wit letter L"],"info":{}}
{"id":"train_8449","question":"Who is the role model of Henry Wadsworth Longfellow that is a member of Arte dei Medici e Speziali?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q152513 wdt:P737 ?answer . ?answer wdt:P463 wd:Q526004 }","paraphrases":["Which member of Arte dei Medici e Speziali is the role model of Henry Wadsworth Longfellow?"],"info":{}}
{"id":"train_8450","question":"Tell me about the discipline of Russian studies.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2578 wd:Q7737 . ?sbj wdt:P31 wd:Q11862829 }","paraphrases":["Let me know approximately the teach of Russian studies."],"info":{}}
{"id":"train_8451","question":"In the administrative territory of Volary, which Acer pseudoplatanus has the smallest perimeter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q156944 . ?ent wdt:P2547 ?obj . ?ent wdt:P131 wd:Q509207 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Within the regulatory region of Volary, which Acer pseudoplatanus has the littlest perimeter?"],"info":{}}
{"id":"train_8453","question":"What are theelectromagnetic radiationwhich start with the letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12969754 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the electromagnetic radiations that begin with alphabet R."],"info":{}}
{"id":"train_8454","question":"Who is the {port city} for {narrative location} of {Twenty Thousand Leagues Under the Sea}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q183565 wdt:P840 ?obj . ?obj wdt:P31 wd:Q2264924 }","paraphrases":["What port city is narrated about in 20,000 Leagues under the sea?"],"info":{}}
{"id":"train_8458","question":"Which nomination did Geraldine Page receive for her work in \"You're a Big Boy Now\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q228650 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P1686 wd:Q858584 }","paraphrases":["What was Geraldine Page's nomination  for her role in \"You're a Big Boy Now\"?"],"info":{}}
{"id":"train_8459","question":"Are Mumbai and Los Angeles twin cities?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1156 wdt:P190 wd:Q65 }","paraphrases":["Is Mumbai the twin city of Los Angeles?"],"info":{}}
{"id":"train_8460","question":"What is FC Barcelona's parent club?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7156 wdt:P831 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8461","question":"Where in Belgium is the headquarters of the Council of the European Union?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8896 p:P159 ?s . ?s ps:P159 ?obj . ?s pq:P17 wd:Q31 }","paraphrases":["I want to know the location in Belgium of the headquarters of the Council of the European Union."],"info":{}}
{"id":"train_8465","question":"What degree did Zora Neale Hurston earn from Barnard College, and what was the major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q220480 p:P69 ?s . ?s ps:P69 wd:Q167733 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["Which degree and what major did Zora Neale Hurston earn upon graduation from Barnard College?"],"info":{}}
{"id":"train_8466","question":"For what movie was Anne Baxter nominated for the Academy Award for Best Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q228906 p:P1411 ?s . ?s ps:P1411 wd:Q103618 . ?s pq:P805 ?value }","paraphrases":["When Anne Baxter was nominated for the Oscar for Best Actress, what film was it for?"],"info":{}}
{"id":"train_8468","question":"Was Audrey_Hepburn wears Caesar cut?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q42786 wdt:P3828 wd:Q5017017 }","paraphrases":["Did Audrey Hepburn ever wear a Caesar cut?"],"info":{}}
{"id":"train_8474","question":"Is it true Ashton_Kutcher country of citizenship United States of America?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q164782 wdt:P27 wd:Q30 }","paraphrases":["Is Ashton Kutcher's citizenship that of the United States of America?"],"info":{}}
{"id":"train_8476","question":"who type of quantum particle for discoverer or inventor of CERN?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P61 wd:Q42944 . ?sbj wdt:P31 wd:Q22675015 }","paraphrases":["who sort of quantum molecule for pioneer or creator of CERN?"],"info":{}}
{"id":"train_8477","question":"When was Henri Moissan nominated for a Nobel Prize in Chemistry?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q102804 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value }","paraphrases":["In what year was Henri Moissan nominated for a Nobel Prize for Chemistry?"],"info":{}}
{"id":"train_8479","question":"Who is the central bank/issuer of Russian ruble?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41044 wdt:P562 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8480","question":"WHICH IS THE PRIME NUMBER WITH THE MAXIMUM NUMERIC VALUE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q49008 . ?ent wdt:P1181 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the prime number with the maximum numeric value?"],"info":{}}
{"id":"train_8481","question":"What is on shore of Olympic Peninsula whose tributary is Maria Linda River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q780293 wdt:P206 ?answer . ?answer wdt:P974 wd:Q5937883 }","paraphrases":["What's on the shore of Maria Linda River's Olympic Peninsula tributary?"],"info":{}}
{"id":"train_8482","question":"Who is the architect for the Flatiron Building ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q220728 wdt:P84 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the planner for the Flatiron Building ?"],"info":{}}
{"id":"train_8484","question":"which force starts with the letter f","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11402 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which drive begins with the letter f"],"info":{}}
{"id":"train_8487","question":"What award did Mikhail Prokhorov receive on 01/01/2006?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q233581 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2006' ) ) }","paraphrases":["Which honor was received on 01/01/2006 by Mikhail Prokhorov?"],"info":{}}
{"id":"train_8488","question":"What was the area code of Cần Thơ in July 16th 2017?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q216075 p:P473 ?s . ?s ps:P473 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2017' ) ) }","paraphrases":["Name the area code of Cần Thơ in July 16th 2017?"],"info":{}}
{"id":"train_8490","question":"What is the color of the rail line that connects to Elbbrücken?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11877023 wdt:P81 ?X . ?X wdt:P462 ?answer }","paraphrases":["What is the color of the rail line that interfaces to Elbbrücken?"],"info":{}}
{"id":"train_8492","question":"What is diplomatic relation for sovereign state of Jabalpur ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q200878 wdt:P17 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is conciliatory connection for paramount state of Jabalpur ?"],"info":{}}
{"id":"train_8493","question":"When did Sheikh Mujibur Rahman become president of Bangladesh?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q191375 p:P39 ?s . ?s ps:P39 wd:Q596123 . ?s pq:P580 ?value }","paraphrases":["Sheikh Mujibur Rahman became president of Bangaldesh in which year?"],"info":{}}
{"id":"train_8494","question":"What is educated at Gene Amdahl for theoretical physics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q62890 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 wd:Q18362 }","paraphrases":["What kind of education for theoretical physics is offered at Gene Amdahl?"],"info":{}}
{"id":"train_8496","question":"What is Francis Bacon's native language.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37388 wdt:P1412 ?X . ?X wdt:P2989 ?answer }","paraphrases":["What is Francis Bacon's local language."],"info":{}}
{"id":"train_8497","question":"What is the deathplace of Philip II of Spain, that has the coordinates of 40.418888888889 -3.6919444444444?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34417 wdt:P20 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '40.418888888889 -3.6919444444444' ) ) }","paraphrases":["What is the deathplace of Philip II of Spain, that has the facilitates of 40.418888888889 -3.6919444444444?"],"info":{}}
{"id":"train_8498","question":"What is the gross tonnage of the Bluenose II, 191?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2714647 wdt:P1093 ?obj filter ( ?obj = 191 ) }","paraphrases":["Can you state the gross tonnage of the Bluenose II, 191?"],"info":{}}
{"id":"train_8500","question":"When was Ted Kaczynski educated at Harvard University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q222134 p:P69 ?s . ?s ps:P69 wd:Q13371 . ?s pq:P580 ?value }","paraphrases":["During what time was Ted Kaczynski educated at Harvard University?"],"info":{}}
{"id":"train_8503","question":"WHICH IS ARCHON CODE FOR AMHERST COLLEGE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q49165 wdt:P3642 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8504","question":"Which sovereign state is located in the administrative territorial entity of Khyber Pakhtunkhwa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q183314 wdt:P131 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["Which sovereign state is situated in the authoritative regional substance of Khyber Pakhtunkhwa?"],"info":{}}
{"id":"train_8505","question":"Who is the plaintiff in Obergefell v. Hodges?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q19866992 wdt:P1620 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Is the plaintiff Obergefell or Hodges?"],"info":{}}
{"id":"train_8506","question":"How many categories are there for women's sports?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2094 wd:Q920057 }","paraphrases":["Which sports categories may women participate in?"],"info":{}}
{"id":"train_8508","question":"Whats is the trans-Neptunian object discovered by Jan Oort that contains the word \"cloud\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6592 . ?sbj wdt:P61 wd:Q309861 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'cloud' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Whats is the trans-Neptunian object observed by way of Jan Oort that consists of the word \"cloud\" in its name"],"info":{}}
{"id":"train_8509","question":"Is the Euler characteristic of the genus-two surface less than -2.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5533830 wdt:P6438 ?obj filter ( ?obj < -2.4 ) }","paraphrases":["Is the Euler characteristic of the genus-two surface less than -2.4?"],"info":{}}
{"id":"train_8511","question":"For what movie Alain Resnais was nominated to the César Award for Best Adaptation?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q218022 p:P1411 ?s . ?s ps:P1411 wd:Q832120 . ?s pq:P1686 ?value }","paraphrases":["Which film won Alain Resnais the nomination for the Cesar Award for Best Adaptation?"],"info":{}}
{"id":"train_8512","question":"Who is the {student of} the {student} of {Michael_Faraday} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q8750 wdt:P1066 ?ans_1 . wd:Q8750 wdt:P802 ?ans_2 }","paraphrases":["Who is the {understudy of} the {understudy} of {Michael_Faraday} ?"],"info":{}}
{"id":"train_8515","question":"\"Which is {godmother} of {Camillo Benso di Cavour}, whose {craft} is {politician} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q166092 wdt:P1290 ?answer . ?answer wdt:P106 wd:Q82955 }","paraphrases":["\"Which is {adoptive parent} of {Camillo Benso di Cavour}, whose {make} is {lawmaker} ?\""],"info":{}}
{"id":"train_8517","question":"Who is the sidekick of Superman","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2546 wd:Q79015 . ?sbj wdt:P31 wd:Q188784 }","paraphrases":["Who is the sidekick of Superman"],"info":{}}
{"id":"train_8518","question":"Name a scientist working in the microbiology field","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1066 wd:Q7193 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is the name of a microbiologist?"],"info":{}}
{"id":"train_8519","question":"What is Ninja's field of this occupation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9402 wdt:P425 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8521","question":"What is the diplomatic relationship between Indonesia and Switzerland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q39 p:P530 ?s . ?s ps:P530 ?obj . ?s pq:P805 wd:Q15948966 }","paraphrases":["Regarding diplomacy, what kind of relationship does Indonesia and Switzerland have?"],"info":{}}
{"id":"train_8522","question":"Tell me the role of Simeon Denis Poison with Pierre-Simon Laplace?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q190772 p:P184 ?s . ?s ps:P184 wd:Q44481 . ?s pq:P3831 ?value }","paraphrases":["What role did Simeon Denis Poison take with Pierre-Simon Laplace?"],"info":{}}
{"id":"train_8523","question":"Which point in time for Charles Boyer has award received as Academy Honorary Award ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q105987 p:P166 ?s . ?s ps:P166 wd:Q727328 . ?s pq:P585 ?value }","paraphrases":["When did Charles Boyer receive the Academy Honorary Reward?"],"info":{}}
{"id":"train_8524","question":"Name a weekly newspaper based in Chicago that starts with letter O","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2305295 . ?sbj wdt:P159 wd:Q1297 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a weekly day by day paper based in Chicago that starts with letter O"],"info":{}}
{"id":"train_8525","question":"When was the 8.00102e+06 population of Virginia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1370 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '8.00102e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["When was the 8.00102e+06 populance of Virginia?"],"info":{}}
{"id":"train_8526","question":"What is ISC event ID for 2011 Tōhoku earthquake and tsunami ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q36204 wdt:P5092 ?answer }","paraphrases":[],"info":{}}
