{"id":"train_9520","question":"who is the member and located in or next to body of water of Robbie_Williams?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q47875 wdt:P54 ?ans_1 . wd:Q47875 wdt:P463 ?ans_2 }","paraphrases":["Who is locate next to Robbie Williams in body of water"],"info":{}}
{"id":"train_9521","question":"Which word in the Bede language has a masculine gender language expression?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q154938 wdt:P1412 ?answer . ?answer wdt:P5109 wd:Q499327 }","paraphrases":["Which word in the Bede language has a masculine gender language expression?"],"info":{}}
{"id":"train_9525","question":"What is Boléro dedicated to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q327331 wdt:P825 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9526","question":"When Frédéric Mistral was nominated for Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42596 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["In what year was Frederic Mistral short-listed for the Literature Nobel?"],"info":{}}
{"id":"train_9530","question":"What are the components of the yeast, \"Saccharomyces cerevisiae\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P427 wd:Q719725 . ?sbj wdt:P31 wd:Q16521 }","paraphrases":["What are \"Saccharomyces cerevisiae\" yeast components?"],"info":{}}
{"id":"train_9532","question":"Is it true that the number of works on the Robert ap Huw Manuscripts is more than 36.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q55774867 wdt:P3740 ?obj filter ( ?obj > 36.0 ) }","paraphrases":["Does the number of works on the Robert ap Huw Manuscripts surpass 36.0?"],"info":{}}
{"id":"train_9533","question":"What platform do customers use to schedule an Uber?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q780442 wdt:P1056 ?obj . ?obj wdt:P31 wd:Q1668024 }","paraphrases":["Which platform do customers use when planning a Uber?"],"info":{}}
{"id":"train_9538","question":"Which is the genetic association of the murder method of José Ferrer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q312098 wdt:P509 ?X . ?X wdt:P2293 ?answer }","paraphrases":["Which is the genetic association of the homicide method of José Ferrer?"],"info":{}}
{"id":"train_9539","question":"Who is the CEO of ExxonMobil?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q156238 wdt:P169 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the CEO of ExxonMobil?"],"info":{}}
{"id":"train_9540","question":"When was Eric Piolle the the Head of Government of Grenoble?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1289 p:P6 ?s . ?s ps:P6 wd:Q16007948 . ?s pq:P580 ?value }","paraphrases":["What was the timeframe that Eric Piolle was the Head of the Government of Grenoble?"],"info":{}}
{"id":"train_9541","question":"What is the artistic genre of the major works of Joyce Blau?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3187221 wdt:P800 ?X . ?X wdt:P136 ?answer }","paraphrases":["What is the aesthetic kind of the real works of Joyce Blau?"],"info":{}}
{"id":"train_9543","question":"What is the number of games played and points received for Radamel Falcao García when he played on Manchester United F.C.?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q138172 p:P54 ?s . ?s ps:P54 wd:Q18656 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["Radamel Falcao Garcia played how many games and received how many points while playing on Manchester United F.C.?"],"info":{}}
{"id":"train_9544","question":"What is {Human Development Index} of {Bulgaria} that is {point in time} in {1980-0-0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q219 p:P1081 ?s . ?s ps:P1081 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["In 1980, what was the HDI for Bulgaria?"],"info":{}}
{"id":"train_9545","question":"What is award received of Robert Fisk that is point in time is 2000-0-0 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q310900 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["At point in time 2000-0-0, Robert Fisk received which award?"],"info":{}}
{"id":"train_9546","question":"Which is the death place of Bjornstjerne Bjornson, that has local government areas in 11th arrondissement of paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q46405 wdt:P20 ?answer . ?answer wdt:P150 wd:Q169293 }","paraphrases":["Which is the passing put of Bjornstjerne Bjornson, that has neighborhood government zones in 11th arrondissement of paris?"],"info":{}}
{"id":"train_9547","question":"When did position held of Charles Stewart Parnell and elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q317436 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["When was the position held and elected by Charles Stewart Parnell?"],"info":{}}
{"id":"train_9549","question":"which is the academic degree and academic major of slyvia plath who   has educated at  smith college?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q133054 p:P69 ?s . ?s ps:P69 wd:Q49204 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["which is the educational diploma and tutorial primary of slyvia plath who has educated at smith college?"],"info":{}}
{"id":"train_9550","question":"Which part of constellation orbits the Djorgovski 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9207890 wdt:P397 ?X . ?X wdt:P59 ?answer }","paraphrases":["Which part of the Djorgovski 1 orbits the constellation?"],"info":{}}
{"id":"train_9552","question":"Which is C-SPAN person ID for Slavoj Žižek?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q184750 wdt:P2190 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9555","question":"How many people in Japan are considered ethnic Japanese?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q17 p:P172 ?s . ?s ps:P172 wd:Q161652 . ?s pq:P1107 ?value }","paraphrases":["What population of Japan is considered ethnic Japanese?"],"info":{}}
{"id":"train_9557","question":"Mention the chemical composition of water's conjugate acid.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q283 wdt:P4147 ?obj . ?obj wdt:P31 wd:Q11173 }","paraphrases":["What is water's conjugate acid's chemical composition?"],"info":{}}
{"id":"train_9558","question":"Who is the male of Owain Glyndŵr, whose abbreviation is 男?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q317279 wdt:P21 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , '男' ) ) }","paraphrases":["Who is Owain Glyndr's male, whose abbreviation is an abbreviation?"],"info":{}}
{"id":"train_9559","question":"Who co-founded the journal that published the University panel faults cloning co-author?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q53254858 wdt:P1433 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who co - founded the journal publishing faults cloning co - author of the University panel?"],"info":{}}
{"id":"train_9562","question":"What is the overall motif of the painting \"The Art Gallery of Jan Gildemeester Jansz\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17337965 wdt:P180 ?X . ?X wdt:P127 ?answer }","paraphrases":["What is the overall theme of \"The Art Gallery of Jan Gildemeester Jansz\"?"],"info":{}}
{"id":"train_9564","question":"WHICH IS THE TRIBUTARY OF OUTFLOW OF SENEGAL RIVER?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3569 wdt:P403 ?X . ?X wdt:P974 ?answer }","paraphrases":["Where is the tributary outflow of The Senegal River?"],"info":{}}
{"id":"train_9565","question":"Who was the head of the Tucuman Province government starting 10/29/2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q44829 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["Who was the leader of the Tucuman Province beginning on 10/29/2015?"],"info":{}}
{"id":"train_9566","question":"Name the island closest to the river mouth.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23442 . ?ent wdt:P2148 ?obj . ?ent wdt:P31 wd:Q23442 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the island closest to the mouth of the river?"],"info":{}}
{"id":"train_9568","question":"Name the municipality that diocese Roman Catholic Archdiocese of Barcelona and which that starts with the letter b","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15284 . ?sbj wdt:P708 wd:Q1364117 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the municipality that diocese Roman Catholic Archdiocese of Barcelona and which that begins with the letter b"],"info":{}}
{"id":"train_9569","question":"What is film ID of The Big Lebowski on Scope.dk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q337078 wdt:P2518 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9570","question":"WHICH IS THE FR SIRET NUMBER OF ECOLE POLYTECHNIQUE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q273626 wdt:P3215 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9571","question":"Is the number of speakers of the Awakatek more than 21.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q35091 wdt:P1098 ?obj filter ( ?obj > 21.6 ) }","paraphrases":["Are there more than 22 people who speak Awakatek?"],"info":{}}
{"id":"train_9572","question":"Who is film crew member for Alan Menken?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3092 wd:Q317272 }","paraphrases":[],"info":{}}
{"id":"train_9575","question":"Who {has children} of {actor} {The Counterfeit Traitor} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q908713 wdt:P161 ?X . ?X wdt:P40 ?answer }","paraphrases":["Who {has children} of {on-screen character} {The Fake Backstabber} ?"],"info":{}}
{"id":"train_9579","question":"How make lakes are in Tagus river?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q14294 wdt:P469 ?obj }","paraphrases":["What is the number of lakes in the Tagus river?"],"info":{}}
{"id":"train_9581","question":"When did Josephine Baker become a citizen of France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q151972 p:P27 ?s . ?s ps:P27 wd:Q142 . ?s pq:P580 ?value }","paraphrases":["What date did Josephine Baker become a citizen of France"],"info":{}}
{"id":"train_9582","question":"What is the correct period for Messina in the time zone UTC+01:00?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q13666 p:P421 ?s . ?s ps:P421 wd:Q6655 . ?s pq:P1264 ?value }","paraphrases":["Which is the correct period for Messina in the time zone UTC +01:00?"],"info":{}}
{"id":"train_9583","question":"In which role was Dan Blocker cast for the movie Bonanza?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q862187 p:P161 ?s . ?s ps:P161 wd:Q962647 . ?s pq:P3831 ?value }","paraphrases":["In the movie Bonanza, what role was Dan Blocker cast in?"],"info":{}}
{"id":"train_9585","question":"Name the chemical compound of the drug used to treat skin cancer.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q192102 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q11173 }","paraphrases":["What is the chemical compound of the drug used to treat skin cancer?"],"info":{}}
{"id":"train_9587","question":"What is used to make the product, Cessna Model A?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3665640 wdt:P176 ?X . ?X wdt:P1056 ?answer }","paraphrases":["What is utilized to create the item, Cessna Demonstrate A?"],"info":{}}
{"id":"train_9590","question":"Who is the leader of Mossad ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q34216 wdt:P488 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the pioneer of Mossad ?"],"info":{}}
{"id":"train_9591","question":"What is the alkane with the safety classification and labelling of NFPA 704: Standard System for the Identification of the Hazards of Materials for Emergency Response and which has the word \"propane\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41581 . ?sbj wdt:P4952 wd:Q51139288 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'propane' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the alkane with the safety classification and labelling of NFPA 704: Standard System for the Identification of the Hazards of Materials for Emergency Response and which has the phrase \"propane\" in its name?"],"info":{}}
{"id":"train_9594","question":"What is  the synonym  name of found in species of vascular tissue ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q968604 wdt:P703 ?X . ?X wdt:P1420 ?answer }","paraphrases":["Name the synonym of species found in vascular tissue."],"info":{}}
{"id":"train_9597","question":"Is Andres Pastrana Arango the current holder of the presidency in Colombia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q315975 p:P39 ?s . ?s ps:P39 wd:Q853475 . ?s pq:P1365 ?value }","paraphrases":["Is Andres Pastrana Arango Colombia's president?"],"info":{}}
{"id":"train_9600","question":"What is the etymology of Laplace transform whose place of death is Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q199691 wdt:P138 ?answer . ?answer wdt:P20 wd:Q90 }","paraphrases":["What is the historical underpinnings of Laplace change whose put of passing is Paris?"],"info":{}}
{"id":"train_9603","question":"Which is the time period of Menander I?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q347878 wdt:P2348 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9604","question":"Which etchnicity do Russians have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7737 wdt:P2341 ?obj . ?obj wdt:P31 wd:Q41710 }","paraphrases":["What are the ethnicities of Russians?"],"info":{}}
{"id":"train_9605","question":"What is Karl von Frisch's Catalogus Professorum Rostochiensium ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q60060 wdt:P2940 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9607","question":"What are the national library which start with the letter library","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22806 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'library' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the national library which begin with the letter library"],"info":{}}
{"id":"train_9608","question":"What is the temperature of lake Valletta?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23800 wdt:P206 ?X . ?X wdt:P2076 ?answer }","paraphrases":["What is Lake Valletta's temperature?"],"info":{}}
{"id":"train_9610","question":"how many musical conductions are by zubin mehta?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3300 wd:Q157635 }","paraphrases":["Zubin Mehta had what number of musical conductions?"],"info":{}}
{"id":"train_9611","question":"How long has Kharkiv Oblast been located in Ukraine?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q170666 p:P131 ?s . ?s ps:P131 wd:Q212 . ?s pq:P580 ?value }","paraphrases":["Tell me when Kharkiv Oblast started living in Ukraine."],"info":{}}
{"id":"train_9612","question":"What is the sub item of the history of France that has an operating speed of 30.0\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7778 wdt:P1269 ?answer . ?answer wdt:P3086 ?x FILTER ( contains ( ?x , '30.0' ) ) }","paraphrases":["What is the sub thing of the history of France that has an working speed of 30.0\"?"],"info":{}}
{"id":"train_9613","question":"How many armaments are pistols?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P520 wd:Q1907525 }","paraphrases":["What is the number of armaments that are pistols?"],"info":{}}
{"id":"train_9614","question":"What destroyer has the largest draft?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q174736 . ?ent wdt:P2262 ?obj . ?ent wdt:P31 wd:Q174736 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["which of the Destroyer Craft has the most substantial draft?"],"info":{}}
{"id":"train_9617","question":"What body of water is Warsaw near and in what is the time zone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q270 wdt:P206 ?ans_1 . wd:Q270 wdt:P421 ?ans_2 }","paraphrases":["Warsaw is near what body of water and what time zone is it in?"],"info":{}}
{"id":"train_9618","question":"What are the sculptors of Patrick's Staycation/ Walking the Plankton ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q29565419 wdt:P179 ?X . ?X wdt:P170 ?answer }","paraphrases":["What are the stone workers of Patrick's Staycation/ Strolling the Tiny fish ?"],"info":{}}
{"id":"train_9619","question":"who historical period for located on terrain feature of ancient rome?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P706 wd:Q1747689 . ?sbj wdt:P31 wd:Q11514315 }","paraphrases":["Which historical period is characteristic of ancient rome on the terrain?"],"info":{}}
{"id":"train_9620","question":"Does the Peugeot 107 have a wheelbase that is equal to 2340?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q214229 wdt:P3039 ?obj filter ( ?obj = 2340 ) }","paraphrases":["Does the Peugeot 107 have a wheelbase of 2340?"],"info":{}}
{"id":"train_9623","question":"When did Istanbul have a population of 14657434?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q406 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '14657434' ) ) . ?s pq:P585 ?value }","paraphrases":["On what date did Istanbul have a population of 14657434?"],"info":{}}
{"id":"train_9624","question":"Tell me a human who may be fictional that has the word cech in their name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q21070568 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'čech' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know a human who may be anecdotal that has the word cech in their name."],"info":{}}
{"id":"train_9625","question":"What is in the category of queue ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q220543 wdt:P2210 ?answer }","paraphrases":[],"info":{}}
{"id":"train_9626","question":"Name the water body comprised of the Paramaribo","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3001 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["what body of water is comprised of the Paramaribo?"],"info":{}}
{"id":"train_9628","question":"What was Natalie Portman nominated for in 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q37876 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["What was Natalie Portman short-listed for in 2011?"],"info":{}}
{"id":"train_9629","question":"Tell me a specialty that starts with the letter w.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1047113 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["GIVE ME A SPECIALITY THAT STARTS WITH THE LETTER W"],"info":{}}
{"id":"train_9630","question":"Is the vehicle range of the Airbus A380 less than 12160.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5830 wdt:P2073 ?obj filter ( ?obj < 12160.0 ) }","paraphrases":["Is the vehicle range of the Airbus A380 lower than 12160.0?"],"info":{}}
{"id":"train_9633","question":"Which quantum particle with the subclass of lepton has the fastest magnetic movement?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22675015 . ?ent wdt:P2069 ?obj . ?ent wdt:P279 wd:Q82586 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the quantum particle with the subclass of lepton with the fastest magnetic movement."],"info":{}}
{"id":"train_9634","question":"When did Alexios I Komnenos become the Byzantine emperor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41600 p:P39 ?s . ?s ps:P39 wd:Q18577504 . ?s pq:P580 ?value }","paraphrases":["When did Alexios I Kommenos become emperor of Byzatine?"],"info":{}}
{"id":"train_9635","question":"what is book of the bible starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q29154430 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is book of the book of scriptures begins with s"],"info":{}}
{"id":"train_9640","question":"What award did Chris Hadfield receive and when did he receive it ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q1076962 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["For which award did Chris Hadfield get & when?"],"info":{}}
{"id":"train_9641","question":"Tell me incorporation whose name has the word geman in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25394665 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'german' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know joining whose title has the word geman in it."],"info":{}}
{"id":"train_9643","question":"who is investor of Lawrence Summers ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1951 wd:Q317953 }","paraphrases":[],"info":{}}
{"id":"train_9644","question":"What is the country of origin and language of work of Catch-22?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q278208 wdt:P495 ?ans_1 . wd:Q278208 wdt:P407 ?ans_2 }","paraphrases":["What is Catch-22's original country and language?"],"info":{}}
{"id":"train_9645","question":"What what is American football team home venue Soldier Field and also which starts with letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17156793 . ?sbj wdt:P115 wd:Q1132413 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is American soccer group home venue Soldier Field and additionally which starts with letter c"],"info":{}}
{"id":"train_9646","question":"Who is the founder of Alexander McQueen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207939 wdt:P108 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who founded Alexander McQueen?"],"info":{}}
{"id":"train_9647","question":"WHAT ARE THE ASYMMETRIC WARFARE WHICH START WITH THE LETTER D","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q752673 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'd' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE ASYMMETRIC WARFARE WHICH BEGIN WITH THE LETTER D"],"info":{}}
{"id":"train_9649","question":"Which is the BCU Ecrivainsvd for Hugo Pratt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12113 wdt:P1253 ?answer }","paraphrases":[],"info":{}}
