{"id":"train_15648","question":"What stainless steel made by ThyssenKrupp has the least durability?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q172587 . ?ent wdt:P5520 ?obj . ?ent wdt:P176 wd:Q137910 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which stainless steel ThyssenKrupp is least durable?"],"info":{}}
{"id":"train_15649","question":"Was Joseph Goebbels an European American demagogue?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41749 wdt:P106 wd:Q10264925 . wd:Q41749 wdt:P106 wd:Q43103 }","paraphrases":["Is it true that Joseph Goebbels was an European American demagogue?"],"info":{}}
{"id":"train_15652","question":"What is the musical instrument used in the painting of Her Majesty Queen Elizabeth II - An 80th Birthday Portrait?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q24807636 wdt:P170 ?X . ?X wdt:P1303 ?answer }","paraphrases":["What is the musical instrument used in the painting of Her Majesty Queen Elizabeth II - An eightieth Birthday Portrait?"],"info":{}}
{"id":"train_15654","question":"Give the triangular number which is opposite to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P461 wd:Q204 . ?sbj wdt:P31 wd:Q245102 }","paraphrases":["Allow the triangular number which is inverse to 0?"],"info":{}}
{"id":"train_15656","question":"Tell me wine color whose name has the word wine in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8024923 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wine' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me game whose name has the word zauberturm in it"],"info":{}}
{"id":"train_15657","question":"What animal breed is a Thoroughbred?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P4743 wd:Q210826 }","paraphrases":["A thoroughbred is part of what animal breed?"],"info":{}}
{"id":"train_15658","question":"What language translates the name \"Andrew\" into \"Andreas\"?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43399 p:P1559 ?s . ?s ps:P1559 ?obj . ?s pq:P2440 ?x filter ( contains ( ?x , 'Andreas' ) ) }","paraphrases":["In what language would the name \"Andrew\" translate to \"Andreas\"?"],"info":{}}
{"id":"train_15659","question":"what is missionary society that contains the word society in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20746389 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'society' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is evangelist society that contains the word society in their title"],"info":{}}
{"id":"train_15660","question":"Tell me mythical creature whose name has the word seka in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2239243 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'şekä' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me mythical creature whose name has the word seka in it."],"info":{}}
{"id":"train_15661","question":"How much did V. S. Naipaul win for the Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q44593 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P2121 ?value }","paraphrases":["What was the cash prize awarded to V.S. Naipual for the Nobel Prize in Literature?"],"info":{}}
{"id":"train_15663","question":"Which is the medication used to treat inflammation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2175 wd:Q101991 . ?sbj wdt:P31 wd:Q12140 }","paraphrases":[],"info":{}}
{"id":"train_15665","question":"Which is the natural product of taxon for artichoke?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q23041430 wdt:P1582 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15666","question":"Which is the brand for Daimler AG?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q27530 wdt:P1716 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15668","question":"What is the heat capacity of water?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q283 wdt:P2056 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15669","question":"What is the ID for Carl Linnaeus for the Swedish National Archive?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1043 wdt:P5324 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15671","question":"What position held Alan Shepard on November of 1963?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q174979 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1963' ) ) }","paraphrases":["Alan Shepard held what position in November of 1963?"],"info":{}}
{"id":"train_15672","question":"Tell me independent city of Germany whose name has the word zweibrucken in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q22865 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zweibrücken' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know autonomous city of Germany whose title has the word zweibrucken in it ."],"info":{}}
{"id":"train_15675","question":"What is in the category of The Lord of the Rings trilogy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q190214 wdt:P4786 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15676","question":"Is the speed limit of the Netherlands equal to 50?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q55 wdt:P3086 ?obj filter ( ?obj = 50 ) }","paraphrases":["Does the Netherlands have a speed limit of 50?"],"info":{}}
{"id":"train_15678","question":"Tell me a beer festival organized by Landeshauptstadt München with the word \"oktoberfest\" in its name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2919327 . ?sbj wdt:P664 wd:Q1361384 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'oktoberfest' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a beer festival geared up by using Landeshauptstadt München with the phrase \"oktoberfest\" in its name."],"info":{}}
{"id":"train_15681","question":"Who is the Soviet Union's head of state?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q15180 wdt:P35 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the Soviet Union's head of state?"],"info":{}}
{"id":"train_15682","question":"What is the prefecture of Hiroshima in Japan ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q34664 wdt:P131 ?obj . ?obj wdt:P31 wd:Q50337 }","paraphrases":["What is the prefecture of Hiroshima in Japan ?"],"info":{}}
{"id":"train_15684","question":"what is military decoration that contains the word war in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1788716 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'war' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is military enhancement that contains the word war in their name"],"info":{}}
{"id":"train_15685","question":"For what period is Lower Austria located in the UTC+02:00 time zone?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42497 p:P421 ?s . ?s ps:P421 wd:Q6723 . ?s pq:P1264 ?value }","paraphrases":["Lower Austria is located in the UTC+02:00 time zone during what period?"],"info":{}}
{"id":"train_15686","question":"What aspect of history is affiliated with the study of Psychology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2578 wd:Q9418 . ?sbj wdt:P31 wd:Q17524420 }","paraphrases":["What component of history is affiliated with the study of Psychology?"],"info":{}}
{"id":"train_15687","question":"What is the gender and sexual orientation of Stephen Fry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q192912 wdt:P21 ?ans_1 . wd:Q192912 wdt:P91 ?ans_2 }","paraphrases":["Tell me Stephen Fry's gender and sexual orientation."],"info":{}}
{"id":"train_15688","question":"Does InterCityExpress have how many connection services?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1192 wd:Q129172 }","paraphrases":["Which is the number of the connection services that InterCityExpress has?"],"info":{}}
{"id":"train_15689","question":"What is located in Western Ghats that has the same administrative divisions of the Ramanathapuram district?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4527 wdt:P131 ?answer . ?answer wdt:P150 wd:Q15191 }","paraphrases":["What is located in Western Ghats with the same Ramanathapuram district administrative divisions?"],"info":{}}
{"id":"train_15692","question":"Was Odin owner of Fenrir and Gungnir?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q43610 wdt:P1830 wd:Q182560 . wd:Q43610 wdt:P1830 wd:Q827918 }","paraphrases":["Did Odin own both Fenrir and Gungnir?"],"info":{}}
{"id":"train_15696","question":"Who wrote the notable book, The Bigmoon Nights?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4327733 wdt:P86 ?X . ?X wdt:P800 ?answer }","paraphrases":["Who composed the outstanding book, The Bigmoon Nights?"],"info":{}}
{"id":"train_15697","question":"What gold medal award did Pete Townhend get?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26933 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Pete Townhend recieved which gold medal award?"],"info":{}}
{"id":"train_15698","question":"Tell me aircraft functional class whose name has the word twinjet in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20027953 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'twinjet' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the functional class of the aircraft whose name includes the word twinjet."],"info":{}}
{"id":"train_15701","question":"What are the enterprise which start with the letter zinifex","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6881511 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zinifex' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the endeavor which begin with the letter zinifex"],"info":{}}
{"id":"train_15702","question":"Was Liver studied by evolution and hepatology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9368 wdt:P2579 wd:Q1063 . wd:Q9368 wdt:P2579 wd:Q668064 }","paraphrases":["Evolution and Hepatology was the study of Liver, correct?"],"info":{}}
{"id":"train_15703","question":"What are the anatomical structure that contains the word vagina in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4936952 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vagina' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the anatomical structure that contains the word vagina in their title"],"info":{}}
{"id":"train_15704","question":"Name the film that takes place in Los Angeles","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11424 . ?ent wdt:P2208 ?obj . ?ent wdt:P840 wd:Q65 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What is the name of the film that takes place in Los Angeles"],"info":{}}
{"id":"train_15708","question":"What is the film of the musical score of String Quartets, Op. 76?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2919526 wdt:P86 ?X . ?X wdt:P136 ?answer }","paraphrases":["What is the film of the melodic score of String Quartets, Op. 76?"],"info":{}}
{"id":"train_15710","question":"What are the controversy which start with the letter M","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1255828 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'm' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["the letter M what are the controversy that start with it"],"info":{}}
{"id":"train_15711","question":"Who is the person that was influenced by Richard Dawkins?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P737 wd:Q44461 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is the individual that was affected by Richard Dawkins?"],"info":{}}
{"id":"train_15712","question":"Name the web search engine that contains the word yatedo in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4182287 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yatedo' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the web search engine in the name of the word yatedo"],"info":{}}
{"id":"train_15713","question":"What Hanseatic city is the twinned administrative body of Leeds?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P190 wd:Q39121 . ?sbj wdt:P31 wd:Q707813 }","paraphrases":["What Hanseatic city is the twinned authoritative body of Leeds?"],"info":{}}
{"id":"train_15714","question":"Where did Robert Wise die, sister city is Makati?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q59821 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1508 }","paraphrases":["Where did Robert Shrewd pass on, sister city is Makati?"],"info":{}}
{"id":"train_15716","question":"Do {archaeology}  includes the {history of topic} {history of technology} and {history of technology in Ukraine} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23498 wdt:P2184 wd:Q465352 . wd:Q23498 wdt:P2184 wd:Q12161084 }","paraphrases":["Do archaeology includes the history of technology in Ukraine?"],"info":{}}
{"id":"train_15717","question":"Who translated One Hundred Years of Solitude","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q178869 wdt:P655 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What is the name of the translator who worked on One Hundred Years of Solitude?"],"info":{}}
{"id":"train_15719","question":"When was Eileen Heckart nominated for a Tony Award for Best Featured Actress in a Play?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q239745 p:P1411 ?s . ?s ps:P1411 wd:Q627778 . ?s pq:P585 ?value }","paraphrases":["In which year did Eileen Heckart got shortlisted for Tony Award as Best Featured Actress in a play?"],"info":{}}
{"id":"train_15720","question":"Who was the head of government of Aosta Valley on January 4, 1984?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1222 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["Give me the head of government of Aosta Valley on January4, 1984?"],"info":{}}
{"id":"train_15723","question":"What is the date of birth of Isabel Maria de Alcantara Brasileira, the child of Pedro I, and who was her mother?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q3154857 . ?s pq:P569 ?value1 . ?s pq:P25 ?value2 }","paraphrases":["What is the date of birth of Isabel Maria de Alcantara Brasileira, the child of Pedro I, and who was her mother?"],"info":{}}
{"id":"train_15725","question":"Which is the RollDaBeats artist ID for Goldie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q507845 wdt:P5240 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15726","question":"What is the native label of Bodhisattva which has the transliteration of bodhisattva?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q178149 p:P1705 ?s . ?s ps:P1705 ?obj . ?s pq:P2440 ?x filter ( contains ( ?x , 'bodhisattva' ) ) }","paraphrases":["What native label can be applied to bodhisattva?"],"info":{}}
{"id":"train_15727","question":"What is the birthplace of Oleg Nikolaenko, the sequel of which is Transcaucasian Socialist Federative Soviet Republic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7086105 wdt:P19 ?answer . ?answer wdt:P155 wd:Q545205 }","paraphrases":["What is the origin of Oleg Nikolaenko, the continuation of which is Transcaucasian Communist Federative Soviet Republic?"],"info":{}}
{"id":"train_15728","question":"Which is indirectly caused by the disease treatment with phentolamine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q420360 wdt:P2175 ?X . ?X wdt:P1537 ?answer }","paraphrases":["Which is not directly brought on by the disorder cure with phentolamine?"],"info":{}}
{"id":"train_15731","question":"What are the reform which start with the letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q900406 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the change which begin with the letter r"],"info":{}}
{"id":"train_15732","question":"What is the folklore domain with the CIP code of 05.0209?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36192 wdt:P2579 ?answer . ?answer wdt:P2357 ?x FILTER ( contains ( ?x , '05.0209' ) ) }","paraphrases":["What is the fables space with the CIP code of 05.0209?"],"info":{}}
{"id":"train_15737","question":"What is the board game publisher of the fork of Miyamoto Musashi ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11454867 wdt:P144 ?X . ?X wdt:P123 ?answer }","paraphrases":["Who published the Life of Miyamoto Musashi?"],"info":{}}
{"id":"train_15738","question":"Who is the curator of Ai Weiwei?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1640 wd:Q160115 }","paraphrases":[],"info":{}}
{"id":"train_15739","question":"Tell me the software company whose stock exchange is Tokyo Stock Exchange and which that starts with the letter n","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1058914 . ?sbj wdt:P414 wd:Q217475 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the software company that has stock exchange in Tokyo Stock Exchange and starts with the letter 'n'?"],"info":{}}
{"id":"train_15740","question":"Tell me the genre that contains the word yike in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q483394 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yike' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the sort that contains the word yike in their name"],"info":{}}
{"id":"train_15741","question":"What is the famous bridge upstream from the Sydney Harbour Bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q54495 wdt:P2673 ?obj . ?obj wdt:P31 wd:Q14276458 }","paraphrases":["What is the popular bridge upstream from the Sydney Harbor Bridge?"],"info":{}}
{"id":"train_15743","question":"What is the river that flows through Nizhny Novgorod","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q891 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["What is the flowing river in Nizhny Novgorod?"],"info":{}}
{"id":"train_15744","question":"What ethnic group does Kid Cudi belong to and what is his country of citizenship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q299138 wdt:P172 ?ans_1 . wd:Q299138 wdt:P27 ?ans_2 }","paraphrases":["What's Kid Cudi's ethnic group and what country is he a citizen of?"],"info":{}}
{"id":"train_15745","question":"What major works by Christopher Wren are in Manhattan, New York?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170373 wdt:P800 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-0.113898' ) ) }","paraphrases":["What is to be distiguished from a bar that stays at the co-ordinates: 25.9077 64.3467?"],"info":{}}
{"id":"train_15746","question":"What generic association is Asperger syndrome to determine the method of TAS?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q161790 p:P2293 ?s . ?s ps:P2293 ?obj . ?s pq:P459 wd:Q23190853 }","paraphrases":["Asperger syndrome is associated with what to determine the method of TAS?"],"info":{}}
{"id":"train_15747","question":"Which {plant taxon in botanical garden} is {located in} of {Gao Gao} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4922925 wdt:P276 ?X . ?X wdt:P1990 ?answer }","paraphrases":["In Gao Gao, which plant taxon in botanical garden is located here?"],"info":{}}
{"id":"train_15748","question":"Is the number of masts for the Vieux Crabe equal to 2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3558075 wdt:P1099 ?obj filter ( ?obj = 2 ) }","paraphrases":["Is the number of masts for the Vieux Crabe equal to 2?"],"info":{}}
{"id":"train_15749","question":"What specialty of the profession is Denis Goldberg","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q869844 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["What is the specialised occupation of Denis Goldberg?"],"info":{}}
{"id":"train_15751","question":"What is worshiped by Ganesha?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1579 wdt:P1049 ?answer }","paraphrases":[],"info":{}}
{"id":"train_15753","question":"What 3D film did David Spade voice act in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P725 wd:Q298658 . ?sbj wdt:P31 wd:Q229390 }","paraphrases":["What 3D film did David Spade voice act in?"],"info":{}}
{"id":"train_15754","question":"\"What is the birthplace of Abū Ḥanīfa that has the gps location of 32.0333?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190896 wdt:P19 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '32.0333' ) ) }","paraphrases":["\"What is the origin of Abū Ḥanīfa that has the gps area of 32.0333?\""],"info":{}}
{"id":"train_15755","question":"Which unit of time starts with the letter \"y\" and measures physical quantity or duration?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1790144 . ?sbj wdt:P111 wd:Q2199864 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which unit of time begins with the letter \"y\" and measures physical quantity or duration?"],"info":{}}
{"id":"train_15759","question":"What Academy Award was F. Murray Abraham nominated for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q181936 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q19020 }","paraphrases":["F. Murray Abraham was nominated for what Academy Award?"],"info":{}}
{"id":"train_15761","question":"Does Mao Zedong has health problem of ICD-9-CM?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5816 wdt:P1050 ?X . ?X wdt:P1692 ?answer }","paraphrases":["Does Mao Zedong have an ICD-9-CM health issue?"],"info":{}}
{"id":"train_15762","question":"What are the municipality of West Bengal which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q18918041 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the West Bengal municipality that starts with letter t?"],"info":{}}
{"id":"train_15763","question":"When is {end time} and {start time} of {{Barbara Walters} {spouse} as {Lee Guber}}","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q231417 p:P26 ?s . ?s ps:P26 wd:Q6513735 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When did Barbara Walters marry and divorce Lee Guber"],"info":{}}
{"id":"train_15765","question":"What are the book series which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q277759 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the book arrangement which begin with the letter w"],"info":{}}
