{"id":"train_14797","question":"Who employed Mata Hari as a spy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q82180 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P39 wd:Q9352089 }","paraphrases":["Hata Hari was a spy for what country?"],"info":{}}
{"id":"train_14798","question":"When did Jose Luis Chila start playing for C.A Velez Sarsfield?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q216312 p:P54 ?s . ?s ps:P54 wd:Q215163 . ?s pq:P580 ?value }","paraphrases":["On what date did C.A Velez Sarsfield begin playing Jose Luis Chila."],"info":{}}
{"id":"train_14799","question":"What is in conflict at the memorial of Statue of Thomas Munro?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7604503 wdt:P547 ?X . ?X wdt:P607 ?answer }","paraphrases":["What is in strife at the dedication of Statue of Thomas Munro?"],"info":{}}
{"id":"train_14800","question":"What is the minimum viable temperature of the strain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q855769 . ?ent wdt:P3251 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the lowest possible temperature of the strain?"],"info":{}}
{"id":"train_14801","question":"Which sports league has the highest sports league level?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q623109 . ?ent wdt:P3983 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which sports association has the most elevated sports association level?"],"info":{}}
{"id":"train_14803","question":"When did Ernst Wilimowski become the member of a sports team known as FC Signen 04?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q559779 p:P54 ?s . ?s ps:P54 wd:Q319868 . ?s pq:P580 ?value }","paraphrases":["At what time did Ernst Wilimowski become the member of a sports team known as FC Signen 04?"],"info":{}}
{"id":"train_14804","question":"What is {number of matches played} and {number of points/goals/set scored} of {{Christine Sinclair} has {member of sports team} as {Vancouver Whitecaps}}","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q262802 p:P54 ?s . ?s ps:P54 wd:Q3567798 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["What is {number of suits played} and {number of points/goals/set scored} of {{Christine Sinclair} has {member of sports activities team} as {Vancouver Whitecaps}}"],"info":{}}
{"id":"train_14805","question":"In which ice hockey team season has the lowest number of points/goals conceded whose country is United States of America ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q27020779 . ?ent wdt:P1359 ?obj . ?ent wdt:P17 wd:Q30 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which season did the US hockey team score the lowest number of goals?"],"info":{}}
{"id":"train_14806","question":"How did Lionel Trilling die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1827287 wdt:P737 ?X . ?X wdt:P1196 ?answer }","paraphrases":["How did Lionel Trilling die?"],"info":{}}
{"id":"train_14810","question":"Is Uranus the child astronomical body of Desdemona and Prospero?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q324 wdt:P398 wd:Q15637 . wd:Q324 wdt:P398 wd:Q18497 }","paraphrases":["If Desdemona and Prospero had a child astronomical body, would it be Uranus?"],"info":{}}
{"id":"train_14811","question":"What are the national symbol which start with the letter palestine","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1128637 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'palestine' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the national symbol that begins with the Palestinian letter?"],"info":{}}
{"id":"train_14812","question":"Who was the leader of the Communist Party of the Soviet Union?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P102 wd:Q79854 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Give leader of the Communist Party of the Soviet Union."],"info":{}}
{"id":"train_14813","question":"What is ethnic group of Mapuche ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P172 wd:Q178484 }","paraphrases":[],"info":{}}
{"id":"train_14815","question":"What is the statement is subject of Bangladesh that shares border with India?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q902 p:P47 ?s . ?s ps:P47 wd:Q668 . ?s pq:P805 ?value }","paraphrases":["Which portion of Bangladesh shares a border with India?"],"info":{}}
{"id":"train_14816","question":"Which is the significant drug interaction for cocaine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P769 wd:Q41576 }","paraphrases":[],"info":{}}
{"id":"train_14817","question":"What is the origin of AIESEC, that borders Ans?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q191866 wdt:P740 ?answer . ?answer wdt:P47 wd:Q499594 }","paraphrases":["What is the beginning of AIESEC, that borders Ans?"],"info":{}}
{"id":"train_14818","question":"Give me an empire name that contains the word 'medes' in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q48349 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'medes' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me a social class name that contains the word 'zeugitae' in it."],"info":{}}
{"id":"train_14820","question":"Since when was Jinju twinned with Omsk?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q42144 p:P190 ?s . ?s ps:P190 wd:Q898 . ?s pq:P580 ?value }","paraphrases":["Jinju was twinned with Omsk on what date?"],"info":{}}
{"id":"train_14821","question":"Which is the route of administration for smoking?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P636 wd:Q193713 }","paraphrases":[],"info":{}}
{"id":"train_14823","question":"What role, Lee Meriwether, performed at Catwoman?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q158952 p:P175 ?s . ?s ps:P175 wd:Q267175 . ?s pq:P642 ?value }","paraphrases":["When did Lee Meriwether play Catwoman?"],"info":{}}
{"id":"train_14824","question":"What is Thomas Henry Huxley a member of that was established by Anders Johan von Höpken?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184366 wdt:P463 ?answer . ?answer wdt:P112 wd:Q491083 }","paraphrases":["What is Thomas Henry Huxley a member of that used to be set up via Anders Johan von Höpken?"],"info":{}}
{"id":"train_14826","question":"What town of Guernica has the partner city New York City?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q175036 wdt:P131 ?answer . ?answer wdt:P190 wd:Q60 }","paraphrases":["What town of Guernica has the accomplice city Modern York City?"],"info":{}}
{"id":"train_14827","question":"In Rama, what is the literary work for the characters?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P674 wd:Q160213 . ?sbj wdt:P31 wd:Q7725634 }","paraphrases":["In Rama, what is the scholarly work for the characters?"],"info":{}}
{"id":"train_14829","question":"Which is the birthplace of J.Edgar Hoover in the territory identical with District of Columbia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q210435 wdt:P19 ?answer . ?answer wdt:P3403 wd:Q3551781 }","paraphrases":["Which is the origin of J.Edgar Hoover within the region indistinguishable with Locale of Columbia?"],"info":{}}
{"id":"train_14831","question":"Who was the spouse of Ted Turner in 2001?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q193368 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["Who was Ted Turner's wife in 2001"],"info":{}}
{"id":"train_14833","question":"what are the Christian movement which  contains the word phineas in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q995347 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'phineas' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the Christian development which contains the word phineas in their name"],"info":{}}
{"id":"train_14835","question":"Tell me the number of points, goals, set scored that Marco van Basten achieved and for what sports team.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q483629 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }","paraphrases":["Where did Marcon Van Basten play and how many points did he score?"],"info":{}}
{"id":"train_14839","question":"For sourcing circumstances what is the birth date of John Chrysostom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q43706 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P1480 wd:Q5727902 }","paraphrases":["What is John Chrysostom's birthday?"],"info":{}}
{"id":"train_14840","question":"Where is Ötscher mountain located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q307436 wdt:P4552 ?X . ?X wdt:P186 ?answer }","paraphrases":["What is the location of Otscher mountain?"],"info":{}}
{"id":"train_14841","question":"WHAT ARE THE DAILY NEWSPAPPER WHICH START WITH THE LETTER Z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1110794 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE DAILY NEWSPAPER OF THE LETTER Z"],"info":{}}
{"id":"train_14842","question":"tell me international sport governing body that starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11422536 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know universal don overseeing body that begins with w"],"info":{}}
{"id":"train_14844","question":"Who is the lead singer for Nirvana","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11649 wdt:P1411 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who is the lead artist for Nirvana"],"info":{}}
{"id":"train_14845","question":"Who is the human biblical figure for the significant person of Saul?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q28730 wdt:P3342 ?obj . ?obj wdt:P31 wd:Q20643955 }","paraphrases":["Who is Saul's significant person's human biblical figure?"],"info":{}}
{"id":"train_14846","question":"Was FUJIC influenced by computers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q68 wdt:P737 wd:Q5427274 }","paraphrases":["Did computers influence FUJIC?"],"info":{}}
{"id":"train_14847","question":"When did award received of Frederick Sanger and prize money?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q151564 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }","paraphrases":["When did grant gotten of Frederick Sanger and prize cash?"],"info":{}}
{"id":"train_14848","question":"What are the demographic profile which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5932254 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the demographic profile which begin with the letter t"],"info":{}}
{"id":"train_14850","question":"Which isotope of antihydrogen with a gravitational interaction has the smallest electric charge ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q31804375 . ?ent wdt:P2200 ?obj . ?ent wdt:P517 wd:Q11412 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["The isotope of antihydrogen with gravitational interaction possessing the smallest electric charge is?"],"info":{}}
{"id":"train_14851","question":"which concept starts with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q151885 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ü' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which concept begins with the letter u"],"info":{}}
{"id":"train_14852","question":"When is the British museum open?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q6373 p:P3025 ?s . ?s ps:P3025 ?obj . ?s pq:P3027 ?value1 . }","paraphrases":["When is the British exhibition hall open?"],"info":{}}
{"id":"train_14854","question":"When, how, and where did Ethel Turner die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3327092 p:P27 ?s . ?s ps:P27 wd:Q174193 . ?s pq:P582 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["Describe the location, time, and circumstances of Ethel Turner's death."],"info":{}}
{"id":"train_14859","question":"What does ARM architecture develop?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q16980 wdt:P178 ?obj . ?obj wdt:P31 wd:Q6881511 }","paraphrases":["What does ARM engineering develop?"],"info":{}}
{"id":"train_14861","question":"To which sports team is Roberto Carlos a member and how many matches has he played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q429039 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["To which sports group is Roberto Carlos a part and how numerous matches has he played?"],"info":{}}
{"id":"train_14863","question":"Name the communist party Vladimir Lenin was a member of.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1394 wdt:P102 ?obj . ?obj wdt:P31 wd:Q233591 }","paraphrases":[],"info":{}}
{"id":"train_14865","question":"which is the chronology of topic of language used on jacques marquette","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q336630 wdt:P1412 ?X . ?X wdt:P2184 ?answer }","paraphrases":["which is the chronology of point of dialect utilized on jacques marquette"],"info":{}}
{"id":"train_14866","question":"What do Jim & Ingrid Croce play?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6193265 wdt:P156 ?X . ?X wdt:P175 ?answer }","paraphrases":["What do Jim & Ingrid Croce play?"],"info":{}}
{"id":"train_14867","question":"What superhero's name starts with \"W\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q188784 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What superhero's title begins with \"W\"?"],"info":{}}
{"id":"train_14868","question":"Which award did Médecins Sans Frontières receive in 2006?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q49330 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2006' ) ) }","paraphrases":["In 2006, with which award was Medecins Sans Frontieres honored?"],"info":{}}
{"id":"train_14871","question":"What was the Human Development Index of Malaysia in 1980?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q833 p:P1081 ?s . ?s ps:P1081 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["In 1980 what was the HDI of Malaysia?"],"info":{}}
{"id":"train_14872","question":"How many students attended the University of Arkansas in 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1070333 p:P2196 ?s . ?s ps:P2196 ?obj . ?s pq:P813 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["How many students were enrolled at the University of Arkansas in 2016?"],"info":{}}
{"id":"train_14874","question":"What is the product with the maximum per capita consumption rate as per Brockhaus and Efron Encyclopedic Dictionary ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2424752 . ?ent wdt:P2662 ?obj . ?ent wdt:P1343 wd:Q602358 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which product in the Brockhaus and Efron Encyclopedic Dictionary is stated to have the maximum consumption per capita?"],"info":{}}
{"id":"train_14876","question":"Who belonged to the International Association of Athletics Federations in 1912?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1158 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1912' ) ) }","paraphrases":["Members of I.A.A.F in 1912?"],"info":{}}
{"id":"train_14877","question":"\"What is the sister or brother of Anton Chekhov,that has the birth city in Taganrog?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5685 wdt:P3373 ?answer . ?answer wdt:P19 wd:Q170513 }","paraphrases":["\"What is the sister or brother of Anton Chekhov,that has the birth city in Taganrog?\""],"info":{}}
{"id":"train_14878","question":"Name an athlete competing in long jump","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2416 wd:Q170737 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who was an athlete in the long jump competition?"],"info":{}}
{"id":"train_14879","question":"What are the polymer which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q81163 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the polymer which begin with the letter t"],"info":{}}
{"id":"train_14880","question":"When did George Santayana move from Ávila?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q237833 p:P551 ?s . ?s ps:P551 wd:Q15688 . ?s pq:P582 ?value }","paraphrases":["What year did George Santayana move from Ávila?"],"info":{}}
{"id":"train_14881","question":"Which international airport is located in Salt Lake City?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P931 wd:Q23337 . ?sbj wdt:P31 wd:Q644371 }","paraphrases":["Salt Lake City has an international airport by the name of?"],"info":{}}
{"id":"train_14882","question":"Was Ray Kroc's given name Ray","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q319648 wdt:P735 wd:Q2133832 }","paraphrases":["Is Ray the given name of Ray Kroc?"],"info":{}}
{"id":"train_14883","question":"What films did Mary Pickford appear in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P175 wd:Q104109 . ?sbj wdt:P31 wd:Q1371849 }","paraphrases":["Mary Pickford appeared in what films?"],"info":{}}
{"id":"train_14885","question":"What is the {toponym} of the {Weierstrass function}, that is a {member of} {Corps Saxonia Bonn}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q94491 wdt:P138 ?answer . ?answer wdt:P463 wd:Q1135031 }","paraphrases":["What is the {toponym} of the {Weierstrass work}, that's a {part of} {Corps Saxonia Bonn}"],"info":{}}
{"id":"train_14887","question":"Where is the lost sculpture of Acropolis of Athens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P276 wd:Q131013 . ?sbj wdt:P31 wd:Q26883973 }","paraphrases":["Where is the misplaced design of Acropolis of Athens?"],"info":{}}
{"id":"train_14889","question":"What award did Arthur Freed, author of An American in Paris, receive?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q747570 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 wd:Q709413 }","paraphrases":["An American in Paris author Arthur Reed was honored with which award?"],"info":{}}
{"id":"train_14892","question":"\"What is {signs} of {common cold}, which has {has underlying cause} is {type I hypersensitivity} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12125 wdt:P780 ?answer . ?answer wdt:P828 wd:Q42982 }","paraphrases":["\"What is {signs} of {common cold}, which has {has basic cause} is {sort I touchiness} ?\""],"info":{}}
{"id":"train_14894","question":"Who was nominated the Academy Award for Best Director for Rocky?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q188652 p:P1411 ?s . ?s ps:P1411 wd:Q103360 . ?s pq:P2453 ?value }","paraphrases":["Who won the Academy Award for directing Rocky?"],"info":{}}
{"id":"train_14895","question":"What are the mythical character which start with the letter Z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4271324 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What mythical character starts with the letter 'Z'?"],"info":{}}
{"id":"train_14898","question":"Where was Michael Caine's residence at the end of the year 1970?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q123351 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1970' ) ) }","paraphrases":["what was the location of Michael Caine's residence at the end of year 1970?"],"info":{}}
{"id":"train_14899","question":"What are the principle which start with the letter a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q211364 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ä' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the guideline which begin with the letter a"],"info":{}}
{"id":"train_14900","question":"What is the fiction hedgehog in Sonic the Hedgehog?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1441 wd:Q1046812 . ?sbj wdt:P31 wd:Q20814410 }","paraphrases":["What is the fiction hedgehog in Sonic the Hedgehog?"],"info":{}}
{"id":"train_14901","question":"Which school did John Roberts attend at the end of 1979?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q11153 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1979' ) ) }","paraphrases":["In the end of 1979, what school did John Roberts attend?"],"info":{}}
{"id":"train_14904","question":"Who is the secretary general of Kuomintang","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q31113 wdt:P3975 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the secretary common of Kuomintang"],"info":{}}
{"id":"train_14905","question":"What is the end point of the meridian with a geolocation of 0.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q32099 wdt:P559 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '0.0' ) ) }","paraphrases":["What is the meridian endpoint with 0.0 geolocation?"],"info":{}}
{"id":"train_14906","question":"What is Sinopec's stock exchange on October 19, 2000.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q831445 p:P414 ?s . ?s ps:P414 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2000' ) ) }","paraphrases":["On October the 19th, 2000 what was Sinopec's stock exchange"],"info":{}}
{"id":"train_14907","question":"Which {has wards} of {county seat of} of {Florianópolis} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q132997 wdt:P1376 ?X . ?X wdt:P150 ?answer }","paraphrases":["Which {has wards} of {province situate of} of {Florianópolis} ?"],"info":{}}
{"id":"train_14909","question":"When did Culiacán Municipality become the administrative body in Zhongshan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q59223 p:P190 ?s . ?s ps:P190 wd:Q2485095 . ?s pq:P580 ?value }","paraphrases":["Culiacán Municipality has been the administrators in Zhongshan for how long?"],"info":{}}
