{"id":"train_16600","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q2277 wdt:P1906 ?obj . ?obj wdt:P31 wd:Q4164871 }","paraphrases":["Not availabile."],"info":{}}
{"id":"train_16602","question":"Tell me the residence of Anne Frank that of  is start time is 1944-10-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q4583 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1944' ) ) }","paraphrases":["Where did Anne Frank live from October 1944"],"info":{}}
{"id":"train_16603","question":"Where is the residence of Ernest Hemingway in 1928-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23434 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1928' ) ) }","paraphrases":["Where did Ernest Hemingway live in 1928?"],"info":{}}
{"id":"train_16608","question":"Who is the spouse of Chrissie Hynde before the year of 1990?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q239202 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1990' ) ) }","paraphrases":["Who was Chrissie Hynde's spouse until 1990?"],"info":{}}
{"id":"train_16609","question":"When did award received of Matt Lauer and point in time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q1100609 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["When did award received of Matt Lauer and factor in time?"],"info":{}}
{"id":"train_16612","question":"What was Rory McIlroy nominated for during 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q380613 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["What was Rory McIlroy recommended for in 2011?"],"info":{}}
{"id":"train_16613","question":"What is the asteroid with the highest periapsis whose site of astronomical discovery is Landessternwarte Heidelberg-Königstuhl ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3863 . ?ent wdt:P2244 ?obj . ?ent wdt:P65 wd:Q27115 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is asteroid discovered in Landessternwarte Heidelberg-Königstuhl had the closest periapsis?"],"info":{}}
{"id":"train_16615","question":"What are the temple which start with the letter g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q44539 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ġ' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the temple which begin with the letter g"],"info":{}}
{"id":"train_16616","question":"Which series was Ewan McGregor in that has a series ordinal of 2?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q165518 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '2' ) ) }","paraphrases":["What series was Ewan McGregor in that had a series ordinal of 2?"],"info":{}}
{"id":"train_16617","question":"Who is owned and developed by the FAceted Application of Subject Terminology?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3294867 wdt:P178 ?X . ?X wdt:P1830 ?answer }","paraphrases":["State the identity of those involved and developed in the FAceted Application of Subject Terminology program."],"info":{}}
{"id":"train_16621","question":"What is the boiling point of cyclohexane at the pressure of 760.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q211433 p:P2102 ?s . ?s ps:P2102 ?obj . ?s pq:P2077 ?x filter ( contains ( ?x , '760.0' ) ) }","paraphrases":["Cyclohexane boils at what point at a pressure of 760.0?"],"info":{}}
{"id":"train_16624","question":"which bank specializes in business enterprise and keeps assets under management?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q22687 . ?ent wdt:P4103 ?obj . ?ent wdt:P31 wd:Q4830453 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What bank manages assets and specializes in business enterprise?"],"info":{}}
{"id":"train_16625","question":"When did Almaty start being the capital of the Almaty Region?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q35493 p:P1376 ?s . ?s ps:P1376 wd:Q186466 . ?s pq:P580 ?value }","paraphrases":["On what day did almaty state being the capitol of the almaty region?"],"info":{}}
{"id":"train_16627","question":"What position did Fridtjof Nansen hold starting 1922?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q72292 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1922' ) ) }","paraphrases":["What position did Fridtjof Nansen hold beginning 1922?"],"info":{}}
{"id":"train_16628","question":"What awards has the leader George F. Kennan received?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q156058 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["What grants has the pioneer George F. Kennan received?"],"info":{}}
{"id":"train_16629","question":"When did Mika Waltari begin to go by Toimi?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q193111 p:P735 ?s . ?s ps:P735 wd:Q5395988 . ?s pq:P1545 ?value }","paraphrases":["From which moment did Toimi be used by Mika Waltari?"],"info":{}}
{"id":"train_16630","question":"who was the  organizer and  the sport of rugby _world _cup?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q16640 wdt:P664 ?ans_1 . wd:Q16640 wdt:P641 ?ans_2 }","paraphrases":["Who organized the Rugby World Cup?"],"info":{}}
{"id":"train_16631","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P488 wd:Q465018 . ?sbj wdt:P31 wd:Q7278 }","paraphrases":["Not available"],"info":{}}
{"id":"train_16633","question":"What is the gender and religion of Alan Watts?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q354867 wdt:P21 ?ans_1 . wd:Q354867 wdt:P140 ?ans_2 }","paraphrases":["What is the sexual orientation and religion of Alan Watts?"],"info":{}}
{"id":"train_16634","question":"\"Which member of Dave Grohl, currently has a nomination received for the MTV Video Music Award for Best New Artist?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q12006 wdt:P463 ?answer . ?answer wdt:P1411 wd:Q595693 }","paraphrases":["Which member of Dave Grohl, presently has a nomination obtained for the MTV Video Music Award for Best New Artist?"],"info":{}}
{"id":"train_16637","question":"When did Stephen Báthory end his reign as King of Poland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q54030 p:P39 ?s . ?s ps:P39 wd:Q3273712 . ?s pq:P582 ?value }","paraphrases":["In what year did Stephen Báthory stop being King of Poland?"],"info":{}}
{"id":"train_16640","question":"Did Lyndon B. Johnson marry Lyndon B. Johnson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9640 wdt:P26 wd:Q9640 }","paraphrases":["Is it true that Lyndon B. Johnson wed Lyndon B. Johnson?"],"info":{}}
{"id":"train_16641","question":"Vancouver has which twinned administrative bodies of municipality of the Netherlands ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q24639 wdt:P190 ?obj . ?obj wdt:P31 wd:Q2039348 }","paraphrases":[],"info":{}}
{"id":"train_16644","question":"Which is the central bank of Iceland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q189 wdt:P1304 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16645","question":"IS THE WIDTH OF THE CAPUCHIN ISLAND GREATER THAN 0.08","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23260 wdt:P2049 ?obj filter ( ?obj > 0.08 ) }","paraphrases":["Is 0.08 the smallest width of the Capuchin Island?"],"info":{}}
{"id":"train_16646","question":"What sports team is Javier Zanetti a member of and how many points/goals/sets did he score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q52876 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }","paraphrases":["What sports group is Javier Zanetti a member of and how many points/goals/sets did he score?"],"info":{}}
{"id":"train_16647","question":"What was Kazuo Ishiguro nominated for in the year 2006?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q272855 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2006' ) ) }","paraphrases":["Kazuo Ishiguro nominated for what in 2006?"],"info":{}}
{"id":"train_16648","question":"Tell me religious concept whose name has the word yojana in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23847174 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yojana' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me religious concept whose name has the word yojana in it."],"info":{}}
{"id":"train_16650","question":"What is the forename of Jan Švankmajer, which is known for its frequency of first names in the Netherlands, 2010?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q316165 wdt:P735 ?answer . ?answer wdt:P793 wd:Q21644845 }","paraphrases":["What is the forename of Jan Švankmajer, which is known for its recurrence of to begin with names within the Netherlands, 2010?"],"info":{}}
{"id":"train_16651","question":"What is the closest planet to International Space Station ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P398 wd:Q25271 . ?sbj wdt:P31 wd:Q3504248 }","paraphrases":["In relative to the International Space Station, which planet is the closest?"],"info":{}}
{"id":"train_16653","question":"Mention the place where human burial can be made possible in Florence Cathedral","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P119 wd:Q191739 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Say the put where human burial can be made conceivable in Florence Cathedral"],"info":{}}
{"id":"train_16654","question":"What was named after Dushanbe in Tajik?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9365 p:P138 ?s . ?s ps:P138 ?obj . ?s pq:P407 wd:Q9260 }","paraphrases":["In Tajik, what was named after Dushanbe?"],"info":{}}
{"id":"train_16655","question":"Who is the executive director with superior formation at Parfums Christian Dior?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3365053 wdt:P749 ?X . ?X wdt:P169 ?answer }","paraphrases":["Who is the official executive with predominant arrangement at Parfums Christian Dior?"],"info":{}}
{"id":"train_16656","question":"Is the torque of the Tesla Roadster equal to 10000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q43253563 wdt:P2230 ?obj filter ( ?obj = 10000 ) }","paraphrases":["Is the Tesla Roadster's torque 10000?"],"info":{}}
{"id":"train_16658","question":"Tell me textile fibre whose name has the word wool in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3071311 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wool' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know material fiber whose title has the word fleece in it."],"info":{}}
{"id":"train_16659","question":"Name the hammer drill brand with the amplitude of which subclass is the hammer drill?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23811264 . ?ent wdt:P2806 ?obj . ?ent wdt:P279 wd:Q1932875 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Provide the hammer drill brand and amplitude, including subclass."],"info":{}}
{"id":"train_16660","question":"What is the ancestral home of Du Fu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q33772 wdt:P66 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16664","question":"How many episodes are there of Cowboy Bebop?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q232246 wdt:P577 ?obj }","paraphrases":["Cowboy Bebop has how may episodes?"],"info":{}}
{"id":"train_16666","question":"What degree is achieved by Gustav Kirchhoff at Heidelberg University?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q60052 p:P802 ?s . ?s ps:P802 ?obj . ?s pq:P69 wd:Q151510 }","paraphrases":["What did Gustav Kirchhoff earn a degree in at Heidelberg University?"],"info":{}}
{"id":"train_16667","question":"Where could you find Gothic art that was created no later than the year 1200?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q46825 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1200' ) ) }","paraphrases":["What is the location of Gothic art created in 1200 or earlier?"],"info":{}}
{"id":"train_16668","question":"Is the dynamic viscosity of undecane equal to 0.4496?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q150731 wdt:P3070 ?obj filter ( ?obj = 0.4496 ) }","paraphrases":["Is the energetic thickness of undecane break even with to 0.4496?"],"info":{}}
{"id":"train_16669","question":"What city with millions of people has the official language of Urdu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q1617 . ?sbj wdt:P31 wd:Q1637706 }","paraphrases":[],"info":{}}
{"id":"train_16670","question":"Was Aamir Khan born in Mumbai?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9557 wdt:P19 wd:Q1156 }","paraphrases":["Was Mumbai the birthplace of Aamir Khan?"],"info":{}}
{"id":"train_16672","question":"Who did Robin Wright play in house of cards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3330940 p:P161 ?s . ?s ps:P161 wd:Q272972 . ?s pq:P453 ?value }","paraphrases":["In the House of Cards TV series, what character did Robin Wright play?"],"info":{}}
{"id":"train_16673","question":"What is the Indian band of the Algonquian ethnicity with the least members.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2882257 . ?ent wdt:P2124 ?obj . ?ent wdt:P172 wd:Q135863 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which Algonquian Indian band has the least amount of members?"],"info":{}}
{"id":"train_16676","question":"WHICH IS THE MULTI PURPOSE STADIUM WITH MAXIMUM MINIMUM CAPACITY","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1049757 . ?ent wdt:P1083 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What's the capacity of the Multi Purpose stadium?"],"info":{}}
{"id":"train_16677","question":"Was Nostradamus occupation Yorkton Film Festival and author?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q39978 wdt:P106 wd:Q17059525 . wd:Q39978 wdt:P106 wd:Q482980 }","paraphrases":["Is it true that Nostradamus occupation was at Yorkton Film Festival and author?"],"info":{}}
{"id":"train_16678","question":"which website that programming language javascript and which contains the word wincounter in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q35127 . ?sbj wdt:P277 wd:Q2005 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wmcounter' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which website that programming language javascript and which carries the phrase wincounter in their name"],"info":{}}
{"id":"train_16681","question":"What are the war of succession that starts with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1348385 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the succession war that begins with the letter w"],"info":{}}
{"id":"train_16682","question":"When was Louis IX of France, child of John of France, born and when did he die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q346 p:P40 ?s . ?s ps:P40 wd:Q14752200 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When was Louis IX of France, toddler of John of France, born and when did he die?"],"info":{}}
{"id":"train_16683","question":"tell  me class of instruments which name has  the word instrument in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1254773 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'instrument' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know course of rebellious which title has the word instrument in it"],"info":{}}
{"id":"train_16684","question":"Who is the person that is the structural engineer of Burj Khalifa?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12495 wdt:P631 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is Burj Khalifa's structural engineer?"],"info":{}}
{"id":"train_16685","question":"Who is commanded by Thomas Blamey?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4791 wd:Q952813 }","paraphrases":[],"info":{}}
{"id":"train_16689","question":"What office does the daughter of Iskandar Muda hold?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q375774 wdt:P40 ?X . ?X wdt:P39 ?answer }","paraphrases":["What office does the girl of Iskandar Muda hold?"],"info":{}}
{"id":"train_16690","question":"What is the diplomatic status of Younus Khan's citizenship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3352654 wdt:P27 ?X . ?X wdt:P530 ?answer }","paraphrases":["What is the conciliatory status of Younus Khan's citizenship?"],"info":{}}
{"id":"train_16691","question":"Tell me the development stages of animal whose name has the word subimago in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20056177 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'subimago' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the improvement stages of creature whose title has the word subimago in it."],"info":{}}
{"id":"train_16692","question":"Which is the region in Mekong Delta having real GDP growth rate of 6.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1052867 wdt:P131 ?answer . ?answer wdt:P2219 ?x FILTER ( contains ( ?x , '6.2' ) ) }","paraphrases":["Which region has a real GDP growth rate of 6.2 in the Mekong Delta?"],"info":{}}
{"id":"train_16693","question":"Who is the chancellor that comes from The Katzenjammer Kids","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1315973 wdt:P495 ?X . ?X wdt:P6 ?answer }","paraphrases":["Who is the chancellor that comes from The Katzenjammer Kids"],"info":{}}
{"id":"train_16694","question":"What is the county seat of the county in which Olafur Eliasson lives?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q365691 wdt:P937 ?X . ?X wdt:P1376 ?answer }","paraphrases":["What is the province situate of the district in which Olafur Eliasson lives?"],"info":{}}
{"id":"train_16696","question":"What is {follows} and {followed by} of {{Pepin the Short} has {noble title} as {king of Franks}}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q81212 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["What is {follows} and {followed by} of {{Pepin the Short} has {noble title} as {king of Franks}}?"],"info":{}}
{"id":"train_16698","question":"Who are the inhabitants that originate in Foucault's Pendulum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q437791 wdt:P495 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Who are the occupants that start in Foucault's Pendulum?"],"info":{}}
{"id":"train_16700","question":"Name the biggest reform for women living in the Wusab As Safil District?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12225020 . ?ent wdt:P1539 ?obj . ?ent wdt:P131 wd:Q4117298 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["For the women living in the Wusab As Safil District what was the biggest reform?"],"info":{}}
{"id":"train_16701","question":"Who is the general manager of the Bernard Lewis workplace?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q501880 wdt:P108 ?X . ?X wdt:P1037 ?answer }","paraphrases":["Who is the common supervisor of the Bernard Lewis workplace?"],"info":{}}
{"id":"train_16702","question":"When did Oskar Lafontaine become the head of the government of Saarland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1201 p:P6 ?s . ?s ps:P6 wd:Q110719 . ?s pq:P580 ?value }","paraphrases":["At what point in time did Oskar Lafontaine become the head of the government of Saarland?"],"info":{}}
{"id":"train_16703","question":"How many people does the UN sponsor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P859 wd:Q7809 }","paraphrases":["What is the number of people sponsored by the UN?"],"info":{}}
{"id":"train_16704","question":"What award was received by Eddy Merckx and when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q103756 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What grant was gotten by Whirlpool Merckx and when?"],"info":{}}
{"id":"train_16705","question":"What is landscape of depicted sea of clouds ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3306217 wdt:P1299 ?X . ?X wdt:P180 ?answer }","paraphrases":["What is a landscape depiction of a sea of clouds?"],"info":{}}
{"id":"train_16706","question":"What happened in Grand Duchy of Lithuania in 1795-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q49683 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1795' ) ) }","paraphrases":["What occured in Lithuania in 1795?"],"info":{}}
{"id":"train_16707","question":"Identify the voting round when Marcio Bittar got the most votes.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q24097670 . ?ent wdt:P5045 ?obj . ?ent wdt:P991 wd:Q9048058 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["when did marcio bittar get the most votes?"],"info":{}}
{"id":"train_16709","question":"What is the career of patron Saint, is he philosopher or professor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4964182 wdt:P417 ?answer . ?answer wdt:P106 wd:Q121594 }","paraphrases":["What is the profession of purchaser Saint, is he philosopher or professor?"],"info":{}}
{"id":"train_16710","question":"Mention the striking painting work of John the Baptist","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q40662 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q3305213 }","paraphrases":["Specify the striking portray work of John the Baptist"],"info":{}}
{"id":"train_16711","question":"Why did Günther Prien fail during his time aboard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q60245 wdt:P5096 ?X . ?X wdt:P770 ?answer }","paraphrases":["Why did Günther Prien come up short amid his time aboard?"],"info":{}}
{"id":"train_16715","question":"What ideology with the word veganism in the name was named by Donald Watson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7257 . ?sbj wdt:P3938 wd:Q178402 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'veganism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What ideology with the word veganism in the title was named via Donald Watson?"],"info":{}}
{"id":"train_16718","question":"What is the group of Arab League nations called?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P530 wd:Q7172 . ?sbj wdt:P31 wd:Q3623811 }","paraphrases":["What is the bunch of Middle easterner Alliance countries called?"],"info":{}}
