{"id":"train_8901","question":"Which is the coordinate location for Saskatchewan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1989 wdt:P625 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8903","question":"Which is {end time} and {start time} of {{Belfast} has {country} as {United Kingdom of Great Britain and Ireland}}","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q10686 p:P17 ?s . ?s ps:P17 wd:Q174193 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When was Belfast a country of the UK?"],"info":{}}
{"id":"train_8910","question":"What does Jules Rimet play whose executive authority is FIFA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q199642 wdt:P641 ?answer . ?answer wdt:P797 wd:Q253414 }","paraphrases":["What does Jules Rimet play whose official specialist is FIFA?"],"info":{}}
{"id":"train_8911","question":"What era is the prequel of baroque music?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8361 wdt:P156 ?X . ?X wdt:P580 ?answer }","paraphrases":["What era is the baroque music prequel?"],"info":{}}
{"id":"train_8912","question":"What is the seat of team member Shohei Yamamoto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3299867 wdt:P54 ?X . ?X wdt:P159 ?answer }","paraphrases":["What is the seat for Shohei Yamamoto?"],"info":{}}
{"id":"train_8913","question":"Is the event distance of the 20 kilometres race walk greater than 16.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q210673 wdt:P3157 ?obj filter ( ?obj > 16.0 ) }","paraphrases":["Is the occasion remove of the 20 kilometers race walk more prominent than 16.0?"],"info":{}}
{"id":"train_8915","question":"When was Johan Huizinga nominated for the Nobel Prize in Literature?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q276280 p:P1411 ?s . ?s ps:P1411 wd:Q37922 . ?s pq:P585 ?value }","paraphrases":["When did Johan Huizinga get nominated for the Nobel Prize?"],"info":{}}
{"id":"train_8919","question":"how much is measured by intelligence?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2575 wd:Q83500 }","paraphrases":["Which is the amount measured by intelligence?"],"info":{}}
{"id":"train_8920","question":"When did Erwin Rommel finish at Württembergische Sicherheitstruppen military branch.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q14060 p:P241 ?s . ?s ps:P241 wd:Q2596869 . ?s pq:P582 ?value }","paraphrases":["Erwin Rommel finished at Württembergische Sicherheitstruppen military branch on what date?"],"info":{}}
{"id":"train_8921","question":"What image does India have for Virat Kholi as a sportsman?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q213854 p:P1532 ?s . ?s ps:P1532 wd:Q668 . ?s pq:P18 ?value }","paraphrases":["What picture does India have for Virat Kholi as a sportsman?"],"info":{}}
{"id":"train_8925","question":"Is Mary Ball Washington mother of George Washington?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23 wdt:P25 wd:Q458119 }","paraphrases":["Is George Washington the son of Mary Ball Washington?"],"info":{}}
{"id":"train_8926","question":"When did Hannes Alfvén cease to be a member of the Royal Swedish Academy of Engineering Sciences?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q54945 p:P463 ?s . ?s ps:P463 wd:Q3394637 . ?s pq:P582 ?value }","paraphrases":["Hannes Alfvén ceases to be a member of the Royal Swedish Academy of Engineering Sciences when?"],"info":{}}
{"id":"train_8927","question":"Are the total points in the career of Mikko Jokela less than 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q119866 wdt:P6544 ?obj filter ( ?obj < 0.0 ) }","paraphrases":["Are Mikko Jokela's total career points less than 0?"],"info":{}}
{"id":"train_8928","question":"Where was The Dark Side of the Moon was recorded?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q150901 wdt:P483 ?X . ?X wdt:P276 ?answer }","paraphrases":["Where was recorded the Moon's Dark Side?"],"info":{}}
{"id":"train_8929","question":"What head of national government is in the town of Narmada?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q234004 wdt:P131 ?X . ?X wdt:P6 ?answer }","paraphrases":["What head of national government is within the town of Narmada?"],"info":{}}
{"id":"train_8931","question":"What taxon with the pronunciation of the following audio file (Uk-яловичина.ogg) has a source of cattle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q830 wdt:P1672 ?answer . ?answer wdt:P443 ?x FILTER ( contains ( ?x , 'Uk-яловичина.ogg' ) ) }","paraphrases":["What taxon has a cattle source with the pronunciation of the following audio file?"],"info":{}}
{"id":"train_8932","question":"For what work was Tennessee Williams nominated for the Academy Award for Best Writing, Adapted Screenplay?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q134262 p:P1411 ?s . ?s ps:P1411 wd:Q107258 . ?s pq:P805 ?value }","paraphrases":["Which was the work that got Tennessee Williams a nomination for the Academy Award for Best Writing, Adapted Screenplay?"],"info":{}}
{"id":"train_8933","question":"When did J. R. R. Tolkien win the Locus Award for Best Fantasy Novel?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q892 p:P1411 ?s . ?s ps:P1411 wd:Q607354 . ?s pq:P585 ?value }","paraphrases":["On what date did J.R.R Tolkein win the Locus Award for Best fantasy Novel?"],"info":{}}
{"id":"train_8934","question":"What software does MS-DOS use?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P306 wd:Q47604 . ?sbj wdt:P31 wd:Q312466 }","paraphrases":["What program does MS-DOS utilize?"],"info":{}}
{"id":"train_8935","question":"who ZIP+4 of active in of david ricardo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q160270 wdt:P937 ?X . ?X wdt:P281 ?answer }","paraphrases":["Get the active ZIP+4 of david ricardo"],"info":{}}
{"id":"train_8938","question":"Is Nokia's operating income -1.1 billion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1418 wdt:P3362 ?obj filter ( ?obj = -1100000000 ) }","paraphrases":["Is the profit of the company Nokia equal to 1.1 billion?"],"info":{}}
{"id":"train_8939","question":"David Ben-Gurion was the signatory of which historical document?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1891 wd:Q37610 . ?sbj wdt:P31 wd:Q3771738 }","paraphrases":["David Ben-Gurion was the signatory of which authentic document?"],"info":{}}
{"id":"train_8940","question":"When did William Shatner marry Nerine Kidd?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16297 p:P26 ?s . ?s ps:P26 wd:Q1529685 . ?s pq:P582 ?value }","paraphrases":["Nerine Kidd and William Shatner got married on what date?"],"info":{}}
{"id":"train_8943","question":"Where did Maximilien Robespierre attend school and what was his major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q44197 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["Where did Maximilien Robespierre attend college and what was once his major?"],"info":{}}
{"id":"train_8944","question":"Which is the economic branch that has motor vehicle as a product and contains the word automotive in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q268592 . ?sbj wdt:P1056 wd:Q752870 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'automotive' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the economic branch that has motor vehicles as a product and is named after the word automotive?"],"info":{}}
{"id":"train_8948","question":"What is  in the panorama view of Jerusalem ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1218 wdt:P4291 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8949","question":"When did Bochum have a population of 341,935?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2103 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '341935.0' ) ) . ?s pq:P585 ?value }","paraphrases":["When did the population of Bochum reach 341,935?"],"info":{}}
{"id":"train_8951","question":"Which is the crown colony of the British Empire that follows Hong Kong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8646 wdt:P155 ?obj . ?obj wdt:P31 wd:Q1351282 }","paraphrases":[],"info":{}}
{"id":"train_8952","question":"When did scholarly article for published in of Rolling Stone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1433 wd:Q33511 . ?sbj wdt:P31 wd:Q13442814 }","paraphrases":[],"info":{}}
{"id":"train_8953","question":"Who created the fictional universe of Doctor Doom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q430178 wdt:P170 ?ans_1 . wd:Q430178 wdt:P1080 ?ans_2 }","paraphrases":["Who created the universe in Doctor Doom?"],"info":{}}
{"id":"train_8954","question":"When did Marilyn Monroe receive an award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q4616 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["When did Marilyn Monroe get an award?"],"info":{}}
{"id":"train_8955","question":"What is the classification of the competition class in sports for the high jump?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2094 wd:Q165704 . ?sbj wdt:P31 wd:Q1744559 }","paraphrases":["What is the competition class class class class for the high jump in sports?"],"info":{}}
{"id":"train_8956","question":"Is the ionization energy of butanethiol equal to 9.15?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q195823 wdt:P2260 ?obj filter ( ?obj = 9.15 ) }","paraphrases":["Is 9.15 the ionization energy of butanethiol?"],"info":{}}
{"id":"train_8957","question":"What was the population of Piraeus in 2001?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q58976 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2001' ) ) }","paraphrases":["Identify the population of Piraeus in 2001."],"info":{}}
{"id":"train_8958","question":"Which is the television character owner of which is Toby and that starts with the letter h?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15773317 . ?sbj wdt:P1830 wd:Q20822927 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'h' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the television character owner of which is Toby and that begins with the letter h?"],"info":{}}
{"id":"train_8960","question":"Which is solved by the Schrödinger equation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2159 wd:Q165498 }","paraphrases":[],"info":{}}
{"id":"train_8961","question":"Who is the developer of C?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q15777 wdt:P178 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8962","question":"Name a video game series that is a spin off of the Mana games that contains the word \"fantasy\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7058673 . ?sbj wdt:P2512 wd:Q587964 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'fantasy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a video diversion arrangement that's a turn off of the Mana recreations that contains the word \"daydream\" in its title"],"info":{}}
{"id":"train_8963","question":"Where in South Carolina was Melvin Purvis buried?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q765838 wdt:P119 ?answer . ?answer wdt:P208 wd:Q53709977 }","paraphrases":["Where in South Carolina was Melvin Purvis buried?"],"info":{}}
{"id":"train_8964","question":"What are theOlympic sport which start with the letter weightlifting","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q212434 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'weightlifting' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are theOlympic game which start with the letter weightlifting"],"info":{}}
{"id":"train_8965","question":"What domain is doctoral supervisor of Yurii Vladimirovich Egorov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q23655951 wdt:P184 ?X . ?X wdt:P101 ?answer }","paraphrases":["Yurii Vladimirovich Egorov's doctoral supervisor's domain is what?"],"info":{}}
{"id":"train_8968","question":"In what year was Breakfast at Tiffany's nominated for the Academy Award for Best Original Dramatic or Comedy Score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q193066 p:P1411 ?s . ?s ps:P1411 wd:Q22752868 . ?s pq:P805 ?value }","paraphrases":["During what year was Breakfast at Tiffany's a nominee for the Oscar for Best Original Dramatic or Comedy Score?"],"info":{}}
{"id":"train_8975","question":"Tell me holiday whose name has the word дан  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1445650 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'дан' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me holiday whose name has the word дан in it."],"info":{}}
{"id":"train_8980","question":"Did Lauryn Hill do disco and neo soul?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q214226 wdt:P136 wd:Q58339 . wd:Q214226 wdt:P136 wd:Q268253 }","paraphrases":["Did Lauryn Slope has disco and neo soul?"],"info":{}}
{"id":"train_8981","question":"What is the lib.reviews ID for the Nintendo Switch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q19610114 wdt:P3308 ?answer }","paraphrases":[],"info":{}}
{"id":"train_8983","question":"Whose {wife} {has sons} of {Cecil Coward} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18529681 wdt:P40 ?X . ?X wdt:P26 ?answer }","paraphrases":["Whose {spouse} {has children} of {Cecil Quitter} ?"],"info":{}}
{"id":"train_8984","question":"When did Carrie Fisher get married to Paul Simon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q108941 wdt:P26 wd:Q4028 }","paraphrases":["When did carrie fisher got marriage with paul simon?"],"info":{}}
{"id":"train_8986","question":"Which is the winner and followed by the Animal Farm that got awarded as Prometheus Award Hall of Fame?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q1396889 p:P166 ?s . ?s ps:P166 wd:Q19360203 . ?s pq:P1346 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Who won the Prometheus Award Hall of Fame after Animal Farm?"],"info":{}}
{"id":"train_8987","question":"On what continent is Constantinople with the banner name \"Ladakh banner.jpg\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16869 wdt:P30 ?answer . ?answer wdt:P948 ?x FILTER ( contains ( ?x , 'Ladakh banner.jpg' ) ) }","paraphrases":["On what continent is Constantinople with the banner name \"Ladakh banner.jpg\"?"],"info":{}}
{"id":"train_8988","question":"When did Mexico City have Dolores Hidalgo Municipality as a twinned administrative body?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1489 p:P190 ?s . ?s ps:P190 wd:Q958153 . ?s pq:P580 ?value }","paraphrases":["When did Dolores Hidalgo Municipality become a twinned administrative body for Mexico City?"],"info":{}}
{"id":"train_8990","question":"What are the khanate which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q331644 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the khanate that begins with the letter t"],"info":{}}
{"id":"train_8991","question":"Which is a lifestyle of mysticism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1576 wd:Q45996 }","paraphrases":[],"info":{}}
{"id":"train_8992","question":"Which does not have part in air force?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3113 wd:Q61883 }","paraphrases":[],"info":{}}
{"id":"train_8993","question":"John Paul II is a character of which miniseries ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P674 wd:Q989 . ?sbj wdt:P31 wd:Q1259759 }","paraphrases":["The character of John Paul II is of which miniseries?"],"info":{}}
{"id":"train_8996","question":"When did Linus Torvalds receive an honorary doctorate?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q34253 p:P166 ?s . ?s ps:P166 wd:Q11415564 . ?s pq:P585 ?value }","paraphrases":["On what date did Linus Torvalds receive an honorary doctorate?"],"info":{}}
{"id":"train_8997","question":"Tell me sex whose name has the word organism in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q290 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'organism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me sex, the name of which contains the word organism."],"info":{}}
{"id":"train_8999","question":"Which termini is connected with Tokyo Metropolitan Road Route 418?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11103016 wdt:P2789 ?X . ?X wdt:P559 ?answer }","paraphrases":["Name the terminals connected to the Tokyo Metropolitan Road Route 418."],"info":{}}
{"id":"train_9001","question":"What what is animated film  city of the United States chicago","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q891382 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'swimming' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is vivified film city of the Joined together States chicago"],"info":{}}
{"id":"train_9004","question":"Is 509.6 the wingspan of the DH-4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q56881060 wdt:P2050 ?obj filter ( ?obj = 509.5 ) }","paraphrases":["Is the wingspan of the DH-4 509.6?"],"info":{}}
{"id":"train_9005","question":"Tell me commandment whose name has the word tithe in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1497090 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tithe' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know commandment whose title has the word tithe in it."],"info":{}}
{"id":"train_9008","question":"What is a mathematical model that starts with the letter t.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q486902 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a model of mathematics that begins with letter t."],"info":{}}
{"id":"train_9009","question":"Who is Imran Khan's significant other, whose gender is female?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q155164 wdt:P451 ?answer . ?answer wdt:P21 wd:Q6581072 }","paraphrases":["Who is Imran Khan's sizeable other, whose gender is female?"],"info":{}}
{"id":"train_9010","question":"What kind of alkanol uses vinegar?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41354 wdt:P186 ?obj . ?obj wdt:P31 wd:Q11685431 }","paraphrases":[],"info":{}}
{"id":"train_9011","question":"Where is the Manhattan Bridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P276 wd:Q11299 . ?sbj wdt:P31 wd:Q537127 }","paraphrases":["Where is the Manhattan Bridge?"],"info":{}}
{"id":"train_9016","question":"Which is the transcontinental country for the location of the French invasion of Russia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q179250 wdt:P276 ?obj . ?obj wdt:P31 wd:Q1323642 }","paraphrases":["Which is the cross-country nation for the area of the French intrusion of Russia?"],"info":{}}
{"id":"train_9017","question":"When did award received of Adolf von Baeyer and prize money?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q57078 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?value1 . }","paraphrases":["When was Adolf von Baeyer's award and prize money received"],"info":{}}
{"id":"train_9018","question":"Who is the ancestor of the record producer from The Thrill Chaser?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7769131 wdt:P162 ?X . ?X wdt:P1038 ?answer }","paraphrases":["Who is the ancestor of the report producer from The Thrill Chaser?"],"info":{}}
{"id":"train_9020","question":"What are the nonprofit organization which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q163740 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the nonprofit organization which begin with the letter v"],"info":{}}
{"id":"train_9021","question":"what award received by Andrew Wiles on 20-16-0-0 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q184433 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["on 20-16 Andrew Wiles received what award?"],"info":{}}
{"id":"train_9022","question":"What is the name for the residence of Thomas Jefferson","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11812 wdt:P551 ?obj . ?obj wdt:P31 wd:Q1365179 }","paraphrases":["Give me the name of the residence of Thomas Jefferson."],"info":{}}
{"id":"train_9023","question":"What are the effects on one's health when dealing with Alcoholism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q15326 wdt:P1542 ?ans_1 . wd:Q15326 wdt:P1995 ?ans_2 }","paraphrases":["what are some health issues associated with alcoholism?"],"info":{}}
{"id":"train_9026","question":"Who is the subsidiary company make the maker My Little Pony?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1071312 wdt:P176 ?X . ?X wdt:P355 ?answer }","paraphrases":["Who is the auxiliary company make the creator My Small Pony?"],"info":{}}
{"id":"train_9027","question":"What location has Maranhao as one of its states, with a co-ordinate location of -44.9333?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42362 wdt:P150 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-44.9333' ) ) }","paraphrases":["What area has Maranhao as one of its states, with a co-ordinate area of -44.9333?"],"info":{}}
{"id":"train_9028","question":"Is the median lethal dose of Benzene 12000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2270 wdt:P2240 ?obj filter ( ?obj = 12000.0 ) }","paraphrases":["Is the middle deadly portion of Benzene 12000?"],"info":{}}
{"id":"train_9029","question":"What country does the Star-Spangled Banner originate from","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44696 wdt:P495 ?obj . ?obj wdt:P31 wd:Q6256 }","paraphrases":["What nation does the Star-Spangled Standard begin from"],"info":{}}
{"id":"train_9030","question":"What part of the Nintendo Switch is called a dock?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q19610114 p:P2935 ?s . ?s ps:P2935 ?obj . ?s pq:P1476 ?x filter ( contains ( ?x , 'Dock' ) ) }","paraphrases":["Which of the Nintento Switch parts is called a dock?"],"info":{}}
{"id":"train_9032","question":"What is the Kaiserhof ID for Aloysius Gonzaga?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q310307 wdt:P1818 ?answer }","paraphrases":[],"info":{}}
