{"id":"train_23610","question":"What is a professional services firm whose name starts with the letter k.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23670565 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'k' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What may be a proficient administrations firm whose title begins with the letter k."],"info":{}}
{"id":"train_23611","question":"Tell me the population count of Greece in year 2012","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2012' ) ) }","paraphrases":["What was the population of Greece in 2012?"],"info":{}}
{"id":"train_23612","question":"Which is the port city located in Aung San Suu Kyi.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q36740 wdt:P551 ?obj . ?obj wdt:P31 wd:Q2264924 }","paraphrases":["Tell me the name of Aung San Suu Kyi's port city."],"info":{}}
{"id":"train_23624","question":"What are the Stellar wind which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q654396 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which are the Stellar wind that start with the letter S?"],"info":{}}
{"id":"train_23629","question":"Name a song performed by Hrithik Roshan","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P175 wd:Q233619 . ?sbj wdt:P31 wd:Q7366 }","paraphrases":["Title a melody performed by Hrithik Roshan"],"info":{}}
{"id":"train_23631","question":"What portion of the population of Nijmegen is titled Bevolkingsontwikkeling","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q47887 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P1476 ?x filter ( contains ( ?x , 'Bevolkingsontwikkeling; regio per maand' ) ) }","paraphrases":["Which portion of the population of Nijmegen is titled Bevolkingsontwikkeling?"],"info":{}}
{"id":"train_23632","question":"Enlist the number of the goal achieved and the count of the matches played by George Weah in the Africa Sports d'Abidjan team","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q173139 p:P54 ?s . ?s ps:P54 wd:Q383943 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["Enlist the variety of the aim finished and the count of the matches performed by means of George Weah in the Africa Sports d'Abidjan crew"],"info":{}}
{"id":"train_23633","question":"What is the {academic major} and {academic degree} of {Umberto Eco} while being educated at the {UNiversity of Turin}","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q12807 p:P69 ?s . ?s ps:P69 wd:Q499911 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What is the {scholarly major} and {scholastic degree} of {Umberto Eco} whereas being taught at the {College of Turin}"],"info":{}}
{"id":"train_23635","question":"Is the number of labs completed by 1924 Duff & Aldington #8 equal to 120","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q55121627 wdt:P5349 ?obj filter ( ?obj = 120 ) }","paraphrases":["Is 120 the number of labs completed by 1924 Duff & Aldington #8?"],"info":{}}
{"id":"train_23639","question":"Name an ancient Greek temple built by Chersiphron that starts with letter A","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q267596 . ?sbj wdt:P84 wd:Q1070392 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title an antiquated Greek sanctuary built by Chersiphron that begins with letter A"],"info":{}}
{"id":"train_23652","question":"What is {used language} of {motif} of {Pietà} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3904411 wdt:P180 ?X . ?X wdt:P1412 ?answer }","paraphrases":["What is {utilized dialect} of {theme} of {Pietà} ?"],"info":{}}
{"id":"train_23654","question":"what is w3c recommendation starts with x","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2661442 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is w3c suggestion begins with x"],"info":{}}
{"id":"train_23668","question":"Tell me which is greater than the rural area.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P5135 wd:Q175185 }","paraphrases":[],"info":{}}
{"id":"train_23676","question":"Is it true that the thermal conductivity of borosilicate glass is less than 1.44","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1422588 wdt:P2068 ?obj filter ( ?obj < 1.44 ) }","paraphrases":["Is the thermal conductivity of borosilicate glass less than 1.44?"],"info":{}}
{"id":"train_23680","question":"What country founded the religion of Islam?W","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P140 wd:Q432 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["The religion of Islam was founded by what country?"],"info":{}}
{"id":"train_23698","question":"What is { significant event } of { Eugène Delacroix } that is { location } is { Saint - Germain - des - Prés Abbey }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q33477 p:P793 ?s . ?s ps:P793 ?obj . ?s pq:P276 wd:Q334186 }","paraphrases":["At Saint Germain des Prés Abbey, what happened of significance to Eugene Delacroix?"],"info":{}}
{"id":"train_23718","question":"WHICH IS THE ELECTORAL DISTRICT AND REPRESENTS JOHN KEY HAS THE MEMBER OF 51ST ZEALAND PARLIAMENTWO","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q57783 p:P463 ?s . ?s ps:P463 wd:Q4640115 . ?s pq:P768 ?value1 . ?s pq:P1268 ?value2 }","paraphrases":["WHICH IS THE ELECTORAL DISTRICT AND REPRESENTS JOHN KEY HAS THE MEMBER OF 51ST ZEALAND PARLIAMENTWO"],"info":{}}
{"id":"train_23720","question":"What genre of music is partially coincident with classical music","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1382 wd:Q9730 . ?sbj wdt:P31 wd:Q188451 }","paraphrases":["Is there a particular genre of music that coincides with classical music?"],"info":{}}
{"id":"train_23723","question":"What are the Original Public Ivy which start with the letter U","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20971972 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Initial Open Ivy which begin with the letter U"],"info":{}}
{"id":"train_23725","question":"What what is railroad line connected with Vladimir and also which starts with letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q728937 . ?sbj wdt:P2789 wd:Q2684 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is railroad line connected with Vladimir and additionally which starts with letter r"],"info":{}}
{"id":"train_23727","question":"Tell me subject of international law  whose name has the word nations in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1896989 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'nations' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose to me subject of global law whose name has the word countries in it"],"info":{}}
{"id":"train_23736","question":"WHAT TYPE OF THE BUILDING MATERIAL WHOSE NAME THAT STARTS WITH Z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q206615 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT TYPE OF THE MATERIAL BUILDING NAME STARTS WITH THE LETTER Z"],"info":{}}
{"id":"train_23746","question":"IS THE POULATION OF LIEBES EQAULS TO 0","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q316638 wdt:P1082 ?obj filter ( ?obj = 0 ) }","paraphrases":["IS THE POULATION OF LIEBES EQAULS TO"],"info":{}}
{"id":"train_23750","question":"Tell me a holiday that celebrates Lakshmi that includes the word \"deepavali\" in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1445650 . ?sbj wdt:P547 wd:Q131443 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'deepavali' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a excursion that celebrates Lakshmi that consists of the phrase \"deepavali\" in it is name?"],"info":{}}
{"id":"train_23753","question":"What instruments do the musicians use within \"In questa reggia\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6011637 wdt:P175 ?X . ?X wdt:P870 ?answer }","paraphrases":["What disobedient do the performers utilize inside \"In questa reggia\"?"],"info":{}}
{"id":"train_23758","question":"what are the borough of new york city which contains the word queens in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q408804 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'queens' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the borough of unused york city which contains the word rulers in their name"],"info":{}}
{"id":"train_23773","question":"Who is the   {city} for {official language} of {Urdu}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q1617 . ?sbj wdt:P31 wd:Q515 }","paraphrases":["Who is the { Official Language } of { Urdu }"],"info":{}}
{"id":"train_23774","question":"Tell me the civic building that is located in the street of Pennsylvania Avenue and whose name contains the word house.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q52177058 . ?sbj wdt:P669 wd:Q1455053 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'house' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the civic building that is located in the avenue of Pennsylvania Avenue and whose title incorporates the phrase house."],"info":{}}
{"id":"train_23776","question":"What is a national association football team whose name starts with the letter t.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6979593 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What may be a national affiliation football group whose title begins with the letter t."],"info":{}}
{"id":"train_23779","question":"Who has the native label of 단 and revised romanization for Mandala","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q191431 p:P1705 ?s . ?s ps:P1705 ?x filter ( contains ( ?x , '단' ) ) . ?s pq:P2001 ?value }","paraphrases":["Who uses the native label 단 and revised romanization for Mandala?"],"info":{}}
{"id":"train_23780","question":"Who was the spouse of Philip II of Macedon in 357 BC.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q130650 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P580 ?x filter ( contains ( ?x , '-357-0-0' ) ) }","paraphrases":["Who was the life partner of Philip II of Macedon in 357 BC?"],"info":{}}
{"id":"train_23783","question":"what are the chemical property that starts with t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q764285 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the chemical property that begins with t"],"info":{}}
{"id":"train_23793","question":"What language does Art Blakey speak? it is not spanglish.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q311715 wdt:P1412 ?answer . ?answer wdt:P1889 wd:Q56418 }","paraphrases":["What dialect does Craftsmanship Blakey talk? it isn't spanglish."],"info":{}}
{"id":"train_23796","question":"Which state was involved in the French invasion of Russia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q179250 wdt:P276 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What state was involved in the French invasion of Russia?"],"info":{}}
{"id":"train_23797","question":"What what is type of number disjoint union of} list values as qualifiers  starts with  and also which starts with letter n","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q47460393 . ?sbj wdt:P2738 wd:Q23766486 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'n' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is kind of number disjoint union of} list values as qualifiers starts offevolved with and additionally which starts with letter n"],"info":{}}
{"id":"train_23805","question":"Mention the number of the matches and the number of the goals count achieved by Carlos Alberto Torres when he was playing for New York Cosmos team","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q295262 p:P54 ?s . ?s ps:P54 wd:Q646135 . ?s pq:P1350 ?value1 . ?s pq:P1351 ?value2 }","paraphrases":["How many matches were played and goals were achieved by Carlos Aberto Torres while he was on the New York Cosmos team?"],"info":{}}
{"id":"train_23820","question":"WHAT IS GEOLOGICAL SUPEREON THAT STARTS WITH P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15398983 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT IS SUPEREON GEOLOGICAL SUPEREON WITH P"],"info":{}}
{"id":"train_23833","question":"Tell me linear combination whose name has the word principle in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q27628 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'principle' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know straight combination whose title has the word guideline in it."],"info":{}}
{"id":"train_23844","question":"WHICH IS THE TOWN STARTS WITH S","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3957 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'š' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT IS WITH S TOWN STARTS"],"info":{}}
{"id":"train_23846","question":"What are the rules of handball","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8418 wdt:P2416 ?obj . ?obj wdt:P31 wd:Q2312410 }","paraphrases":["How do you play handball?"],"info":{}}
{"id":"train_23847","question":"What is the Big Bang","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P793 wd:Q323 . ?sbj wdt:P31 wd:Q36906466 }","paraphrases":["What's the big shock?"],"info":{}}
{"id":"train_23850","question":"What are the group of greek mythical character which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28061975 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the gather of greek legendary character which begin with the letter t"],"info":{}}
{"id":"train_23853","question":"What is the grade of Andy Murray","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q10125 wdt:P1352 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23862","question":"Who was the doctoral adviser to Benedict XVI","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P184 wd:Q2494 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who advised Benedict XVI on his doctorate?"],"info":{}}
{"id":"train_23863","question":"Name the country with the lowest age of majority in the country.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q6256 . ?ent wdt:P2997 ?obj . ?ent wdt:P31 wd:Q6256 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What country has the lowest age of majority?"],"info":{}}
{"id":"train_23864","question":"WHOSE VOICE IN THE WORK OF VENEZUELA","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q39395927 wdt:P1441 ?X . ?X wdt:P725 ?answer }","paraphrases":["WHOSE VOICE Within The WORK OF VENEZUELA"],"info":{}}
{"id":"train_23877","question":"What are the film studio which start with the letter engineering","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q379231 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'law' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which film studio starts with letter engineering?"],"info":{}}
{"id":"train_23880","question":"Did Manic Street Preachers record music with Universal Music Group ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q217025 wdt:P264 wd:Q38903 }","paraphrases":["Iconic rock bandManic Street Preachers have signed a worldwide publishing deal, covering their future songwriting, with Warner/Chappell Music, the music publishing arm of Warner Music Group. The band are set to release their thirteenth album, Resistance Is Futile, in April.Feb 12, 2018"],"info":{}}
{"id":"train_23883","question":"What is the current translated edition of Bhagavad Gita","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P629 wd:Q46802 . ?sbj wdt:P31 wd:Q3331189 }","paraphrases":["What is the current interpreted version of Bhagavad Gita"],"info":{}}
{"id":"train_23885","question":"when is the {end time} for {Louis XVIII of France} tha has {spouse} as {Marie Joséphine of Savoy} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7750 p:P26 ?s . ?s ps:P26 wd:Q231844 . ?s pq:P582 ?value }","paraphrases":["When did Louis XVIII of France, husband of Marie Josephine of Savoy, die?"],"info":{}}
{"id":"train_23889","question":"Where is the place of death of György Sárosi, in Italy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q502942 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q38 }","paraphrases":["Where did Gyorgy Sarosi die?"],"info":{}}
{"id":"train_23905","question":"How many bodies of water are located next to Lübeck?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q2843 wdt:P206 ?obj }","paraphrases":["What is the number of bodies of water that are located next to Lubeck?"],"info":{}}
{"id":"train_23906","question":"Which  is Catholic Hierarchy person ID of Óscar Romero?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q293455 wdt:P1047 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23927","question":"Which is senat.fr ID for Raymond Poincaré?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q191974 wdt:P1808 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23933","question":"which isomer of indium has the lowest atomic number","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q846110 . ?ent wdt:P1086 ?obj . ?ent wdt:P279 wd:Q1094 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What isomer of indium contains the lowest atomic number?"],"info":{}}
{"id":"train_23945","question":"Is New Jersey next to Querétaro, a subdivided neighborhood?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q79754 wdt:P47 ?answer . ?answer wdt:P150 wd:Q1408 }","paraphrases":["Is Modern Shirt another to Querétaro, a subdivided neighborhood?"],"info":{}}
{"id":"train_23959","question":"What are the phase of the moon which start with the letter q","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q26388 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'q' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the stage of the moon which begin with the letter q"],"info":{}}
{"id":"train_23972","question":"tell  me development stage of animal starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20056177 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the stage of animal development begins with s"],"info":{}}
{"id":"train_23977","question":"Name what died on 1922-9-7 that was coined by the Arts and Crafts movement.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q330369 wdt:P3938 ?answer . ?answer wdt:P570 ?x FILTER ( contains ( YEAR ( ?x ) , '1922' ) ) }","paraphrases":["Name what died on 1922-9-7 that used to be coined by way of the Arts and Crafts movement."],"info":{}}
{"id":"train_23979","question":"Which is nighttime view for Asunción?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2933 wdt:P3451 ?answer }","paraphrases":[],"info":{}}
{"id":"train_23988","question":"which profession  starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q28640 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which calling begins with s"],"info":{}}
{"id":"train_23989","question":"What degree did Richard Feynman get at Princeton University","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q39246 p:P69 ?s . ?s ps:P69 wd:Q21578 . ?s pq:P512 ?value1 . ?s pq:P184 ?value2 }","paraphrases":["What degree did Richard Feynman get at Princeton University"],"info":{}}
{"id":"train_23994","question":"Tell me constellation  whose name has the word volans in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8928 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'volans' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me constellation whose name has the word volans in it."],"info":{}}
{"id":"train_24003","question":"Did Kid Cudi use record labels \"Top Dawg Entertainment\" and \"Fool's Gold Records\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q299138 wdt:P264 wd:Q16957703 . wd:Q299138 wdt:P264 wd:Q5465592 }","paraphrases":["Did Kid Cudi record for both \"Top Dawg Entertainment\" and \"Fool's Gold Records\"?"],"info":{}}
{"id":"train_24032","question":"Tell me the codomain of sequence.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1571 wd:Q133250 }","paraphrases":[],"info":{}}
{"id":"train_24050","question":"gsdg","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q259507 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q6837261 }","paraphrases":["nonsensical"],"info":{}}
{"id":"train_24052","question":"What are the fictional which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3247351 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the fictionals that begin with W."],"info":{}}
{"id":"train_24055","question":"What are the annexation which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q194465 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the extension which begin with the letter w"],"info":{}}
