{"id":"train_21615","question":"\"What is {is in the principal area of} of {Flevoland}, whose {member of} is {Australia Group} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q707 wdt:P131 ?answer . ?answer wdt:P463 wd:Q782942 }","paraphrases":["In the Australia Group, what is the principal area of it's member Flevoland?"],"info":{}}
{"id":"train_21617","question":"What is speed limit of Gaza Strip ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q39760 wdt:P3086 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21618","question":"Who has played Please Don't Make My Cry?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7204205 wdt:P156 ?X . ?X wdt:P175 ?answer }","paraphrases":["Give me the name of the person that has played Please Don't Make Me Cry."],"info":{}}
{"id":"train_21619","question":"Who makes use of the inventor of World on a Wire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q481467 wdt:P2283 ?X . ?X wdt:P61 ?answer }","paraphrases":["Who makes utilize of the innovator of World on a Wire?"],"info":{}}
{"id":"train_21620","question":"Give me the reason for which Walt Disney has nominated for Academy award as best live action short film?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8704 p:P1411 ?s . ?s ps:P1411 wd:Q1324407 . ?s pq:P805 ?value }","paraphrases":["Why Walt Disney was nominated for Academy award for Best Live Action Short Fim?"],"info":{}}
{"id":"train_21621","question":"Tell me the language family that discoverer or inventor of  William Jones and which that starts with the letter e","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q25295 . ?sbj wdt:P61 wd:Q273969 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the language family that discoverer or inventor of William Jones and which that starts with the letter e"],"info":{}}
{"id":"train_21622","question":"Do you know, what is the drawing with the tallest height?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q93184 . ?ent wdt:P2048 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Do you know, what is the drawing with the tallest height?"],"info":{}}
{"id":"train_21623","question":"what are the mythical place which start with the letter y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24334893 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What mythical place starts with \"y\"?"],"info":{}}
{"id":"train_21624","question":"What is the Datahub Page of the DDC?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q48460 wdt:P2666 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21625","question":"How do i pronounce honey in Punjabi?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q10987 p:P443 ?s . ?s ps:P443 ?obj . ?s pq:P407 wd:Q58635 }","paraphrases":["Which is the right way to pronounce honey in Punjabi?"],"info":{}}
{"id":"train_21626","question":"What what is vaccine vaccine for  by rubella and which that starts with v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q134808 . ?sbj wdt:P1924 wd:Q155857 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What what is vaccine vaccine for by rubella and which that begins with v"],"info":{}}
{"id":"train_21627","question":"Name a moon of Neptune","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q332 wdt:P398 ?obj . ?obj wdt:P31 wd:Q2139 }","paraphrases":["Name Neptune's moon"],"info":{}}
{"id":"train_21630","question":"What Looney Toons publishing house won the Golden Raspberry Award for Worst Picture?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q622435 wdt:P123 ?answer . ?answer wdt:P166 wd:Q1780634 }","paraphrases":["What Looney Toons publishing residence won the Golden Raspberry Award for Worst Picture?"],"info":{}}
{"id":"train_21631","question":"What causes Staphylococcus aureus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P828 wd:Q188121 . ?sbj wdt:P31 wd:Q12136 }","paraphrases":["What causes Staphylococcus aureus?"],"info":{}}
{"id":"train_21634","question":"What is All-Athletics.com ID for Jan Železný?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q193187 wdt:P3765 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21635","question":"What is Robert frost a winner of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1346 wd:Q168728 }","paraphrases":[],"info":{}}
{"id":"train_21636","question":"When did Ai Weiwei complete his studies at the Art Students League of NY?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q160115 p:P69 ?s . ?s ps:P69 wd:Q705737 . ?s pq:P582 ?value }","paraphrases":["What year did Ai Weiwei finish studying at the Arts Students League of NY?"],"info":{}}
{"id":"train_21637","question":"Is the prize money of the Geschwister-Scholl-Preis equal to 10000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q118404 wdt:P2121 ?obj filter ( ?obj = 10000 ) }","paraphrases":["Is there a $10000 prize for the Geschwister-Scholl-Preis?"],"info":{}}
{"id":"train_21638","question":"Which {contains administrative territorial entity} and the {located in the administrative territorial entity} of {Tamil_Nadu} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1445 wdt:P150 ?ans_1 . wd:Q1445 wdt:P131 ?ans_2 }","paraphrases":["Identify the administrative territorial entity of Tamil Nadu."],"info":{}}
{"id":"train_21640","question":"WHAT IS THE SURFACE PLACE OF INCORPORATION IN SCOUTS ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q872181 wdt:P740 ?X . ?X wdt:P2046 ?answer }","paraphrases":["WHAT IS THE SURFACE Put OF Consolidation IN SCOUTS ?"],"info":{}}
{"id":"train_21641","question":"What did C. Vann Woodward major in at Emory University, and what academic degree did he earn?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q612410 p:P69 ?s . ?s ps:P69 wd:Q621043 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What did C. Vann Woodward most important in at Emory University, and what educational degree did he earn?"],"info":{}}
{"id":"train_21644","question":"What mausoleum commemorates Vladimir Lenin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P547 wd:Q1394 . ?sbj wdt:P31 wd:Q162875 }","paraphrases":["Vladimir Lenin is commemorated by which mausoleum"],"info":{}}
{"id":"train_21645","question":"DOES THE NU,BER OF ARRSTS OFD 2915 BALTIMORE PROTESTS EQAULS  388.8","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q19838194 wdt:P5582 ?obj filter ( ?obj = 388.8 ) }","paraphrases":["DOES THE NU,BER OF ARRSTS OFD 2915 BALTIMORE Challenges EQAULS 388.8"],"info":{}}
{"id":"train_21646","question":"What is the military branch or location of Yuri Gagarin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7327 wdt:P241 ?obj . ?obj wdt:P31 wd:Q13226383 }","paraphrases":["What is the military branch or location of Yuri Gagarin?"],"info":{}}
{"id":"train_21647","question":"Who is the leader member of Gil Colunje?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5879508 wdt:P102 ?X . ?X wdt:P488 ?answer }","paraphrases":["Who is the pioneer part of Gil Colunje?"],"info":{}}
{"id":"train_21648","question":"What are the non metropolitan country which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q769603 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the non metropolitan nation which begin with the letter w"],"info":{}}
{"id":"train_21650","question":"Why did Gregory Bateson lose his U.k. citizenship?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q314252 p:P27 ?s . ?s ps:P27 wd:Q174193 . ?s pq:P1534 ?value }","paraphrases":["How was U.K. citizenship lost by Gregory Bateson"],"info":{}}
{"id":"train_21654","question":"Use rallye-info.com  to get driver or co-driver is of Sebastian Loeb?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7855 wdt:P3930 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21655","question":"Which is the BLF article ID for Alvar Aalto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q82840 wdt:P3595 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21658","question":"Who produced the prequel for Tales of Mystery and Imagination?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1475573 wdt:P156 ?X . ?X wdt:P162 ?answer }","paraphrases":["Who delivered the prequel for Stories of Secret and Creative ability?"],"info":{}}
{"id":"train_21660","question":"Tell me the boy band that contains the wotd westlife in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q216337 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'westlife' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me the boy band that contains the wotd westlife in their name"],"info":{}}
{"id":"train_21661","question":"How many people live in Massachusetts according to the census?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q771 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["What is the population of people of Massachusetts according to the census?"],"info":{}}
{"id":"train_21662","question":"How many computers are for IBM?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q37156 wdt:P1056 ?obj }","paraphrases":["Which is the number of computers for IBM?"],"info":{}}
{"id":"train_21663","question":"Name a member of the band ABBA","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q18233 wdt:P138 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["From the band ABBA, name one member."],"info":{}}
{"id":"train_21664","question":"How many {frequenter } are to/by {Lorenzo Diamond State ' Medici} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1962 wd:Q177854 }","paraphrases":["Which is the number of frequenters at Lorenzo Diamond State Medici?"],"info":{}}
{"id":"train_21668","question":"When did Rafael Caldera receive the Order of Isabella the Catholic?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q311323 p:P166 ?s . ?s ps:P166 wd:Q931502 . ?s pq:P585 ?value }","paraphrases":["On what date did Rafael Caldera receive the Order of Isabella the Catholic?"],"info":{}}
{"id":"train_21670","question":"Is it true that the number of cases of AIDS equals to 30160000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q12199 wdt:P1603 ?obj filter ( ?obj = 30160000.0 ) }","paraphrases":["Is it genuine that the number of cases of Helps rises to to 30160000?"],"info":{}}
{"id":"train_21672","question":"Where was yttrium discovered that has an executive branch in the Finnish Government?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q941 wdt:P189 ?answer . ?answer wdt:P208 wd:Q2366737 }","paraphrases":["Where used to be yttrium determined that has an govt branch in the Finnish Government?"],"info":{}}
{"id":"train_21673","question":"What newspaper is the Wikidata SPARQL query equivalent?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11032 wdt:P3921 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21674","question":"Is it true that the stellar rotational velocity of Albireo equals to 1.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13018 wdt:P4296 ?obj filter ( ?obj = 1.4 ) }","paraphrases":["Is it genuine that the stellar rotational speed of Albireo breaks even with to 1.4?"],"info":{}}
{"id":"train_21675","question":"What was the name after Sibelius Monument where music were studies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2584017 wdt:P138 ?answer . ?answer wdt:P101 wd:Q638 }","paraphrases":["What used to be the identify after Sibelius Monument the place tune have been studies?"],"info":{}}
{"id":"train_21677","question":"When did position held of Arthur Balfour and elected in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q19008 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P2715 ?value1 . }","paraphrases":["When was the position held and elected by Arthur Balfour?"],"info":{}}
{"id":"train_21678","question":"What is the LepIndex ID of Bombyx mori ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q134747 wdt:P3064 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21680","question":"Tell me the new religious movement that is standards body of Religious Technology Center and starts with the letter s?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q477544 . ?sbj wdt:P1462 wd:Q2672895 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the new religious movement that is standards body of Religious Technology Center and begins with the letter s?"],"info":{}}
{"id":"train_21682","question":"Which are the page(s) for A Love Supreme has publication date as 1965-2-1 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q5106 p:P577 ?s . ?s ps:P577 ?x filter ( contains ( YEAR ( ?x ) , '1965' ) ) . ?s pq:P304 ?value }","paraphrases":["What pages for A love Supreme was published on 1965-2-1?"],"info":{}}
{"id":"train_21685","question":"What child body, located on the astronomical body of the Great Red Spot, is S/2017 J 8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q194256 wdt:P376 ?answer . ?answer wdt:P398 wd:Q55598488 }","paraphrases":["What infant body, positioned on the astronomical physique of the Great Red Spot, is S/2017 J 8?"],"info":{}}
{"id":"train_21686","question":"Who is the director of Chespirito?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P57 wd:Q555578 }","paraphrases":[],"info":{}}
{"id":"train_21687","question":"Who is {wedded to} {chairperson} of {38th César Awards} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2263724 wdt:P488 ?X . ?X wdt:P26 ?answer }","paraphrases":["Name the person who is spouse of Chairperson of 38th Cesar Awards?"],"info":{}}
{"id":"train_21688","question":"What are the animated series which start with the letter trotro","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q581714 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trotro' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What church is dedicated to the Virgin Mary and the church name begins with D."],"info":{}}
{"id":"train_21689","question":"When did William Jennings Bryan retire from his position as a United States representative?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q205282 p:P39 ?s . ?s ps:P39 wd:Q13218630 . ?s pq:P582 ?value }","paraphrases":["One what date did William Jennings Bryan retire from his position as a United States representative?"],"info":{}}
{"id":"train_21690","question":"What ecozone does Melanesia belong to","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q37394 wdt:P706 ?obj . ?obj wdt:P31 wd:Q944816 }","paraphrases":["What ecozone does Melanesia have a place to"],"info":{}}
{"id":"train_21691","question":"(RS)-methadone physically interacts with which protein?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q179996 wdt:P129 ?obj . ?obj wdt:P31 wd:Q8054 }","paraphrases":["(RS)-methadone physically interatomic with which protein?"],"info":{}}
{"id":"train_21692","question":"Who is the husband of Carol Burnett who died in 1984?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q255565 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1984' ) ) }","paraphrases":["Who was Carol Burnett married to up until 1984, the year he passed away?"],"info":{}}
{"id":"train_21694","question":"What did Franz Schubert die from where the symptom was a continuous fever?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7312 wdt:P509 ?answer . ?answer wdt:P780 wd:Q29644032 }","paraphrases":["What did Franz Schubert kick the bucket from where the side effect was a nonstop fever?"],"info":{}}
{"id":"train_21695","question":"Which is the Radionavigation-satellite service that is a manifestation of satellite navigation system and contains the word global in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20181002 . ?sbj wdt:P1557 wd:Q179435 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'global' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the Radionavigation-satellite carrier that is a manifestation of satellite navigation machine and carries the word international in it is name?"],"info":{}}
{"id":"train_21696","question":"What is the specific gravity of lemonade?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q893 wdt:P186 ?X . ?X wdt:P2054 ?answer }","paraphrases":["Give me the figure of the specific gravity of lemonade."],"info":{}}
{"id":"train_21697","question":"Is the maximum sustained winds of Hurricane Able equal to 80?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q272049 wdt:P2895 ?obj filter ( ?obj = 80 ) }","paraphrases":["Did Hurricane Able have a maximum sustained wind of 80?"],"info":{}}
{"id":"train_21698","question":"Name a noble family who posessed the power in the form of an absolute monarchy that contains the word \"dynasty \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13417114 . ?sbj wdt:P122 wd:Q184558 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dynasty' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a noble household who posessed the energy in the structure of an absolute monarchy that includes the word \"dynasty \" in its name"],"info":{}}
{"id":"train_21699","question":"What is the architecture firm and resting place of Matilda of Tuscany?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q464162 wdt:P119 ?X . ?X wdt:P84 ?answer }","paraphrases":["What is the design firm and resting put of Matilda of Tuscany?"],"info":{}}
{"id":"train_21700","question":"Are the women playing miniature golf in the Women in Red banner picture that is labeled Golf Women in Red banner.jpg ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q754796 wdt:P641 ?answer . ?answer wdt:P948 ?x FILTER ( contains ( ?x , 'Golf page banner.jpg' ) ) }","paraphrases":["Are the female playing miniature golf in the Women in Red banner image that is labeled Golf Women in Red banner.jpg ?"],"info":{}}
{"id":"train_21703","question":"Jan Evangelista Purkyně served as a translator in what field of work?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q159542 p:P106 ?s . ?s ps:P106 wd:Q333634 . ?s pq:P101 ?value }","paraphrases":["In what field was Jan Evangelista Purkyne a translator?"],"info":{}}
{"id":"train_21707","question":"What is ICD-9-CM to cause death of Kitch Christie?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q677419 wdt:P509 ?X . ?X wdt:P1692 ?answer }","paraphrases":["What is ICD-9-CM to cause passing of Kitch Christie?"],"info":{}}
{"id":"train_21710","question":"Name a videogame developped by CPU that contains the word \"pong\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7889 . ?sbj wdt:P880 wd:Q11653 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pong' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a videogame developped through CPU that consists of the word \"pong\" in its name"],"info":{}}
{"id":"train_21711","question":"Which {tributary} {is on} {Hawaiian Islands} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192626 wdt:P706 ?X . ?X wdt:P974 ?answer }","paraphrases":["Which {tributary} {is on} {Hawaiian Islands} ?"],"info":{}}
{"id":"train_21713","question":"na","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q1017 . ?sbj wdt:P31 wd:Q18127 }","paraphrases":["Na: Na"],"info":{}}
{"id":"train_21728","question":"Tell me me a  cation whose name consist of the word \"woman\" and whose antiparticle antiproton proton","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q326277 . ?sbj wdt:P2152 wd:Q107575 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'proton' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me me a cation whose identify consist of the word \"woman\" and whose antiparticle antiproton proton"],"info":{}}
{"id":"train_21735","question":"What are the standards organization which start with the letter t13","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1328899 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 't13' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the measures organization which begin with the letter t13"],"info":{}}
{"id":"train_21741","question":"Tell me  association football club whose name has the word wrexham in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q476028 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wrexham' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know affiliation football club whose title has the word wrexham in it."],"info":{}}
{"id":"train_21750","question":"Tell me the colossal statue that depicts the throne and which that starts with the letter o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1779653 . ?sbj wdt:P180 wd:Q189233 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'o' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Disclose me the colossal statue that depicts the throne and which that starts with the letter o"],"info":{}}
{"id":"train_21758","question":"What award did Alejandro González Iñárritu receive for Birdman?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q55215 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1686 wd:Q13255497 }","paraphrases":["Which award did Alejandro González Iñárritu receive for Birdman?"],"info":{}}
{"id":"train_21759","question":"What are the diplomatic rank which start with the letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q303618 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the discretionary rank which begin with the letter P"],"info":{}}
{"id":"train_21760","question":"What are the airliner which start with the letter e","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q210932 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the aircraft which begin with the letter e"],"info":{}}
{"id":"train_21761","question":"Does the Gross Domestic Product and Purchasing Power Parity of Finland equals that of 1.85468488057 €?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q33 wdt:P4010 ?obj filter ( ?obj = 1.85468488057e+11 ) }","paraphrases":["Is Rihanna's net worth less than $ 276,000,000?"],"info":{}}
