{"id":"train_16837","question":"Name a small planet that contains the word \" 90377\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1022867 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , '90377' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a little planet that contains the word \" 90377\" in its name"],"info":{}}
{"id":"train_16839","question":"What award did Martti Ahtisaari receive in 2007?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q29230 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2007' ) ) }","paraphrases":["Tell me which award Martti Ahtisaari received in 2007."],"info":{}}
{"id":"train_16841","question":"who is managed by exchange of Unisys ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q518016 wdt:P414 ?X . ?X wdt:P137 ?answer }","paraphrases":["who is overseen by trade of Unisys ?"],"info":{}}
{"id":"train_16842","question":"What position was held by George VI and when did he begin in that position?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q280856 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["What position was held by George VI and when did he start in that position?"],"info":{}}
{"id":"train_16843","question":"What position did Recep Tayyip Erdogan hold that had a coat of arms with the Seal of the Prime Ministry of the Republic of Turkey?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q39259 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P94 ?x filter ( contains ( ?x , 'Seal of Prime Ministry of the Republic of Turkey.svg' ) ) }","paraphrases":["Recep Tayyip Erdogan held a Prime Ministry of Republic of Turkey designation in which the attire comprised of coat with arms with Seal of Prime Ministry. Name the designation."],"info":{}}
{"id":"train_16846","question":"WHICH IS THE THERAPEUTIC AREA OF BIRTH CONTROL","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P4044 wd:Q122224 }","paraphrases":[],"info":{}}
{"id":"train_16847","question":"Is the literate population of Parsal 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q60379780 wdt:P6499 ?obj filter ( ?obj = 0 ) }","paraphrases":["Are there no literate people in Parsal?"],"info":{}}
{"id":"train_16848","question":"Is the IPA number order of the voiced palatal stop equal to 108?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q239206 wdt:P3917 ?obj filter ( ?obj = 108 ) }","paraphrases":["Is 108 the IPA number order of the voiced palatal stop?"],"info":{}}
{"id":"train_16850","question":"Who was the film produ er of Rekvijem za teškaša?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q31184853 wdt:P144 ?X . ?X wdt:P162 ?answer }","paraphrases":["Who was the film produ er of Rekvijem za teškaša?"],"info":{}}
{"id":"train_16851","question":"What is ESPN.com MLB ID for Deion Sanders ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q954184 wdt:P3571 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16852","question":"who state of Australia for capital of Melbourne?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P36 wd:Q3141 . ?sbj wdt:P31 wd:Q5852411 }","paraphrases":["who state of Australia for capital of Melbourne?"],"info":{}}
{"id":"train_16853","question":"What will be the effect of bacteria which has prescribed drug of cefizoxime?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10876 wdt:P1542 ?answer . ?answer wdt:P2176 wd:Q1082945 }","paraphrases":["What will be the effect of bacteria which has prescribed drug of cefizoxime?"],"info":{}}
{"id":"train_16854","question":"How was it determined that the population of Cadiz was 128,554?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q15682 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '128554.0' ) ) . ?s pq:P459 ?value }","paraphrases":["How did you know what the population of Cadiz was?"],"info":{}}
{"id":"train_16855","question":"Which is the country for which Rodrigo Duterte is the head of the government?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q457786 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["Rodrigo Duterte is the head of government for which country?"],"info":{}}
{"id":"train_16857","question":"Is it true that the mass excess of samarium-148 equals to -79336.264?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1985308 wdt:P2160 ?obj filter ( ?obj = -79336.264 ) }","paraphrases":["Is it genuine that the mass abundance of samarium-148 rises to to -79336.264?"],"info":{}}
{"id":"train_16859","question":"\"Where is the {seat} of {Nihon Keizai Shimbun}, that {has villages} in {Minato-ku} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1077694 wdt:P159 ?answer . ?answer wdt:P150 wd:Q190088 }","paraphrases":["\"Where is the {seat} of {Nihon Keizai Shimbun}, that {has villages} in {Minato-ku} ?\""],"info":{}}
{"id":"train_16861","question":"In a notable incident during the World Premiere, what is the place of Don Giovanni's first performance?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192039 wdt:P4647 ?answer . ?answer wdt:P793 wd:Q2500107 }","paraphrases":["In a eminent occurrence amid the World Debut, what is the put of Wear Giovanni's to begin with performance?"],"info":{}}
{"id":"train_16863","question":"What country are Evanescence from?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q1777698 wdt:P495 ?ans_1 . wd:Q1777698 wdt:P740 ?ans_2 }","paraphrases":["Where is the band Evanescence from?"],"info":{}}
{"id":"train_16868","question":"What polychoron starts with the letter \"u\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2155148 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What polychoron does the letter \"u\" start with?"],"info":{}}
{"id":"train_16869","question":"Is Rani Mukerji related to either Ayan Mukerji or Debashree Roy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q485557 wdt:P1038 wd:Q4830910 . wd:Q485557 wdt:P1038 wd:Q3349817 }","paraphrases":["Are Ayan Mukerji or Debashree Roy family members of Rani Mukerji?"],"info":{}}
{"id":"train_16870","question":"What taxon rank in zoology is the Dodo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43502 wdt:P105 ?obj . ?obj wdt:P31 wd:Q13578154 }","paraphrases":["What taxon rank is the Dodo?"],"info":{}}
{"id":"train_16871","question":"Is Dengue fever an infectious disease?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q30953 wdt:P1995 wd:Q788926 }","paraphrases":["Is Dengue fever considered to be an infectious disease?"],"info":{}}
{"id":"train_16872","question":"Tell me historical process whose name has the word germany in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16622264 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'germany' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know chronicled prepare whose title has the word germany in it."],"info":{}}
{"id":"train_16874","question":"Who is the voice actor, José Ferrer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P725 wd:Q312098 }","paraphrases":[],"info":{}}
{"id":"train_16875","question":"Ruby is what color?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43088 wdt:P462 ?obj . ?obj wdt:P31 wd:Q1075 }","paraphrases":["What color is Ruby?"],"info":{}}
{"id":"train_16876","question":"What award did Joni Mitchell win and when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q205721 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["What grant did Joni Mitchell win and when?"],"info":{}}
{"id":"train_16878","question":"Tell me the national association football team that competition class men's association football and which that starts with the letter f","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q6979593 . ?sbj wdt:P2094 wd:Q35554451 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the national affiliation soccer team that opposition class men's affiliation soccer and which that starts with the letter f"],"info":{}}
{"id":"train_16879","question":"Which is the cause that has the proximate cause of marsh?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q30198 wdt:P1478 ?X . ?X wdt:P1542 ?answer }","paraphrases":["What is the cause that has the proximate cause of marsh?"],"info":{}}
{"id":"train_16880","question":"Tell me the results of the label \"Cheech & Chong\".","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1066813 wdt:P264 ?X . ?X wdt:P1056 ?answer }","paraphrases":["Let me know the comes about of the name \"Cheech & Chong\"."],"info":{}}
{"id":"train_16882","question":"Is Rowan Atkinson's occupation a screenwriter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23760 wdt:P106 wd:Q28389 }","paraphrases":["Does Rowan Atkinson works as a screenwriter?"],"info":{}}
{"id":"train_16883","question":"How much physical interaction is affected by oxytocin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q169960 wdt:P129 ?obj }","paraphrases":["Oxytocin affects what physical interaction?"],"info":{}}
{"id":"train_16884","question":"What and when was Jeff Bezo's significant life event?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q312556 p:P793 ?s . ?s ps:P793 wd:Q171558 . ?s pq:P276 ?value1 . ?s pq:P585 ?value2 }","paraphrases":["What and when was the important event in life for Jeff Bezo?"],"info":{}}
{"id":"train_16885","question":"What was the award received by Stendhal in 1835?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q502 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1835' ) ) }","paraphrases":["In 1835, Stendhal received what award?"],"info":{}}
{"id":"train_16887","question":"What is the short-chain fatty acid with the lowest surface tension that is part carbon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q2698455 . ?ent wdt:P3013 ?obj . ?ent wdt:P527 wd:Q623 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which short-chain fatty acid that is part carbon has the lowest surface tension?"],"info":{}}
{"id":"train_16890","question":"What is Robert Fumerton's battle formation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7344580 wdt:P241 ?X . ?X wdt:P607 ?answer }","paraphrases":["What is Robert Fumerton's fight arrangement?"],"info":{}}
{"id":"train_16892","question":"Was Ludwing_Van_Bethoven's notable work Piano Sonata No. 14?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q255 wdt:P800 wd:Q12008 }","paraphrases":["Was Ludwing Van Bethoven the person who created Piano Sonata No. 14?"],"info":{}}
{"id":"train_16893","question":"Is Juan José Ibarretxe a chairperson of FC Barcelona?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7156 wdt:P488 wd:Q351738 }","paraphrases":["Does FC Barcelona have Juan Jose Ibarretxe as a chairperson?"],"info":{}}
{"id":"train_16894","question":"Tell me isotope of carbon whose name has the word carbon in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q471790 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'carbon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know isotope of carbon whose title has the word carbon in it."],"info":{}}
{"id":"train_16895","question":"What subsidiary entities are co-founded by Google?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q95 wdt:P355 ?X . ?X wdt:P112 ?answer }","paraphrases":["Google co-founds what subsidiary entities?"],"info":{}}
{"id":"train_16896","question":"Which is Models.com client ID of Vanity Fair?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q158283 wdt:P2782 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16899","question":"WHICH IS THE TWINJET WITH THE MOST OPERATING ATTITUDE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q233132 . ?ent wdt:P2254 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Twinjet with the most operation attitude is ?"],"info":{}}
{"id":"train_16900","question":"What year did Giza Governorate have a population of 6.29432e+06?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q30832 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '6.29432e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["What year did Giza Governorate have a populace of  6.29432e+06?"],"info":{}}
{"id":"train_16903","question":"What is the  language of environment of Darkwood ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q26694917 wdt:P400 ?X . ?X wdt:P277 ?answer }","paraphrases":["Name the language of environment of Darkwood"],"info":{}}
{"id":"train_16904","question":"Mention the predecessor and the successor of Louis the Pious while being recognized as king of Franks","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q43974 p:P97 ?s . ?s ps:P97 wd:Q22923081 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["Mention the predecessor and the successor of Louis the Pious whilst being diagnosed as king of Franks"],"info":{}}
{"id":"train_16907","question":"David Duchovny is the producer of which television series ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P162 wd:Q484365 . ?sbj wdt:P31 wd:Q5398426 }","paraphrases":["What television series did David Duchovny produce?"],"info":{}}
{"id":"train_16909","question":"Are the total assists in career of Mikko Jokela equal to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q119866 wdt:P6545 ?obj filter ( ?obj = 0 ) }","paraphrases":["How many assists did Mikko Jokela have in his entire career?"],"info":{}}
{"id":"train_16910","question":"IS THE MELTING POINT OF THE CARBON MONOXIDE GREATER THAN -269.6","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2025 wdt:P2101 ?obj filter ( ?obj > -269.6 ) }","paraphrases":["Can I melt Carbon Monoxide at temperatures more than -269.6?"],"info":{}}
{"id":"train_16911","question":"Tell me theory whose name has the word traditionalism in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q17737 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'traditionalism' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me hypothesis whose title has the word traditionalism in it."],"info":{}}
{"id":"train_16912","question":"Is it true that the face value of the 1 euro coin equals to 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q684722 wdt:P3934 ?obj filter ( ?obj = 1 ) }","paraphrases":["Does the face value of a one euro coin equal to one?"],"info":{}}
{"id":"train_16917","question":"Who was awarded the Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series in Matthew Fox ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q185554 p:P166 ?s . ?s ps:P166 wd:Q2530270 . ?s pq:P1346 ?value }","paraphrases":["Who was awarded the Screen Actors Guild Award for Outstanding Performance by an Ensemble in a Drama Series in Matthew Fox ?"],"info":{}}
{"id":"train_16918","question":"Buckingham Palace is commissioned by what body?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q42182 wdt:P88 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16919","question":"What 9-Cylinder radial engine model has the least bore?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15057021 . ?ent wdt:P2556 ?obj . ?ent wdt:P1002 wd:Q15135215 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What 9-Cylinder outspread motor show has the slightest bore?"],"info":{}}
{"id":"train_16921","question":"Which is the start time and end time of Antonio Gades having Marisol as wife?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q561048 p:P26 ?s . ?s ps:P26 wd:Q942278 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["Which is the start time and stop time of Antonio Gades having Marisol as wife?"],"info":{}}
{"id":"train_16922","question":"What is the ARWU university ID of the University of Cambridge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q35794 wdt:P5242 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16927","question":"tell me the rapid transit which starts with the letter s in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5503 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the leading academics starting with letter T?"],"info":{}}
{"id":"train_16929","question":"What award was provided to Anthony Hewish and Martin Ryle?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q189990 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 wd:Q190766 }","paraphrases":["What award did Anthony Hewish and Martin Ryle win?"],"info":{}}
{"id":"train_16931","question":"Name a radio program hosted by Donald Trump","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P371 wd:Q22686 . ?sbj wdt:P31 wd:Q1555508 }","paraphrases":["Title a radio program facilitated by Donald Trump"],"info":{}}
{"id":"train_16933","question":"WHAT IS THE RETIREMENT AGE OF LATVIA","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q211 wdt:P3001 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16935","question":"Which is a public key fingerprint of Linus Torvalds?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q34253 wdt:P3721 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16937","question":"What time point  has  population as 422861.0  for Murcia ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q12225 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '422861.0' ) ) . ?s pq:P585 ?value }","paraphrases":["Murcia had a population of 422,861 at what point in time?"],"info":{}}
{"id":"train_16938","question":"What are the diseases that arise from air pollution?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q131123 wdt:P2854 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16940","question":"What are the musical form which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q862597 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the melodic shape which begin with the letter v"],"info":{}}
{"id":"train_16941","question":"What is the antonym of arable farming, that creates livestock?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51075346 wdt:P461 ?answer . ?answer wdt:P1056 wd:Q103459 }","paraphrases":["What is the antonym of arable cultivating, that makes livestock?"],"info":{}}
{"id":"train_16942","question":"how many partners did isadora duncan have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q483512 wdt:P451 ?obj }","paraphrases":["Give me the total number of colleagues isadora duncan has."],"info":{}}
{"id":"train_16944","question":"What is the Mickey Mouse film poster?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11934 wdt:P3383 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16947","question":"film studio","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q920890 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'windows' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Studio of the film"],"info":{}}
{"id":"train_16950","question":"aspect ratio of vertigo","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q202548 wdt:P2061 ?answer }","paraphrases":[],"info":{}}
{"id":"train_16951","question":"Is the vibration of the Bosch 1700A equal to 11.6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23775562 wdt:P2806 ?obj filter ( ?obj = 11.6 ) }","paraphrases":["Is 11.6 equal to the vibration of the Bosch 1700A?"],"info":{}}
{"id":"train_16953","question":"what is award received of fritz haber that is prize money is 138198.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q57075 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter ( contains ( ?x , '138198.0' ) ) }","paraphrases":["With prize money of 138,198.0 Fritz Haber received what award?"],"info":{}}
{"id":"train_16954","question":"What phase does solid deodorant play in the matter?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q309035 wdt:P515 ?answer . ?answer wdt:P1535 wd:Q11438 }","paraphrases":["What stage does strong antiperspirant play within the matter?"],"info":{}}
{"id":"train_16955","question":"Who gave the {discipline} of {published in journal} of {Fast-ion-beam laser and laser-rf double-resonance measurements of hyperfine structure in 83Kr II.} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q31930410 wdt:P1433 ?X . ?X wdt:P101 ?answer }","paraphrases":["Who gave the {teach} of {distributed in diary} of {Fast-ion-beam laser and laser-rf double-resonance estimations of hyperfine structure in 83Kr II.} ?"],"info":{}}
{"id":"train_16960","question":"Which award did Hilary Swank receive in the year 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q93187 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["Tell me the award Hilary Swank received in 2015."],"info":{}}
{"id":"train_16961","question":"When is daylight savings time in Bremen?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q24879 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q36669 }","paraphrases":["What is Bremen's daylight savings time?"],"info":{}}
{"id":"train_16962","question":"What is the nae of the band, who started in London, and name begins with Y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q215380 . ?sbj wdt:P740 wd:Q84 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the nae of the band, who commenced in London, and title starts offevolved with Y"],"info":{}}
{"id":"train_16964","question":"Who are the shareholders of the subsidiary entities of SoftBank?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q201653 wdt:P355 ?X . ?X wdt:P127 ?answer }","paraphrases":["At Softbank, list the shareholds of the subsidiary entities."],"info":{}}
{"id":"train_16966","question":"What shows after The Simpsons?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P156 wd:Q886 }","paraphrases":[],"info":{}}
{"id":"train_16968","question":"What school did Irena Szewinska attend at the end of 1970?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q229424 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1970' ) ) }","paraphrases":["Towards the end of 1970, where was Irena Szewinska a student?"],"info":{}}
{"id":"train_16969","question":"Who shares a border with Pays de la Loire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P47 wd:Q16994 }","paraphrases":[],"info":{}}
