{"id":"train_14401","question":"Which is the film that has Robin Hood as character?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P674 wd:Q122634 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Which is the film that has Robin Hood as character?"],"info":{}}
{"id":"train_14403","question":"What is the stance of the originating source of life of the Dharmagupta?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3706371 wdt:P140 ?X . ?X wdt:P248 ?answer }","paraphrases":["Dharmagupta is the original source of life in what stance?"],"info":{}}
{"id":"train_14406","question":"What position did Lin Biao start on May 25, 1959.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q315475 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1959' ) ) }","paraphrases":["Which position did Lin Biao held on May 25,1959?."],"info":{}}
{"id":"train_14408","question":"Which is the sheet music for Symphony No. 9?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11989 wdt:P3030 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14409","question":"WHat medicine is used to treat pain ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2175 wd:Q81938 . ?sbj wdt:P31 wd:Q12140 }","paraphrases":["WHat pharmaceutical is utilized to treat torment ?"],"info":{}}
{"id":"train_14410","question":"Municipal President of Nezahualcoytol's country is bordered by what nation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q52634198 wdt:P1001 ?X . ?X wdt:P47 ?answer }","paraphrases":["Civil President of Nezahualcoytol's nation is bordered by what nation?"],"info":{}}
{"id":"train_14417","question":"What is the Ritchey–Chrétien telescope with the lowest observing time available whose has part is Four Laser Guide Star Facility?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q1062138 . ?ent wdt:P3891 ?obj . ?ent wdt:P527 wd:Q24820708 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["At the Four Laser Guide Star Facility, which Ritchey-Chretien telescope has the lowest observing time available?"],"info":{}}
{"id":"train_14418","question":"At what pressure is the boiling point of beryllium 4532?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q569 p:P2102 ?s . ?s ps:P2102 ?x filter ( contains ( ?x , '4532.0' ) ) . ?s pq:P2077 ?value }","paraphrases":["Beryllium 4532 has a boiling point at what pressure?"],"info":{}}
{"id":"train_14419","question":"Which is the {filming location} and the {narrative location} of {The_Social_Network} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q185888 wdt:P915 ?ans_1 . wd:Q185888 wdt:P840 ?ans_2 }","paraphrases":["What is the setting of The Social Network and where was it filmed?"],"info":{}}
{"id":"train_14423","question":"How was the number of households in Cumbria determined for the United Kingdom Census in 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23066 p:P1538 ?s . ?s ps:P1538 ?obj . ?s pq:P459 wd:Q855531 }","paraphrases":["What determined the number of households in Cumbria for the UK census in 2011?"],"info":{}}
{"id":"train_14426","question":"Is the flexural strength of the callitris glaucophylla less than 85.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7177505 wdt:P5677 ?obj filter ( ?obj < 85.2 ) }","paraphrases":["Is the flexural quality of the callitris glaucophylla less than 85.2?"],"info":{}}
{"id":"train_14428","question":"When was David Brown a member of the Warrington Wolves?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q3017134 p:P54 ?s . ?s ps:P54 wd:Q2549837 . ?s pq:P580 ?value }","paraphrases":["During what time period did David Brown play for the Washington Wolves?"],"info":{}}
{"id":"train_14429","question":"Was Whitney Huston's voice a spinto soprano type?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q34389 wdt:P412 wd:Q2327598 }","paraphrases":["Was Whitney Huston a spinto soprano?"],"info":{}}
{"id":"train_14430","question":"Is the apparent magnitude of the Sunflower Galaxy smaller than 10.32?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13981 wdt:P1215 ?obj filter ( ?obj < 10.32 ) }","paraphrases":["Is the Sunflower Galaxy's apparent magnitude less than 10.32?"],"info":{}}
{"id":"train_14431","question":"Was Brie Larson in Scott Pilgrim vs. the world?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q29328 wdt:P800 wd:Q753899 }","paraphrases":["Is it true that Brie Larson was in Scott Pilgrim vs The World?"],"info":{}}
{"id":"train_14433","question":"which is amsl of home town of skip bayless?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7535646 wdt:P551 ?X . ?X wdt:P2044 ?answer }","paraphrases":["which is amsl of domestic town of skip bayless?"],"info":{}}
{"id":"train_14434","question":"What rebellion contains the work zollunruhen in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q124734 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zollunruhen' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the rebellion whose name includes the term \"zollunruhen\"."],"info":{}}
{"id":"train_14438","question":"For which disease aspirin is being used?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2176 wd:Q18216 . ?sbj wdt:P31 wd:Q12136 }","paraphrases":["For which illness headache medicine is being used?"],"info":{}}
{"id":"train_14439","question":"How many jurisdictions are within Mercosur?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1001 wd:Q4264 }","paraphrases":["Give me the number of Jurisdictions within Mercosur"],"info":{}}
{"id":"train_14441","question":"Who plays badminton?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P641 wd:Q7291 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What is the badminton player called?"],"info":{}}
{"id":"train_14442","question":"How can you tell Laayoune has 26033 households?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q47837 p:P1538 ?s . ?s ps:P1538 ?x filter ( contains ( ?x , '26033.0' ) ) . ?s pq:P459 ?value }","paraphrases":["Give evidence that Laayoune possessed 26033 households"],"info":{}}
{"id":"train_14446","question":"What is crafted from the invention of carbon nanotube?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1778729 wdt:P186 ?X . ?X wdt:P575 ?answer }","paraphrases":["What is made from carbon nanotubes?"],"info":{}}
{"id":"train_14447","question":"who is film starring of un chien andalou that has his father is salvador dali i cusi","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190575 wdt:P161 ?answer . ?answer wdt:P22 wd:Q13034350 }","paraphrases":["who is film featuring of un chien andalou that has his father is salvador dali i who is film featuring of un chien andalou that has his father is salvador dali i cusi"],"info":{}}
{"id":"train_14448","question":"when did Jair Bolsonaro's term end at the","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q10304982 p:P102 ?s . ?s ps:P102 wd:Q5109506 . ?s pq:P582 ?value }","paraphrases":["At what time did Jair Bolsonaro end his term?"],"info":{}}
{"id":"train_14449","question":"How many astonomical filters are on the visible spectrum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1227 wd:Q76299 }","paraphrases":["What is the number of astonomical filters on the visible spectrum?"],"info":{}}
{"id":"train_14450","question":"What is the reason for John Williams' nominations for Jaws?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q189505 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P2453 wd:Q131285 }","paraphrases":["For what did John Williams receive a nomination for Jaws?"],"info":{}}
{"id":"train_14451","question":"What award did Itzhak Perlman recieve in 1980?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q215905 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["What award did Itzhak Perlman get in 1980?"],"info":{}}
{"id":"train_14452","question":"Is the national team caps of Haruka Toko less than 8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q20983145 wdt:P1129 ?obj filter ( ?obj < 8.0 ) }","paraphrases":["Is Haruka Toko's national team cap less than 8?"],"info":{}}
{"id":"train_14453","question":"Where did Jean Auguste Dominique Ingres begin being educated in 1791?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23380 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1791' ) ) }","paraphrases":["Jean Auguste Dominique Ingres began attending what school in 1791?"],"info":{}}
{"id":"train_14455","question":"Who is the  {nuclear weapon} for {designed by} of {Manhattan Project}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P287 wd:Q127050 . ?sbj wdt:P31 wd:Q12802 }","paraphrases":["Who is the { nuclear weapon } of the { Manhattan Project }"],"info":{}}
{"id":"train_14456","question":"What is Académie des beaux-arts member ID for Sebastião Salgado ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q358158 wdt:P5363 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14458","question":"Is the block size of idea NXT equal to 128?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1389431 wdt:P2599 ?obj filter ( ?obj = 128 ) }","paraphrases":["Is the NXT block size 128?"],"info":{}}
{"id":"train_14460","question":"Name a colonial Empire that starts with letter B","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1790360 . ?sbj wdt:P122 wd:Q41614 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a colonial Realm that begins with letter B"],"info":{}}
{"id":"train_14462","question":"What is the name of the business division of of Reuters that is publicly traded?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P199 wd:Q130879 . ?sbj wdt:P31 wd:Q891723 }","paraphrases":["WHICH IS THE NAME OF THE BUSINESS DIVISION OF REUTERS IS PUBLICLY TRADED"],"info":{}}
{"id":"train_14463","question":"Where is James Hetfield country of sport and his citizenship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q484302 wdt:P1532 ?ans_1 . wd:Q484302 wdt:P27 ?ans_2 }","paraphrases":["What is James Hetfield most known for, and which country is he from?"],"info":{}}
{"id":"train_14464","question":"TELL ME SEA MONSTER WHOSE NAME HAS THE WORD TANNIN IN IT.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q920028 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tannin' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME SEA MONSTER THE WORD TANNIN IN IT HAS THE NAME."],"info":{}}
{"id":"train_14465","question":"Who is the {fundamental state of matter} for {greater than} of {gas}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P5135 wd:Q11432 . ?sbj wdt:P31 wd:Q15831576 }","paraphrases":["Who is the { basic state of matter } { greater than } of { gas }"],"info":{}}
{"id":"train_14466","question":"Name a biblical character that starts with letter L","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12405827 . ?sbj wdt:P1441 wd:Q41064 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'l' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the biblical character whose name starts with the letter L"],"info":{}}
{"id":"train_14467","question":"When is Bielefeld referred to as Bet?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2112 p:P1813 ?s . ?s ps:P1813 ?x filter ( contains ( ?x , 'Bet' ) ) . ?s pq:P31 ?value }","paraphrases":["In what moment Bielefeld declared to as Wager?"],"info":{}}
{"id":"train_14473","question":"What's the standard body of Extensible Markup Language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2115 wdt:P1462 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14474","question":"When was the record held by Florence Griffith- Joyner as well as the score?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q31082 p:P1000 ?s . ?s ps:P1000 ?obj . ?s pq:P585 ?value1 . }","paraphrases":["When was the record held by Florence Griffith- Joyner as well as the score?"],"info":{}}
{"id":"train_14476","question":"What is the history of the science of language  and family?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q25295 wdt:P2579 ?X . ?X wdt:P2184 ?answer }","paraphrases":["What is the history of the science of dialect and family?"],"info":{}}
{"id":"train_14477","question":"What is Rotten Tomatoes ID of Double Indemnity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q478209 wdt:P1258 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14478","question":"Which French truss bridge is the longest?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q158218 . ?ent wdt:P2787 ?obj . ?ent wdt:P17 wd:Q142 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which French truss bridge is the longest?"],"info":{}}
{"id":"train_14479","question":"What afflictions are there as a result of consuming benzene?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2270 wdt:P1542 ?X . ?X wdt:P689 ?answer }","paraphrases":["What afflictions are there as a result of ingesting benzene?"],"info":{}}
{"id":"train_14480","question":"Tell me position whose name has the word yeonguijeong  in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4164871 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yeonguijeong' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal me position whose name has the word yeonguijeong in it."],"info":{}}
{"id":"train_14483","question":"Does polycarbonate have a heat capacity equal to 1000.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q62246 wdt:P2056 ?obj filter ( ?obj = 1000.0 ) }","paraphrases":["Does polycarbonate have a warmth limit equivalent to 1000.0?"],"info":{}}
{"id":"train_14484","question":"Which performers' union was founded by Irving Berlin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P112 wd:Q128746 . ?sbj wdt:P31 wd:Q17004679 }","paraphrases":["Which performers' union was established by Irving Berlin?"],"info":{}}
{"id":"train_14488","question":"What country of Surrey was established on December 6, 1922?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q23276 p:P17 ?s . ?s ps:P17 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1922' ) ) }","paraphrases":["On December 6, 1922 which country of Surrey was established?"],"info":{}}
{"id":"train_14489","question":"At what temperature does ethyl acetate reach a vapor pressure of 10.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q407153 p:P2119 ?s . ?s ps:P2119 ?x filter ( contains ( ?x , '10.0' ) ) . ?s pq:P2076 ?value }","paraphrases":["At what temperature does ethyl acetate reach 10.0 vapor pressure?"],"info":{}}
{"id":"train_14490","question":"Which is the cause of death of Douglas Jardine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3038014 wdt:P509 ?X . ?X wdt:P828 ?answer }","paraphrases":["Which is the cause of passing of Douglas Jardine?"],"info":{}}
{"id":"train_14493","question":"In what year was Franz Hasiba elected the second mayor deputy of Graz?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q13298 p:P6 ?s . ?s ps:P6 wd:Q1379391 . ?s pq:P580 ?value }","paraphrases":["Franz Hasiba was elected the 2nd mayor deputy of Graz in what year?"],"info":{}}
{"id":"train_14494","question":"What Indian reservation was the Kurdish–Turkish conflict in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q619749 wdt:P276 ?X . ?X wdt:P131 ?answer }","paraphrases":["What Indian reservation was the Kurdish–Turkish strife in?"],"info":{}}
{"id":"train_14495","question":"Which is the VKontakte ID for United Nations Educational, Scientific and Cultural Organization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7809 wdt:P3185 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14498","question":"What is followed by Stranger in a Strange Land awarded as Prometheus Award - Hall of Fame?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q929821 p:P166 ?s . ?s ps:P166 wd:Q19360203 . ?s pq:P156 ?value }","paraphrases":["which is Stranger in a Strange Land awarded as Prometheus Award - Hall of Fame?"],"info":{}}
{"id":"train_14499","question":"Where is the enclave within Nottingham?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q41262 wdt:P501 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14501","question":"Was Eazy-E a CEO?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q36804 wdt:P106 wd:Q484876 }","paraphrases":["Did Eazy-E have the title of CEO?"],"info":{}}
{"id":"train_14504","question":"Which assembly is endemic to Gujarati?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5137 wdt:P2341 ?X . ?X wdt:P194 ?answer }","paraphrases":["what  assembly is endemic to Gujarati?"],"info":{}}
{"id":"train_14505","question":"Who had developed the Colossal Cave Adventure, whose first name is William?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q379904 wdt:P178 ?answer . ?answer wdt:P735 wd:Q12344159 }","paraphrases":["Who developed the adventure of the Colossal Cave, whose first name is William?"],"info":{}}
{"id":"train_14506","question":"Is it true that Axl Rose's family name is Rose?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q11885 wdt:P734 wd:Q1724227 }","paraphrases":["Was Axl Rose's family name Rose?"],"info":{}}
{"id":"train_14508","question":"Mention the electoral area and duration reigned by Bob Hawke while serving as the Member of the Australian House of Representatives","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q269372 p:P39 ?s . ?s ps:P39 wd:Q18912794 . ?s pq:P2715 ?value1 . ?s pq:P768 ?value2 }","paraphrases":["Mention of Bob Hawke's electoral area and duration as Member of the Australian House of Representatives"],"info":{}}
{"id":"train_14509","question":"Since what time Bern has the head of government as Alexander Tschäppät?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q70 p:P6 ?s . ?s ps:P6 wd:Q74144 . ?s pq:P580 ?value }","paraphrases":["When did Alexander Tschappat begin his role as the head of government of Bern?"],"info":{}}
{"id":"train_14510","question":"Is the gross tonnage of the Tugboat Spence greater than 151.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q7851615 wdt:P1093 ?obj filter ( ?obj > 151.2 ) }","paraphrases":["Does Tugboat Spence have a gross tonnage higher than 151.2?"],"info":{}}
{"id":"train_14511","question":"Which is the CONA ID for White House?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q35525 wdt:P1669 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14512","question":"What is the ionization energy in silicon carbide with series ordinal of 1","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q412356 p:P2260 ?s . ?s ps:P2260 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '1' ) ) }","paraphrases":["What is the ionization vitality in silicon carbide with arrangement ordinal of 1"],"info":{}}
{"id":"train_14513","question":"When is {deathdate} of {children} of {Chandragupta II} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q844536 wdt:P40 ?X . ?X wdt:P570 ?answer }","paraphrases":["When is {deathdate} of {children} of {Chandragupta II} ?"],"info":{}}
{"id":"train_14514","question":"Is the declination of the Orion Nebula greater than -4.3117432?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13903 wdt:P6258 ?obj filter ( ?obj > -4.3117432 ) }","paraphrases":["Is -4.3117432 greater than the declination of the Orion Nebula?"],"info":{}}
{"id":"train_14515","question":"What term is used to describe a resident of Hong Kong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P5389 wd:Q8646 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What term is utilized to depict a inhabitant of Hong Kong?"],"info":{}}
{"id":"train_14517","question":"what is sausage sandwich contains the word dog in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7427595 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'dog' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is wiener sandwich contains the word canine in their name"],"info":{}}
{"id":"train_14518","question":"What are notable books developed by Unix","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11368 wdt:P178 ?X . ?X wdt:P800 ?answer }","paraphrases":["Name the notable books that Unix developed."],"info":{}}
{"id":"train_14521","question":"Who is the filmography performer of Hrithik Roshan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P175 wd:Q233619 . ?sbj wdt:P31 wd:Q1371849 }","paraphrases":[],"info":{}}
{"id":"train_14522","question":"What is the ID number of Michel Foucault from College de France","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q44272 wdt:P5443 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14523","question":"Which is the German municipality key for Krefeld?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2805 wdt:P439 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14524","question":"Who programmed Sonic the Hedgehog?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q37123 wdt:P943 ?answer }","paraphrases":[],"info":{}}
{"id":"train_14525","question":"where is the country and writing system of Punjabi_language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q58635 wdt:P17 ?ans_1 . wd:Q58635 wdt:P282 ?ans_2 }","paraphrases":["Who uses the Punjabi language?"],"info":{}}
{"id":"train_14527","question":"The planetary system of Kepler-1625b is part of what constellation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28857545 wdt:P397 ?X . ?X wdt:P59 ?answer }","paraphrases":["The planetary arrangement of Kepler-1625b is a piece of what group of stars?"],"info":{}}
{"id":"train_14528","question":"What are the business which start with the letter v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4830453 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the trade which begin with the letter v"],"info":{}}
{"id":"train_14529","question":"What time zone, Durrës, is located at standard time?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q83285 p:P421 ?s . ?s ps:P421 ?obj . ?s pq:P1264 wd:Q1777301 }","paraphrases":["Is Durrës located at standard time zone?"],"info":{}}
{"id":"train_14530","question":"Who was the head of Nuremberg's government in 1891?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2090 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1891' ) ) }","paraphrases":["In 1891, who was the government head of Nuremberg?"],"info":{}}
