{"id":"train_11366","question":"What river is a tributary for the Hertfordshire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q3410 wdt:P974 ?obj . ?obj wdt:P31 wd:Q4022 }","paraphrases":["What river is a tribute to Hertfordshire?"],"info":{}}
{"id":"train_11368","question":"Where is the location of birth of Antónia Ferreira subdivided into Galafura e Covelinhas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q591755 wdt:P19 ?answer . ?answer wdt:P150 wd:Q25438947 }","paraphrases":["In Galafura e Cevlinhas, where would you find the subdivisions of Antónia Ferreira's location of birth?"],"info":{}}
{"id":"train_11369","question":"Was Andy Kaufman a comedian and showman for an occupation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q299983 wdt:P106 wd:Q245068 . wd:Q299983 wdt:P106 wd:Q355242 }","paraphrases":["Did Andy Kaufman make a living as a comedian?"],"info":{}}
{"id":"train_11372","question":"What position did Philip Noel-Baker, Baron Noel-Baker, hold that ended in 1964?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q211856 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1964' ) ) }","paraphrases":["Philip Noel-Baker, Baron Noel-Baker's position as what ended in 1964?"],"info":{}}
{"id":"train_11374","question":"When did Alan García become the President of Peru?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q167211 p:P39 ?s . ?s ps:P39 wd:Q5708511 . ?s pq:P580 ?value }","paraphrases":["Alan Garcia became President of Peru in what year?"],"info":{}}
{"id":"train_11376","question":"Is the boiling point of eicosane equal to 344.1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q150925 wdt:P2102 ?obj filter ( ?obj = 344.1 ) }","paraphrases":["Does eicosane boil at 344.1?"],"info":{}}
{"id":"train_11377","question":"Name the barque with the most masts ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q216057 . ?ent wdt:P1099 ?obj . ?ent wdt:P31 wd:Q216057 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the name of the barque that has the most masts?"],"info":{}}
{"id":"train_11378","question":"Methanol | CH3OH or CH4O | CID 887 - structure, chemical names, physical and chemical ... The air odor threshold for methanol has been reported as 100 ppm. ...... Following intake of large amounts of methanol (50 mL), methanol was found in the .... Elimination of methanol from the blood appears to be slow in all species, ...","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q14982 wdt:P703 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'Manusia' ) ) }","paraphrases":["Methanol | CH3OH or CH4O | CID 887 - structure, chemical names, physical and chemical ... The air scent threshold for methanol has been mentioned as a hundred ppm. ...... Following consumption of giant quantities of methanol (50 mL), methanol used to be discovered in the .... Elimination of methanol from the blood appears to be slow in all species, ..."],"info":{}}
{"id":"train_11379","question":"When was Reinhard Hoppner the head of government for Saxony-Anhalt?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1206 p:P6 ?s . ?s ps:P6 wd:Q78414 . ?s pq:P582 ?value }","paraphrases":["During Which period Reinhard Hoppner was the head of Govt for Saxony-Anhalt?."],"info":{}}
{"id":"train_11380","question":"What is the birth and death date of Philip II of France?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q34428 p:P40 ?s . ?s ps:P40 wd:Q19007 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["When was Philip II of France born and when did he die?"],"info":{}}
{"id":"train_11382","question":"Which department is responsible for the city of Paris","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q90 wdt:P194 ?obj . ?obj wdt:P31 wd:Q19758733 }","paraphrases":["Which division is mindful for the city of Paris"],"info":{}}
{"id":"train_11385","question":"What publisher has population  as 122728  for Monza ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6252 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '122728' ) ) . ?s pq:P123 ?value }","paraphrases":["Who published Monza's population of 122728?"],"info":{}}
{"id":"train_11388","question":"What is the exhibition history of Pomona College?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P608 wd:Q7227384 }","paraphrases":[],"info":{}}
{"id":"train_11389","question":"What are the rock band which start with the letter yellowcard","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5741069 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yellowcard' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the rock band starting with the yellowcard letter?"],"info":{}}
{"id":"train_11390","question":"What music from Loretta Lynn received an award?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1346 wd:Q272931 . ?sbj wdt:P31 wd:Q1364556 }","paraphrases":["What music from Loretta Lynn gotten an grant?"],"info":{}}
{"id":"train_11394","question":"who champion of awarded of jan tinbergen ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q183181 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["who winner of granted of jan tinbergen ?"],"info":{}}
{"id":"train_11395","question":"Which is the monocation for the conjugation base of ammonia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4149 wd:Q4087 . ?sbj wdt:P31 wd:Q55523831 }","paraphrases":["Which is the monocation for the conjugation base of alkali?"],"info":{}}
{"id":"train_11398","question":"What are the series ordinal of Ernesto Samper as Secretary General of the Non-Aligned Movement?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q365427 p:P39 ?s . ?s ps:P39 wd:Q15647601 . ?s pq:P1545 ?value }","paraphrases":["As Secretary General of the Non-Aligned Movement, what are the series ordinal of Ernesto Samper?"],"info":{}}
{"id":"train_11399","question":"Mention the date of the birth and the name of father of Joseph Stalin who had child named Artem Sergeev","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q4416801 . ?s pq:P569 ?value1 . ?s pq:P22 ?value2 }","paraphrases":["Who was the father of Joseph Stalin with child Artem Sergeev, and when was he born?"],"info":{}}
{"id":"train_11402","question":"who aircraft family for item operated of Air India?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q69906 wdt:P121 ?obj . ?obj wdt:P31 wd:Q15056993 }","paraphrases":["Air India operated which aircraft unit?"],"info":{}}
{"id":"train_11403","question":"What is the main sequence star G - type for Jupiter's child astronomical body?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P398 wd:Q319 . ?sbj wdt:P31 wd:Q5864 }","paraphrases":["What is the most grouping star G - sort for Jupiter's child galactic body?"],"info":{}}
{"id":"train_11404","question":"na","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P4147 wd:Q130336 . ?sbj wdt:P31 wd:Q55523986 }","paraphrases":["n/a"],"info":{}}
{"id":"train_11407","question":"What are the civil code which start with the letter code","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1923776 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'code' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the common code which begin with the letter code"],"info":{}}
{"id":"train_11408","question":"Is it true that the total reserves of Denmark equal 75391898443?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q35 wdt:P2134 ?obj filter ( ?obj = 75391898443 ) }","paraphrases":["Is it genuine that the whole saves of Denmark rise to 75391898443?"],"info":{}}
{"id":"train_11409","question":"Name a song composed by Pete Townshend.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P86 wd:Q26933 . ?sbj wdt:P31 wd:Q7366 }","paraphrases":["Title a melody composed by Pete Townshend."],"info":{}}
{"id":"train_11410","question":"Claude Monet belonged to which art movement?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q296 wdt:P135 ?obj . ?obj wdt:P31 wd:Q968159 }","paraphrases":["Which art movement was Claude Monet a part of?"],"info":{}}
{"id":"train_11411","question":"What Ghost in the Shell character was voiced by actor Kōichi Yamadera?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1066948 p:P725 ?s . ?s ps:P725 wd:Q333194 . ?s pq:P453 ?value }","paraphrases":["Which character in Ghost in the Shell was voiced by actor Koichi Yamadera?"],"info":{}}
{"id":"train_11413","question":"Where did Yayoi Kusama stop working in 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q231121 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["Give the place Yayoi Kusama stopped working in 2015."],"info":{}}
{"id":"train_11414","question":"Who was Galileo Galilei's employer in 1592?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q307 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1592' ) ) }","paraphrases":["In 1592, who was Galileo Galilei's employer?"],"info":{}}
{"id":"train_11416","question":"What is the {aspect of history} that {follows} {apartheid}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P155 wd:Q11409 . ?sbj wdt:P31 wd:Q17524420 }","paraphrases":["What is the {viewpoint of history} that {takes after} {apartheid}?"],"info":{}}
{"id":"train_11417","question":"Which country participated in the October Revolution?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P770 wd:Q42976 . ?sbj wdt:P31 wd:Q1323642 }","paraphrases":["Which nation taken part within the October Insurgency?"],"info":{}}
{"id":"train_11420","question":"Tell me the end time for Federal Republic of Central America has capital as Sonsonate ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q190025 p:P36 ?s . ?s ps:P36 wd:Q1014248 . ?s pq:P582 ?value }","paraphrases":["When did the Capital of Sonsonate for the Federal Republic of Central America end?"],"info":{}}
{"id":"train_11421","question":"Which films did Mike Myers write?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P58 wd:Q185724 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Which movies did Mike Myers write?"],"info":{}}
{"id":"train_11422","question":"Which is the Elle.fr person ID of Miranda Kerr?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q127454 wdt:P3812 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11423","question":"Which is the PCP reference number of Kunsthaus Zürich?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q685038 wdt:P381 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11425","question":"In part of the series of The Bachelor, season 18, who is the director of the script?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15706907 wdt:P179 ?X . ?X wdt:P136 ?answer }","paraphrases":["In portion of the arrangement of The Single man, season 18, who is the executive of the script?"],"info":{}}
{"id":"train_11426","question":"Does Tarek Amouri has 63 national team caps?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q16020996 wdt:P1129 ?obj filter ( ?obj = 63 ) }","paraphrases":["Does Tarek Amouri has 63 national group caps?"],"info":{}}
{"id":"train_11428","question":"What is recorded at Revolver?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q185121 wdt:P483 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11429","question":"Who is the leader of party membership for Martin Dinha?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6775305 wdt:P102 ?X . ?X wdt:P488 ?answer }","paraphrases":["Who is the pioneer of party enrollment for Martin Dinha?"],"info":{}}
{"id":"train_11430","question":"What is the number out of school childern of based on South Island?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q120755 wdt:P131 ?X . ?X wdt:P2573 ?answer }","paraphrases":["What is the number out of school childern of based on South Island?"],"info":{}}
{"id":"train_11431","question":"What award did Maggie Smith win on 4/9/1979?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q172653 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1979' ) ) }","paraphrases":["On April 9, 1979, Maggie Smith won which award?"],"info":{}}
{"id":"train_11432","question":"What is Julian Assange's occupant's embassy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P466 wd:Q360 . ?sbj wdt:P31 wd:Q3917681 }","paraphrases":["What is the embassy of the occupant of Julian Assange?"],"info":{}}
{"id":"train_11435","question":"What is Internet Bird Collection species ID for common quail ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q28358 wdt:P3099 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11436","question":"What borders the Hamadan Province that has acreage totalling 29127.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q187373 wdt:P47 ?answer . ?answer wdt:P2046 ?x FILTER ( contains ( ?x , '29137.0' ) ) }","paraphrases":["What borders the Hamadan Province that has acreage totalling 29127.0?"],"info":{}}
{"id":"train_11437","question":"What are the three phases of water?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q283 p:P873 ?s . ?s ps:P873 wd:Q106410 . ?s pq:P2077 ?value1 . ?s pq:P515 ?value2 }","paraphrases":["What are the three stages of water?"],"info":{}}
{"id":"train_11439","question":"Is the distance from earth to the Messier 107 20,550?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q4755 wdt:P2583 ?obj filter ( ?obj = 20550 ) }","paraphrases":["Is 20,550 the distance from Earth to the Messier 107?"],"info":{}}
{"id":"train_11441","question":"Was Prague a twin administrative body of Hamburg and Miami-Dade County?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1085 wdt:P190 wd:Q1055 . wd:Q1085 wdt:P190 wd:Q468557 }","paraphrases":["Is it true that Prague was a twin administrative body of Hamburg and Miami-Dade County?"],"info":{}}
{"id":"train_11442","question":"What series of silicate minerals is named after Ernest H. Nickel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q178977 wdt:P179 ?answer . ?answer wdt:P138 wd:Q1356348 }","paraphrases":["What arrangement of silicate minerals is named after Ernest H. Nickel?"],"info":{}}
{"id":"train_11444","question":"Which company in Russia has the lowest total equity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q13641190 . ?ent wdt:P2137 ?obj . ?ent wdt:P17 wd:Q159 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which Russian based company has the lowest total equity?"],"info":{}}
{"id":"train_11445","question":"Tell me about occupation of Bettie Page and followed by?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q61898 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P156 ?value1 . }","paraphrases":["et me know around occupation of Bettie Page and taken after by?"],"info":{}}
{"id":"train_11447","question":"Which archaeological site was the former capitol of the Achaemenid Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q389688 wdt:P36 ?obj . ?obj wdt:P31 wd:Q839954 }","paraphrases":["Which archeological site was the Achaemenid Empire's former capital?"],"info":{}}
{"id":"train_11448","question":"In what year did Tim Hunt give a Croonian Lecture?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q309977 p:P166 ?s . ?s ps:P166 wd:Q1192912 . ?s pq:P585 ?value }","paraphrases":["Tim Hunt gave a Croonian Lecture on what date?"],"info":{}}
{"id":"train_11450","question":"What mechanical property of materials starts with the letter \"y\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5725005 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What mechanical property of materials begins with the letter \"y\"?"],"info":{}}
{"id":"train_11451","question":"Which 3D film was Sarah Silverman a voice actor for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P725 wd:Q229013 . ?sbj wdt:P31 wd:Q229390 }","paraphrases":[],"info":{}}
{"id":"train_11452","question":"In which famous spaceflight Neil Armstrong was involved ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1029 wd:Q1615 . ?sbj wdt:P31 wd:Q752783 }","paraphrases":["What was the name of the spaceflight Neil Armstrong was involved in?"],"info":{}}
{"id":"train_11453","question":"what is republic of catholicism of official religion  and also which starts with letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7270 . ?sbj wdt:P3075 wd:Q1841 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is republic of catholicism of official religion and additionally which begins with letter r"],"info":{}}
{"id":"train_11454","question":"Name a Roman province located in the Roman Empire.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q2277 . ?sbj wdt:P31 wd:Q182547 }","paraphrases":[],"info":{}}
{"id":"train_11455","question":"what is working on galactic astronomy, that has a dwarf galaxy Boötes II","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q58908 wdt:P2578 ?answer . ?answer wdt:P398 wd:Q2483957 }","paraphrases":["What works on galactic astronomy, the dwarf Boötes II galaxy?"],"info":{}}
{"id":"train_11457","question":"When was Pedro I's child Princess Maria Amélia of Brazil born and when did she die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q939 p:P40 ?s . ?s ps:P40 wd:Q235815 . ?s pq:P569 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["When was once Pedro I's baby Princess Maria Amélia of Brazil born and when did she die?"],"info":{}}
{"id":"train_11458","question":"When did Newfoundland and Labrador have a population of 519716 people?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2003 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '519716.0' ) ) . ?s pq:P585 ?value }","paraphrases":["What year did Labrador and Newfoundland have 519716 citizens?"],"info":{}}
{"id":"train_11459","question":"WHICH IS CAPABLE OF INHIBITING OR PREVENING PATHOLOGICAL PROCESS OF PRESCRIBED DRUG OF INFLAMMATION","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q101991 wdt:P2176 ?X . ?X wdt:P2175 ?answer }","paraphrases":["WHICH IS Able OF Repressing OR PREVENING Neurotic Prepare OF Endorsed Sedate OF INFLAMMATION"],"info":{}}
{"id":"train_11460","question":"When was The Band inducted into the Canadian Music Hall of Fame?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q600344 p:P166 ?s . ?s ps:P166 wd:Q3362499 . ?s pq:P585 ?value }","paraphrases":["What year was the \"The Band\" inducted into the Canadian Music Hall of Fame?"],"info":{}}
{"id":"train_11462","question":"what is the symbol which measures angstrom?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q81454 wdt:P111 ?X . ?X wdt:P416 ?answer }","paraphrases":["What is the angstrom measuring symbol?"],"info":{}}
{"id":"train_11463","question":"What was Davor Šuker's team in 1996?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q189217 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1996' ) ) }","paraphrases":["Which was the team of Davor Šuker in 1996?"],"info":{}}
{"id":"train_11464","question":"who constitutional republic for ethnic group of Indigenous peoples of the United States?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P172 wd:Q49297 . ?sbj wdt:P31 wd:Q1520223 }","paraphrases":["Who is the constitutional republic of the U.S. indigenous ethnic group?"],"info":{}}
{"id":"train_11467","question":"What is a cause of botulism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18553251 wdt:P828 ?X . ?X wdt:P171 ?answer }","paraphrases":["What is a botulism cause?"],"info":{}}
{"id":"train_11468","question":"Which is Louisiana Sports Hall of Fame ID for Terry Bradshaw?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q633263 wdt:P4367 ?answer }","paraphrases":[],"info":{}}
{"id":"train_11469","question":"What is from Dungeons & Dragons' fictional universe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1080 wd:Q1375 }","paraphrases":[],"info":{}}
{"id":"train_11470","question":"Tell me a {character encoding} whinch includes the word {yuscii} in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q184759 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yuscii' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know a {character encoding} whinch incorporates the word {yuscii} in its name"],"info":{}}
{"id":"train_11473","question":"What is long  lives in  John Keats ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q82083 wdt:P551 ?X . ?X wdt:P2043 ?answer }","paraphrases":["What is long lives in John Keats ?"],"info":{}}
{"id":"train_11475","question":"What are the form factor which start with the letter u","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q24574728 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the frame calculate which begin with the letter u"],"info":{}}
{"id":"train_11476","question":"What writer, born in Hamburg, wrote Curious George?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5194776 wdt:P50 ?answer . ?answer wdt:P19 wd:Q1055 }","paraphrases":["What author, born in Hamburg, composed Inquisitive George?"],"info":{}}
{"id":"train_11477","question":"What year was The Funnies created, and who published it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1645141 wdt:P123 ?X . ?X wdt:P571 ?answer }","paraphrases":["What year was The Funnies made, and who distributed it?"],"info":{}}
{"id":"train_11479","question":"Name the door commissioned by Frederick William II of Prussia that contains the word \" brandenburg\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q36794 . ?sbj wdt:P88 wd:Q152229 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'brandenburg' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the entryway appointed by Frederick William II of Prussia that contains the word \" brandenburg\" in its name"],"info":{}}
{"id":"train_11480","question":"What award did Cherry Jones achieve in the 49th Tony Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q239046 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P805 wd:Q4638847 }","paraphrases":["Which award did Cherry Jones win in the 49th Tony Awards?"],"info":{}}
{"id":"train_11481","question":"Alexander McQueen is the employer of what fashion label?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q207939 wdt:P108 ?obj . ?obj wdt:P31 wd:Q1618899 }","paraphrases":[],"info":{}}
{"id":"train_11482","question":"Which is the Art Renewal Center ID for Lawrence Alma-Tadema?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q240526 wdt:P3791 ?answer }","paraphrases":[],"info":{}}
