{"id":"train_6100","question":"TELL ME CREDIT INSTITUTION WHOSE NAME HAS THE WORD WACHOVIA IN TI","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q730038 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wachovia' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME CREDIT INSTITUTION IN THE WORD WACHOVIA"],"info":{}}
{"id":"train_6102","question":"What are thebig city which start with the letter i","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1549591 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ł' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the big city that begins with the letter I"],"info":{}}
{"id":"train_6104","question":"What is the address of the Chrysler Building in New York City?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q11274 p:P276 ?s . ?s ps:P276 wd:Q60 . ?s pq:P969 ?value }","paraphrases":["Where is the Chrysler building located in New York City"],"info":{}}
{"id":"train_6105","question":"Is it true that the Fibonacci Sequence is named after Fibonacci?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q47577 wdt:P138 wd:Q8763 }","paraphrases":["Did Fibonacci Sequence get named after Fibonacci?"],"info":{}}
{"id":"train_6106","question":"Who is {habitat} of {taxon parent} of {Lagopus persicus} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q41002157 wdt:P171 ?X . ?X wdt:P2974 ?answer }","paraphrases":["Who is the { taxon parent } { Lagopus persicus }'s { habitat }?"],"info":{}}
{"id":"train_6107","question":"tell  me Original Public Ivy that chairperson Carol Folt starts with  letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20971972 . ?sbj wdt:P488 wd:Q11246486 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["tell me Original Public Ivy that chairperson Carol Folt begins with letter c"],"info":{}}
{"id":"train_6108","question":"What was the previous favorite player of constructivism","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207103 wdt:P737 ?X . ?X wdt:P155 ?answer }","paraphrases":["What was the past favorite player of constructivism"],"info":{}}
{"id":"train_6110","question":"When did Rostack become a part of the German Democratic Republic?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q2861 p:P17 ?s . ?s ps:P17 wd:Q16957 . ?s pq:P580 ?value }","paraphrases":["In which year, did Rostack became a part of the German Democratic Republic?."],"info":{}}
{"id":"train_6112","question":"What was Joe Pesci nominated for at the point in time 1980-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q20178 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["For which award was Joe Pesci nominated in 1980?"],"info":{}}
{"id":"train_6113","question":"Which straight six cylinder diesel electric engine has the largest bore?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5378251 . ?ent wdt:P2556 ?obj . ?ent wdt:P1002 wd:Q1148385 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Give me the name of the straight six cylinder diesel electric engine that has the largest bore?"],"info":{}}
{"id":"train_6114","question":"What city is home to Singapore Airlines and has a medan household income of 32360.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q32245 wdt:P159 ?answer . ?answer wdt:P3529 ?x FILTER ( contains ( ?x , '32360.0' ) ) }","paraphrases":["Which city is Singapore Airlines ' home and has 32360.0 median household income?"],"info":{}}
{"id":"train_6115","question":"What type of electrification is direct current?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P930 wd:Q159241 }","paraphrases":[],"info":{}}
{"id":"train_6116","question":"What New Line Cinema film trilogy had the largest box office?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q13593818 . ?ent wdt:P2142 ?obj . ?ent wdt:P272 wd:Q79202 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Of all New Line Cinema film trilogies, which had the largest box office?"],"info":{}}
{"id":"train_6117","question":"What are the revolution which start with the letter r","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10931 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'r' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the revolution that begins with the letter r"],"info":{}}
{"id":"train_6118","question":"When Boa Vista started as head of government at Teresa Surita?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q181056 p:P6 ?s . ?s ps:P6 wd:Q9086139 . ?s pq:P580 ?value }","paraphrases":["Boa Vista, the former head of government at Teresa Surita, started when?"],"info":{}}
{"id":"train_6119","question":"How many people practice tennis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q847 wdt:P3095 ?obj }","paraphrases":["How many tennis practitioners are there?"],"info":{}}
{"id":"train_6120","question":"What county seat does Josef Neumayer hold in the Austrian national government","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q40 wdt:P36 ?answer . ?answer wdt:P6 wd:Q1705370 }","paraphrases":["What province situate does Josef Neumayer hold within the Austrian national government"],"info":{}}
{"id":"train_6122","question":"What is the unemployment rate at the Misiones Province Indian reservation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44798 wdt:P131 ?X . ?X wdt:P1198 ?answer }","paraphrases":["What is the unemployment rate at the Misiones Territory Indian reservation?"],"info":{}}
{"id":"train_6123","question":"What is the end of time for Han Dynasty has a capital as Chang'an?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7209 p:P36 ?s . ?s ps:P36 wd:Q6501000 . ?s pq:P582 ?value }","paraphrases":["In the Han Dynasty end of time, which had the capital Chang'an?"],"info":{}}
{"id":"train_6124","question":"What is the most important medicine used in treating inflammation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2175 wd:Q101991 . ?sbj wdt:P31 wd:Q35456 }","paraphrases":["What is the foremost vital pharmaceutical utilized in treating inflammation?"],"info":{}}
{"id":"train_6128","question":"Who does Kristin Davis portray on the HBO series, 'Sex and the City'?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q35791 p:P161 ?s . ?s ps:P161 wd:Q229176 . ?s pq:P453 ?value }","paraphrases":["On the HBO series 'Sex and the City' what's the name of Kristen Davis' character?"],"info":{}}
{"id":"train_6132","question":"How many Tony awards did they receive?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P166 wd:Q191874 }","paraphrases":["They got how many Tony Awards?"],"info":{}}
{"id":"train_6135","question":"B. B. King died from a stroke in his brain.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q188969 wdt:P509 ?answer . ?answer wdt:P927 wd:Q492038 }","paraphrases":["B. B. Ruler kicked the bucket from a stroke in his brain."],"info":{}}
{"id":"train_6137","question":"Who is the daughter in the musical The Beat That My Heart Skipped","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q931671 wdt:P86 ?X . ?X wdt:P40 ?answer }","paraphrases":["Who is the girl within the melodic The Beat That My Heart Skipped"],"info":{}}
{"id":"train_6138","question":"What are the Avion which start with the letter washington","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q13393265 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'washington' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Avion which begin with the letter washington"],"info":{}}
{"id":"train_6140","question":"Can you tell distributor of BP?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P750 wd:Q152057 }","paraphrases":[],"info":{}}
{"id":"train_6141","question":"Which sister city of Burlington has a county seat held by Yaroslavl Oblast?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q31058 wdt:P190 ?answer . ?answer wdt:P1376 wd:Q2448 }","paraphrases":["Which sister city of Burlington contains a district situate held by Yarosla Oblast?"],"info":{}}
{"id":"train_6143","question":"When did award received of Art Tatum and winner?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q109053 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1346 ?value1 . }","paraphrases":["When did grant gotten of Craftsmanship Tatum and winner?"],"info":{}}
{"id":"train_6144","question":"WHICH IS THE ROCK BAND THAT STARTS WITH Y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5741069 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE ROCK BAND THAT BEGINS WITH Y"],"info":{}}
{"id":"train_6145","question":"What is the taxon parent of archosaur, whose vernacular name is クルロタルシ類?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q130910 wdt:P171 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'クルロタルシ類' ) ) }","paraphrases":["What is the taxon mother or father of archosaur, whose vernacular title is クルロタルシ類?"],"info":{}}
{"id":"train_6146","question":"When will Paul-Henri Spaak no longer be the secretary general of the North Atlantic Treaty Organization?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7184 p:P3975 ?s . ?s ps:P3975 wd:Q155691 . ?s pq:P582 ?value }","paraphrases":["What date will the secretary general of the North Atlantic Treaty Organization no longer be Paul-Henri Spaak?"],"info":{}}
{"id":"train_6148","question":"What military rank did Mikhail Kalashnikov achieve in 1999-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q167573 p:P410 ?s . ?s ps:P410 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1999' ) ) }","paraphrases":["On January 1, 1999, what was Mikhail Kalashnikov's military rank?"],"info":{}}
{"id":"train_6149","question":"Who are the sons and daughters of Athena?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37122 wdt:P22 ?X . ?X wdt:P40 ?answer }","paraphrases":["Give me the names of Athena's children?"],"info":{}}
{"id":"train_6150","question":"Is Diplo a participant with Skrillex and Sanjoy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q533781 wdt:P710 wd:Q19004 . wd:Q533781 wdt:P710 wd:Q16910067 }","paraphrases":["Does Diplo participate with Skrillex and Sanjoy?"],"info":{}}
{"id":"train_6152","question":"What low electronegativity gas did Andre-Marie Ampere discover?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11432 . ?ent wdt:P1108 ?obj . ?ent wdt:P61 wd:Q675 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What electronegativity gas did Andre-Marie Ampere discover?"],"info":{}}
{"id":"train_6153","question":"Tell me the jurisdiction and location of Matthias Corvinus which was an event as coronation.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q188634 p:P793 ?s . ?s ps:P793 wd:Q209715 . ?s pq:P1001 ?value1 . ?s pq:P276 ?value2 }","paraphrases":["What was the jurisdiction and location of Matthias Corvinus which was an event as coronation?"],"info":{}}
{"id":"train_6154","question":"Who is employing Lockheed Martin ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P108 wd:Q7240 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is utilizing Lockheed Martin ?"],"info":{}}
{"id":"train_6155","question":"which chemical compound has the highest kinematic viscosity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q11173 . ?ent wdt:P2118 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["which chemical compound has the easiest kinematic viscosity?"],"info":{}}
{"id":"train_6158","question":"Mention the opposite quantum element of elementary particle.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q43116 wdt:P461 ?obj . ?obj wdt:P31 wd:Q22675015 }","paraphrases":["Specify the inverse quantum component of rudimentary particle."],"info":{}}
{"id":"train_6161","question":"Which second language did Paul van Dyk study?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q77034 wdt:P1412 ?X . ?X wdt:P4132 ?answer }","paraphrases":["What was Paul van Dyk's second language?"],"info":{}}
{"id":"train_6163","question":"Name a dead language that contains the word \"norn\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q45762 . ?sbj wdt:P2989 wd:Q146233 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'norn' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a dead dialect that contains the word \"norn\" in its name"],"info":{}}
{"id":"train_6165","question":"What is the Glucan with the highest minimum explosive concentration whose has part is hydrogen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q416796 . ?ent wdt:P2204 ?obj . ?ent wdt:P527 wd:Q556 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What is the Glucan with the most noteworthy least hazardous concentration whose has portion is hydrogen?"],"info":{}}
{"id":"train_6167","question":"What is the catalog  of traditional Chinese characters for writing system","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P282 wd:Q178528 . ?sbj wdt:P31 wd:Q2352616 }","paraphrases":[],"info":{}}
{"id":"train_6169","question":"What actor from The Truman Show was educated at the Peabody Institute?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q214801 wdt:P161 ?answer . ?answer wdt:P69 wd:Q1156934 }","paraphrases":["What actor from The Truman Show used to be skilled at the Peabody Institute?"],"info":{}}
{"id":"train_6170","question":"what killed john lennon?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1203 p:P1196 ?s . ?s ps:P1196 ?obj . ?s pq:P805 wd:Q2341090 }","paraphrases":["who was john lennon's killer?"],"info":{}}
{"id":"train_6171","question":"What advisor was musical score Piano Sonata No.3 by?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q145937 wdt:P86 ?X . ?X wdt:P1066 ?answer }","paraphrases":["What advisor was melodic score Piano Sonata No.3 by?"],"info":{}}
{"id":"train_6172","question":"What preceded London Calling in the same literary genre of folk punk?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q644416 wdt:P155 ?answer . ?answer wdt:P136 wd:Q1425661 }","paraphrases":["What preceded London Calling in the same literary genre of people punk?"],"info":{}}
{"id":"train_6173","question":"For what was Kevin Kline in nomination for in the year 1991","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q105817 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1991' ) ) }","paraphrases":["Kevin Kline was nominated for what in 1991?"],"info":{}}
{"id":"train_6174","question":"What is the award received by Ellen DeGeneres in 2012-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q483325 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2012' ) ) }","paraphrases":["What award did Ellen DeGeneres receive in 2012-1-1?"],"info":{}}
{"id":"train_6175","question":"What is the cultural state of Rome","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q220 wdt:P2596 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What is Rome's cultural state?"],"info":{}}
{"id":"train_6178","question":"What are the fields created by Chef Boyardee ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17079048 wdt:P1056 ?X . ?X wdt:P101 ?answer }","paraphrases":["What fields are created by Chef Boyardee?"],"info":{}}
{"id":"train_6179","question":"Mention the year span and the reason of service elimination of John Hume  during serving as Member of the 1st Northern Ireland Assembly","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q193630 p:P39 ?s . ?s ps:P39 wd:Q37303731 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["Mention of the year and the reason for the removal of John Hume while serving as a member of the 1st Assembly of Northern Ireland"],"info":{}}
{"id":"train_6180","question":"What disputed territory starts with the letter \"t\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15239622 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH DISPUTED TERRITORY STARTS WITH THE LETTER T"],"info":{}}
{"id":"train_6181","question":"Tell me the academic college library with the largest collection.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q856234 . ?ent wdt:P1436 ?obj . ?ent wdt:P31 wd:Q1622062 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which academic college library currently houses the largest collection?"],"info":{}}
{"id":"train_6184","question":"Is the clearance of the Little Belt Bridge greater than 35.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1424674 wdt:P2793 ?obj filter ( ?obj > 35.2 ) }","paraphrases":["Is the clearance of the Small Belt Bridge more noteworthy than 35.2?"],"info":{}}
{"id":"train_6185","question":"What comes before and is developed by MultiMediaCard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q646104 wdt:P156 ?X . ?X wdt:P178 ?answer }","paraphrases":["What comes some time recently and is created by MultiMediaCard?"],"info":{}}
{"id":"train_6186","question":"Which is the epithet which is said to be the same as Apollo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P460 wd:Q37340 . ?sbj wdt:P31 wd:Q207869 }","paraphrases":[],"info":{}}
{"id":"train_6187","question":"Which year did Jack Ma graduate college?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1137062 wdt:P69 ?X . ?X wdt:P571 ?answer }","paraphrases":["Specify the year in which Jack Ma graduated from college."],"info":{}}
{"id":"train_6189","question":"When did Umberto I of Italy replace Victor Emmanuel II of Savoy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q153688 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P1365 wd:Q168691 }","paraphrases":["When did Umberto succeed Victor?"],"info":{}}
{"id":"train_6190","question":"When does the new season of Saturday Night Live start?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P179 wd:Q13979 . ?sbj wdt:P31 wd:Q3464665 }","paraphrases":["When is the premiere for the upcoming season of Saturday Night Live?"],"info":{}}
{"id":"train_6191","question":"Who are the participants in the Battle of Greece, which is a member of the Organisation for the Prohibition of Chemical Weapons?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2888837 wdt:P710 ?answer . ?answer wdt:P463 wd:Q842490 }","paraphrases":["Who are the members within the Battle of Greece, which could be a part of the Association for the Disallowance of Chemical Weapons?"],"info":{}}
{"id":"train_6194","question":"What Papal State was founded in 756?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q170174 p:P31 ?s . ?s ps:P31 ?obj . ?s pq:P580 ?x filter ( contains ( ?x , '756-0-0' ) ) }","paraphrases":["What Papal State began in 756?"],"info":{}}
{"id":"train_6196","question":"What time zone is the same as Macau?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q17272482 . ?ent wdt:P2907 ?obj . ?ent wdt:P460 wd:Q996734 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the time zone that matches Macau."],"info":{}}
{"id":"train_6197","question":"Is the total services of the United States of America equal to 3.47533162784e+11?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q30 wdt:P2134 ?obj filter ( ?obj = 3.47533162784e+11 ) }","paraphrases":["Is the overall administrations of the Joined together States of America break even with to 3.47533162784e+11?"],"info":{}}
{"id":"train_6198","question":"who zenith of borders of east java?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3586 wdt:P47 ?X . ?X wdt:P610 ?answer }","paraphrases":["Who is the zenith of east java boundaries?"],"info":{}}
{"id":"train_6199","question":"What is the part of the constellation HD 76700 that has a moon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1563424 wdt:P398 ?X . ?X wdt:P59 ?answer }","paraphrases":["In the constellation HD 76700, which part has a moon?"],"info":{}}
{"id":"train_6200","question":"Where is the birth place of Frank Capra?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51492 wdt:P19 ?X . ?X wdt:P421 ?answer }","paraphrases":["Where is the birth put of Straight to the point Capra?"],"info":{}}
{"id":"train_6201","question":"What is the automobile manufacturer that owns Aston Martin that starts with letter C ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q786820 . ?sbj wdt:P199 wd:Q27074 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the vehicle producer that claims Aston Martin that begins with letter C ?"],"info":{}}
{"id":"train_6204","question":"How many commanders does Erich von Manstein have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q57135 wdt:P598 ?obj }","paraphrases":["Which is the number of the commanders that Erich von Manstein have?"],"info":{}}
{"id":"train_6206","question":"TELL ME THE SEAT OF LEIDEN UNIVERSITY MEMBER?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q156598 wdt:P463 ?X . ?X wdt:P159 ?answer }","paraphrases":["Let Me know THE Situate OF LEIDEN College Part?"],"info":{}}
{"id":"train_6207","question":"Name the empire that was replaced by the Principality of Serbia that starts with letter E","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q48349 . ?sbj wdt:P1366 wd:Q684030 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the empire that was changed by means of the Principality of Serbia that begins with letter E"],"info":{}}
{"id":"train_6209","question":"What WWII weapon had the greatest range?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q15142894 . ?ent wdt:P4036 ?obj . ?ent wdt:P607 wd:Q362 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What WWII weapon had the most noteworthy run?"],"info":{}}
{"id":"train_6210","question":"Which is the government of the executive body of Beijing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q956 wdt:P208 ?obj . ?obj wdt:P31 wd:Q7188 }","paraphrases":["Which is the Beijing executive body's government"],"info":{}}
{"id":"train_6211","question":"What was the street number of Rue d'Antin where the exhibition of Les Demoiselles d'Avignon took place?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q910199 p:P608 ?s . ?s ps:P608 wd:Q3450475 . ?s pq:P670 ?value }","paraphrases":["What was the street number of the Rue d'Antin where the exhibition of Les Demoiselles d'Avignon happened?"],"info":{}}
{"id":"train_6214","question":"What is the tributary of Mindanao's body of water?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q124873 wdt:P206 ?X . ?X wdt:P974 ?answer }","paraphrases":["Which is the river running into Mindanao's sea?"],"info":{}}
