{"id":"train_17562","question":"What fruit starts with the letter \"w\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1364 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What fruit does the letter \"w\" start with?"],"info":{}}
{"id":"train_17563","question":"At what age can males and females in Saint Lucia marry?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q760 p:P3000 ?s . ?s ps:P3000 ?obj . ?s pq:P518 wd:Q27177113 }","paraphrases":["Women and men in Saint Lucia can marry at what age?"],"info":{}}
{"id":"train_17565","question":"Which means {Scoville grade} in a {bell pepper} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1548030 wdt:P2658 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17567","question":"What is the customer service management tool used by Verizon?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P156 wd:Q467752 . ?sbj wdt:P31 wd:Q6881511 }","paraphrases":["Verizon uses which customer service management tool?"],"info":{}}
{"id":"train_17568","question":"What is the electoral district for French National Assembly member Nicolas Sarkozy.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q329 p:P39 ?s . ?s ps:P39 wd:Q3044918 . ?s pq:P768 ?value }","paraphrases":["Which electoral district is French National Assembly member Nicolas Sarkozy a part of?"],"info":{}}
{"id":"train_17572","question":"What is the birthplace of Harald III?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q203647 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q14944091 }","paraphrases":["Could you mention the birthplace of Harald III?"],"info":{}}
{"id":"train_17573","question":"WHICH IS THE LICENCE OF PLATFORMS OF FIFA","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q326704 wdt:P400 ?X . ?X wdt:P275 ?answer }","paraphrases":["Say the platform license of FIFA"],"info":{}}
{"id":"train_17574","question":"Which female holds the record in pole vaulting?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q185027 wdt:P1000 ?answer . ?answer wdt:P21 wd:Q6581072 }","paraphrases":["Which woman holds the report in pole vaulting?"],"info":{}}
{"id":"train_17578","question":"What are the types of the official language of Turkic Khaganate ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15146034 wdt:P37 ?X . ?X wdt:P4132 ?answer }","paraphrases":["What are the sorts of the official dialect of Turkic Khaganate ?"],"info":{}}
{"id":"train_17579","question":"What is the alphabet of the language of expression by Nicholas Biddle?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2580098 wdt:P1412 ?X . ?X wdt:P282 ?answer }","paraphrases":["What is the letter set of the dialect of expression by Nicholas Biddle?"],"info":{}}
{"id":"train_17580","question":"Tell me form of cricket whose name has the word kilikit in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5470256 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'kilikiti' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which cricket form includes the term \"kilikit\" in its name?"],"info":{}}
{"id":"train_17582","question":"What gravitational-wave detector contains the word \"virgo\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2302080 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'virgo' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What gravitational-wave locator contains the word \"virgo\" in its title?"],"info":{}}
{"id":"train_17586","question":"When did Garfield Sobers become a member of the West Indies cricket team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q981485 p:P54 ?s . ?s ps:P54 wd:Q912881 . ?s pq:P580 ?value }","paraphrases":["In what Year did Garfield Sobers join the team of the West Indies cricjets?"],"info":{}}
{"id":"train_17588","question":"When did member of sports team of  Bobby Moore and number of points/goals/set scored?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q191492 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1351 ?value1 . }","paraphrases":["When did part of sports group of Bobby Moore and number of points/goals/set scored?"],"info":{}}
{"id":"train_17589","question":"Is it true that the water footprint of the beef is greater than 13380.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q192628 wdt:P6000 ?obj filter ( ?obj > 13380.8 ) }","paraphrases":["Is the water footprint of beef more than 13380.8?"],"info":{}}
{"id":"train_17591","question":"Figure out the shape composition of the objects made out of textile","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q28823 wdt:P186 ?X . ?X wdt:P1419 ?answer }","paraphrases":["Identify the shape composition of textile objects"],"info":{}}
{"id":"train_17592","question":"Which heterocyclic compound of drug used for treatment of mental disorder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q12135 wdt:P2176 ?obj . ?obj wdt:P31 wd:Q193430 }","paraphrases":[],"info":{}}
{"id":"train_17593","question":"Which chlorine-containing flammable liquid is the least soluble ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5457310 . ?ent wdt:P2177 ?obj . ?ent wdt:P527 wd:Q688 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Give the name of the chlorine-containing flammable liquid that is the least soluble."],"info":{}}
{"id":"train_17594","question":"Which is the Roman praenomen for Ovid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7198 wdt:P2358 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17596","question":"Is it true that the number of speakers of Esperanto equals to 2000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q143 wdt:P1098 ?obj filter ( ?obj = 2000 ) }","paraphrases":["Are there actually 2000 total Esperanto speakers?"],"info":{}}
{"id":"train_17597","question":"Which triple point drug has the highest heat capacity ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12140 . ?ent wdt:P2056 ?obj . ?ent wdt:P873 wd:Q106410 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which three - point medicine has the highest heat capacity?"],"info":{}}
{"id":"train_17600","question":"What is Guy Fieri's academic major from studying at the University of Navada, Las Vegas and what is his academic degree?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q12057690 p:P69 ?s . ?s ps:P69 wd:Q2302311 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["What is Guy Fieri's academic main from reading at the University of Navada, Las Vegas and what is his tutorial degree?"],"info":{}}
{"id":"train_17604","question":"What part of work studies the effects of acute total body resistance exercise on hormonal and cytokines changes in men and women?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q53550791 wdt:P1433 ?X . ?X wdt:P101 ?answer }","paraphrases":["In men and women, what type of work studies the effects of acute total body resistance exercise on hormonal and cytokine changes?"],"info":{}}
{"id":"train_17605","question":"when did george armitage miller received te award of international prize by fyssen foundation?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q670658 p:P166 ?s . ?s ps:P166 wd:Q6052573 . ?s pq:P585 ?value }","paraphrases":["In what year did George Armitage Millar receive the award of International Prize by fyssen foundation?"],"info":{}}
{"id":"train_17606","question":"Name a space observatory that starts with letter J","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q148578 . ?sbj wdt:P3712 wd:Q180046 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'j' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a space observatory that begins with letter J"],"info":{}}
{"id":"train_17607","question":"tell me version, edition, or translation that edition or translation of Bible starts with s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3331189 . ?sbj wdt:P629 wd:Q1845 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["inform me version, edition, or translation that edition or translation of Bible begins with s"],"info":{}}
{"id":"train_17610","question":"Which is the programming paradigm of Swift?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q17118377 wdt:P3966 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17611","question":"Which is the dead language that was replaced by Dutch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q7411 wdt:P1365 ?obj . ?obj wdt:P31 wd:Q45762 }","paraphrases":["Which is the dead dialect that was supplanted by Dutch?"],"info":{}}
{"id":"train_17614","question":"What is Mikhail Bakunin's Grave memorial ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q27645 wdt:P535 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17616","question":"when did Chris Evert change there name from Christine?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q14286 p:P735 ?s . ?s ps:P735 wd:Q2087646 . ?s pq:P1545 ?value }","paraphrases":["waht did Chris Evert change there name from Christine?"],"info":{}}
{"id":"train_17617","question":"Which dynasty for family of Joseon","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q28179 wdt:P53 ?obj . ?obj wdt:P31 wd:Q164950 }","paraphrases":["Which line for family of Joseon"],"info":{}}
{"id":"train_17618","question":"What is a pair of enantiomers that contains the word trimethylpentane contained in its name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55662747 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trimethylpentane' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What could be a combine of enantiomers that contains the word trimethylpentane contained in its name."],"info":{}}
{"id":"train_17621","question":"\"Who is {artist} of {Amazing Grace}, whose {Christian name} is {Whitney} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q210211 wdt:P175 ?answer . ?answer wdt:P735 wd:Q13583399 }","paraphrases":["\"Who is {craftsman} of {Astounding Elegance}, whose {Christian title} is {Whitney} ?\""],"info":{}}
{"id":"train_17623","question":"What monotypic taxon contains the word \"trogloraptoridae\" in its name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q310890 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'trogloraptoridae' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What monotypical taxon contains in its name the word \"trogloraptoridae\""],"info":{}}
{"id":"train_17625","question":"Who is the role model of Anthony Giddens and Baron Giddens?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q220008 wdt:P737 ?X . ?X wdt:P101 ?answer }","paraphrases":["Anthony Giddens and Barron Giddens look at who as a role model?"],"info":{}}
{"id":"train_17626","question":"What is the name of the tourist destination in the twinned administrative body of Lahore?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11739 wdt:P190 ?obj . ?obj wdt:P31 wd:Q1200957 }","paraphrases":["What is the title of the traveler goal within the twinned authoritative body of Lahore?"],"info":{}}
{"id":"train_17630","question":"Which canal has the largest discharge?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q12284 . ?ent wdt:P2225 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["State the canal with the largest discharge."],"info":{}}
{"id":"train_17632","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1995 wd:Q183257 . ?sbj wdt:P31 wd:Q30897648 }","paraphrases":["N / A N / A"],"info":{}}
{"id":"train_17633","question":"What is the standard edition of the IP4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P747 wd:Q11103 . ?sbj wdt:P31 wd:Q290378 }","paraphrases":["What is the standard version of the IP4?"],"info":{}}
{"id":"train_17636","question":"Are the total assists in Tim Ramholt's career less than 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q683824 wdt:P6545 ?obj filter ( ?obj < 0.0 ) }","paraphrases":["Is 0 the total amount of assists in Tim Ramholt's career?"],"info":{}}
{"id":"train_17638","question":"Which country has Lockheed Martin's headquarters located in Bethesda?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7240 p:P159 ?s . ?s ps:P159 wd:Q584451 . ?s pq:P17 ?value }","paraphrases":["In which country is Lockheed Martin's Bethesda headquarters?"],"info":{}}
{"id":"train_17640","question":"How many causes of destruction are like the September 11 attacks?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P770 wd:Q10806 }","paraphrases":["In regards to the September 11th attacks, how many causes of destruction are similar?"],"info":{}}
{"id":"train_17641","question":"Who gave the {stockholders} of {builder} of {EMD GP39-2} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5323435 wdt:P176 ?X . ?X wdt:P127 ?answer }","paraphrases":["Where was once Christian liturgy founded?"],"info":{}}
{"id":"train_17642","question":"Who is the head of party membership of Lynn Boylan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16945605 wdt:P102 ?X . ?X wdt:P488 ?answer }","paraphrases":["Who is the head of party participation of Lynn Boylan?"],"info":{}}
{"id":"train_17643","question":"What is the name of the composer of the music used in Blade Runner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q184843 wdt:P86 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["What is the name of Blade Runner's music composer?"],"info":{}}
{"id":"train_17645","question":"Where is the place of formation of Clannad that has the associated people from Gweedore?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q192609 wdt:P740 ?answer . ?answer wdt:P1792 wd:Q32342083 }","paraphrases":["Where is the place of formation of Clannad that has the related people from Gweedore?"],"info":{}}
{"id":"train_17646","question":"What is the temporal range start and the parent taxon of Animal ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q729 wdt:P523 ?ans_1 . wd:Q729 wdt:P171 ?ans_2 }","paraphrases":["What is the parent taxon and the temporal range start of Animal?"],"info":{}}
{"id":"train_17650","question":"What are the ideology which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7257 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the ideology that begins with the letter w"],"info":{}}
{"id":"train_17651","question":"Which is the association football club of the head coach of Zinedine Zidane?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P286 wd:Q1835 . ?sbj wdt:P31 wd:Q476028 }","paraphrases":["Which is the affiliation football club of the head coach of Zinedine Zidane?"],"info":{}}
{"id":"train_17652","question":"Is the residence time of water of Lake Michigan greater than 79.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1169 wdt:P3020 ?obj filter ( ?obj > 79.2 ) }","paraphrases":["Is the home time of water of Lake Michigan more prominent than 79.2?"],"info":{}}
{"id":"train_17654","question":"Which is the territory of Australia that has New Year's Day as public holiday and whose name contains the word territory?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q14192199 . ?sbj wdt:P832 wd:Q196627 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'territory' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the territory of Australia that has New Year's Day as public vacation and whose identify includes the word territory?"],"info":{}}
{"id":"train_17656","question":"What is the message of Gaia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q767805 wdt:P1170 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17657","question":"Which is the political catch phrase that applies to the jurisdiction of the United States of America and that contains the word destiny in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3377406 . ?sbj wdt:P1001 wd:Q30 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'destiny' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is republic of catholicism of authentic religion and moreover which starts offevolved with letter r"],"info":{}}
{"id":"train_17659","question":"Which is the WorldCat Registy ID for Library of Congress?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q131454 wdt:P5505 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17660","question":"Which religious culture worships the deity Krishna?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q42891 p:P179 ?s . ?s ps:P179 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["Which devout culture adores the god Krishna?"],"info":{}}
{"id":"train_17664","question":"What college uses the Russia language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2936 wd:Q7737 . ?sbj wdt:P31 wd:Q189004 }","paraphrases":[],"info":{}}
{"id":"train_17665","question":"What position did Ramsay MacDonald hold on June 5, 1929?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q166646 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1929' ) ) }","paraphrases":["Which was the position that Ramsay MacDonald held in 1929?"],"info":{}}
{"id":"train_17668","question":"Was Paul Erdos a doctoral student?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q173746 wdt:P185 ?obj }","paraphrases":["Did Paul Erdos go to doctoral school?"],"info":{}}
{"id":"train_17669","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11582 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '-34.1923' ) ) }","paraphrases":["what it is?"],"info":{}}
{"id":"train_17671","question":"What is posthumous name of the Jiajing Emperor ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q10011 wdt:P1786 ?answer }","paraphrases":[],"info":{}}
{"id":"train_17672","question":"Does the Odyssey have the characters Mentor and a Greek primordial deity?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q35160 wdt:P674 wd:Q878099 . wd:Q35160 wdt:P674 wd:Q214003 }","paraphrases":["Are the characters of Mentor and a Greek primordial deity present in the Odyssey?"],"info":{}}
{"id":"train_17675","question":"Which is the ethnic group of the religion of Druze?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q163943 wdt:P140 ?obj . ?obj wdt:P31 wd:Q41710 }","paraphrases":[],"info":{}}
{"id":"train_17676","question":"Name the poem which comprises of Rama as the character","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P674 wd:Q160213 . ?sbj wdt:P31 wd:Q37484 }","paraphrases":["Title the sonnet which comprises of Rama as the character"],"info":{}}
{"id":"train_17677","question":"which television station that manager/director bob lger and which contains the word american in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1616075 . ?sbj wdt:P1037 wd:Q532423 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'american' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which tv station that manager/director bounce lger and which contains the word american in their name"],"info":{}}
{"id":"train_17678","question":"What is the special municipality association of Germany with headquarters location at Aachen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P159 wd:Q1017 . ?sbj wdt:P31 wd:Q1780389 }","paraphrases":["Which German special municipality association is headquartered in Aachen?"],"info":{}}
{"id":"train_17680","question":"When is {point in time} {prize money} of {{Rabindranath Tagore} has {received award} as {Nobel Prize in Literature}}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q7241 p:P166 ?s . ?s ps:P166 wd:Q37922 . ?s pq:P585 ?value1 . ?s pq:P2121 ?value2 }","paraphrases":["When is { point in time } of { Rabindranath Tagore } as { Nobel Prize in Literature } } { premium money }?"],"info":{}}
{"id":"train_17682","question":"What award did Wilhelm Ostwald receive in 1909?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12658 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1909' ) ) }","paraphrases":["In 1909, Wilhelm Ostwald won which award?"],"info":{}}
{"id":"train_17683","question":"Who is the contestant of part of the series by Edward Mordrake?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20020303 wdt:P179 ?X . ?X wdt:P161 ?answer }","paraphrases":["Who is the hopeful of portion of the arrangement by Edward Mordrake?"],"info":{}}
{"id":"train_17687","question":"Who gave the {type of taxon} of {taxon parent} of {Chlorophyta} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q264543 wdt:P171 ?X . ?X wdt:P105 ?answer }","paraphrases":["Who gave the {sort of taxon} of {taxon parent} of {Chlorophyta} ?"],"info":{}}
{"id":"train_17689","question":"Who is patron saint of Holy Spirit?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P417 wd:Q37302 }","paraphrases":[],"info":{}}
{"id":"train_17690","question":"Who is the child of the father of Hamengkubuwono V?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2581159 wdt:P22 ?X . ?X wdt:P3373 ?answer }","paraphrases":["Who is the child of the father of Hamengkubuwono V?"],"info":{}}
{"id":"train_17691","question":"Was Hugh Laurie given name James and Calum?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q49017 wdt:P735 wd:Q677191 . wd:Q49017 wdt:P735 wd:Q5024022 }","paraphrases":["Was Hugh Laurie the birth name of James and Calum?"],"info":{}}
{"id":"train_17694","question":"What is the population of Qena Governorate which has determination method as census?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q31065 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P459 wd:Q39825 }","paraphrases":["As determined by the census, how many people lived in the Qena Governorate?"],"info":{}}
{"id":"train_17695","question":"Which is the public office that George Weah held a position in?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q173139 wdt:P39 ?obj . ?obj wdt:P31 wd:Q294414 }","paraphrases":["Which is the open office that George Weah held a position in?"],"info":{}}
{"id":"train_17696","question":"What is the sex or gender and the religion of Eddie_Izzard ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q254022 wdt:P21 ?ans_1 . wd:Q254022 wdt:P140 ?ans_2 }","paraphrases":["Eddie_Izzard was apart of what Sex, gender, and religion?"],"info":{}}
{"id":"train_17697","question":"Is a symptom of camphor overdose diarrhea?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q181559 wdt:P1542 ?answer . ?answer wdt:P780 wd:Q40878 }","paraphrases":["Could be a indication of camphor overdose diarrhea?"],"info":{}}
{"id":"train_17698","question":"What is culture of Etruschi in Etruscan deity/","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2596 wd:Q17161 . ?sbj wdt:P31 wd:Q42593818 }","paraphrases":[],"info":{}}
