{"id":"train_3764","question":"What is the religion based on the sacred text Nihon Shoki that contains the word \" shinto\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1068640 . ?sbj wdt:P457 wd:Q813935 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'shinto' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is religion based on Nihon Shoki's sacred text, which contains the word \"shinto\" in its name?"],"info":{}}
{"id":"train_3765","question":"What are the ancient city which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15661340 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the ancient city which begin with the letter z"],"info":{}}
{"id":"train_3767","question":"What is the moon of the star of Tarantula Nebula?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q224145 wdt:P397 ?X . ?X wdt:P398 ?answer }","paraphrases":["What moon orbits the stars of the Tarantula Nebula?"],"info":{}}
{"id":"train_3769","question":"what is sister or brohter of caligula that has public office is quaestor ?''","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1409 wdt:P3373 ?answer . ?answer wdt:P39 wd:Q189430 }","paraphrases":["what is sister or brohter of caligula that has open office is quaestor ?''"],"info":{}}
{"id":"train_3772","question":"When did Kurmanbek Bakiyev end as head of state for Kyrgyzstan?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q813 p:P35 ?s . ?s ps:P35 wd:Q484816 . ?s pq:P582 ?value }","paraphrases":["End date of Kurmanbek Bakiyev  as head of state for Kyrgyzstan?"],"info":{}}
{"id":"train_3775","question":"Which language is the stable version of Android?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q94 wdt:P277 ?X . ?X wdt:P348 ?answer }","paraphrases":["Which dialect is the steady adaptation of Android?"],"info":{}}
{"id":"train_3776","question":"Which is the ISO 639-5 code of Aramaic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q28602 wdt:P1798 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3777","question":"Which country has the highest quality of life according to the international center for settlement of investment disputes.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q7270 . ?ent wdt:P1081 ?obj . ?ent wdt:P463 wd:Q899770 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["According to the international center for settlement of investment, which country has the highest quality of life?"],"info":{}}
{"id":"train_3778","question":"What award did David Foster win in 2003?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q77112 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2003' ) ) }","paraphrases":["David Foster captured which award in 2003?"],"info":{}}
{"id":"train_3779","question":"Mention the film based on the description of Batman","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P144 wd:Q2695156 . ?sbj wdt:P31 wd:Q11424 }","paraphrases":["Give a short summary of the film \"Batman\""],"info":{}}
{"id":"train_3781","question":"Tell me the inflation rate of CPI for magnesium?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q660 wdt:P189 ?X . ?X wdt:P1279 ?answer }","paraphrases":["What is the inflation rate of CPI of magnesium?"],"info":{}}
{"id":"train_3783","question":"What arch bridge is named after Paul von Hindenburg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P138 wd:Q2667 . ?sbj wdt:P31 wd:Q158438 }","paraphrases":["What curve bridge is named after Paul von Hindenburg?"],"info":{}}
{"id":"train_3785","question":"Nale a low-cost airline that operates Boeing 737-800 and that contains the word \"Ryanair\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q190915 . ?sbj wdt:P121 wd:Q12476717 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ryanair' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Nale a inexpensive airline that operates Boeing 737-800 and that carries the phrase \"Ryanair\" in its name"],"info":{}}
{"id":"train_3786","question":"What is Hepatitis C's health specialty and medical examinations\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q154869 wdt:P1995 ?ans_1 . wd:Q154869 wdt:P923 ?ans_2 }","paraphrases":["What are the health specialty and medical examinations for Hepatitis C?"],"info":{}}
{"id":"train_3787","question":"Which is the main subject for history of religions?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P921 wd:Q846742 }","paraphrases":[],"info":{}}
{"id":"train_3788","question":"Which award did Leon Festinger receive in 1959?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q315916 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1959' ) ) }","paraphrases":["In 1959, what award did Leon Festinger receive?"],"info":{}}
{"id":"train_3790","question":"What was the cause of Lady Godiva's death on September 10, 1067?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q106077 p:P570 ?s . ?s ps:P570 ?x filter ( contains ( YEAR ( ?x ) , '1067' ) ) . ?s pq:P1480 ?value }","paraphrases":["How did Lady Godiva die in September 10, 1067?"],"info":{}}
{"id":"train_3791","question":"How many teams are participating for {Chicago Bulls} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1923 wd:Q128109 }","paraphrases":["Which teams are playing for Bulls?"],"info":{}}
{"id":"train_3797","question":"Which is the currency that has a location of final assembly the Royal Mint and contains the word pound in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q8142 . ?sbj wdt:P1071 wd:Q951830 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'pound' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the currency that has a area of closing meeting the Royal Mint and carries the phrase pound in it is name?"],"info":{}}
{"id":"train_3800","question":"What award did Anna Politkovskaya receive in 2003-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131240 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2003' ) ) }","paraphrases":["which type of award receive Anna Politkovskaya in 2003-0-0?"],"info":{}}
{"id":"train_3802","question":"How many official religions are there for the {Protestantism} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3075 wd:Q23540 }","paraphrases":["What is the number of official religions for Protestantism?"],"info":{}}
{"id":"train_3805","question":"What award did Henry Dunant receive that granted him $75,391 in prize money?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12091 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P2121 ?x filter ( contains ( ?x , '75391.0' ) ) }","paraphrases":["henry dunant won $75,391 in prize money for what award?"],"info":{}}
{"id":"train_3807","question":"Who gave the {has grammatical person} of {language} of {Franz Kline} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q374492 wdt:P1412 ?X . ?X wdt:P5110 ?answer }","paraphrases":["Who gave the {has linguistic individual} of {dialect} of {Franz Kline} ?"],"info":{}}
{"id":"train_3810","question":"What is the child body of Milky that has a light travel distance of 33600?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q321 wdt:P398 ?answer . ?answer wdt:P2583 ?x FILTER ( contains ( ?x , '33600.0' ) ) }","paraphrases":["What is the baby physique of Milky that has a mild travel distance of 33600?"],"info":{}}
{"id":"train_3811","question":"What is playing that Ieva Januskeviciute was a part of?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15676906 wdt:P1344 ?X . ?X wdt:P641 ?answer }","paraphrases":["What is playing that Ieva Januskeviciute was a portion of? ?"],"info":{}}
{"id":"train_3813","question":"WHAT IS THE STRAIN WITH THE MAXIMUM VIABLE TEMPERATURE","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q855769 . ?ent wdt:P3252 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which strain has the highest viable temperature?"],"info":{}}
{"id":"train_3814","question":"Who gave the{mayor} of {mediatised to} of {Government of the 1st Dáil} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5589360 wdt:P1366 ?X . ?X wdt:P6 ?answer }","paraphrases":["Who gave the{mayor} of {mediatised to} of {Government of the 1st Dáil} ?"],"info":{}}
{"id":"train_3815","question":"DC-3 is operated by which airline?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P121 wd:Q190211 . ?sbj wdt:P31 wd:Q46970 }","paraphrases":["DC-3 is worked by which airline?"],"info":{}}
{"id":"train_3816","question":"What was the partner town of Toulon that was first recorded in 766-0-0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q44160 wdt:P190 ?answer . ?answer wdt:P1249 ?x FILTER ( contains ( ?x , '766-0-0' ) ) }","paraphrases":["What was the accomplice town of Toulon that was to begin with recorded in 766-0-0?"],"info":{}}
{"id":"train_3817","question":"In 1967, what city was the twinned administrative body of Skopje?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q384 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1967' ) ) }","paraphrases":["Which city was twinned administrative body of Skopje in 1967?"],"info":{}}
{"id":"train_3819","question":"What desalination plant material has the greatest yield strength?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q214609 . ?ent wdt:P5529 ?obj . ?ent wdt:P366 wd:Q51932686 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What material usend in desalination plants had the biggest yield strength?"],"info":{}}
{"id":"train_3820","question":"What is the outcome of  the antonym  of plasma recombination?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4392902 wdt:P461 ?X . ?X wdt:P1542 ?answer }","paraphrases":["What is the result of the antonym of plasma recombination?"],"info":{}}
{"id":"train_3823","question":"Which is the protein that is the encoding of INS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q21163221 wdt:P688 ?obj . ?obj wdt:P31 wd:Q8054 }","paraphrases":[],"info":{}}
{"id":"train_3824","question":"What is (different) of (moorland)and has the (geographic coordinate) of (55.9439)?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1092661 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '55.9439' ) ) }","paraphrases":["What is (diverse) of (moorland)and has the (geographic facilitate) of (55.9439)?"],"info":{}}
{"id":"train_3826","question":"What is the architectural style of Gothic art?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P149 wd:Q46825 }","paraphrases":["Gothic art has what architectural style?"],"info":{}}
{"id":"train_3827","question":"Tell me sports league whose name has the word shield in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q623109 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'shield' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know sports alliance whose title has the word shield in it."],"info":{}}
{"id":"train_3831","question":"Is the upper flammable limit of the toulene less than 8.52?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q15779 wdt:P2203 ?obj filter ( ?obj < 8.52 ) }","paraphrases":["Is toulene's upper flammable limit under 8.52?"],"info":{}}
{"id":"train_3833","question":"On what album can you find the song Stairway to Heaven ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P658 wd:Q192023 . ?sbj wdt:P31 wd:Q208569 }","paraphrases":["What album is the song Stairway to Heaven on?"],"info":{}}
{"id":"train_3834","question":"What is the longest book review published in The Archaeological Journal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q637866 . ?ent wdt:P1104 ?obj . ?ent wdt:P1433 wd:Q7714165 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Please name The Archaeological Journal's longest published book review."],"info":{}}
{"id":"train_3835","question":"What is the dimension of works by Jean Racine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q742 wdt:P800 ?X . ?X wdt:P2043 ?answer }","paraphrases":["Mention the dimension of works by Jean Racine?"],"info":{}}
{"id":"train_3837","question":"When did character from Star Wars for killed by of Luke Skywalker?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q51746 wdt:P157 ?obj . ?obj wdt:P31 wd:Q33125444 }","paraphrases":[],"info":{}}
{"id":"train_3839","question":"Of what is Richard Hofstadter a member, who is specialist in American studies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q982698 wdt:P463 ?answer . ?answer wdt:P101 wd:Q470125 }","paraphrases":["What is a member of Richard Hofstadter, who is an American Studies Specialist?"],"info":{}}
{"id":"train_3840","question":"What is The Merchant of Venice's genre and characters?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q206400 wdt:P136 ?ans_1 . wd:Q206400 wdt:P674 ?ans_2 }","paraphrases":["Who was in The Merchant of Venice and what type of book was it?"],"info":{}}
{"id":"train_3842","question":"Where Carl Theodor Dreyer born at Denmark died?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q51127 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q35 }","paraphrases":["Where did Carl Theodor Dreyer, who was born in Denmark, die?"],"info":{}}
{"id":"train_3843","question":"What university is located in Karachi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q8660 . ?sbj wdt:P31 wd:Q3918 }","paraphrases":["What universities are in Karachi, Pakistan?"],"info":{}}
{"id":"train_3849","question":"What was the amount of female population of Sana'a in 2004-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q2471 p:P1539 ?s . ?s ps:P1539 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["What is the female population of Sana'a in 2004?"],"info":{}}
{"id":"train_3850","question":"Which is the bite force quotient for sun bear?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q144923 wdt:P3485 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3851","question":"Which Chinese Dynasty had it's capital at Nanjing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q16666 wdt:P1376 ?obj . ?obj wdt:P31 wd:Q12857432 }","paraphrases":["Which Chinese Line had it's capital at Nanjing?"],"info":{}}
{"id":"train_3853","question":"Who are the students of Pablo Picasso?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q5593 wdt:P1066 ?ans_1 . wd:Q5593 wdt:P802 ?ans_2 }","paraphrases":["Who are Pablo Picasso's students?"],"info":{}}
{"id":"train_3855","question":"What is it?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9289 wdt:P138 ?answer . ?answer wdt:P30 wd:Q15 }","paraphrases":["What it is?"],"info":{}}
{"id":"train_3856","question":"Which is the distribution map for Yue Chinese?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q7033959 wdt:P1846 ?answer }","paraphrases":[],"info":{}}
{"id":"train_3858","question":"When was lutetium discovered?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1857 wdt:P61 ?X . ?X wdt:P119 ?answer }","paraphrases":["Lutetium was discovered when?"],"info":{}}
{"id":"train_3859","question":"What is the title of the anthem of Somaliland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q34754 p:P85 ?s . ?s ps:P85 ?obj . ?s pq:P51 ?x filter ( contains ( ?x , 'Heesta Qaranka Somaliland.ogg' ) ) }","paraphrases":["What is Somaliland's National Anthem?"],"info":{}}
{"id":"train_3860","question":"What was the population of Le Mans at the beginning of 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1476 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["Enlist the population size figure of Le Mans in year 2015."],"info":{}}
{"id":"train_3868","question":"What are the afflicts caused by 2,4,6-trinitrotoluene?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q170167 wdt:P1542 ?X . ?X wdt:P689 ?answer }","paraphrases":["2,4,6-trinitrotoluene has what effects?"],"info":{}}
{"id":"train_3869","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1177 wdt:P17 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["n/a"],"info":{}}
{"id":"train_3871","question":"For Karlheinz Stockhausen was spoused was in the end time in the year 1972?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q154556 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1972' ) ) }","paraphrases":["Who was Karlheinz Stockhausen married to until 1972?"],"info":{}}
{"id":"train_3872","question":"WHAT ARE THE SHIPWRECKING WHOSE NAME HAS THE WORD ALESUNDSOLYCKORNA IN IT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q906512 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ålesundsolyckorna' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE SHIPWRECKING WHOSE Title HAS THE WORD ALESUNDSOLYCKORNA IN IT"],"info":{}}
{"id":"train_3873","question":"Which is the FFH-Habitat which contains the word vegetation in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q60029820 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vegetation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the FFH-Habitat which consists of the phrase vegetation in it's name?"],"info":{}}
{"id":"train_3875","question":"Explain the historical process of a polymerase chain reaction.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1269 wd:Q176996 . ?sbj wdt:P31 wd:Q17524420 }","paraphrases":["Clarify the chronicled prepare of a polymerase chain reaction."],"info":{}}
{"id":"train_3876","question":"What non-fiction career author wrote The Right Stuff?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3301814 wdt:P50 ?answer . ?answer wdt:P106 wd:Q15980158 }","paraphrases":["What non-fiction career creator composed The Proper Stuff?"],"info":{}}
{"id":"train_3877","question":"Which is the position that applies to the jurisdiction of Coptic Orthodox Church of Alexandria?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1001 wd:Q198998 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["Which is the position that applies to the purview of Coptic Orthodox Church of Alexandria?"],"info":{}}
{"id":"train_3878","question":"Which is the international organization of the secretary general Vladimir Norov and contains the word cooperation in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q484652 . ?sbj wdt:P3975 wd:Q365665 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'cooperation' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which is the worldwide association of the secretary general Vladimir Norov and contains the word collaboration in it's name?"],"info":{}}
{"id":"train_3879","question":"Tell me the population of Makati on 2010-5-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1508 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2010' ) ) }","paraphrases":["What's the population of Makati on 5/1/2010?"],"info":{}}
{"id":"train_3880","question":"To whom did Ingmar Bergman got married and when did it ended?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q43247 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["To whom did Ingmar Bergman got hitched and when did it finished?"],"info":{}}
{"id":"train_3883","question":"Is it true that the VAT-rate of the Australia equals to 8.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q408 wdt:P2855 ?obj filter ( ?obj = 8.0 ) }","paraphrases":["What is the VAT-rate of Australia?"],"info":{}}
{"id":"train_3887","question":"Who is the current holder of the award once won by Andre Geim?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q104104 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Who currently holds the award once won by Andre Geim?"],"info":{}}
{"id":"train_3890","question":"WHAT ARE THE WORD THAT 10 WHICH CONTAINS INTEGER","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12503 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , '10' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHAT ARE THE WORD THAT 10 WHICH CONTAINS INTEGER"],"info":{}}
{"id":"train_3894","question":"In which country is Beijing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P150 wd:Q956 . ?sbj wdt:P31 wd:Q6256 }","paraphrases":["In which nation is Beijing?"],"info":{}}
{"id":"train_3895","question":"When did Alexander III of Russia receive the award for Knight Grand Cross of the Military Order of William?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q120180 p:P166 ?s . ?s ps:P166 wd:Q2424158 . ?s pq:P585 ?value }","paraphrases":["On what date did Alexander III of Russia receive the Knight Grand Cross of the Military Order of William award?"],"info":{}}
{"id":"train_3897","question":"What award was Terry Pratchett nominated for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q46248 wdt:P1411 ?obj . ?obj wdt:P31 wd:Q618779 }","paraphrases":["For which award was Terry Pratchett nominated?"],"info":{}}
{"id":"train_3898","question":"Is the unemployment rate of Lesotho equal to 26?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1013 wdt:P1198 ?obj filter ( ?obj = 26 ) }","paraphrases":["Is Lesotho's unemployment rate 26?"],"info":{}}
{"id":"train_3899","question":"how many records are held for pole vaulting?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1000 wd:Q185027 }","paraphrases":["Tell me how many records are held for pole vaulting."],"info":{}}
{"id":"train_3900","question":"is it true that the thermal conductivity of tin II oxide is equal to 38.24?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q204980 wdt:P2068 ?obj filter ( ?obj = 38.24 ) }","paraphrases":["Is the thermal conductivity of tin II oxide equal to 38.24?"],"info":{}}
{"id":"train_3901","question":"Where is Sindh geographically located","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q37211 wdt:P2633 ?obj . ?obj wdt:P31 wd:Q46865913 }","paraphrases":["Where is Sindh on a map?"],"info":{}}
{"id":"train_3903","question":"\"What product is developed by Advanced Audio Coding, that has a World Geodetic System of 84 by 49.5472?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q337594 wdt:P178 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '49.5472' ) ) }","paraphrases":["Which product that has a World Geodetic System of 84 by 49.5472 is developed by Advanced Audio Coding?"],"info":{}}
{"id":"train_3904","question":"Which key is Violin Concerto No. 1 Bruch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q163689 wdt:P826 ?X . ?X wdt:P155 ?answer }","paraphrases":["In what key is Violin Concert No. 1 Bruch?"],"info":{}}
{"id":"train_3905","question":"Is the vertical depth of Midenata peshtera equal to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q60040067 wdt:P4511 ?obj filter ( ?obj = 0 ) }","paraphrases":["Is 0 the vertical depth of Midenata peshtera?"],"info":{}}
