{"id":"train_5981","question":"What was the award received by The Great Dictator that is point in time was 1940-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q109116 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1940' ) ) }","paraphrases":["What 1940 award did The Great Dictator receive?"],"info":{}}
{"id":"train_5982","question":"How many presentations did Dick Clark give?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P371 wd:Q366563 }","paraphrases":["What is the number of Presentations Dick Clark Gave?"],"info":{}}
{"id":"train_5983","question":"which method starts with w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1799072 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name the method that begins with W."],"info":{}}
{"id":"train_5986","question":"What is at the grave of the son of Sancha of Castile, Queen of Navarre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q939696 wdt:P25 ?X . ?X wdt:P119 ?answer }","paraphrases":["WHICH IS THE GRAVE OF THE SONE OF SANCHA OF CASTILE QUEEN OF NAVARRA"],"info":{}}
{"id":"train_5989","question":"What is  home place  of  New York Yankees  that is  end time  is 1922 - 0 - 0 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q213417 p:P115 ?s . ?s ps:P115 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1922' ) ) }","paraphrases":["Where was the New York Yankees home in 1922?"],"info":{}}
{"id":"train_5991","question":"When did Lublin cease to be a Kingdom of Poland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q37333 p:P17 ?s . ?s ps:P17 wd:Q696908 . ?s pq:P582 ?value }","paraphrases":["In what year did Lublin stop being a Polish kingdom?"],"info":{}}
{"id":"train_5992","question":"When did Peyton Manning play for the Tennessee Volunteers Football","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q7539 p:P54 ?s . ?s ps:P54 wd:Q12070759 . ?s pq:P580 ?value }","paraphrases":["When did Peyton Manning play with the Tennessee Volunteer Football?"],"info":{}}
{"id":"train_5993","question":"Is the service life of the Gran Turismo 5 Prologue equal to 10?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2324928 wdt:P5069 ?obj filter ( ?obj = 10 ) }","paraphrases":["Is the benefit life of the Gran Turismo 5 Introduction rise to to 10?"],"info":{}}
{"id":"train_5994","question":"Who is the {human} for {founded by} of {Safavid dynasty}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q161205 wdt:P112 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Which individual established the Safavid dynasty?"],"info":{}}
{"id":"train_5995","question":"What award did The Smashing Pumpkins receive in 1996?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q184217 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1996' ) ) }","paraphrases":["In 1996, The Smashing Pumpkins received what award?"],"info":{}}
{"id":"train_5997","question":"what is the point in time for vigo has population as 294997.0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q8745 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '294997.0' ) ) . ?s pq:P585 ?value }","paraphrases":["When did the population in Vigo reach 294997?"],"info":{}}
{"id":"train_5999","question":"Where in New York was Sofia Coppola born?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q193628 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P131 wd:Q1384 }","paraphrases":["In which place in New York was Sofia Coppola born?"],"info":{}}
{"id":"train_6000","question":"Which is the position that applies to jurisdiction of Weimar Republic?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1001 wd:Q41304 . ?sbj wdt:P31 wd:Q4164871 }","paraphrases":["What is the position that applies to Weimar Republic jurisdiction?"],"info":{}}
{"id":"train_6001","question":"Where was Niels Bohr educated at, and who was his doctoral advisor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q7085 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P184 ?value1 . }","paraphrases":["Where did Niels Bohr receive his education and who was his doctoral advisor?"],"info":{}}
{"id":"train_6002","question":"What is the dual of the facet of a polytope of the grand 120-cell ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5594220 wdt:P1312 ?X . ?X wdt:P1322 ?answer }","paraphrases":["What is the double of the aspect of a polytope of the fantastic 120-cell ?"],"info":{}}
{"id":"train_6003","question":"who principal place of state of loreng ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q35368261 wdt:P17 ?X . ?X wdt:P36 ?answer }","paraphrases":["who vital put of state of loreng ?"],"info":{}}
{"id":"train_6004","question":"Who is the musical score by in It Happened One Night that states someone's middle name is Howard?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q208632 wdt:P86 ?answer . ?answer wdt:P735 wd:Q3595959 }","paraphrases":["Who is the musical score that says the middle name of someone is Howard in It Happened One Night?"],"info":{}}
{"id":"train_6005","question":"Is the number of injured in the Newhall massacre less than 0.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q16211090 wdt:P1339 ?obj filter ( ?obj < 0.8 ) }","paraphrases":["Is the number of harmed within the Newhall slaughter less than 0.8?"],"info":{}}
{"id":"train_6006","question":"Lata Mangeshkar received what award in what field of work?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q156347 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P101 ?value1 . }","paraphrases":["What field of work did Lata Mangeshkar receive an award in?"],"info":{}}
{"id":"train_6007","question":"What is follows of city that has criterion used for human population?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q515 p:P155 ?s . ?s ps:P155 ?obj . ?s pq:P1013 wd:Q33829 }","paraphrases":["This sentence has no meaning."],"info":{}}
{"id":"train_6008","question":"who pharmaceutical product for has active ingredient of amoxicillin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3781 wd:Q201928 . ?sbj wdt:P31 wd:Q28885102 }","paraphrases":["who pharmaceutical item for has dynamic fixing of amoxicillin?"],"info":{}}
{"id":"train_6010","question":"WHICH IS THE ACADEMIC DEGREE AND ACADEMIC MAJOR OF BASHAR ALASSAD HAS EDUCATED IN DAMASCUS UNIVERSITY","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q44329 p:P69 ?s . ?s ps:P69 wd:Q1351317 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["WHICH IS THE ACADEMIC DEGREE AND ACADEMIC MAJOR OF BASHAR ALASSAD HAS EDUCATED IN DAMASCUS UNIVERSITY"],"info":{}}
{"id":"train_6011","question":"What workplace compiled Historia Coelestis Britannica?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20963643 wdt:P98 ?X . ?X wdt:P108 ?answer }","paraphrases":["What work environment compiled Historia Coelestis Britannica?"],"info":{}}
{"id":"train_6013","question":"Who are the {pupils} of the {songwriter} of {Für Elise}?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11980 wdt:P86 ?X . ?X wdt:P802 ?answer }","paraphrases":["Give me the names of the pupils of this Fur Elise songwriter."],"info":{}}
{"id":"train_6014","question":"What is a religious order of knight ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P611 wd:Q102083 }","paraphrases":[],"info":{}}
{"id":"train_6015","question":"TELL ME CEREMONY WHICH START WITH THE LETTER U.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2627975 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know CEREMONY WHICH Begin WITH THE LETTER U."],"info":{}}
{"id":"train_6016","question":"Which part of Adélie Land has a the second-level administrative country subdivision?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q184319 p:P31 ?s . ?s ps:P31 wd:Q13220204 . ?s pq:P361 ?value }","paraphrases":["The second-level administrative country subdivision is in which part of Adelie Land?"],"info":{}}
{"id":"train_6017","question":"What are theeconomic ideology which start with the letter t","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5333510 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What economic ideology starts with the letter 't'?"],"info":{}}
{"id":"train_6018","question":"Who owned the Mona Lisa in 1519?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q12418 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1519' ) ) }","paraphrases":["In 1519 who was the owner of the Mona Lisa?"],"info":{}}
{"id":"train_6019","question":"What is the sex of Barbie and who is her partner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q167447 wdt:P21 ?ans_1 . wd:Q167447 wdt:P451 ?ans_2 }","paraphrases":["Which sex is Barbie, and who is her partner?"],"info":{}}
{"id":"train_6020","question":"What is Chisinau's sister town?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q21197 wdt:P190 ?X . ?X wdt:P150 ?answer }","paraphrases":["The sister town of Chisinau is?"],"info":{}}
{"id":"train_6022","question":"Who are the daughters of Peter Gabriel that were born in Bath?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q175195 wdt:P40 ?answer . ?answer wdt:P19 wd:Q22889 }","paraphrases":["Who are the girls of Dwindle Gabriel that were born in Shower?"],"info":{}}
{"id":"train_6024","question":"Where did Diane Sawyer study ZIP+4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q236402 wdt:P69 ?X . ?X wdt:P281 ?answer }","paraphrases":["Give me the location that Diane Sawyer studied ZIP+4."],"info":{}}
{"id":"train_6025","question":"Who are Sean Connery's wife and child?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q4573 wdt:P26 ?ans_1 . wd:Q4573 wdt:P40 ?ans_2 }","paraphrases":["Who are Sean Connery's spouse and kid?"],"info":{}}
{"id":"train_6027","question":"How many people use Polish as their native language?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P103 wd:Q809 }","paraphrases":["What is the number of native Polish speakers?"],"info":{}}
{"id":"train_6031","question":"Who is the leader of the honor of the Colour of My Love?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q939286 wdt:P166 ?X . ?X wdt:P1346 ?answer }","paraphrases":["Give me the name of the honor leader of the Colour of My Love."],"info":{}}
{"id":"train_6033","question":"Phil Collins hosted what benefit concert?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P371 wd:Q144622 . ?sbj wdt:P31 wd:Q1850936 }","paraphrases":["Phil Collins facilitated what advantage concert?"],"info":{}}
{"id":"train_6035","question":"What is social media account on publishing house of Puyo Puyo Fever 2 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5356463 wdt:P123 ?X . ?X wdt:P553 ?answer }","paraphrases":["What is the social media account of the publishing house of Puyo Puyo Fever 2?"],"info":{}}
{"id":"train_6036","question":"Air India operates which aircraft model ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q69906 wdt:P121 ?obj . ?obj wdt:P31 wd:Q15056995 }","paraphrases":[],"info":{}}
{"id":"train_6037","question":"Name a former country that contains the word \"joseon\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3624078 . ?sbj wdt:P1366 wd:Q28233 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'joseon' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a previous nation that contains the word \"joseon\" in its name"],"info":{}}
{"id":"train_6040","question":"Was Carlos Slim the owner of Torre Latinoamericana and Claro?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q170419 wdt:P1830 wd:Q947870 . wd:Q170419 wdt:P1830 wd:Q1770208 }","paraphrases":["Is it true that Carlos Sim was the owner of Torre Latinoamericana and Claro?"],"info":{}}
{"id":"train_6041","question":"Is the number of eligible voters in the Catalan regional election 2015 in Sobremunt equal to 69?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44991020 wdt:P1867 ?obj filter ( ?obj = 69 ) }","paraphrases":["Is 69 the number of eligible voters found in Catalan for the regional election of Sobremunt in 2015?"],"info":{}}
{"id":"train_6045","question":"What platform was Doom released on in 1996?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q189784 p:P577 ?s . ?s ps:P577 ?x filter ( contains ( YEAR ( ?x ) , '1996' ) ) . ?s pq:P400 ?value }","paraphrases":["doom came out on what platform in 1996?"],"info":{}}
{"id":"train_6046","question":"what title did Gediminas hold in 1341-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q244852 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1341' ) ) }","paraphrases":["Gediminas held what title in 1341?"],"info":{}}
{"id":"train_6048","question":"What was the twinned administrative body of San Diego in 1983?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q16552 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1983' ) ) }","paraphrases":["in 1883 what was the administrative body of San Diego"],"info":{}}
{"id":"train_6049","question":"Where is the stomach located anatomicaly","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1029907 wdt:P927 ?obj . ?obj wdt:P31 wd:Q4936952 }","paraphrases":["Anatomically, where is the stomach located?"],"info":{}}
{"id":"train_6051","question":"Is the albedo of the 7384 1981 TJ .035?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q844936 wdt:P4501 ?obj filter ( ?obj = 0.035 ) }","paraphrases":["Is 0.035 the albedo of the 7384 1981 TJ?"],"info":{}}
{"id":"train_6052","question":"when was the total fertility rate of Bahrain estimated?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q398 p:P4841 ?s . ?s ps:P4841 ?obj . ?s pq:P459 wd:Q791801 }","paraphrases":["Bahrain's fertility rate was estimated what period of time?"],"info":{}}
{"id":"train_6053","question":"WHO PLAYED THE SUCCESSOR OF CALL OF THE WILD?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2934076 wdt:P156 ?X . ?X wdt:P175 ?answer }","paraphrases":["WHO PLAYED THE SUCCESSOR OF CALL OF THE WILD?"],"info":{}}
{"id":"train_6055","question":"Which dynasty did Chandragupta Maurya belong to?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q188541 wdt:P27 ?obj . ?obj wdt:P31 wd:Q164950 }","paraphrases":["The Chandragupta Maurya belonged to which dynasty?"],"info":{}}
{"id":"train_6060","question":"What is the BMW M20 with the highest torque whose engine configuration is straight-six ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q796558 . ?ent wdt:P2230 ?obj . ?ent wdt:P1002 wd:Q1148385 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which BMW M20 has the highest straight six torque engine?"],"info":{}}
{"id":"train_6061","question":"Is the synodic period of Pluto equal to 366.73?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q339 wdt:P4341 ?obj filter ( ?obj = 366.73 ) }","paraphrases":["Is the synodic period of Pluto rise to to 366.73?"],"info":{}}
{"id":"train_6063","question":"what is instruction set architecture that starts with x","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q272683 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'x' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is instruction set architecture that begins with x"],"info":{}}
{"id":"train_6065","question":"Which bridge is upstream of the London bridge","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q130206 wdt:P2673 ?obj . ?obj wdt:P31 wd:Q1055465 }","paraphrases":["Which bridge is upstream of the London bridge"],"info":{}}
{"id":"train_6066","question":"Is the elongation at the break of the AKROLOY PARA ICF 40 equal to 1?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q57273218 wdt:P5811 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is the prolongation at the break of the AKROLOY PARA ICF 40 break even with to 1?"],"info":{}}
{"id":"train_6067","question":"Are John F. Kennedy and Eunice Kennedy Shriver sibling to Ted Kennedy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q134549 wdt:P3373 wd:Q9696 . wd:Q134549 wdt:P3373 wd:Q272908 }","paraphrases":["Were JFK and Eunice Kennedy Shriver siblings of Ted Kennedy?"],"info":{}}
{"id":"train_6068","question":"an","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q2494 p:P39 ?s . ?s ps:P39 wd:Q45722 . ?s pq:P155 ?value1 . ?s pq:P156 ?value2 }","paraphrases":["an"],"info":{}}
{"id":"train_6070","question":"What is the Wikipedia article for natural numbers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P360 wd:Q21199 . ?sbj wdt:P31 wd:Q13406463 }","paraphrases":["Give me the natural numbers piece from Wikipedia."],"info":{}}
{"id":"train_6072","question":"What influenced Georges Bataille that studied at Eberhard-Ludwigs Gymnasium?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q207359 wdt:P737 ?answer . ?answer wdt:P69 wd:Q1278808 }","paraphrases":["What influenced Georges Bataille that studied at Eberhard-Ludwigs Gymnasium?"],"info":{}}
{"id":"train_6073","question":"Tell me race horse whose name has the word tikkanen in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q10855242 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tikkanen' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a race horse whose name contains the word tikkanen"],"info":{}}
{"id":"train_6075","question":"where is the filming location and narrative location of Full_Metal_Jacket?which","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q243439 wdt:P915 ?ans_1 . wd:Q243439 wdt:P840 ?ans_2 }","paraphrases":["Where was the filming of Full Metal Jacket and where was it supposed to take place?"],"info":{}}
{"id":"train_6078","question":"What is the birth place of Claude Adrien Halrtius, that aslo has villages, and is 7th arrondissement of Paris?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q190302 wdt:P19 ?answer . ?answer wdt:P150 wd:Q259463 }","paraphrases":["What is the delivery vicinity of Claude Adrien Halrtius, that aslo has villages, and is 7th arrondissement of Paris?"],"info":{}}
{"id":"train_6079","question":"What is {position held} of {Liu Xiaobo} where {start time} is {2003-0-0} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41617 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2003' ) ) }","paraphrases":["which is the {position held} of {Liu Xiaobo} where {start time} is {2003-0-0}"],"info":{}}
{"id":"train_6080","question":"What award did Juan Ramon Jimenez receive on 1956-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131318 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1956' ) ) }","paraphrases":["which award did juan Ramon Jimenez receive on 1956-1-1?"],"info":{}}
{"id":"train_6081","question":"Who is the  {sovereign state} for {allegiance} of {Salman of Saudi Arabia}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q367825 wdt:P945 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["In Saudi Arabia, who's the sovereign state for allegiance of Salman?"],"info":{}}
{"id":"train_6082","question":"When did Carl Friedrich Gauss receive his doctoral thesis from University of Helmstedt?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q6722 p:P69 ?s . ?s ps:P69 wd:Q314466 . ?s pq:P585 ?value1 . ?s pq:P1026 ?value2 }","paraphrases":["Carl Friedrich Guass received his doctorate from University of Helmstedt on what date?"],"info":{}}
{"id":"train_6083","question":"What are the neurological symptoms of influenza?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2840 wdt:P780 ?answer . ?answer wdt:P1995 wd:Q83042 }","paraphrases":["What are the influenza neurological symptoms?"],"info":{}}
{"id":"train_6085","question":"Who was the head of government in New Jersey beginning in 1935-1-15?W","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1408 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1935' ) ) }","paraphrases":["Who was the governor of New Jersey, January 1, 1935?"],"info":{}}
{"id":"train_6087","question":"What is {position held} of {Zhou Enlai} where {end time} is {1976-1-8} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q17410 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '1976' ) ) }","paraphrases":["Which designation was held by Zhou Enlai in the year 1976?"],"info":{}}
{"id":"train_6088","question":"What is the art genre that starts with the letter o?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1792379 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ō' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the craftsmanship class that begins with the letter o?"],"info":{}}
{"id":"train_6092","question":"Name the flattest inferior planet rotating the Sun.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q3901935 . ?ent wdt:P1102 ?obj . ?ent wdt:P397 wd:Q525 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which inferior planet orbiting the sun is the flattest?"],"info":{}}
{"id":"train_6093","question":"What ice age starts with the letter \"a\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q49367 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What ice age does the letter \"a\" begin with?"],"info":{}}
{"id":"train_6095","question":"Wich means  {SpectraBase Compound ID} at{ethanol} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q153 wdt:P5234 ?answer }","paraphrases":[],"info":{}}
{"id":"train_6096","question":"What is the place of incorporation of the developers of the Nintendo Switch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19610114 wdt:P178 ?X . ?X wdt:P740 ?answer }","paraphrases":["What is the put of joining of the designers of the Nintendo Switch?"],"info":{}}
{"id":"train_6097","question":"What woodcut print is depicted by the Tower of Babel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q41213 wdt:P1299 ?obj . ?obj wdt:P31 wd:Q18219090 }","paraphrases":["What woodcut print is presented on the Tower of Babel?"],"info":{}}
{"id":"train_6099","question":"Which departments of the United Nations are directed by the UN Secretary-General?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q81066 wdt:P2389 ?obj . ?obj wdt:P31 wd:Q15899789 }","paraphrases":["Which divisions of the Joined together Countries are coordinated by the UN Secretary-General?"],"info":{}}
