{"id":"train_18410","question":"Where and what height did Renaud Lavillenie hold the pole vault record","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q185027 p:P1000 ?s . ?s ps:P1000 wd:Q1742 . ?s pq:P276 ?value1 . ?s pq:P2048 ?value2 }","paraphrases":["Where and what height did Renaud Lavillenie hold the pole vault record"],"info":{}}
{"id":"train_18413","question":"Which {voice actors} of {series} {She Swill Survive} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51165010 wdt:P179 ?X . ?X wdt:P725 ?answer }","paraphrases":["List the voice actors in the series, She Swill Survive."],"info":{}}
{"id":"train_18417","question":"Name the shortest wheelbased Sport motorcycle","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q23866334 . ?ent wdt:P3039 ?obj . ?ent wdt:P279 wd:Q1339146 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["What sporting, wheel bead motorcycle, is also the shortest?"],"info":{}}
{"id":"train_18418","question":"What is electrical conductivity for gold?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q897 wdt:P2055 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18419","question":"How many armaments does the MiG-21 have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q150609 wdt:P520 ?obj }","paraphrases":["MiG-21 has how many armaments?"],"info":{}}
{"id":"train_18420","question":"Which album has Ellen DeGeneres produced?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P162 wd:Q483325 . ?sbj wdt:P31 wd:Q482994 }","paraphrases":["Which collection has Ellen DeGeneres produced?"],"info":{}}
{"id":"train_18422","question":"The fact that Gro Harlem Brundtland was the Prime Minister of Norway pertains to what subject?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q133009 p:P39 ?s . ?s ps:P39 wd:Q2334076 . ?s pq:P805 ?value }","paraphrases":["The truth that Gro Harlem Brundtland was the Prime Serve of Norway relates to what subject?"],"info":{}}
{"id":"train_18423","question":"Which {father} and {date of death} of {{Abigail Adams} has {child} as {Abigail Adams Smith}}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q4667661 . ?s pq:P22 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["Which { father } and { date of death } of { { Abigail Adams } will have { child } like { Abigail Adams Smith } }?"],"info":{}}
{"id":"train_18424","question":"what is norse deity starts with o","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q16513881 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'ó' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is northern deity begins with o"],"info":{}}
{"id":"train_18425","question":"How many titles are published by the British Medical Journal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q546003 wdt:P1476 ?obj }","paraphrases":["What is the number of titles that the British Medical Journal has published?"],"info":{}}
{"id":"train_18426","question":"What is the position held by Jules Ferry who started at 1880-9-23?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q959708 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1880' ) ) }","paraphrases":["On September, 23, 1880, Jules Ferry assumed what position?"],"info":{}}
{"id":"train_18427","question":"Was Scientific method is used by mathematics education and scientist ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q46857 wdt:P1535 wd:Q853077 . wd:Q46857 wdt:P1535 wd:Q901 }","paraphrases":["Which Scientific method was used by both mathematics education and scientist?"],"info":{}}
{"id":"train_18429","question":"1st place medalist, Dave Brubeck, received which recognition title of Henry Fonda?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19155 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q108597 }","paraphrases":["1st put medalist, Dave Brubeck, gotten which acknowledgment title of Henry Fonda?"],"info":{}}
{"id":"train_18431","question":"What is the working place created by White Cat?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q20428476 wdt:P170 ?X . ?X wdt:P108 ?answer }","paraphrases":["What is the working put made by White Cat?"],"info":{}}
{"id":"train_18434","question":"At which point in time Yoko Ono won and was awarded the Grammy Award for Album of the Year?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q117012 p:P166 ?s . ?s ps:P166 wd:Q904528 . ?s pq:P585 ?value1 . ?s pq:P1346 ?value2 }","paraphrases":["At which point in time Yoko Ono won and was granted the Grammy Grant for Collection of the Year?"],"info":{}}
{"id":"train_18437","question":"What language regulatory body of Portuguese that applies to part of Portugal","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q5146 p:P1018 ?s . ?s ps:P1018 ?obj . ?s pq:P518 wd:Q45 }","paraphrases":["What language is spoken predominately in Portugal?"],"info":{}}
{"id":"train_18438","question":"Tell me  chronology whose name has the word timeline in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q130788 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'timeline' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know chronology whose title has the word timeline in it."],"info":{}}
{"id":"train_18440","question":"Which is the LoJ peak ID of Mount Saint Elias?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q770496 wdt:P3907 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18441","question":"Tell me the ISQ derived quantity that starts with the letter 'v'?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q30337763 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Reveal to me the ISQ determined amount that begins with the letter 'v'?"],"info":{}}
{"id":"train_18442","question":"What are the regional organization that shares border with the Central African Republic and which that starts with the letter a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4120211 . ?sbj wdt:P47 wd:Q929 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the regional corporation that shares border with the Central African Republic and which that begins with the letter a"],"info":{}}
{"id":"train_18443","question":"Tell me a painting that depicts Mona Lisa with the word \"lisa\" in its name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3305213 . ?sbj wdt:P180 wd:Q11879536 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'lisa' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me a portray that depicts Mona Lisa with the phrase \"lisa\" in its name."],"info":{}}
{"id":"train_18445","question":"when was Moscow has twinned administrative body as Banja Luka ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q649 p:P190 ?s . ?s ps:P190 wd:Q131127 . ?s pq:P580 ?value }","paraphrases":["On what date was Banja Luka a twinned administrative body with Moscow?"],"info":{}}
{"id":"train_18447","question":"What language did Nigerian Joseph Edet Akinwale Way speak?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3509444 wdt:P172 ?X . ?X wdt:P2936 ?answer }","paraphrases":["What language has Joseph Edet Akinwale Way spoken in Nigeria?"],"info":{}}
{"id":"train_18449","question":"How many social classifications are there for the {peasant} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P3716 wd:Q838811 }","paraphrases":["Which is the number of social classifications that there are for the peasant?"],"info":{}}
{"id":"train_18450","question":"Which are the programming paradigm of logic programming?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3966 wd:Q275603 }","paraphrases":[],"info":{}}
{"id":"train_18451","question":"Who is the {media company} for {publisher} of {The Economist}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q180089 wdt:P123 ?obj . ?obj wdt:P31 wd:Q1331793 }","paraphrases":["What media company publishes The Economist?"],"info":{}}
{"id":"train_18452","question":"Is par at the British Masters 85.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q1778156 wdt:P3530 ?obj filter ( ?obj = 85.2 ) }","paraphrases":["Tell me that the par at the British Masters is 85.2."],"info":{}}
{"id":"train_18453","question":"Which primary medicinal ingredient is used to treat colorectal cancer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2175 wd:Q188874 . ?sbj wdt:P31 wd:Q35456 }","paraphrases":[],"info":{}}
{"id":"train_18454","question":"What Australian sport tour has the least amount of tied/drawn matches/games?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q50846468 . ?ent wdt:P1357 ?obj . ?ent wdt:P17 wd:Q408 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Name the Aussie sport with the minimum number of tied games."],"info":{}}
{"id":"train_18456","question":"Which is the Stadtbezirk that contains administrative territorial entity of Bonn?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q586 wdt:P150 ?obj . ?obj wdt:P31 wd:Q2740635 }","paraphrases":["Which is the Stadtbezirk that contains authoritative regional substance of Which is the Stadtbezirk that contains authoritative regional substance of Bonn?"],"info":{}}
{"id":"train_18457","question":"Name the flag carrier operated by the Airbus A380.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P121 wd:Q5830 . ?sbj wdt:P31 wd:Q721639 }","paraphrases":[],"info":{}}
{"id":"train_18458","question":"What are the solar calendar which start with the letter c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q210953 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE SOLAR CALENDAR START WITH THE LETTER C"],"info":{}}
{"id":"train_18459","question":"What is the translation for Bay of Biscay in Asturian?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q41573 p:P138 ?s . ?s ps:P138 ?obj . ?s pq:P407 wd:Q29507 }","paraphrases":["What does Bay of Biscay mean in Asturian?"],"info":{}}
{"id":"train_18463","question":"What are the automobile manufacturer which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q786820 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the car producer which begin with the letter z"],"info":{}}
{"id":"train_18464","question":"What are the birth and death dates of John Quincy Adams, son of Abigail Adams?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q11816 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["What are the beginning and death dates of John Quincy Adams, son of Abigail Adams?"],"info":{}}
{"id":"train_18465","question":"Who is the {episcopal see} for {office held by head of the organisation} of {pope}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2388 wd:Q19546 . ?sbj wdt:P31 wd:Q866196 }","paraphrases":["Who is the {episcopal see} for {office held by head of the association} of {pope}"],"info":{}}
{"id":"train_18466","question":"How was George I of Great Britain related to Sophia von Kielmansegg, Countess of Darlington?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q130805 p:P3373 ?s . ?s ps:P3373 wd:Q74001 . ?s pq:P1039 ?value }","paraphrases":["What was the relationship between George I of Great Britain and Sophia von Kielmansegg, Countess of Darlington?"],"info":{}}
{"id":"train_18472","question":"is the account charge / subscription fee of the payVIP Master card GOLD more than 0.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q57046635 wdt:P5897 ?obj filter ( ?obj > 0.0 ) }","paraphrases":["Does the payVIP Master card GOLD have fees of more than 0.0?"],"info":{}}
{"id":"train_18473","question":"Name a professional sports league starting in September that starts with letter P","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q15991290 . ?sbj wdt:P4794 wd:Q123 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a professional sports activities league starting in September that starts offevolved with letter P"],"info":{}}
{"id":"train_18475","question":"how many facets are there to marketing?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q39809 wdt:P1269 ?obj }","paraphrases":["How many facets of marking are there?"],"info":{}}
{"id":"train_18479","question":"What award did Konrad Lorenz win, and who won it with him?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q78496 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P1706 ?value1 . }","paraphrases":["What grant did Konrad Lorenz win, and who won it with him?"],"info":{}}
{"id":"train_18482","question":"What is the Commons category of Edgar Degas whose place of burial is Montmartre Cemetery.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q46373 p:P119 ?s . ?s ps:P119 wd:Q746647 . ?s pq:P373 ?value }","paraphrases":["Edgar Degas, who is buried in Montmartre Cemetery, was in what part of the Commons?"],"info":{}}
{"id":"train_18483","question":"Who works at sally ride that is part of the executive office of the president of the United States","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49285 wdt:P108 ?answer . ?answer wdt:P749 wd:Q1355327 }","paraphrases":["Who works at sally experience that is section of the executive workplace of the president of the United States"],"info":{}}
{"id":"train_18486","question":"What twinned administrative body of Norwich had a start time of 1978-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q130191 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1978' ) ) }","paraphrases":["What twinned authoritative body of Norwich had a begin time of 1978-1-1?"],"info":{}}
{"id":"train_18487","question":"Which is LAU of Burgas?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q6509 wdt:P782 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18488","question":"I'd like to know the Rangpur Division's Bangladesh administrative division code?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q876023 wdt:P4530 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18490","question":"Where is the place of the Taxi Driver?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q47221 wdt:P495 ?X . ?X wdt:P530 ?answer }","paraphrases":["Where is the Taxi Driver going?"],"info":{}}
{"id":"train_18492","question":"Which series is dubbed by Cape Feare?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2700666 wdt:P179 ?X . ?X wdt:P725 ?answer }","paraphrases":["Which arrangement is named by Cape Feare??"],"info":{}}
{"id":"train_18493","question":"What day is Thanksgiving in Liberia?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q13959 p:P837 ?s . ?s ps:P837 ?obj . ?s pq:P17 wd:Q1014 }","paraphrases":["On which day, Thanksgiving celebrated in Liberia?"],"info":{}}
{"id":"train_18494","question":"What is owned by  Salvator Mundi Saviour of the World that is start time is 1660 ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1892745 p:P127 ?s . ?s ps:P127 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1660' ) ) }","paraphrases":["Salvator Mundi owned what in the beginning of 1660?"],"info":{}}
{"id":"train_18495","question":"Is the market capitalization of Toyota greater than 4e+11?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q53268 wdt:P2226 ?obj filter ( ?obj > 4e+11 ) }","paraphrases":["Is 4e+11 greater than Toyota's market capitalization?"],"info":{}}
{"id":"train_18498","question":"On 11-30-1016 what did Edmund II of England die of?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q188684 p:P570 ?s . ?s ps:P570 ?x filter ( contains ( YEAR ( ?x ) , '1016' ) ) . ?s pq:P31 ?value }","paraphrases":["What caused Edmund II of Englands death?"],"info":{}}
{"id":"train_18499","question":"Is it true that the Human Development Index of Kenya is greater than 0.3784?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q114 wdt:P1081 ?obj filter ( ?obj > 0.3784 ) }","paraphrases":["Is it possible that the Human Development Index of Kenya greater than 0.3784?"],"info":{}}
{"id":"train_18500","question":"What is the official language of the First Bulgarian Empire where the alphabet is the Early Cyrillic alphabet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q203817 wdt:P37 ?answer . ?answer wdt:P282 wd:Q442244 }","paraphrases":["What is the professional language of the First Bulgarian Empire the place the alphabet is the Early Cyrillic alphabet?"],"info":{}}
{"id":"train_18506","question":"Which airline starts with the letter a has the business division Alliance Air?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q46970 . ?sbj wdt:P199 wd:Q1376333 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which airline begins with the letter a has the business division Alliance Air?"],"info":{}}
{"id":"train_18509","question":"What award did Gurbanguly Berdimuhamedow win when they were introduced on October 26th, 2009?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q57530 wdt:P166 ?answer . ?answer wdt:P571 ?x FILTER ( contains ( YEAR ( ?x ) , '2009' ) ) }","paraphrases":["What award did Gurbanguly Berdimuhamedow win when they had been delivered on October 26th, 2009?"],"info":{}}
{"id":"train_18512","question":"What's Paul Kagame's position since January 28, 2018?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1231345 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2018' ) ) }","paraphrases":["What's Paul Kagame's situation since 01/28/2018?"],"info":{}}
{"id":"train_18515","question":"What are the laws and regulations of Hong Kong?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8646 wdt:P92 ?obj . ?obj wdt:P31 wd:Q10872094 }","paraphrases":["What are the laws and directions of Hong Kong?"],"info":{}}
{"id":"train_18516","question":"TELL ME DOG WHOSE NAME HAS THE WORD ULK IN IT","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q144 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'ulk' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH DOG CONTAINS THE WORD ULK IN ITS NAME?"],"info":{}}
{"id":"train_18518","question":"Who is the student of Louis Pasteur?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q529 wdt:P802 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who does Louis Pasteur have for a student?"],"info":{}}
{"id":"train_18519","question":"Who is the employer of The Guardian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P108 wd:Q11148 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["The Guardian is employed by who?"],"info":{}}
{"id":"train_18520","question":"What is the data controller (GDPR) of the product of Uber rideshare service that starts with the letter u?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q59859818 . ?sbj wdt:P1056 wd:Q61058590 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'u' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the information controller (GDPR) of the item of Uber rideshare benefit that begins with the letter u?"],"info":{}}
{"id":"train_18521","question":"Which is Shakeosphere person ID for Emmanuel Swedenborg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q185832 wdt:P2886 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18522","question":"Was Jordan Peterson an employer of Massachusetts Institute of Technology and University of Toronto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6276882 wdt:P108 wd:Q49108 . wd:Q6276882 wdt:P108 wd:Q180865 }","paraphrases":["Did MIT and U of Toronto employ Jordan Peterson?"],"info":{}}
{"id":"train_18523","question":"Which university is located in the Milwaukee area.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q37836 . ?sbj wdt:P31 wd:Q3918 }","paraphrases":["Which university in the Milwaukee area is located."],"info":{}}
{"id":"train_18526","question":"What is in the category winner of Phil Taylor ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q550313 wdt:P1346 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18527","question":"What was the population of Isle of Man on 1978-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q9676 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1978' ) ) }","paraphrases":["In 1978, how many people lived on Isle of Man?"],"info":{}}
{"id":"train_18528","question":"Tell me the standards organization that is affiliated with United Nations Economic and Social Council and starts with the letter i?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1328899 . ?sbj wdt:P1416 wd:Q170075 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'i' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the requirements enterprise that is affiliated with United Nations Economic and Social Council and starts with the letter i?"],"info":{}}
{"id":"train_18529","question":"Which is {style of architecture} {buried in}  {Edmund Allenby, 1st Viscount Allenby} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q334846 wdt:P119 ?X . ?X wdt:P149 ?answer }","paraphrases":["What is { architecture style } { buried in } { Edmund Allenby, 1st Allenby Viscount }?"],"info":{}}
{"id":"train_18530","question":"What airport is in Los Angeles?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P931 wd:Q65 . ?sbj wdt:P31 wd:Q1248784 }","paraphrases":["What air terminal is in Los Angeles?"],"info":{}}
{"id":"train_18532","question":"For what was Rebecca nominate for in the 13th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q204212 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q508554 }","paraphrases":["What was \"Rebecca\" nominated for in the 13th Academy Awards?"],"info":{}}
{"id":"train_18533","question":"Which is the residence time of water of Khanka Lake?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q201843 wdt:P3020 ?answer }","paraphrases":[],"info":{}}
{"id":"train_18534","question":"What are the physical law which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q214070 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the physical law which begin with the letter s"],"info":{}}
