{"id":"train_20534","question":"Who is the student of William of Ockham?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1066 wd:Q43936 }","paraphrases":[],"info":{}}
{"id":"train_20535","question":"Who is affiliated with NYU?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1416 wd:Q49210 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who are NYU's affiliates?"],"info":{}}
{"id":"train_20536","question":"When did Animal Farm win the Prometheus Award - Hall of Fame award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1396889 p:P166 ?s . ?s ps:P166 wd:Q19360203 . ?s pq:P585 ?value }","paraphrases":["What year did Animal Farm with the Prometheus Hall of Fame Award?"],"info":{}}
{"id":"train_20537","question":"Who is the founder of Mad Decent?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15116528 wdt:P112 ?X . ?X wdt:P710 ?answer }","paraphrases":["Who is the originator of Frantic Conventional?"],"info":{}}
{"id":"train_20538","question":"What is in the category of Don Quixote?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q480 wdt:P655 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20539","question":"Which country was writer Roald Dahl from and when did he die?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q25161 p:P106 ?s . ?s ps:P106 wd:Q36180 . ?s pq:P27 ?value1 . ?s pq:P570 ?value2 }","paraphrases":["Which country used to be creator Roald Dahl from and when did he die?"],"info":{}}
{"id":"train_20540","question":"What is the Indonesian ethnicity code for grain?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q693944 wdt:P3034 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20543","question":"Which belligerents competed in Klaus Brähmig?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q102992 wdt:P1344 ?X . ?X wdt:P710 ?answer }","paraphrases":["In Klaus Brahmig, who were the belligerents who competed?"],"info":{}}
{"id":"train_20544","question":"At what start time does Guillaume Apollinaire take his occupation as a censor?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q133855 p:P106 ?s . ?s ps:P106 wd:Q22272441 . ?s pq:P580 ?value }","paraphrases":["When does Guillaume Apollinaire take his occupation as a censor?"],"info":{}}
{"id":"train_20545","question":"what is the diaspora of moors?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P3833 wd:Q169260 }","paraphrases":[],"info":{}}
{"id":"train_20546","question":"What language does Egyptian hieroglyphs represent","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q132659 wdt:P407 ?obj . ?obj wdt:P31 wd:Q34049 }","paraphrases":["Do hieroglyphs represent the Egyptian language?"],"info":{}}
{"id":"train_20547","question":"Which is the length of the Green River?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q952429 wdt:P2043 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20550","question":"What is petit-patrimoine.com ID for Bibracte?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q650053 wdt:P3324 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20553","question":"Who co-founded the region release of \"An Introduction to the History of Science\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51427554 wdt:P291 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who co founded \"An Introduction of the History of Science?\""],"info":{}}
{"id":"train_20554","question":"What was the noble title of Lothair I?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q150735 p:P97 ?s . ?s ps:P97 ?obj . ?s pq:P155 ?value1 . }","paraphrases":["What was Lothair I's noble title?"],"info":{}}
{"id":"train_20556","question":"What is the name of a firearm that starts with the letter s.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q12796 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a gun that begins with the letter s."],"info":{}}
{"id":"train_20560","question":"\"Which is {is not} of {mangrove}, that has {wgs 84} is {16.2628} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19756 wdt:P1889 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '16.2628' ) ) }","paraphrases":["\"Which { is not } of { mangrove } is { 16.2628 } which has { wgs 84 }?\""],"info":{}}
{"id":"train_20561","question":"Name the winner of the FIFA World Cup match between Sweden and England.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q16851252 . ?ent wdt:P1352 ?obj . ?ent wdt:P1344 wd:Q52063370 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which team won the FIFA World Cup match between Sweden and England?"],"info":{}}
{"id":"train_20567","question":"What was the position of Lee hsien Loong held on 2004-8-12?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q57643 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2004' ) ) }","paraphrases":["Which position did  Lee hsien Loong hold on 2004-8-12?"],"info":{}}
{"id":"train_20568","question":"What has died in Solon which has the twin city Barcelona?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q133337 wdt:P20 ?answer . ?answer wdt:P190 wd:Q1492 }","paraphrases":["What has passed on in Solon which has the twin city Barcelona?"],"info":{}}
{"id":"train_20570","question":"When did monument for depicts of Dante Alighieri?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P180 wd:Q1067 . ?sbj wdt:P31 wd:Q4989906 }","paraphrases":[],"info":{}}
{"id":"train_20571","question":"Who were James VI and I married to on October 23rd,1589","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q79972 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1589' ) ) }","paraphrases":["In Octover 1589 James VI and I married who?"],"info":{}}
{"id":"train_20572","question":"What award did Carlos Arias Navarro receive in 1960?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q365172 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1960' ) ) }","paraphrases":["In 1960 Carlos Arias Navarro won what award?"],"info":{}}
{"id":"train_20576","question":"Who were the inhabitants of the state of Ancient Egypt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11768 wdt:P17 ?X . ?X wdt:P1082 ?answer }","paraphrases":["Who were the tenants of the state of Antiquated Egypt?"],"info":{}}
{"id":"train_20577","question":"What is the name for someone who lives in the Soviet Union","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P27 wd:Q15180 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What's the name of someone living in the Soviet Union?"],"info":{}}
{"id":"train_20578","question":"Which is the ZooBank publication ID of the American Journal of Botany?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2664693 wdt:P2007 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20579","question":"What are the technical specification which start with the letter webid","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20819677 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'webid' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the specialized determination which begin with the letter webid"],"info":{}}
{"id":"train_20580","question":"What are the human settlement which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q486972 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the human settlement which begin with the letter z"],"info":{}}
{"id":"train_20583","question":"Where is the US Declaration of Independence located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q127912 wdt:P1001 ?obj . ?obj wdt:P31 wd:Q6256 }","paraphrases":["Which are the mineral acids that contains the word corrosive in their name?"],"info":{}}
{"id":"train_20585","question":"Who played the alumni of the role model of George Saunders?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1251926 wdt:P737 ?X . ?X wdt:P69 ?answer }","paraphrases":["Give me the name of the person that played the alumni of the role model of George Saunders."],"info":{}}
{"id":"train_20586","question":"Which is {sports league} of {team played for} {Hope Solo} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q229619 wdt:P54 ?X . ?X wdt:P118 ?answer }","paraphrases":["Which team { sports league } has played for { Hope Solo }?"],"info":{}}
{"id":"train_20588","question":"Name a language spoken in England that starts with letter E","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q33742 . ?sbj wdt:P2596 wd:Q21 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a language spoken in England that begins with letter E"],"info":{}}
{"id":"train_20591","question":"When did Angela Merkel  begin her term as prime minister?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q567 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["What is the Glucan with the most elevated least dangerous concentration whose has portion is hydrogen?"],"info":{}}
{"id":"train_20593","question":"When did Rudolph Valentino marry Jean Acker and when did their marriage end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q188692 p:P26 ?s . ?s ps:P26 wd:Q265422 . ?s pq:P580 ?value1 . ?s pq:P582 ?value2 }","paraphrases":["When did Rudolph Valentino marry Jean Acker and when did their marriage end?"],"info":{}}
{"id":"train_20594","question":"In what country is Stanford University's Stanford headquarters?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q41506 p:P159 ?s . ?s ps:P159 wd:Q173813 . ?s pq:P17 ?value }","paraphrases":["What country houses Stanford University's headquarters?"],"info":{}}
{"id":"train_20597","question":"What are the properties for the type of file format that describes the technical standard class?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q235557 p:P1963 ?s . ?s ps:P1963 ?obj . ?s pq:P2308 wd:Q317623 }","paraphrases":["description for the file format of the technical standard class?"],"info":{}}
{"id":"train_20598","question":"When did Marja van Bijsterveldt start as the head of the municipal council?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q690 p:P6 ?s . ?s ps:P6 wd:Q434650 . ?s pq:P580 ?value }","paraphrases":["Marja Van Bijsterveldt took over the municipal council in what year?"],"info":{}}
{"id":"train_20599","question":"What party besides Odisha is part of the Rajya Sabha?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1889 wd:Q22048 . ?sbj wdt:P31 wd:Q57156205 }","paraphrases":["What party other than Odisha is a piece of the Rajya Sabha?"],"info":{}}
{"id":"train_20601","question":"which uninformed search starts with letter f","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4443425 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'f' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["which ignorant look begins with letter f"],"info":{}}
{"id":"train_20604","question":"What is Cebu City's population of 662299 determination method?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1467 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '662299.0' ) ) . ?s pq:P459 ?value }","paraphrases":["How do they determine Cebu City's 662299 population?"],"info":{}}
{"id":"train_20605","question":"What are the head of government and the capital of Mecca?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q5806 wdt:P6 ?ans_1 . wd:Q5806 wdt:P1376 ?ans_2 }","paraphrases":["Who is the head of the capital and government of Mecca?"],"info":{}}
{"id":"train_20607","question":"What citation is published in the journal of Strategies for reporting health plan performance information to consumers; evidence from controlled studies?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q34520285 wdt:P2860 ?X . ?X wdt:P1433 ?answer }","paraphrases":["What reference is distributed in the diary of Strategies for announcing wellbeing plan execution data to buyers; proof from controlled investigations?"],"info":{}}
{"id":"train_20608","question":"Who passed judgement on Jesus Christ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3342 wd:Q302 . ?sbj wdt:P31 wd:Q3769186 }","paraphrases":["Who passed judgment on Jesus Christ?"],"info":{}}
{"id":"train_20609","question":"Which brother or sister of Artemis has a kid named Hymen?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q39503 wdt:P3373 ?answer . ?answer wdt:P40 wd:Q506770 }","paraphrases":["Which brother or sister of Artemis includes a kid named Hymen?"],"info":{}}
{"id":"train_20610","question":"Are Robin, Starfire, and Cyborg from the DC Universe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q14916928 wdt:P1080 wd:Q1152150 }","paraphrases":["Does the DC Universe contain Robin, Starfire and Cyborg?"],"info":{}}
{"id":"train_20614","question":"When and what was  the position held by Deodoro da Fonseca?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q200812 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?value1 . }","paraphrases":["When and what was the position held by Deodoro da Fonseca?"],"info":{}}
{"id":"train_20615","question":"When was Brigham Young no longer married to Ann Eliza Young?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q203559 p:P26 ?s . ?s ps:P26 wd:Q3617629 . ?s pq:P582 ?value }","paraphrases":["When did Brigham Young divorce Ann Eliza Young?"],"info":{}}
{"id":"train_20616","question":"TELL ME PROGRAMMING LANGUAGE WHOSE NAME HAS THE WORD XL IN IT,","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q9143 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'xl' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let Me know PROGRAMMING Dialect WHOSE Title HAS THE WORD XL IN IT,"],"info":{}}
{"id":"train_20617","question":"Nigel Farage was employed by whom and until when?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q318471 p:P108 ?s . ?s ps:P108 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Nigel Farage was employed by way of whom and until when?"],"info":{}}
{"id":"train_20619","question":"What are the plague pandemics which start with the letter p","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1516910 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'p' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the torment pandemics which begin with the letter p"],"info":{}}
{"id":"train_20620","question":"Is the upper limit of the 1 E1 greater than 120.0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q13012266 wdt:P5448 ?obj filter ( ?obj > 120.0 ) }","paraphrases":["What is the upper limit of the 1 E1 greater than?"],"info":{}}
{"id":"train_20621","question":"Tell me planning  whose name has the word planningm in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q309100 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'planning' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me the name of the planning that has the word planningm in it."],"info":{}}
{"id":"train_20622","question":"Does the Sandbox-Quantity of December 27th equal 32.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5249031 wdt:P1106 ?obj filter ( ?obj = 32.4 ) }","paraphrases":["Is 32.4 the Sandbox-Quantity of December 27th?"],"info":{}}
{"id":"train_20623","question":"What was William Goldman nominated for at the 49th Academy Awards?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q506885 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P805 wd:Q611050 }","paraphrases":["Which award was William Goldman short-listed for at the 49th Academy Awards?"],"info":{}}
{"id":"train_20625","question":"What is satellite of orbits for Mimas ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15034 wdt:P397 ?X . ?X wdt:P398 ?answer }","paraphrases":["What is adj. of circles for Mimas ?"],"info":{}}
{"id":"train_20626","question":"What are the cryptid which start with the letter yowie","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q772636 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'yowie' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the cryptid which begin with the letter yowie"],"info":{}}
{"id":"train_20627","question":"What award did Betty Williams receive on 1976-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q157690 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1976' ) ) }","paraphrases":["Give me the name of the award that Betty Williams received on 1976-0-0."],"info":{}}
{"id":"train_20628","question":"What country in the Holy Roman Empire was Innocent IV born in?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q160609 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q12548 }","paraphrases":["Where was Innocent VI born?"],"info":{}}
{"id":"train_20629","question":"What part of the series is Lands of Lore: Guardians of Destiny?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3217112 wdt:P179 ?X . ?X wdt:P400 ?answer }","paraphrases":["What portion of the arrangement is Lands of Legend: Gatekeepers of Destiny?"],"info":{}}
{"id":"train_20632","question":"What street is the publisher of De revolutibus orbium coelestium on?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q845981 wdt:P291 ?X . ?X wdt:P969 ?answer }","paraphrases":["On which street is the publisher of De revolutibus orbium coelestium?"],"info":{}}
{"id":"train_20634","question":"Does Cricket use Flavour and Life?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5375 wdt:P2283 wd:Q23461546 }","paraphrases":["Are Flavour and Life used in the game of Cricket?"],"info":{}}
{"id":"train_20640","question":"What is pseudonym of Jin Yong ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q180626 wdt:P742 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20642","question":"Which is the city that is capital of Austrian Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1376 wd:Q131964 . ?sbj wdt:P31 wd:Q515 }","paraphrases":["Which is the city that's capital of Austrian Realm?"],"info":{}}
{"id":"train_20643","question":"What is the central processing unit with a minimum FSB speed whose lithorgraphy is 45 nanometers?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5300 . ?ent wdt:P2150 ?obj . ?ent wdt:P2157 wd:Q2652372 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which central processing unit has a minimum FSB speed with a lithorgraphy of 45 nanometers?"],"info":{}}
{"id":"train_20644","question":"What is the occupation of Rachel Sylvester?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7279421 wdt:P106 ?X . ?X wdt:P425 ?answer }","paraphrases":["what is Rachel Sylvester's occupation?"],"info":{}}
{"id":"train_20645","question":"Name an art form performed with instruments that contains the word \"music \" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56055944 . ?sbj wdt:P3095 wd:Q1278335 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'music' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name an artwork structure carried out with gadgets that consists of the word \"music \" in its name"],"info":{}}
{"id":"train_20648","question":"Name an archaeological finding in the Kingdom of Wessex.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P17 wd:Q105313 . ?sbj wdt:P31 wd:Q10855061 }","paraphrases":[],"info":{}}
{"id":"train_20649","question":"Which medicine is the essential treatment for bipolar disorder?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2175 wd:Q131755 . ?sbj wdt:P31 wd:Q35456 }","paraphrases":[],"info":{}}
{"id":"train_20650","question":"Which place with town rights and privileges has the largest water as percent of area ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q13539802 . ?ent wdt:P2927 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which put with town rights and benefits has the biggest water as percent of region ?"],"info":{}}
{"id":"train_20651","question":"Which is premanent resident of Ma Ying-jeou having acronym as USA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q19216 wdt:P5389 ?answer . ?answer wdt:P1813 ?x FILTER ( contains ( ?x , 'USA' ) ) }","paraphrases":["Which is premanent resident of Ma Ying-jeou having acronym as USA?"],"info":{}}
{"id":"train_20652","question":"Who are Dan Bilzerian's sibling and father?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q16199296 wdt:P3373 ?ans_1 . wd:Q16199296 wdt:P22 ?ans_2 }","paraphrases":["Who are sibling and father to \nDan Bilzerian?"],"info":{}}
{"id":"train_20654","question":"What was Erich Raeder's role in the Nuremberg trials?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q57154 p:P1344 ?s . ?s ps:P1344 wd:Q80130 . ?s pq:P2868 ?value }","paraphrases":["Erich Raeder did what in the Nuremberg Trials?"],"info":{}}
{"id":"train_20655","question":"Is the number of processor cores for the Core i7-6700 process equal to 4.8?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q28739510 wdt:P1141 ?obj filter ( ?obj = 4.8 ) }","paraphrases":["Is the number of processor centers for the Center i7-6700 prepare rise to to 4.8?"],"info":{}}
{"id":"train_20656","question":"tell me video game series that contains the word warlords in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7058673 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'warlords' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know video amusement arrangement that contains the word warlords in ilet me know video amusement arrangement that contains the word warlords in it"],"info":{}}
{"id":"train_20658","question":"When did member of sports team of Robert Lewandowski and number of matches -played?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q151269 p:P54 ?s . ?s ps:P54 ?obj . ?s pq:P1350 ?value1 . }","paraphrases":["When did part of sports group of Robert Lewandowski and number of matches -played?"],"info":{}}
{"id":"train_20661","question":"What's the population of Anglesey in 2011?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q168159 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2011' ) ) }","paraphrases":["2011's Anglesey population was?"],"info":{}}
