{"id":"train_4143","question":"When was Robert Koch nominated for the Nobel Prize in Physiology or Medicine","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q37193 p:P1411 ?s . ?s ps:P1411 wd:Q80061 . ?s pq:P585 ?value }","paraphrases":["In what year was Robert Koch among the Nobel Prize in Physiology or Medicine nominees?"],"info":{}}
{"id":"train_4144","question":"What is the ideology named after Donald Watson that starts with letter V ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7257 . ?sbj wdt:P3938 wd:Q178402 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the ideology named after Donald Watson that begins with letter V ?"],"info":{}}
{"id":"train_4147","question":"Did Shah Rukh Khan work in Koyaanisqatsi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q9535 wdt:P101 wd:Q1127828 }","paraphrases":["Is it true that Shah Rukh Khan worked in Koyaanisqatsi?"],"info":{}}
{"id":"train_4148","question":"what is game mode starts with v","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1971694 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what is game mode begins with v"],"info":{}}
{"id":"train_4149","question":"Give me jurisdiction that applies to jurisdiction Member states of the United Nations starts with c","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q471855 . ?sbj wdt:P1001 wd:Q160016 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Give me jurisdiction that applies to jurisdiction Member states of the United Nations starts offevolved with c"],"info":{}}
{"id":"train_4150","question":"Name a demigod of Greek mythology that contains the word \"Heracles\" in its name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23015925 . ?sbj wdt:P3828 wd:Q3291230 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'heracles' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a demigod of Greek mythology containing in his name the word \"Heracles\""],"info":{}}
{"id":"train_4151","question":"Who follows Berengar 1 of Italy as monarch of Italy","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q274606 p:P97 ?s . ?s ps:P97 wd:Q271148 . ?s pq:P156 ?value1 . ?s pq:P155 ?value2 }","paraphrases":["Who was the monarch of Italy after Berengar 1?"],"info":{}}
{"id":"train_4152","question":"Who is the toponym of thorium, and has a parent named Odin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1115 wdt:P138 ?answer . ?answer wdt:P22 wd:Q43610 }","paraphrases":["Who is the toponym of thorium, and encompasses a parent named Odin?"],"info":{}}
{"id":"train_4153","question":"If the female population of Sagamihara is 360244.0, what is the total population?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q209779 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P1539 ?x filter ( contains ( ?x , '360244.0' ) ) }","paraphrases":["What is the total population of Sagamihara if the female population is 360244.0?"],"info":{}}
{"id":"train_4154","question":"When did Cordell Hull stop being a United States representative?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q202979 p:P39 ?s . ?s ps:P39 wd:Q13218630 . ?s pq:P582 ?value }","paraphrases":["When did US representative Cordell Hull step down?"],"info":{}}
{"id":"train_4157","question":"What is population of Ostrava that is point in time is 2017-1-1?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q8385 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2017' ) ) }","paraphrases":["How many people live in Ostrava as of 2017-1-1?"],"info":{}}
{"id":"train_4158","question":"Is Jane Fonda's father Henry Fonda?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q41142 wdt:P22 wd:Q19155 }","paraphrases":["Is it true that the father of Jane Fonda is Henry Fonda?"],"info":{}}
{"id":"train_4159","question":"Eiffel tower has how many floors?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q243 wdt:P1101 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4160","question":"Who is {member of} of {university} of {Douglas Southall Freeman} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q451929 wdt:P69 ?X . ?X wdt:P463 ?answer }","paraphrases":["Who is a member at the University of Douglas Southall Freeman?"],"info":{}}
{"id":"train_4161","question":"What is the immediate outcome of a door with a vernacular name of Mirov?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q36794 wdt:P1478 ?answer . ?answer wdt:P1843 ?x FILTER ( contains ( ?x , 'Mirov' ) ) }","paraphrases":["If a door is named Mirov, what will happen next?"],"info":{}}
{"id":"train_4162","question":"when did the relationship between Gore Vidal and Howard Austen start?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q167821 p:P451 ?s . ?s ps:P451 wd:Q17309157 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When did Gore Vidal's relationship with Howard Austen begin?"],"info":{}}
{"id":"train_4164","question":"What is the SI unit for frequency?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11652 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q208469 }","paraphrases":["What is the SI unit for frequency?"],"info":{}}
{"id":"train_4166","question":"Who owns UNESCO and the what office does it's organization head hold?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q7809 wdt:P1830 ?ans_1 . wd:Q7809 wdt:P2388 ?ans_2 }","paraphrases":["Name the owner of UNESCO and the office that its organization head holds."],"info":{}}
{"id":"train_4167","question":"Which game of chess allows the maximum score of 3 points difference to win?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q471257 wdt:P1269 ?answer . ?answer wdt:P1873 ?x FILTER ( contains ( ?x , '3.0' ) ) }","paraphrases":["Which is the private of Otto Lilienthal nationality?"],"info":{}}
{"id":"train_4170","question":"Tell me physical law whose name has the word superposition in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q214070 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'superposition' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know physical law whose title has the word superposition in it."],"info":{}}
{"id":"train_4174","question":"Which is from the fictional universe of Spock?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q16341 wdt:P1080 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4175","question":"What causes mica, which has a first aid response of moving the patient to fresh air?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q114675 wdt:P1542 ?answer . ?answer wdt:P2239 wd:Q21010971 }","paraphrases":["What reasons mica, which has a first aid response of moving the affected person to clean air?"],"info":{}}
{"id":"train_4176","question":"What is {end time} and {start time} of {{Boeing 747} has {operator} as {Air Algérie}} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q2494 p:P793 ?s . ?s ps:P793 wd:Q41463697 . ?s pq:P276 ?value1 . ?s pq:P748 ?value2 }","paraphrases":["When does the Air Algerie Boeing 747 depart and return?"],"info":{}}
{"id":"train_4177","question":"Who is the human biblical figure that is a significant person of Samuel and contains the word saul in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20643955 . ?sbj wdt:P3342 wd:Q6577515 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'saul' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Who is the human scriptural assume that is a noteworthy individual of Samuel and contains the word saul in it's name?"],"info":{}}
{"id":"train_4180","question":"Tell me private not-for-profit educational institution whose name has the word university in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q23002054 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'university' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know private not-for-profit instructive institution whose title has the word college in it."],"info":{}}
{"id":"train_4181","question":"Tell me least squares method  whose name has the word least in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q74304 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'least' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know financial pointer whose title has the word soil in it."],"info":{}}
{"id":"train_4183","question":"Who is member of Marguerite Yourcenar since 1980-3-6?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q163118 p:P463 ?s . ?s ps:P463 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1980' ) ) }","paraphrases":["Since March 6th, 1980, who is a member of Marguerite Yourcenar?"],"info":{}}
{"id":"train_4185","question":"What is the [prize that was awarded to Carcassonne is that Victor Elfenland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q17262 wdt:P166 ?answer . ?answer wdt:P1346 wd:Q1328502 }","paraphrases":["What is Victor Elfenland, the [ prize awarded to Carcassonne?"],"info":{}}
{"id":"train_4186","question":"What degree and major did Chanda Kochhar receive at Jamnalal Bajaj Institute of Management?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q539281 p:P69 ?s . ?s ps:P69 wd:Q6148070 . ?s pq:P512 ?value1 . ?s pq:P812 ?value2 }","paraphrases":["What degree and major did Chanda Kochhar get at Jamnalal Bajaj Established of Administration?"],"info":{}}
{"id":"train_4188","question":"What is the service ribbon image for the Medal of Honor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q203535 wdt:P2425 ?answer }","paraphrases":[],"info":{}}
{"id":"train_4189","question":"When did John of the Cross adopt the religious name of Juan de la Cruz?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q190388 p:P1635 ?s . ?s ps:P1635 ?x filter ( contains ( ?x , 'Juan de la Cruz' ) ) . ?s pq:P580 ?value }","paraphrases":["John of the Cross adopted the religious name of Juan de la Cruze in what year?"],"info":{}}
{"id":"train_4190","question":"Which city did Charleroi twin with in 1958?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q81046 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1958' ) ) }","paraphrases":["Charleroi became the twin of what city in 1958?"],"info":{}}
{"id":"train_4191","question":"Who is Adad's aunt?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q346547 wdt:P22 ?X . ?X wdt:P3373 ?answer }","paraphrases":["Who is the aunt of Adad?"],"info":{}}
{"id":"train_4193","question":"What is the natural language for the Arabic alphabet?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8196 wdt:P407 ?obj . ?obj wdt:P31 wd:Q33742 }","paraphrases":["What is the Arabic alphabet's natural language?"],"info":{}}
{"id":"train_4194","question":"When was Jonny Wilkinson has joind as a member to the RC Toulonnais sports team?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q318920 p:P54 ?s . ?s ps:P54 wd:Q1857064 . ?s pq:P580 ?value }","paraphrases":["At what time was Jonny Wilkinson joined as a member at RC Toulonnais sports team?"],"info":{}}
{"id":"train_4195","question":"Mention the Hamburg's responsible work location.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P937 wd:Q1055 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Specify the Hamburg's capable work location"],"info":{}}
{"id":"train_4196","question":"What is the subsidiary of IBM Power?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13637178 wdt:P178 ?X . ?X wdt:P199 ?answer }","paraphrases":["What is the backup of IBM Power?"],"info":{}}
{"id":"train_4197","question":"Mention the year of establishment and the reason of tenure end of Enoch Powell after holding up place as the Member of the 48th Parliament of the United Kingdom","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q333028 p:P39 ?s . ?s ps:P39 wd:Q41582619 . ?s pq:P2715 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["enoch powell was established as a member of the 48th parliament of the united kingdom in what year and what was the reason for the ending of his tenure?"],"info":{}}
{"id":"train_4198","question":"Name the birth place of Sylvester II, in Kingdom of France.","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q172383 p:P19 ?s . ?s ps:P19 ?obj . ?s pq:P17 wd:Q70972 }","paraphrases":["What is the name of the birth place of Sylvester II in the Kingdom of France?"],"info":{}}
{"id":"train_4201","question":"What was the electoral district and position that George Reid held?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q23352 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P768 ?value1 . }","paraphrases":["What was once the electoral district and function that George Reid held?"],"info":{}}
{"id":"train_4202","question":"Who made and dispensed \"ANGTT\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q16826312 wdt:P750 ?X . ?X wdt:P112 ?answer }","paraphrases":["Who made and administered \"ANGTT\""],"info":{}}
{"id":"train_4203","question":"Taungoo Dynasty covers what area?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q519718 wdt:P2046 ?obj }","paraphrases":["What area does Taungoo Dynasty cover?"],"info":{}}
{"id":"train_4204","question":"What group of people died in Tenochtitlan?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P20 wd:Q13695 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who are the people that died in Tenochtitlan?"],"info":{}}
{"id":"train_4205","question":"Who is Neil Young's spouse?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q633 wdt:P451 ?ans_1 . wd:Q633 wdt:P26 ?ans_2 }","paraphrases":["Who is married to Neil Young?"],"info":{}}
{"id":"train_4207","question":"Is 15 service life of the Intelsat 15?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q195783 wdt:P5069 ?obj filter ( ?obj = 15 ) }","paraphrases":["Is the Intelstat's service life 15?"],"info":{}}
{"id":"train_4209","question":"What was the monetary prize worth that William Henry Bragg received for winning the Nobel Prize in Physics?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q133747 p:P166 ?s . ?s ps:P166 wd:Q38104 . ?s pq:P2121 ?value1 . ?s pq:P1706 ?value2 }","paraphrases":["Did the disciple Zeno of Citium die in 1-1-232?"],"info":{}}
{"id":"train_4212","question":"When did Fahrenheit 451 win the Prometheus Award?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q202009 p:P166 ?s . ?s ps:P166 wd:Q19360203 . ?s pq:P585 ?value }","paraphrases":["Fahrenheit 451 won the Prometheus Award in which year?"],"info":{}}
{"id":"train_4214","question":"Who gave the{located in} of {participant of event} of {Annemarie Moser-Pröll} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q9586 wdt:P1344 ?X . ?X wdt:P276 ?answer }","paraphrases":["Who gave the{located in} of {member of occasion} of {Annemarie Moser-Pröll} ?"],"info":{}}
{"id":"train_4215","question":"What is the horse  characters of Madame Sans-Gêne play ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3136222 wdt:P674 ?X . ?X wdt:P3091 ?answer }","paraphrases":["What role do the horse characters play in Madam Sans-Gêne?"],"info":{}}
{"id":"train_4216","question":"What sovereign states does the US Declaration of Independence apply to","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q127912 wdt:P1001 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What majestic states does the US Affirmation of Autonomy apply to"],"info":{}}
{"id":"train_4217","question":"Where in Venice is Casada Nova?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P551 wd:Q641 . ?sbj wdt:P31 wd:Q58439237 }","paraphrases":["In what area of Venice is Casada Nova located?"],"info":{}}
{"id":"train_4218","question":"Is it true that the total expenditure of the Central Catholic High School is less than 4272234.24?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q5060518 wdt:P2402 ?obj filter ( ?obj < 4272234.24 ) }","paraphrases":["Is Central Catholic High School's total expenditure less than 4272234.24?"],"info":{}}
{"id":"train_4221","question":"How many anatomical locations are by the thymus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P927 wd:Q163987 }","paraphrases":["By the thymus how many anatomical locations are there?"],"info":{}}
{"id":"train_4222","question":"who coach of player of Simone Biles ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7520267 wdt:P54 ?X . ?X wdt:P286 ?answer }","paraphrases":["who coach of player of Simone Biles ?"],"info":{}}
{"id":"train_4223","question":"Is it true that the thermal design power of AMD Ryzen Threadripper 1920X is less than 216?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q56062735 wdt:P2229 ?obj filter ( ?obj < 216.0 ) }","paraphrases":["Is 216 greater than the thermal design power of AMD Ryzen Threadripper 1920X?"],"info":{}}
{"id":"train_4225","question":"What is the name of the sovereign state located in Benghazi?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q40816 wdt:P131 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":["What is Benghazi's sovereign state?"],"info":{}}
{"id":"train_4226","question":"Who are the founders of Benelux, which has an inflation rate of consumer price index of 1.4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13116 wdt:P112 ?answer . ?answer wdt:P1279 ?x FILTER ( contains ( ?x , '1.4' ) ) }","paraphrases":["Who are the founders of Benelux, which has an inflation rate of customer price index of 1.4?"],"info":{}}
{"id":"train_4227","question":"Which is the corporation for the products produced by Coca-Cola?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1056 wd:Q2813 . ?sbj wdt:P31 wd:Q167037 }","paraphrases":["Which is the organization for the items delivered by Coca-Cola?"],"info":{}}
{"id":"train_4228","question":"Does Christian Slater play a musician character called The Name of the Rose?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q172850 wdt:P674 ?answer . ?answer wdt:P175 wd:Q204590 }","paraphrases":["Does Christian Slater play a performer character called The Title of the Rose?"],"info":{}}
{"id":"train_4230","question":"When did Alexander Fleming win the Nobel Prize, was it for Physiology or Medicine, and what was the cash prize?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q37064 p:P166 ?s . ?s ps:P166 wd:Q80061 . ?s pq:P585 ?value1 . ?s pq:P2121 ?value2 }","paraphrases":["When did Alexander Fleming win the Nobel Prize, was once it for Physiology or Medicine, and what used to be the cash prize?"],"info":{}}
{"id":"train_4231","question":"When did begin Louis VII of France his reign as the king of the Franks and when did his reign end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q134259 p:P39 ?s . ?s ps:P39 wd:Q22923081 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When did start Louis VII of France his reign as the king of the Franks and when did his reign end?"],"info":{}}
{"id":"train_4232","question":"what is the statement for subject of Kuwait which has diplomatic relation as Mexico?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q817 p:P530 ?s . ?s ps:P530 wd:Q96 . ?s pq:P805 ?value }","paraphrases":["what is the explanation for subject of Kuwait which has conciliatory connection as Mexico?"],"info":{}}
{"id":"train_4235","question":"who is diplomatic relation of originate of The Shawshank Redemption?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q172241 wdt:P495 ?X . ?X wdt:P530 ?answer }","paraphrases":["who is political connection of begin of The Shawshank Redemption?"],"info":{}}
{"id":"train_4237","question":"Tell me metabolite whose name has the word violaxanthin in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q407595 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'violaxanthin' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know metabolite whose title has the word violaxanthin in it."],"info":{}}
{"id":"train_4239","question":"Where is {land} {adjacent to} {Villanova University} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1466001 wdt:P17 ?X . ?X wdt:P47 ?answer }","paraphrases":["Where is { land } adjacent to { University of Villanova }?"],"info":{}}
{"id":"train_4241","question":"When was William Henry Bragg employed at the University of Leeds and when did it end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q133747 p:P108 ?s . ?s ps:P108 wd:Q503424 . ?s pq:P582 ?value1 . ?s pq:P580 ?value2 }","paraphrases":["When was William Henry Bragg utilized at the College of Leeds and when did it conclusion?"],"info":{}}
{"id":"train_4242","question":"What human was killed by commodus?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P157 wd:Q1434 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["What human was slaughtered by commodus?"],"info":{}}
{"id":"train_4246","question":"Which outer planet has the most flattening?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q30014 . ?ent wdt:P1102 ?obj } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Which is the most flattening outer planet?"],"info":{}}
{"id":"train_4247","question":"Which {record label} and the {genre} is of {Radiohead} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q44190 wdt:P264 ?ans_1 . wd:Q44190 wdt:P136 ?ans_2 }","paraphrases":["Which record label does Radiohead belong to and which genre?"],"info":{}}
{"id":"train_4248","question":"What was Dmitry Merezhkovsky nominated for on 1-1-1937?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q326459 p:P1411 ?s . ?s ps:P1411 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1937' ) ) }","paraphrases":["Dmitry Merezhovsky was nominated for what in 1937?"],"info":{}}
{"id":"train_4252","question":"What is the election to the Parliament of Catalonia with the lowest eligible voters whose candidate is Socialists' Party of Catalonia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q5116010 . ?ent wdt:P1867 ?obj . ?ent wdt:P726 wd:Q2055003 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Give the name of the election of the Parliament of Catalonia whose candidate is on the Socialists and has the lowest eligible voters."],"info":{}}
{"id":"train_4253","question":"what are the cold war which start with the letter g","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4176199 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'g' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Which cold war starts with \"g\"?"],"info":{}}
