{"id":"train_21280","question":"How many careers are related to poultry farming?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P101 wd:Q861182 }","paraphrases":["How many professions are related to poultry farming?"],"info":{}}
{"id":"train_21283","question":"What type of Austrian award has an elm?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q131113 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P17 wd:Q40 }","paraphrases":["An elm is what type of Austrian award?"],"info":{}}
{"id":"train_21284","question":"When was Muhammad bin Tughluq born, according to the Julian calendar?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q381830 p:P569 ?s . ?s ps:P569 ?obj . ?s pq:P31 wd:Q26961029 }","paraphrases":["Muhammad bin Tughluq was born  on what date?"],"info":{}}
{"id":"train_21286","question":"who is film producer for part of series to Make Two Hearts ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q15879018 wdt:P179 ?X . ?X wdt:P162 ?answer }","paraphrases":["Who produced \"Make Two Hearts?\""],"info":{}}
{"id":"train_21288","question":"What is the name of a human that contains the word vitellius in their name.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'vitellius' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the title of a human that contains the word vitellius in their name."],"info":{}}
{"id":"train_21289","question":"Which is the academic subject of the disciples of Dmitry Anuchin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q561470 wdt:P802 ?X . ?X wdt:P101 ?answer }","paraphrases":["What was the subject studied by the disciples of Dmitry Anuchin?"],"info":{}}
{"id":"train_21290","question":"what is an aircraft functional class that starts with the letter t.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q20027953 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 't' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is a functional aircraft class starting with letter t."],"info":{}}
{"id":"train_21293","question":"Which is the GEPRIS organization ID for Humboldt University of Berlin?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q152087 wdt:P4871 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21295","question":"Who participated in the Babi Yar conflict in WW2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q48766 wdt:P607 ?answer . ?answer wdt:P1792 wd:Q6620691 }","paraphrases":["Who taken an interest within the Babi Yar strife in WW2?"],"info":{}}
{"id":"train_21296","question":"What are the federal holidays in the United States which start with the letter thanksgiving","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q5440534 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'thanksgiving' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the government occasions in the United States which begin with the letter thanksgiving"],"info":{}}
{"id":"train_21297","question":"Which is {place of marriage} and {end cause} of {{Lindsey Vonn} has {spouse} as {Thomas Vonn}}?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q10068 p:P26 ?s . ?s ps:P26 wd:Q354865 . ?s pq:P2842 ?value1 . ?s pq:P1534 ?value2 }","paraphrases":["What led to the marriage of Lindsey Vonn and her spouse Thomas Vonn, and where did they get married?"],"info":{}}
{"id":"train_21298","question":"What is Rush Limbaugh's Abyssinian pet","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q319072 wdt:P1429 ?obj . ?obj wdt:P31 wd:Q7955 }","paraphrases":["What is Surge Limbaugh's Abyssinian pet"],"info":{}}
{"id":"train_21299","question":"Which is confused with ivory , that has made from Elephantidae?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q82001 wdt:P1889 ?answer . ?answer wdt:P1582 wd:Q2372824 }","paraphrases":["Which is befuddled with ivory , that has made from Elephantidae?"],"info":{}}
{"id":"train_21300","question":"Does the publication interval of the Supernanny equal to 1.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q819092 wdt:P2896 ?obj filter ( ?obj = 1.2 ) }","paraphrases":["Does the distribution interim of the Supernanny rise to to 1.2?"],"info":{}}
{"id":"train_21301","question":"What is the item operator F / A Hornet of greeks culture?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q46397 wdt:P137 ?answer . ?answer wdt:P172 wd:Q539051 }","paraphrases":["What is the thing administrator F / A Hornet of greeks culture?"],"info":{}}
{"id":"train_21302","question":"how many connections do you have with USB-C?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P2935 wd:Q20026619 }","paraphrases":["What is the number of connections you can have with USB-C?"],"info":{}}
{"id":"train_21303","question":"What is effect of verb ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P1542 wd:Q24905 }","paraphrases":[],"info":{}}
{"id":"train_21304","question":"What landlocked country replaced Czechoslovakia","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1365 wd:Q33946 . ?sbj wdt:P31 wd:Q123480 }","paraphrases":["Name the landlocked country that substituted Czechoslovakia."],"info":{}}
{"id":"train_21305","question":"What are the administrative divisions of Kōchi Prefecture? The complete title is 室戸市.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q134093 wdt:P150 ?answer . ?answer wdt:P1448 ?x FILTER ( contains ( ?x , '室戸市' ) ) }","paraphrases":["What are the regulatory divisions of Kōchi Prefecture? The total title is 室戸市."],"info":{}}
{"id":"train_21306","question":"Who is the Secretary-General of the United Nations?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q81066 wdt:P1308 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the Secretary-General of the Joined together Nations?"],"info":{}}
{"id":"train_21307","question":"When was Apocalypse Now received the Academy Award for Best Sound Mixing?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q182692 p:P166 ?s . ?s ps:P166 wd:Q830079 . ?s pq:P1346 ?value }","paraphrases":["On which date did Apocalypse Now received the Academy Award for Best Sound Mixing?"],"info":{}}
{"id":"train_21308","question":"What are thewater deity which start with the letter'y","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1916821 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'y' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What is the water deity that begins with the letter y"],"info":{}}
{"id":"train_21309","question":"Which is the ambitus for Silent Night?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q172152 wdt:P2279 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21310","question":"What are the relativistic wave equation which start with the letter e","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q7310838 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'e' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the relativistic wave equation which begin with the letter e"],"info":{}}
{"id":"train_21312","question":"Are prednisone and ibrutinib used to treat lymphoma?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q208414 wdt:P2176 wd:Q424972 . wd:Q208414 wdt:P2176 wd:Q5984881 }","paraphrases":["Is lymphoma treated by prednisone and ibrutinib?"],"info":{}}
{"id":"train_21313","question":"Does the interest rate of the DKB Cash equal 0.2?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q56489310 wdt:P5899 ?obj filter ( ?obj = 0.2 ) }","paraphrases":["Does the intrigued rate of the DKB Cash rise to 0.2?"],"info":{}}
{"id":"train_21314","question":"What associated football team does Lionel Messi play for?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q615 wdt:P54 ?obj . ?obj wdt:P31 wd:Q15944511 }","paraphrases":["What related football group does Lionel Messi play for?"],"info":{}}
{"id":"train_21315","question":"What is the extinct spoken language used with the Egyptian hieroglyphs?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q132659 wdt:P407 ?obj . ?obj wdt:P31 wd:Q45762 }","paraphrases":["What is the terminated talked dialect utilized with the Egyptian hieroglyphs?"],"info":{}}
{"id":"train_21317","question":"Where did Margaret Thatcher die?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7416 wdt:P20 ?X . ?X wdt:P178 ?answer }","paraphrases":["Where did Margaret Thatcher die?"],"info":{}}
{"id":"train_21318","question":"Which sculptor, located in East Longmeadow, created the sculpture known as Battleship?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q953491 wdt:P170 ?answer . ?answer wdt:P159 wd:Q2302480 }","paraphrases":["Which artist, found in East Longmeadow, made the form known as Battleship?"],"info":{}}
{"id":"train_21321","question":"who affiliated with of member of Yale University ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q49112 wdt:P463 ?X . ?X wdt:P1416 ?answer }","paraphrases":["Who is affiliated with someone from Yale?"],"info":{}}
{"id":"train_21322","question":"Why are books writen about Salvador Dali","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q5577 wdt:P800 ?X . ?X wdt:P180 ?answer }","paraphrases":["Why are books writen almost Salvador Dali"],"info":{}}
{"id":"train_21323","question":"When was George Hamilton-Gordon, 4th Earl of Aberdeen as the Prime Minister of the United Kingdom?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q24631 p:P39 ?s . ?s ps:P39 wd:Q14211 . ?s pq:P580 ?value }","paraphrases":["On what date became George Hamilton-Gordon, 4th Earl of Aberdeen,  the Prime Minister of the UK?"],"info":{}}
{"id":"train_21325","question":"Who took part of Fanny Blankers-Koen, which dissolved on August 3rd, 1952","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q229046 wdt:P1344 ?answer . ?answer wdt:P582 ?x FILTER ( contains ( YEAR ( ?x ) , '1952' ) ) }","paraphrases":["Who took portion of Fanny Blankers-Koen, which broken down on Eminent 3rd, 1952"],"info":{}}
{"id":"train_21327","question":"what are the war deity which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q41863069 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["what are the war deity which begin with the letter z"],"info":{}}
{"id":"train_21330","question":"Which is the Reaxys registry number of the diamorphine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q60168 wdt:P1579 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21331","question":"When did Carlo Ponti Sr. marry Giuliana Fiastri","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q299419 p:P26 ?s . ?s ps:P26 wd:Q22808138 . ?s pq:P580 ?value }","paraphrases":["What year did Carlo Ponti Sr. and Guilana Fiastri marry?"],"info":{}}
{"id":"train_21332","question":"TELL ME THE THERMODYNAMIC PROCESS WHICH CONTAINS THE WORD PROCESS IN THER NAME","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q213016 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'process' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["TELL ME THE THERMODYNAMIC PROCESS WHICH CONTAINS THE WORD PROCESS IN THER NAME"],"info":{}}
{"id":"train_21335","question":"What did Jawaharlal Nehru major in at City Law College?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q1047 p:P69 ?s . ?s ps:P69 wd:Q5123253 . ?s pq:P812 ?value1 . ?s pq:P512 ?value2 }","paraphrases":["What was the importance of Jawaharlal Nehru at City Law College?"],"info":{}}
{"id":"train_21336","question":"Mention the person unlike of Ian Thorpe","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1889 wd:Q185044 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Say the individual not at all like of Ian Thorpe"],"info":{}}
{"id":"train_21338","question":"who are the diplomats of the russian empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P530 wd:Q34266 . ?sbj wdt:P31 wd:Q48349 }","paraphrases":["Give me the names of the diplomats of the russian empire."],"info":{}}
{"id":"train_21339","question":"Who is the organizer of the Grand Tour for Amaury Sport Organisation that has the word de in their name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q866427 . ?sbj wdt:P664 wd:Q372681 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'de' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Who is the organizer of the Grand Tour for Amaury Sport Organisation that has the word de in their name?"],"info":{}}
{"id":"train_21340","question":"The order of Druze's religion is known as?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q163943 wdt:P140 ?obj . ?obj wdt:P31 wd:Q2061186 }","paraphrases":["What is the religion Druze's order?"],"info":{}}
{"id":"train_21341","question":"Tell me about child of Lu Xun and mother?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q23114 p:P40 ?s . ?s ps:P40 ?obj . ?s pq:P25 ?value1 . }","paraphrases":["Tell me about baby of Lu Xun and mother?"],"info":{}}
{"id":"train_21344","question":"Tell me the dimension of the topic called introduction to entropy.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6058959 wdt:P1269 ?X . ?X wdt:P4020 ?answer }","paraphrases":["I would like to know in the introduction to entropy what the dimension of the topic is."],"info":{}}
{"id":"train_21345","question":"Is the neutron number of the neutron one?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2348 wdt:P1148 ?obj filter ( ?obj = 1 ) }","paraphrases":["Is one the neutron number of the neutron?"],"info":{}}
{"id":"train_21346","question":"What is the  Léonore ID of Siméon Denis Poisson ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q190772 wdt:P640 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21347","question":"What position did Charles X of France take over on 1824-9-16?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q7758 p:P39 ?s . ?s ps:P39 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1824' ) ) }","paraphrases":["What title did Charles X of France assume on 1824-16?"],"info":{}}
{"id":"train_21348","question":"Who are the authors of The Colorado Kid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q464557 wdt:P50 ?X . ?X wdt:P800 ?answer }","paraphrases":["Who are the creators of The Colorado Kid?"],"info":{}}
{"id":"train_21349","question":"Which is the sovereign state for the country that started The Star-Spangled Banner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q44696 wdt:P495 ?obj . ?obj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_21350","question":"Name the person who is responsible for the editor-ship of The Guardian","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11148 wdt:P98 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is responsible for the editor-ship of The Guardian?"],"info":{}}
{"id":"train_21351","question":"What is cast member of Alarm für Cobra 11 – Die Autobahnpolizei that is character role is Jenny Dorn ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q156155 p:P161 ?s . ?s ps:P161 ?obj . ?s pq:P453 wd:Q34465708 }","paraphrases":["What cast member played Jenny Dorn?"],"info":{}}
{"id":"train_21355","question":"What job did Bernard Bolzano have on 1805-4-7?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q184735 p:P106 ?s . ?s ps:P106 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1805' ) ) }","paraphrases":["Where did Bernard Bolzano work on 1805-4-7?"],"info":{}}
{"id":"train_21356","question":"who total fertility rate of nationality of Chris hardwick ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q313049 wdt:P27 ?X . ?X wdt:P4841 ?answer }","paraphrases":["Who is Chris hardwick's total fertility rate?"],"info":{}}
{"id":"train_21358","question":"Tell me  website whose name has the word  willy in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q35127 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'willy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know site whose title has the word willy in it."],"info":{}}
{"id":"train_21359","question":"Does the daily patronage of the akezawa Station equal 31?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q845007 wdt:P1373 ?obj filter ( ?obj = 31 ) }","paraphrases":["Does the day by day support of the akezawa Station rise to 31?"],"info":{}}
{"id":"train_21362","question":"What is the birth city of Charles IV which is in the state Čimice?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q155669 wdt:P19 ?answer . ?answer wdt:P150 wd:Q2440414 }","paraphrases":["What is the birth city of Charles IV which is within the state Čimice?"],"info":{}}
{"id":"train_21363","question":"What award did the United States Air Force Academy receive on 8/31/1998?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1331280 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '1998' ) ) }","paraphrases":["Name the award that was received by the United Air Force Academy in 1998?"],"info":{}}
{"id":"train_21367","question":"in which year Jaroslav Heyrovský was nominated for  Nobel Prize in Chemistry?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q157701 p:P1411 ?s . ?s ps:P1411 wd:Q44585 . ?s pq:P585 ?value }","paraphrases":["When was Jaroslav Heyrovsky considered for the Nobel Prize in Chemistry?"],"info":{}}
{"id":"train_21369","question":"What is the highest paying job that requires a certificate op aptiude for secondary school teaching","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q28640 . ?ent wdt:P3618 ?obj . ?ent wdt:P4968 wd:Q2946825 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["what is the largest earning salary career that needs a certificate op aptiude for secondary school teaching"],"info":{}}
{"id":"train_21370","question":"Name a short story collection illustrated by John Lockwood Kipling that starts with letter B","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1279564 . ?sbj wdt:P110 wd:Q538533 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'b' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Title a brief story collection outlined by John Lockwood Kipling that begins with letter B"],"info":{}}
{"id":"train_21371","question":"Is it true that the maximum thrust of Typhoon equals to 180000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q151384 wdt:P2228 ?obj filter ( ?obj = 180000 ) }","paraphrases":["Is 180000 the maximum thrust of Typhoon?"],"info":{}}
{"id":"train_21372","question":"What condition does cocaine treat and what significant drug interactions does it have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q41576 wdt:P2175 ?ans_1 . wd:Q41576 wdt:P769 ?ans_2 }","paraphrases":["What condition is treated by cocaine?"],"info":{}}
{"id":"train_21373","question":"What is the trend  of the professor  of Aratus ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q180671 wdt:P1066 ?X . ?X wdt:P135 ?answer }","paraphrases":["Name the professor of Aratus' trend."],"info":{}}
{"id":"train_21374","question":"When was Jessica Chastain nominated for the Academy Award for Best Supporting Actress?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q229313 p:P1411 ?s . ?s ps:P1411 wd:Q106301 . ?s pq:P585 ?value }","paraphrases":["Jessica Chastain was nominated for the Academy Award for Best Supporting Actress in what year?"],"info":{}}
{"id":"train_21375","question":"What was Ethiopia's ethnic makeup in 2007?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q115 p:P172 ?s . ?s ps:P172 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2007' ) ) }","paraphrases":["In 2007, what was Ethiopia's genetic makeup?"],"info":{}}
{"id":"train_21376","question":"Nicolas Sarkozy was involved in which politic-finance scandal?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q329 wdt:P793 ?obj . ?obj wdt:P31 wd:Q2826027 }","paraphrases":["Nicolas Sarkozy was included in which politic-finance scandal?"],"info":{}}
{"id":"train_21378","question":"Is the number of clubs in the rugby union in Namibia equal to 28","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q2174887 wdt:P4999 ?obj filter ( ?obj = 28 ) }","paraphrases":["Does the number of clubs in the rugby union in Namibia equal 28?"],"info":{}}
{"id":"train_21380","question":"What is the voting round with the least number of blank votes that is part in the Governor election in  2014 in Acre?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q24097670 . ?ent wdt:P5045 ?obj . ?ent wdt:P361 wd:Q51336711 } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["In the election for Governor of Acre in 2014, which voting round had the least number of blank votes?"],"info":{}}
{"id":"train_21381","question":"I need to know Blind Lemon Jefferson's All About Jazz' musician ID.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q45001 wdt:P5121 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21382","question":"Is Rodrigo Duterte a child of Sara Duterte-Carpio and Christopher Go?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q457786 wdt:P40 wd:Q1491004 . wd:Q457786 wdt:P40 wd:Q24896679 }","paraphrases":["Are Sara Duterte-Carpio and Christopher Go Rodrigo Duterte's parents?"],"info":{}}
{"id":"train_21383","question":"Tell me government structure whose name has the word technocracy in it.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q19944802 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'technocracy' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know government structure whose title has the word technocracy in it."],"info":{}}
{"id":"train_21384","question":"What lived in Florence Nightingale, Florence Nightingale diplomatic relation in Bangladesh","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q37103 wdt:P551 ?answer . ?answer wdt:P530 wd:Q902 }","paraphrases":["What lived in Florence Nightingale, Florence Nightingale diplomatic relation in Bangladesh"],"info":{}}
{"id":"train_21385","question":"Which city is the capital of the Austrian Empire?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P1376 wd:Q131964 . ?sbj wdt:P31 wd:Q262882 }","paraphrases":[],"info":{}}
{"id":"train_21387","question":"What is Chronicling America ID for the New York Times?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q9684 wdt:P4898 ?answer }","paraphrases":[],"info":{}}
{"id":"train_21388","question":"What is the valid in period for Los Angeles with its time zone UTC−07:00?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q65 p:P421 ?s . ?s ps:P421 wd:Q2212 . ?s pq:P1264 ?value }","paraphrases":["What is the time in LA when its UTC-07:00?"],"info":{}}
