{"id":"train_20171","question":"What are the state function which start with the letter z","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q230937 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'z' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["WHICH IS THE STATE FUNCTION THAT START WITH THE LETTER Z"],"info":{}}
{"id":"train_20172","question":"Who is the first person which contains the word phoroneus in his name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q4349921 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'phoroneus' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Who is the primary individual which contains the word phoroneus in his name?"],"info":{}}
{"id":"train_20175","question":"What is divided into  diplomatic relation of Belarus ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q184 wdt:P530 ?X . ?X wdt:P150 ?answer }","paraphrases":["What is diplomatic relation divided into in Belarus?"],"info":{}}
{"id":"train_20176","question":"What is the birth date of the child of Abigail Adams and Charles Adams?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q206191 p:P40 ?s . ?s ps:P40 wd:Q5074968 . ?s pq:P569 ?value1 . ?s pq:P22 ?value2 }","paraphrases":["What is the birth date of the child of Abigail Adams and Charles Adams?"],"info":{}}
{"id":"train_20177","question":"What was Rama's next series after Balabhadra?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q160213 p:P179 ?s . ?s ps:P179 wd:Q26701417 . ?s pq:P156 ?value }","paraphrases":["Which was Rama's following series after Balabhadra"],"info":{}}
{"id":"train_20178","question":"who association football club for member of sports team of alan shearer?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q483583 wdt:P54 ?obj . ?obj wdt:P31 wd:Q476028 }","paraphrases":["What football team does Alan Shearer play for?"],"info":{}}
{"id":"train_20180","question":"Name a sovereign state in which English is the official language of.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P37 wd:Q1860 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_20184","question":"How many locations are nearby County Down?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P276 wd:Q190684 }","paraphrases":["County Down is nearby how many locations?"],"info":{}}
{"id":"train_20185","question":"Can you tell me where Hildegarf Knef resided up until January 1st, 2001?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q57604 p:P551 ?s . ?s ps:P551 ?obj . ?s pq:P582 ?x filter ( contains ( YEAR ( ?x ) , '2002' ) ) }","paraphrases":["Can you tell me where the hard knef resided up until January 1st, 2001"],"info":{}}
{"id":"train_20189","question":"what is the etymology of fermi gas,that has language written in Italian?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1072904 wdt:P138 ?answer . ?answer wdt:P1412 wd:Q652 }","paraphrases":["what is the historical underpinnings of fermi gas,that has dialect composed in Italian?"],"info":{}}
{"id":"train_20190","question":"What are the region covered by Lighthouse of Alexandria which is located in twin cities in Kazanlak?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q43244 wdt:P131 ?answer . ?answer wdt:P190 wd:Q192926 }","paraphrases":["What are the location blanketed by means of Lighthouse of Alexandria which is positioned in twin cities in Kazanlak?"],"info":{}}
{"id":"train_20191","question":"\"Who's husband is Paul Simon, and has a number of children+0 that are 1.0 ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4028 wdt:P26 ?answer . ?answer wdt:P1971 ?x FILTER ( contains ( ?x , '1.0' ) ) }","paraphrases":["\"Who is Paul Simon's husband and has a number of kids+0 who are 1.0?\""],"info":{}}
{"id":"train_20192","question":"What was the position of Philip IV of France who was born in1268?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q130969 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( YEAR ( ?x ) , '1268' ) ) . ?s pq:P31 ?value }","paraphrases":["give me the position details of Philip IV of France born in 1268?"],"info":{}}
{"id":"train_20193","question":"Tell me the legal right influenced by Richard Dawkins?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P737 wd:Q44461 . ?sbj wdt:P31 wd:Q22059430 }","paraphrases":[],"info":{}}
{"id":"train_20194","question":"What is Michael Faraday's EGAXA ID?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q8750 wdt:P1309 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20198","question":"When did educated at of Paolo Gentiloni and academic major?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q1071031 p:P69 ?s . ?s ps:P69 ?obj . ?s pq:P812 ?value1 . }","paraphrases":["When did taught at of Paolo Gentiloni and scholarly major?"],"info":{}}
{"id":"train_20201","question":"What political figure was part of the First Crusade?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51649 wdt:P710 ?X . ?X wdt:P39 ?answer }","paraphrases":["Which political figure participated in the First Crusade?"],"info":{}}
{"id":"train_20202","question":"Where is the terminus location for the Channel Tunnel?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q10257 wdt:P609 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20203","question":"What { time point } has { population } as { 3.12311e+06 } for { Sohag Governorate }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q30669 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '3.12311e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["When did Sohag Governorate have a population of 3.12311e+06?"],"info":{}}
{"id":"train_20205","question":"Which characters has Jerry Seinfeld played?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P170 wd:Q215506 . ?sbj wdt:P31 wd:Q15711870 }","paraphrases":["Which characters has Jerry Seinfeld played?"],"info":{}}
{"id":"train_20206","question":"Who is the daughter-in-law of Frederick III, Holy Roman Emperor, whose sister or brother is Friedrich von Brandenburg-Ansbach?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q150966 wdt:P1038 ?answer . ?answer wdt:P3373 wd:Q1463615 }","paraphrases":["Who is the daughter-in-law of Frederick III, Holy Roman Emperor, whose sister or brother is Friedrich von Brandenburg-Ansbach?"],"info":{}}
{"id":"train_20208","question":"The Canary Islands contain how many locations?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P276 wd:Q5813 }","paraphrases":["How many islands exist in the group known as The Canary Islands?"],"info":{}}
{"id":"train_20210","question":"What are the modern language which start with the letter thai","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1288568 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'thai' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the present day dialect which begin with the letter thai"],"info":{}}
{"id":"train_20212","question":"What were the characteristics of the historical inhabitants of Macau?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1369628 wdt:P1269 ?X . ?X wdt:P1082 ?answer }","paraphrases":["List the characteristics of the historical inhabitants of Macau?"],"info":{}}
{"id":"train_20214","question":"what is Atlanta's territorial entity and time zone?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q23556 wdt:P131 ?ans_1 . wd:Q23556 wdt:P421 ?ans_2 }","paraphrases":["In what state and time zone is Atlanta in?"],"info":{}}
{"id":"train_20215","question":"Which is {time zone} of {Arizona State University} {land} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q670897 wdt:P17 ?X . ?X wdt:P421 ?answer }","paraphrases":["What time zone is Arizona State University in"],"info":{}}
{"id":"train_20216","question":"Who is Jennifer Hudson's spouse or partner?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q192410 wdt:P451 ?ans_1 . wd:Q192410 wdt:P26 ?ans_2 }","paraphrases":["Who is Jennifer Hudson romantically involved with?"],"info":{}}
{"id":"train_20219","question":"Which is {has towns} of {nationality} of {Rollo May} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1059597 wdt:P27 ?X . ?X wdt:P150 ?answer }","paraphrases":["Which is {has towns} of {nationality} of {Rollo May} ?"],"info":{}}
{"id":"train_20220","question":"\"What is {forename} of {John of Scotland}, whichhas {is said to be the same as} is {Hanns} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q310065 wdt:P735 ?answer . ?answer wdt:P460 wd:Q16276296 }","paraphrases":["\"What is { forename } of { John of Scotland }, which is { the same as } { Hanns }?\""],"info":{}}
{"id":"train_20221","question":"What is the platform ID for GAMECIP on XBOX?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q132020 wdt:P5379 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20222","question":"What is Uniform Resource Identifier Scheme  for transport layer security?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q206494 wdt:P4742 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20223","question":"What is the place of death of Kurt Vonnegut whose country is United States of America?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q49074 p:P20 ?s . ?s ps:P20 ?obj . ?s pq:P17 wd:Q30 }","paraphrases":["Where in the USA did Kurt Vonnegut die"],"info":{}}
{"id":"train_20224","question":"What are the municipalities in the History of Northern Ireland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1468953 wdt:P1269 ?X . ?X wdt:P150 ?answer }","paraphrases":["What are the districts within the History of Northern Ireland?"],"info":{}}
{"id":"train_20228","question":"What award did Henry Shefflin receive in 2006?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q967636 p:P166 ?s . ?s ps:P166 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2006' ) ) }","paraphrases":["Henry Shefflin won what award in 2006?"],"info":{}}
{"id":"train_20229","question":"what is the topic of history  and opposite of capitalism?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q6206 wdt:P2184 ?ans_1 . wd:Q6206 wdt:P461 ?ans_2 }","paraphrases":["The opposite of capitalism and the topic of history is this."],"info":{}}
{"id":"train_20230","question":"What are the Greco-Roman mysteries which start with the letter mysteries","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q505821 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'mysteries' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the Greco-Roman secrets which begin with the letter mysteries"],"info":{}}
{"id":"train_20231","question":"who doctoral student of advisor of Johannes diderik van der waals ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q131721 wdt:P184 ?X . ?X wdt:P185 ?answer }","paraphrases":["who doctoral understudy of advisor of Johannes diderik van der waals ?"],"info":{}}
{"id":"train_20233","question":"To what mother was Charlemange born in Italy?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q3044 p:P40 ?s . ?s ps:P40 wd:Q299645 . ?s pq:P569 ?value1 . ?s pq:P25 ?value2 }","paraphrases":["To what mother was Charlemange born in Italy?"],"info":{}}
{"id":"train_20234","question":"What is {antonym of} which {has symptom} of {friction} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q82580 wdt:P1542 ?X . ?X wdt:P461 ?answer }","paraphrases":["what is the antonym for friction?"],"info":{}}
{"id":"train_20235","question":"Which data is externally available on Johann Sebastian Bach?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1339 wdt:P1325 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20236","question":"what is the {start time} for {Yakutsk} which has {located in the administrative territorial entity} as {Sakha Republic} ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q6610 p:P131 ?s . ?s ps:P131 wd:Q6605 . ?s pq:P580 ?value }","paraphrases":["What is the {begin time} for {Yakutsk} which has {found within the authoritative regional substance} as {Sakha Republic} ?"],"info":{}}
{"id":"train_20237","question":"In 1874 the McIntosh family moved to 2 Firpark Street, Dennistoun, from which William McIntosh rented part of the grounds of Golfhill House. There he grew flowers in which his family were encouraged to take an interest, the origin of Mackintosh's life-long interest in botanical forms as a subject matter for the watercolours and sources for his decorative work. At the age of seven Mackintosh was sent first to Reid's School, and then to Alan Glen's, despite suffering from dyslexia. There a chill on the sportsfield resulted in a slight droop of the right eyelid visible in some photographs.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q220703 wdt:P5308 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20242","question":"What was the population of Tehran in 2006?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q3616 p:P1082 ?s . ?s ps:P1082 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2006' ) ) }","paraphrases":["Tell me the population of Tehran in 2006."],"info":{}}
{"id":"train_20244","question":"Tell me identical twins whose name has the word veronicas in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2301325 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'veronicas' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know indistinguishable twins whose title has the word veronicas in it"],"info":{}}
{"id":"train_20245","question":"Who published","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q49081 p:P800 ?s . ?s ps:P800 wd:Q7044696 . ?s pq:P577 ?value1 . ?s pq:P123 ?value2 }","paraphrases":["How many suits Ian Rush played and how many desires he scored for Liverpool F.C"],"info":{}}
{"id":"train_20246","question":"What is the manner and place of death of Jeff Buckley?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q215855 wdt:P1196 ?ans_1 . wd:Q215855 wdt:P20 ?ans_2 }","paraphrases":["Where did Jeff Buckley die?"],"info":{}}
{"id":"train_20247","question":"Is the position angle of the southeast by south equal to 117?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q20968399 wdt:P2211 ?obj filter ( ?obj = 117.0 ) }","paraphrases":["Is the position point of the southeast by south break even with to 117?"],"info":{}}
{"id":"train_20249","question":"What is { Publication Date } of { Sonic Hedgehog } which is { Platform } is { Sega Mega Drive }?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q37123 p:P577 ?s . ?s ps:P577 ?obj . ?s pq:P400 wd:Q10676 }","paraphrases":["The release date of Sonic the Hedgehog for Sega Mega Drive"],"info":{}}
{"id":"train_20250","question":"Who is the captain of the Indian national cricket team?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P634 wd:Q1143793 }","paraphrases":[],"info":{}}
{"id":"train_20252","question":"Is Lady Gaga's residence Malibu?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q19848 wdt:P551 wd:Q387047 }","paraphrases":["Does Lady Gaa live in Malibu?"],"info":{}}
{"id":"train_20253","question":"What was the area of Hanover in 2016?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q1715 p:P2046 ?s . ?s ps:P2046 ?obj . ?s pq:P585 ?x filter ( contains ( YEAR ( ?x ) , '2016' ) ) }","paraphrases":["In 2016, what was Hanover?"],"info":{}}
{"id":"train_20254","question":"Tell me the name of the twinned administrative body of Avignon on the 4th September 1967?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q6397 p:P190 ?s . ?s ps:P190 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1967' ) ) }","paraphrases":["What was the twinned administrative body of Avignon known as on September 4th 1967?"],"info":{}}
{"id":"train_20255","question":"In which building the New York Stock Exchange is located ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P466 wd:Q13677 . ?sbj wdt:P31 wd:Q655686 }","paraphrases":["In which building the Unused York Stock Trade is found ?"],"info":{}}
{"id":"train_20256","question":"tell me hindu temple which name has the word temple in it","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q842402 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'temple' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Where is the lost plan of Acropolis of Athens?"],"info":{}}
{"id":"train_20257","question":"What is the source of income for subsidy?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P2770 wd:Q193219 }","paraphrases":[],"info":{}}
{"id":"train_20258","question":"Who is the illustrator of Charles Dana Gibson?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { ?answer wdt:P110 wd:Q151165 }","paraphrases":[],"info":{}}
{"id":"train_20259","question":"When did Antipolo have a population of 345,512?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q1636 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '345512.0' ) ) . ?s pq:P585 ?value }","paraphrases":["What was the year did Antipolo have a population of 345,512"],"info":{}}
{"id":"train_20260","question":"Which is the SI base unit measured by temperature?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q11466 wdt:P1880 ?obj . ?obj wdt:P31 wd:Q223662 }","paraphrases":[],"info":{}}
{"id":"train_20262","question":"What is the SFDb ID for ABBA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q18233 wdt:P2337 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20264","question":"Which is the phase of matter for sulfuric acid?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q4118 wdt:P515 ?answer }","paraphrases":[],"info":{}}
{"id":"train_20265","question":"Is the total expenditure of the Watch Tower Bible and Tract Society of Pennsylvania equal to 236000000?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q898067 wdt:P2402 ?obj filter ( ?obj = 236000000 ) }","paraphrases":["Is 236000000 the total expenditure of the Watch Tower Bible and Tract Society of Pennsylvania?"],"info":{}}
{"id":"train_20268","question":"Frank Lloyd Wright, the famous architect's house, is located where?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P84 wd:Q5604 . ?sbj wdt:P31 wd:Q3947 }","paraphrases":["Where is Frank Lloyd Wright's house?"],"info":{}}
{"id":"train_20269","question":"What is the total fertility rate of the country that originated hard rock?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q83270 wdt:P495 ?X . ?X wdt:P4841 ?answer }","paraphrases":["What is the overall richness rate of the nation that begun difficult rock?"],"info":{}}
{"id":"train_20270","question":"What video game company is Gabe Newell associated with?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P169 wd:Q347418 . ?sbj wdt:P31 wd:Q1137109 }","paraphrases":["What video diversion company is Gabe Newell related with?"],"info":{}}
{"id":"train_20271","question":"How many are affected by bronchitis?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P1542 wd:Q173022 }","paraphrases":["Bronchitis affects how many people?"],"info":{}}
{"id":"train_20274","question":"Which tournament in New Zealand has the fewest losses?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q500834 . ?ent wdt:P1356 ?obj . ?ent wdt:P276 wd:Q664 . } ORDER BY ASC ( ?obj ) LIMIT 5","paraphrases":["Which New Zealand Tournament features the fewest losses?"],"info":{}}
{"id":"train_20275","question":"Who is the patron saint of Granada?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8810 wdt:P417 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who is the benefactor holy person of Granada?"],"info":{}}
{"id":"train_20277","question":"When did Wolfgang Pauli receive the Franklin Medal?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q65989 p:P166 ?s . ?s ps:P166 wd:Q3141777 . ?s pq:P585 ?value }","paraphrases":["The Franklin Medal was received by Wolfgang Pauli in what year?"],"info":{}}
{"id":"train_20279","question":"who is the country code top-level domain for top-level Internet domain of Czechoslovakia?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q33946 wdt:P78 ?obj . ?obj wdt:P31 wd:Q42032 }","paraphrases":["who is the nation code top-level space for top-level Web space of Czechoslovakia?"],"info":{}}
{"id":"train_20280","question":"Tell me the painting technique that contains the word wet in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q1231896 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'wet' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Let me know the portray method that contains the word damp in their name"],"info":{}}
{"id":"train_20281","question":"WHO IS THE FATHER OF THE FILM DIRECTOR OF HUMILIATION?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q13729152 wdt:P57 ?X . ?X wdt:P22 ?answer }","paraphrases":["WHO IS THE FATHER OF THE FILM Chief OF HUMILIATION?"],"info":{}}
{"id":"train_20283","question":"In which language or work, Friday has been named after number 5?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q130 p:P138 ?s . ?s ps:P138 wd:Q203 . ?s pq:P407 ?value }","paraphrases":["Which language or work was Friday named after the number 5?"],"info":{}}
{"id":"train_20284","question":"Who is Kenneth D. West Ph.D supervisor?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q6390017 wdt:P184 ?X . ?X wdt:P185 ?answer }","paraphrases":["Who is Kenneth D. West Ph.D supervisor?"],"info":{}}
{"id":"train_20285","question":"Was Marco Polo born in Venice?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q6101 wdt:P19 wd:Q641 }","paraphrases":["Is Venice Marco Polo's birthplace?"],"info":{}}
{"id":"train_20286","question":"Where did William Hogarth work on January 1, 1712?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q171344 p:P937 ?s . ?s ps:P937 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '1712' ) ) }","paraphrases":["Where was William Hogarth worked on January 1, 1712?"],"info":{}}
{"id":"train_20287","question":"What is the second given name of Robbie Williams?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q47875 p:P735 ?s . ?s ps:P735 ?obj . ?s pq:P1545 ?x filter ( contains ( ?x , '2' ) ) }","paraphrases":["Robbie Williams second given name is what?"],"info":{}}
{"id":"train_20289","question":"Guess the component that results into the initiation of the automobiles","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1420 wdt:P618 ?X . ?X wdt:P129 ?answer }","paraphrases":["Figure the component that comes about into the start of the automobiles"],"info":{}}
{"id":"train_20290","question":"Which is the combustible powder for the medical condition inflammation?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P2175 wd:Q101991 . ?sbj wdt:P31 wd:Q21073023 }","paraphrases":[],"info":{}}
