{"id":"train_5871","question":"At what point in time did Dnipro have a population of 1189000?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q48256 p:P1082 ?s . ?s ps:P1082 ?x filter ( contains ( ?x , '1.189e+06' ) ) . ?s pq:P585 ?value }","paraphrases":["Dnipro had a population of 1189000 at what point in time?"],"info":{}}
{"id":"train_5872","question":"Name a landmark located in the administrative territorial entity of Old Toronto that starts with letter C","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q2319498 . ?sbj wdt:P131 wd:Q919169 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'c' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Name a landmark located in the administrative territorial entity of Old Toronto that begins with letter C"],"info":{}}
{"id":"train_5873","question":"When was Charles VI, Holy Roman Emperor, the King of Hungary?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q150665 p:P39 ?s . ?s ps:P39 wd:Q6412254 . ?s pq:P580 ?value }","paraphrases":["What year was Charles VI King of Hungary"],"info":{}}
{"id":"train_5876","question":"Is it true that people speak German in Seychelles and Republic of Congo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q188 wdt:P17 wd:Q1042 . wd:Q188 wdt:P17 wd:Q971 }","paraphrases":["Do people speak German in Seychellas and the Republic of Congo?"],"info":{}}
{"id":"train_5877","question":"Who had a son named Timur, and whose interment was in Shahrisabz?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q8462 wdt:P40 ?answer . ?answer wdt:P119 wd:Q569766 }","paraphrases":["Who had a son called Timur, and who was in Shahrisabz's interment?"],"info":{}}
{"id":"train_5878","question":"Who is the {Wikimedia category} for {category for films shot at this location} of {Shanghai}","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q8686 wdt:P1740 ?obj . ?obj wdt:P31 wd:Q4167836 }","paraphrases":["Who is the {Wikimedia category} for {category for movies shot at this area} of {Shanghai}"],"info":{}}
{"id":"train_5879","question":"When did John Hume end his position held as Member of the Parliament of Norther Ireland?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q193630 p:P39 ?s . ?s ps:P39 wd:Q19462434 . ?s pq:P582 ?value }","paraphrases":["What was the last date of John Hume's reign as Member of the Parliament of Northern Ireland?"],"info":{}}
{"id":"train_5880","question":"Who composed \"The Magic Flute\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q5064 wdt:P86 ?obj . ?obj wdt:P31 wd:Q5 }","paraphrases":["Who wrote The Magic Flute?"],"info":{}}
{"id":"train_5881","question":"Which is the Polish scientist ID for Lech Kaczyński?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2757 wdt:P3124 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5883","question":"Which aspect of history of Latin America has scientifical studies of Latin American?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2365406 wdt:P1269 ?answer . ?answer wdt:P2579 wd:Q28617 }","paraphrases":["Which issue of records of Latin America has scientifical research of Latin American?"],"info":{}}
{"id":"train_5884","question":"Who was Barbara Walters's spouse and when did the marriage end?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?obj WHERE { wd:Q231417 p:P26 ?s . ?s ps:P26 ?obj . ?s pq:P582 ?value1 . }","paraphrases":["Who was the spouse of Barbara Walters and when was the end of the marriage?"],"info":{}}
{"id":"train_5885","question":"What is the toughest stainless steel used in the chemical industry ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q172587 . ?ent wdt:P5520 ?obj . ?ent wdt:P366 wd:Q207652 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["Name the strongest stainless steel currently used in the chemical industry."],"info":{}}
{"id":"train_5886","question":"which is the name in native language of Antonio Inoki that of  name in kana is {アントニオ いのき ?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q45207 p:P1559 ?s . ?s ps:P1559 ?obj . ?s pq:P1814 ?x filter ( contains ( ?x , 'アントニオ いのき' ) ) }","paraphrases":["which is the title in local dialect of Antonio Inoki that of title in kana is {アントニオ いのき?"],"info":{}}
{"id":"train_5887","question":"Does the collection or exhibition size of William S. soule photographs of Arapaho , Cheyenna,Kiowa,Comanche, and Apache indians equal to 0?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q59927304 wdt:P1436 ?obj filter ( ?obj = 0 ) }","paraphrases":["How large is the exhibition of William S. Soule photographs of American Indians?"],"info":{}}
{"id":"train_5889","question":"What is the birthplace of Ching Sharman, whose Wikivoyage banner is Guangdong Banner.jpg?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q266715 wdt:P19 ?answer . ?answer wdt:P948 ?x FILTER ( contains ( ?x , 'Guangdong Banner.jpg' ) ) }","paraphrases":["What is the birthplace of Ching Sharman, whose Wikivoyage banner is Guangdong Banner.jpg?"],"info":{}}
{"id":"train_5894","question":"Where was Alexander buried in Freising Cathedral?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q80028 p:P119 ?s . ?s ps:P119 wd:Q262769 . ?s pq:P585 ?value }","paraphrases":["In what part of Freising Cathedral was Alexander buried?"],"info":{}}
{"id":"train_5895","question":"Joko Widodo is the head of government of which sovereign state ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P6 wd:Q3318231 . ?sbj wdt:P31 wd:Q3624078 }","paraphrases":[],"info":{}}
{"id":"train_5896","question":"\"What is {eponym} of {Gödel, Escher, Bach}, which has {working place} is {Institute for Advanced Study} ?\"","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q831517 wdt:P138 ?answer . ?answer wdt:P108 wd:Q635642 }","paraphrases":["\"What is {eponym} of {Gödel, Escher, Bach}, which has {working put} is {Established for Progressed Consider} ?\""],"info":{}}
{"id":"train_5897","question":"How do you know Zeno of Elea's birthday is -490-0-0?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q132157 p:P569 ?s . ?s ps:P569 ?x filter ( contains ( ?x , '-490-0-0' ) ) . ?s pq:P1480 ?value }","paraphrases":["Is it true that Zeno of Elea's birthday is -490-0-0?"],"info":{}}
{"id":"train_5898","question":"Who is the role model of the author of The Iron Duke?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q7742590 wdt:P50 ?X . ?X wdt:P737 ?answer }","paraphrases":["Who is the part demonstrate of the creator of The Press Duke?"],"info":{}}
{"id":"train_5899","question":"What theme follows the Manual for Civilization?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q18615410 wdt:P156 ?X . ?X wdt:P144 ?answer }","paraphrases":["What is the theme of the Manual for Civilization?"],"info":{}}
{"id":"train_5900","question":"What is the flash point of malathion whose criterion used is lower bound?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q423005 p:P2128 ?s . ?s ps:P2128 ?obj . ?s pq:P1013 wd:Q21067468 }","paraphrases":["Malathion whose criterion used is lower bound has a flashpoint of this?"],"info":{}}
{"id":"train_5902","question":"Which talk show did Ellen DeGeneres create?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P170 wd:Q483325 . ?sbj wdt:P31 wd:Q622812 }","paraphrases":[],"info":{}}
{"id":"train_5904","question":"Who is starring in the film series The Heather Biblow Story?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q51228928 wdt:P179 ?X . ?X wdt:P161 ?answer }","paraphrases":["Who is featuring within the film arrangement The Heather Biblow Story?"],"info":{}}
{"id":"train_5905","question":"Which was the last year John Russell, 1st Earl Russell held the position of the Lord President of the Council?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q157259 p:P39 ?s . ?s ps:P39 wd:Q943379 . ?s pq:P582 ?value }","paraphrases":["John Russel, 1st Earl Russell left the position of Lord President of the Council in what year?"],"info":{}}
{"id":"train_5906","question":"For what body of government was Nizhny Novgorod the head starting on October 7, 2015?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?obj WHERE { wd:Q891 p:P6 ?s . ?s ps:P6 ?obj . ?s pq:P580 ?x filter ( contains ( YEAR ( ?x ) , '2015' ) ) }","paraphrases":["What government did Nizhny Novgorod head in 2015?"],"info":{}}
{"id":"train_5908","question":"What's Andrew Gaze's Australian Olympic Committee athlete ID.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q504835 wdt:P3682 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5909","question":"What is the date of birth and date of death of the child of Joseph Stalin, Vasily Dzhugashvili?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value1 ?value2 WHERE { wd:Q855 p:P40 ?s . ?s ps:P40 wd:Q459216 . ?s pq:P570 ?value1 . ?s pq:P569 ?value2 }","paraphrases":["What is the date of birth and date of dying of the baby of Joseph Stalin, Vasily Dzhugashvili?"],"info":{}}
{"id":"train_5912","question":"n/a","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P131 wd:Q37836 . ?sbj wdt:P31 wd:Q123705 }","paraphrases":["n/a"],"info":{}}
{"id":"train_5913","question":"How many programmers does Yuji Naka have?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?sub ) AS ?value ) { ?sub wdt:P943 wd:Q726119 }","paraphrases":["Yuji Naka has what number of programmers?"],"info":{}}
{"id":"train_5916","question":"What is portrayed by track list of Morning Musume no Hyokkori Hyōtanjima ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q1137292 wdt:P658 ?X . ?X wdt:P175 ?answer }","paraphrases":["What is depicted by track list of Morning Musume no Hyokkori Hyōtanjima ?"],"info":{}}
{"id":"train_5919","question":"What is the capital of the secular state of Montevideo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1335 wdt:P1376 ?obj . ?obj wdt:P31 wd:Q859563 }","paraphrases":["What is Montevideo's secular state capital?"],"info":{}}
{"id":"train_5920","question":"In which metropolitan region of terrain feature is Frankfurt located?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q1794 wdt:P706 ?obj . ?obj wdt:P31 wd:Q1132300 }","paraphrases":["In which metropolitan locale of landscape highlight is Frankfurt found?"],"info":{}}
{"id":"train_5923","question":"what is the field of action of the works for of Michael Stipe?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q215182 wdt:P108 ?X . ?X wdt:P452 ?answer }","paraphrases":["The work of Michael Stripe is in what field of action?"],"info":{}}
{"id":"train_5924","question":"Which platforms have software versions of Fallout release 10.14 beta 4?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q167835 wdt:P400 ?answer . ?answer wdt:P348 ?x FILTER ( contains ( ?x , '10.14 beta 4' ) ) }","paraphrases":["Which systems have software versions of Fallout launch 10.14 beta 4?"],"info":{}}
{"id":"train_5925","question":"What is the part of the grammar that deals with the history or origin of the words of {Planck time}, that has {doctoral student} is {Walther Bothe} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q202642 wdt:P138 ?answer . ?answer wdt:P185 wd:Q76474 }","paraphrases":["What is the phase of the grammar that offers with the records or starting place of the words of {Planck time}, that has {doctoral student} is {Walther Bothe} ?"],"info":{}}
{"id":"train_5926","question":"Tell me the intergovernmental organization of the coat of arms of Emblem of the Association of Southeast Asian Nations that starts with the letter a!","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q245065 . ?sbj wdt:P237 wd:Q128544 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'a' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the intergovernmental business enterprise of the coat of arms of Emblem of the Association of Southeast Asian Nations that starts offevolved with the letter a!"],"info":{}}
{"id":"train_5929","question":"Tell me the newspaper that has English as language of work and contains the word tribune in it's name?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q11032 . ?sbj wdt:P407 wd:Q1860 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'tribune' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["Tell me the newspaper that has English as language of work and consists of the phrase tribune in it is name?"],"info":{}}
{"id":"train_5930","question":"Which is the organization for the subsidiary of Rutgers University?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?obj where { wd:Q499451 wdt:P355 ?obj . ?obj wdt:P31 wd:Q43229 }","paraphrases":[],"info":{}}
{"id":"train_5932","question":"How many individuals has Andrei Chikatilo convicted?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q44496 wdt:P1399 ?obj }","paraphrases":["Andrei Chikatilo has convicted how many people?"],"info":{}}
{"id":"train_5933","question":"Who succeeds to John McIntosh, the inventor of Honeycrisp?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3140024 wdt:P155 ?answer . ?answer wdt:P61 wd:Q3182058 }","paraphrases":["Who succeeds to John McIntosh, the creator of Honeycrisp?"],"info":{}}
{"id":"train_5934","question":"What is the works for of the movie director of  Primate ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q3403168 wdt:P57 ?X . ?X wdt:P108 ?answer }","paraphrases":["What's the work for Primate's film director?"],"info":{}}
{"id":"train_5936","question":"What is the sister city of Kharkiv which has a population of 850?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q42308 wdt:P190 ?answer . ?answer wdt:P1082 ?x FILTER ( contains ( ?x , '850.0' ) ) }","paraphrases":["What is the sister city of Kharkiv which features a populace of 850?"],"info":{}}
{"id":"train_5938","question":"What is  field of study of René Leduc. Pionnier de la propulsion à réaction. 2000 ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q50810219 wdt:P50 ?X . ?X wdt:P101 ?answer }","paraphrases":["What is field of consider of René Leduc. Pionnier de la impetus à réaction. 2000 ?"],"info":{}}
{"id":"train_5939","question":"Who gave the{deathdate} of {directed by} of {The World According to Garp} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q2507282 wdt:P57 ?X . ?X wdt:P570 ?answer }","paraphrases":["Who gave thedeathdate of coordinated by of The World According to Garp ?"],"info":{}}
{"id":"train_5941","question":"Who attended the Battle of the Vittorio Veneto?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q662961 wdt:P710 ?X . ?X wdt:P463 ?answer }","paraphrases":["Who competed in the Battle of the Vittorio Veneto?"],"info":{}}
{"id":"train_5943","question":"How many head coaches are there for FC Bayern Munich?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ( COUNT ( ?obj ) AS ?value ) { wd:Q15789 wdt:P286 ?obj }","paraphrases":["What is the number of head coaches for FC Bayern Munich?"],"info":{}}
{"id":"train_5945","question":"Which is the patron saint for Sabadell?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12258 wdt:P417 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5946","question":"What is a taxonomic rank that starts with the letter v.","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q427626 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'v' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What may be a ordered rank that begins with the letter v."],"info":{}}
{"id":"train_5947","question":"What is the Parthian Empire's office religion?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q1986139 wdt:P3075 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5948","question":"What is the capital of the Khmer empire that is located at 13.43333333333333 103.833333333?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q201705 wdt:P36 ?answer . ?answer wdt:P625 ?x FILTER ( contains ( ?x , '13.433333333333 103.83333333333' ) ) }","paraphrases":["What is the capital of the Khmer realm that's found at 13.43333333333333 103.833333333?"],"info":{}}
{"id":"train_5949","question":"What are the unit of mass which start with the letter zuz","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q3647172 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'zuz' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the unit of mass which begin with the letter zuz"],"info":{}}
{"id":"train_5951","question":"Is Transport Layer Security used by Extensible Authentication Protocol and SMPTPS?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q206494 wdt:P1535 wd:Q1146165 . wd:Q206494 wdt:P1535 wd:Q949493 }","paraphrases":["Does Extensible Authentication Protocol and SMPTPS use Transport Layer Security?"],"info":{}}
{"id":"train_5952","question":"tell me about sedative contains the word nutmeg in their name","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q847705 . ?sbj rdfs:label ?sbj_label . FILTER ( CONTAINS ( lcase ( ?sbj_label ) , 'nutmeg' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["let me know approximately narcotic contains the word nutmeg in their name"],"info":{}}
{"id":"train_5954","question":"What are the names of the characters in the show \"Bobby Smiles\"?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q10431845 wdt:P1441 ?X . ?X wdt:P674 ?answer }","paraphrases":["What are the names of the characters in the show \"Bobby Smiles\"?"],"info":{}}
{"id":"train_5955","question":"IS THE PARALLAX OF THE VEGA EQUALS 128.93","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q3427 wdt:P2214 ?obj filter ( ?obj = 128.93 ) }","paraphrases":["Parallax is the observed apparent change in the position of an object resulting from a change in the position of the observer. Specifically, in the case of astronomy it refers to the apparent displacement of a nearby star as seen from an observer on Earth.\n\nThe parallax of an object can be used to approximate the distance to an object using the formula:\n\nparallax\nWhere p is the parallax angle observed, and D is the actual distance measured in parsecs. A parsec is defined as the distance at which an object has a parallax of 1 arcsecond. This distance is approximately 3.26 light years.\n\n\n\nExample:\n\nThe bright star Vega has a parallax of 0.129\", how far is it?\n\nSolution:\n\nparallaxeq\nSo Vega is about 7.75 parsecs from Earth, or about 25 light years."],"info":{}}
{"id":"train_5958","question":"What are the  heavy metal band which start with the letter w","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q56816954 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 'w' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the overwhelming metal band which begin with the letter w"],"info":{}}
{"id":"train_5960","question":"Which is the {participant of} and the {owner of} of {FC_Porto} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?ans_1 ?ans_2 WHERE { wd:Q128446 wdt:P1344 ?ans_1 . wd:Q128446 wdt:P1830 ?ans_2 }","paraphrases":["Who owns FC_Porto?"],"info":{}}
{"id":"train_5961","question":"Was 201 the total number of valid votes cast n the 2015 Catalan regional election in Malla?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q44877325 wdt:P1697 ?obj filter ( ?obj = 201 ) }","paraphrases":["Did the 2015 Catalan regional election in Malla have 201 votes cast?"],"info":{}}
{"id":"train_5962","question":"Are the German Aerospace Center and the NASA Astrobiology Institute subidiaries of NASA?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q23548 wdt:P355 wd:Q157332 . wd:Q23548 wdt:P355 wd:Q1147312 }","paraphrases":["Jump to Research - Selected, significant topics of interdisciplinary research by NAI as of ... Comets in space and in the laboratory; Discovery of the \"rare"],"info":{}}
{"id":"train_5963","question":"Is the fiscal/tax revenue of Manabo under 44305723.128?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q29082 wdt:P3087 ?obj filter ( ?obj < 44305723.128 ) }","paraphrases":["What is the fiscal/tax revenue of Manabo?"],"info":{}}
{"id":"train_5964","question":"when did zhejiang became a ming dynasty?","sparql":"PREFIX pq: <http://www.wikidata.org/prop/qualifier/> PREFIX ps: <http://www.wikidata.org/prop/statement/> PREFIX p: <http://www.wikidata.org/prop/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?value WHERE { wd:Q16967 p:P131 ?s . ?s ps:P131 wd:Q9903 . ?s pq:P580 ?value }","paraphrases":["What year was Zhejiang absorbed into the Ming Dynasty?"],"info":{}}
{"id":"train_5965","question":"What are the  freeway network which start with the letter s","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX rdfs: <http://www.w3.org/2000/01/rdf-schema#> PREFIX wd: <http://www.wikidata.org/entity/> SELECT DISTINCT ?sbj ?sbj_label WHERE { ?sbj wdt:P31 wd:Q55504191 . ?sbj rdfs:label ?sbj_label . FILTER ( STRSTARTS ( lcase ( ?sbj_label ) , 's' ) ) . FILTER ( lang ( ?sbj_label ) = 'en' ) } LIMIT 25","paraphrases":["What are the turnpike organize which begin with the letter s"],"info":{}}
{"id":"train_5969","question":"Which is the edition or translation of Internet Protocol version 6?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q2551624 wdt:P629 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5970","question":"What is the locomotive class with the most stroke whose operator is Lancashire, Derbyshire and East Coast Railway?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select ?ent where { ?ent wdt:P31 wd:Q19832486 . ?ent wdt:P2557 ?obj . ?ent wdt:P137 wd:Q6482976 } ORDER BY DESC ( ?obj ) LIMIT 5","paraphrases":["What locomotive class has the most stroke operated by Lancashire, Derbyshire and East Coast Railway?"],"info":{}}
{"id":"train_5971","question":"who is video game publisher of safety classification and labelling of β-lactose ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q127900 wdt:P4952 ?X . ?X wdt:P123 ?answer }","paraphrases":["who is video amusement distributer of security classification and naming of β-lactose ?"],"info":{}}
{"id":"train_5972","question":"Which is the TheFinalBall player ID of Cristiano Ronaldo?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q11571 wdt:P3047 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5973","question":"Who is {subject} of {inventor or discoverer} of {Bogdanov-Takens bifurcation} ?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q4937510 wdt:P61 ?X . ?X wdt:P101 ?answer }","paraphrases":["Who is {subject} of {innovator or pioneer} of {Bogdanov-Takens bifurcation} ?"],"info":{}}
{"id":"train_5974","question":"What vein is connected to the small intestine?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q11090 wdt:P2789 ?X . ?X wdt:P2289 ?answer }","paraphrases":["What vein is associated to the little digestive system?"],"info":{}}
{"id":"train_5975","question":"What is on focus list on Wikimedia project for arch?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?answer where { wd:Q12277 wdt:P5008 ?answer }","paraphrases":[],"info":{}}
{"id":"train_5976","question":"How many out of school children are there in Scotland?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> SELECT ?answer WHERE { wd:Q22 wdt:P30 ?X . ?X wdt:P2573 ?answer }","paraphrases":["What number of out of younger students are there in Scotland?"],"info":{}}
{"id":"train_5977","question":"Which county in Norway shares a border with Oslo","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P47 wd:Q585 . ?sbj wdt:P31 wd:Q192299 }","paraphrases":["Which Norwegian county shares a border with the city of Oslo?"],"info":{}}
{"id":"train_5979","question":"Was William McKinley educated at the Allegheny College and the New York Law School?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> ASK WHERE { wd:Q35041 wdt:P69 wd:Q4062566 . wd:Q35041 wdt:P69 wd:Q3339059 }","paraphrases":["Did William McKinley receive his education at the Allegheny College and the New York Law School?"],"info":{}}
{"id":"train_5980","question":"Who is Aisha's sibling?","sparql":"PREFIX wdt: <http://www.wikidata.org/prop/direct/> PREFIX wd: <http://www.wikidata.org/entity/> select distinct ?sbj where { ?sbj wdt:P3373 wd:Q4730963 . ?sbj wdt:P31 wd:Q5 }","paraphrases":["Who is Aisha's brother or sister?"],"info":{}}
